{"id":"5e9c2f7b9b6559241525d9bb","artists":["5e9b68f27a1236eccfeb2032"],"title":"Exclusive Video Premiere: Fairweather Academy – A Well Traveled Man (Part II)","content":"<p>There’s no doubting the importance of the internet in the spider’s web that is the modern day music industry.</p><p> Whilst there are those who would argue that the phenomenal rise of digital methods is leading to a subdued and distorted view on the release of new music; the pro’s of online promotional mechanisms are often overlooked. Music videos are easier to create and distribute, album artworks are possibly more important and diverse than ever and the integration with social media outlets providing a platform for discussion is invaluable.</p>\n<p>One musical group who have warmly embraced the new avenues that the internet has provided, are Boise duo <strong>Fairweather Academy</strong>, comprised of friends <strong>Matt Dalley</strong> and <strong>Jay Saenz</strong>. Their newest project,<strong><em> A Well Traveled Man</em></strong> is a concept record of sorts, with an engaging twist.  Instead of merely releasing a steady stream of tracks, <strong>Fairweather Academy</strong> have adopted a fairly unique approach, in so far as ensuring that each track is accompanied by a self produced video, that recreates the story told through the music. As they describe it; ‘The story is told through film, music, photography, and excerpts from the main character’s journal.’, quite a challenging yet fulfilling project to embark upon. All images, videos and musical compositions are conceived by the duo, including the image above taken by <strong>Jay Saenz</strong>.</p>\n<p>Having released<em> Part I</em> of <strong><em>A Well Traveled Man</em></strong> towards the back end of May, we’re delighted to be able to present to you an exclusive premiere of <em>Part II</em> in the series. Featuring guest vocals from<strong> Solomon’s Hollow</strong> singer <strong>Nate Agenbroad</strong>, and percussion sections courtesy of <strong>Dave Wood</strong> (<strong>TEENS</strong>), it’s another track that demonstrates how fantastic the music coming from Boise really is. Whilst <em>Part I</em> served as somewhat of an introduction to the main protagonist; <em>Part II</em> begins to delve deeper into the fractured mind of the lead character.</p>\n<p>An underlying feeling of escapism dominates the piece; which appears to document a struggle between spiritual and irreverent freedom. The ongoing battle between light and dark, life and death. There are several truly beautiful shots, in particular around the mid point of the video, as the sun sets and the night sky takes control. The track itself is a stunning piece of work as well, although to truly experience and gain complete understanding of <strong>Fairweather Academy</strong>, all elements have to be processed simultaneously. With more sections to come over the next few months, it’s sure to be a thrilling project to watch unravel. Check out <em>Part II</em> of <strong>A Well Traveled Man</strong> below, and head over to the<strong> <a href=\"https://www.fairweatheracademy.com/awelltraveledman.html\" target=\"_blank\">Fairweather Academy</a></strong><a href=\"https://www.fairweatheracademy.com/awelltraveledman.html\" target=\"_blank\"> site</a> or <strong>Saenz</strong> and <strong>Dalley’s</strong> record label <a href=\"https://barnowlrecords.com/home.html\" target=\"_blank\">Barn Owl Records</a> to watch and download <em>Part I</em> for free. A free download of <em>Part II</em> will be available in a couple of hours.</p>\n<p><iframe src=\"https://www.youtube.com/embed/9wW53V-v4Lk\" frameborder=\"0\" width=\"560\" height=\"349\"></iframe></p>\n","slug":"10016-exclusive-video-premiere-fairweather-academy-a-well-traveled-man-part-ii","category":"mpfree","date":1313506860000,"wpid":10016,"isSticky":false,"featured_image":{"width":165,"height":165,"src":"2011/08/fairweather-academy-165x165.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAABgf/xAAjEAACAAMIAwAAAAAAAAAAAAABAgADEQQFBhMhIkGREjFR/8QAFAEBAAAAAAAAAAAAAAAAAAAABf/EABgRAAIDAAAAAAAAAAAAAAAAAAARAQID/9oADAMBAAIRAxEAPwB5iATWu0zTa2FhQMuQy0owA4FK007iarJsniMwqXpu2c9w3v3dgxWbVsx9T75gHQfIIzs4EEf/2Q=="},"createdAt":1587294075807,"updatedAt":1588403550784,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/08/fairweather-academy-165x165.jpg","categories":["mpfree","music","videos"]}