{"id":"5e9c34059b6559241525e163","title":"5 Minutes With: Yoyoyo Acapulco","content":"<p><a href=\"https://admin.</p><p>crackintheroad.com/uploads/2010/05/Picture1.jpg\"><img class=\"alignnone size-full wp-image-1014\" title=\"Picture1\" src=\"https://api.crackintheroad.com/wp-content/uploads/2010/05/Picture1.jpg\" alt=\"\" width=\"960\" height=\"774\" srcset=\"https://api.crackintheroad.com/images/2010/05/Picture1.jpg 960w, https://api.crackintheroad.com/images/2010/05/Picture1-300x241.jpg 300w, https://api.crackintheroad.com/images/2010/05/Picture1-494x398.jpg 494w, https://api.crackintheroad.com/images/2010/05/Picture1-165x133.jpg 165w, https://api.crackintheroad.com/images/2010/05/Picture1-950x765.jpg 950w\" sizes=\"(max-width: 960px) 100vw, 960px\" /></a>A band who originally came to my attention after appearing on 2008’s Norweign artists compilation album <em>Oslo!,</em> <strong>Yoyoyo Acapulco </strong>released their debut LP <em>The Pleumelec Experience</em>, earlier this year. Imagine a<strong> Robert Pollard</strong> fronted, acid tripping <strong>Noah and the Whale</strong>; combining influences of ska, punk and acoustic melodies, they manage to create a twee sound which is strangely intriguing, especially when boosted by <strong>Arne Barlund’s </strong>quirky, witty lyrics. Their debut album is uplifting, intertwining comical stories with emotional heartbreaks and ironic statements, such as “don’t puncture my artery, no matter what you say my heart’s a part of me”. Every song seems to personify sunny, warm, joyful days, so if you’re stuck for an album to soundtrack your summer, be sure to give <em>The Pleumelec Experience </em>a listen!</p>\n<p><strong>Arne Barlund </strong>kindly agreed to answer a few questions for us.</p>\n<p><em>CitR:</em> Your music is very lyrically strong, which is strange for a band whose first language is not English, how difficult did you find it writing songs in English?</p>\n<p><strong>Thank you. When I listen back to my recordings I sometimes cringe because of the pronounciation. I hear my Norwegian heritage, like the great explorer Thor Heyerdahl shouting commands from a balsaraft. You know as much as it is a disadvantage, I fool myself to think of it as an advantage to. It makes it possible to associate and interpretate words differently than the natives. Perhaps it works out good in a different way.</strong></p>\n<p><em>CitR: </em>From listening to your debut album, your sound seems very inspired by Guided By Voices and Silver Jews, would you agree with those comparisons and if you had to name one band as a major influence upon you, who would it be?</p>\n<p><strong>The album that turned my head hard onto 4 track recordings in the mid 90’s was Alien Lanes by Guided By Voices. The short songs, like unfinished popclassics. They kind of lost the magic when they upgraded. As for Silver Jews, never really got into that. Don’t know why. I like Pavement a lot though. Lou Reed, Jonathan Richman, and strong new songsters like Jeffrey Lewis & Herman Dune is usually a joy to listen to.</strong></p>\n<p><em>CitR:</em> If you had to describe your album as an animal to someone, what animal would it be, and why?</p>\n<p><strong>I guess that would be a threelegged Lynx. With a bouncy walk</strong></p>\n<p><em>CitR: </em>What has been your favourite gigging experience to date?</p>\n<p><strong>Hmm, playing at Knaus in Trondheim 09 was good fun. So was Øya 08. Packed. Energetic. The different small tours, houseshows and festivals we did the summer of 2009 in France was also great. I like it a lot when the band is loose in a strong way, and both old & new tunes turn out fresh.</strong></p>\n<p><em>CitR: </em>Would you rather sell thousands of copies of an album you weren’t overly happy with, or sell fewer copies of an album that was your pride and joy?</p>\n<p><strong>Definitly the last, offcourse. As for this first album my initial plan was to use a few tracks from previously released 7”, maybe get one or two 7” from the week in france we did the Pleumeleuc Sessions, and then release an album with different ep tracks. The drummer Ola convinced me that it was better to have somekind of consistent sound on the record, instead of  mixing in tracks from different stuff. It turned out pretty ok. The song Orange is the only one from a different session, a demo that I liked a lot, so we put it in. It’s not at all about selling something. – It makes me very tired thinking about selling anything. I have never sold anything with a profit, exept when I worked at a telemarketing company, selling hunter & dog magazines. It makes everything burn brighter if I know I have made a decent tune the day before. I can listen to it until I get fed up, and no one else has heard it yet. Or the band has heard it, but it’s not properly settled, and that first rough recording is the only existing version. That’s probably one of the the things I like the most.</strong></p>\n<p style=\"text-align: center;\"><a href=\"https://www.myspace.com/yoyoyoacapulco\">Check Out Their Myspace!</a></p>\n<p style=\"text-align: center;\"><a href=\"https://www.myspace.com/egotrippingatthegatesof\">Check Out Arne’s Solo Project!</a></p>\n","slug":"1004-5-minutes-with-yoyoyo-acapulco","category":"interviews","date":1274971098000,"wpid":1004,"isSticky":false,"featured_image":{"width":245,"height":198,"src":"2010/05/picture1.png","placeholder":"data:image/jpeg;base64, iVBORw0KGgoAAAANSUhEUgAAAAoAAAAICAYAAADA+m62AAAACXBIWXMAABcSAAAXEgFnn9JSAAABPElEQVR4nBXByyvDAQDA8d+fghNZZh6jib3sYS/DlmVbm34We2lsqa2WWlJuOCgHDpKQiBY5/GYOLpSDk5M4LYQDadnsK5+PMOAT2TiSeHn7oApUfn+p1WqUK1XuHp65vn9iXyoi2AMhTMN+8tIl/34qFd4/vyl9lSl9Vbl9fGXr9BzBOOpF0aVmKjJDUSpwkj9jb3uHjdVlpIsCx1c3rB0cIvQ63CTnl/AEQ2j6zShV/XS3yDEqmkmFI6zvHpBYyCEo9GZWNneYTKRoaGxGqVLTqVTT0aoiG46RzOSQj9gQ2nQGFpfX0BltNMnkWBxaQvEkE7E0iWCUoVE/dZY+BLlGj9M5jMUyiLJHjcGow2R10qPS4rG6CPjGqbdrENp1euZmE2QzaeLTMUQxiN/rYcxlJxkRiYaCyNxm/gAag8OVlDvYKgAAAABJRU5ErkJggg=="},"createdAt":1587295237268,"updatedAt":1588403567287,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2010/05/picture1.png","categories":["interviews","music"]}