{"id":"5e9c2f6a9b6559241525d99d","title":"Artist Interview: Max Wallis","content":"<p><em>(Featured photo by <a href=\"https://www.</p><p>nathanchandler.co.uk/\">Nathan Chandler</a>)</em></p>\n<p>The last time I met Max Wallis was late last year in a Bavarian beer house on Old Street. The place was charmingly full of kitsch woodwork and Eastern European waitressess. The beer overpriced but the conversation rich. Max was a friend from college who had dropped out of a degree in Biology and ended up on an English masters through the quality of his poetry and prose alone.</p>\n<p>Since then even more has changed. This week I found Max <a href=\"https://www.guardian.co.uk/books/2011/aug/15/naked-poets-calendar-male-muses\">naked on the Opium bed in Coleridge’s study</a> and last month, his first poetry pamphlet <a href=\"https://www.flippedeye.net/store/product_info.php?products_id=80\">‘Modern Love’</a> was released with Flipped Eye Publishing.</p>\n<p><strong>SG: Writer, model & internationally published poet, It has been a strange few years for Max Wallis. I thought we would catch up so you can tell Crack In The Road why, how & who?</strong></p>\n<p>MW: [In Biology] I kept on getting firsts but no satisfaction. My workload was getting crazy and I wasn’t sleeping because I was writing all day and then doing university work all night. I snapped and had a bit of a breakdown. Applied for the masters never thinking I’d actually get on … but did.<br />\n<strong><br />\nSG: In Modern Love and many of your earlier poems there’s a real blend of Baroque technique and 21st Century lyricism. What inspires you?</strong></p>\n<p>MW: Everything. My first pamphlet’s all about love so naturally relationships and everything inbetween have impacted that. It’s a bit like novel writing though, some of the best advice I got when I was younger was that it’s okay to lie in poetry – people have this prevarication that it’s about catharsis but really it’s just as much about narrative as fiction.</p>\n<p>I like the beauty in small things and how it’s possible to write about modern life in poetry. What’s the meaning of a text message? an email? facebook? is there room for poetics in them? I think there is.</p>\n<p><strong>SG: Poetic reccomendations?</strong></p>\n<p>MW: I read more than I ever used to. The bloodaxe anthologies are practically encyclopedias to me and I read <a title=\"The Rialto, Arts Council funded poetry mag\" href=\"https://www.therialto.co.uk/pages/\">The Rialto</a>, <a href=\"https://magmapoetry.com/\">Magma</a> & <a title=\"Popshot, poetry & illustration magazine\" href=\"https://www.popshotpopshot.com/\">Popshot Magazine</a> a lot. I tend to buy pamphlets rather than collections though.</p>\n<p><strong>SG: You tell me your first open mic didn’t go down so well?</strong></p>\n<p>MW HA! 2008. Awful. Utterly awful. I was a nervous wreck and had to loop my legs around the chair to hide my shakes. Then I wrote a poem about dicks and the social networking side of the gay world and, because it was so outlandish, in a way it was easy to perform. It wasn’t me speaking. It was a performer.</p>\n<p><strong>SG: And performing on stage now?</strong></p>\n<p>MW: Ah I love it. If you can make someone cry, cheer, laugh or anything in a room full of people then you know you’re doing something good. I choose the set list in advance so that there’s a flow to the material with sad ones interspersed around happier, funny poems. But on the day I can swap and change. I know them off by heart so it’s pretty easy to do. I still get nervous though, just don’t shake!</p>\n<p><strong>SG: Ever had a particularly bad reception?</strong></p>\n<p>Once I did particularly gay material in a pub in Manchester, full of chavs and their girlfriends. I opened with a poem all about threesomes and genitalia. The lads all kinda bared their teeth but the girls laughed so it went okay. One time I did the threesome poem in front of another group and one part goes ‘and where’s the passion when all you have is this ration, this tiny slice of double-human pie, two guys plus you aside not inside’ and someone yelled ‘I BET THEY WERE.’ I just looked at him, and performed the next stanza never looking away ‘skin upon skin upon skin upon bone and yet you’re alone and watching them groan, attempting those manoeuvres a tactical chooser trying to negotiate limbs’ and he was chucked out.</p>\n<p><strong>SG: Theres been a lot of buzz about Modern Love but tell me in your own words, what is it all about?</strong></p>\n<p>MW: It’s a tale of love, naturally, over the course of one year between two characters. You take their journey: of yearning to sex to betrayal and everything that follows. But each poem is self contained and understood out of context but together they make something entirely different. I loved writing it. I had the idea for the pamphlet for around a year or so and I guess I just finally got to the position where I could writing it.</p>\n<p><strong>SG: With arts funding cuts & possibly more competition than ever before, how do you find the motivation to keep going, instead of throwing in the towel and getting a McJob?</strong></p>\n<p>MW: To be honest I’m supported a lot by friends and family. I don’t think I’d be able to do it without them. Modelling brings in cash but it’s early days. Eventually I want to earn enough from those aspects of my life so that I have the time to write and, not worry about  earning enough money from my poetry & novels.</p>\n<p>Modern Love is available now, direct from the <a title=\"Max Wallis - Modern Love\" href=\"https://www.flippedeye.net/store/product_info.php?products_id=80\">Flipped Eye Bookstore</a> or from <a href=\"https://www.amazon.co.uk/Modern-Love-Flap-Pamphlet-Wallis/dp/190523337X\">Amazon</a>.</p>\n<p>For more of Max’s escapades you can <a href=\"https://twitter.com/#!/boommaxboom\">follow him on twitter</a> or find him on <a href=\"https://maxwallismaxwallis.tumblr.com/\">Tumblr</a></p>\n","slug":"10065-artist-interview-max-wallis","category":"interviews","date":1313570392000,"wpid":10065,"isSticky":false,"featured_image":{"width":165,"height":165,"src":"2011/08/19-165x165.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAABQb/xAAlEAACAQMDAgcAAAAAAAAAAAABAgMABAUHESEGEhQjMUFCUXH/xAAVAQEBAAAAAAAAAAAAAAAAAAADBP/EABgRAAIDAAAAAAAAAAAAAAAAAAABAhEh/9oADAMBAAIRAxEAPwBLWzUmfC9cWMFhNc+HdEk3juHjA+JXYcH3P7tQ82ouYSZ1TJZPtDEDzW9KjNa5pZ8l0688ryOEkAZ2JO3cv3VjY3Vw1lblp5STGpJLnnimpUivIxWH/9k="},"createdAt":1587294058761,"updatedAt":1588403550521,"author":"5e9b68b27a1236eccfeb1d40","old_image":"2011/08/19-165x165.jpg","categories":["interviews","life"]}