{"id":"5e9c2f3d9b6559241525d960","artists":["5e9b68cd7a1236eccfeb1dd2","5e9b68f87a1236eccfeb20bd","5e9b69047a1236eccfeb2138","5e9b691e7a1236eccfeb22da","5e9b69517a1236eccfeb25f9"],"title":"Big Chill Festival 2011: Friday","content":"<p>My train slid in to Great Malvern station, Worcestershire late Thursday evening.</p><p> A fleet of coaches almost outnumbering the arriving festival-goers. A bearded tout leant on a nearby wall hustling passers-by. He told me over the hum of engines that so far he had struggled to sell any tickets, unfortunately for my hairy aquaintance the Big Chill had far from sold out.</p>\n<p>On the last train from London, CITR photographer Laura Turner arrived. Wild hair, african halter neck dress and kit bag in tow. She recalled how the conductor had given history lessons at every station they passed, signing off with an apt ‘Welcome to Hogwarts’ on arrival. We boarded a half empty coach & were flung through the countryside, arriving onsite to find the press entrance already closed.</p>\n<p>Stella, cereal bars & sleep, our tent camaflouged by cars. We were awoken early morning by security demanding to see our credentials. It seemed the proletariat name of Crack In The Road didn’t ring any bells with the bouncing elite but a crumpled notice of press accreditation sorted things out.</p>\n<p>Playing host to hammocks, glowing orbs and brightly coloured tents. The Big Chill’s turnout might not have been as expected but with the sun bursting through the clouds, the atmosphere on Friday was magnificent.</p>\n<p>The festival was hosted on the 16th century estate of Eastnor Castle, Herefordshire but a much more amusing 21st century fact is a woman was <a href=\"https://www.youtube.com/watch?v=P57OHUN_o8U&feature=related\" target=\"_blank\">hit in the head with a watermelon</a> here in 2010 during the filming of US reality TV show, The Amazing Race.</p>\n<p class=\"r\"><a href=\"https://api.crackintheroad.com/uploads/2011/08/BigChillArielPink.jpg\"><img class=\"size-archives wp-image-10420 alignleft\" title=\"BigChillArielPink\" src=\"https://api.crackintheroad.com/images/2011/08/BigChillArielPink-350x466.jpg\" alt=\"Ariel Pink's Haunted Grafitti\" width=\"100\" height=\"132.5\" /></a><span class=\"l\">By the main stage, the distinct sound of <strong>Mahala Raï Banda</strong> reminded me I was supposed to be reviewing the festival & not thinking about funny videos I’d seen online. The Romanian gypsies had succeeded in getting a small mob jigging to their accordion and strings. </span><strong><span class=\"l\">Mahala Raï Banda</span></strong><span class=\"l\"> could easily be overlooked as another </span><span class=\"l\">Pseudopean Balkan beat band but the complex arrangement of  tracks like ‘Tu Romnie’, tell a different story.</span></p>\n<p class=\"r\">Eager to snap some shots of <strong>Ariel Pink’s Haunted Grafitti</strong>, Laura disappeared to the pits camera in hand. I’d heard bad things about Ariel Pink’s live performances & a few songs later, my notebook and pen were snatched from my hands. Back from the pits and looking pissed, Laura had already made up her mind, writing; <em>“Postmodern punk in a dress. The bad sound engineering only compliments the unmelodic sound of this 80’s wannabe. TWAT.”</em> For someone who had never heard of Ariel Pink before the festival, she did a good job of nailing his entire act.<a href=\"https://api.crackintheroad.com/images/2011/08/BigChillGhostPoet.jpg\"><img class=\"size-archives wp-image-10421 alignleft\" title=\"BigChillGhostPoet\" src=\"https://api.crackintheroad.com/images/2011/08/BigChillGhostPoet-350x262.jpg\" alt=\"Ghost Poet August 2011\" width=\"350\" height=\"262\" /></a></p>\n<p>On the Revellers stage, roots reggae singer <strong>Horace Andy</strong> soundtracked the sunny saturday afternoon whilst, evening turned to night on the The People’s Ear Stage to the anxious and addictive electronic tones of Mercury prize nominated, <strong>Ghostpoet</strong>.</p>\n<p>Unsuprisingly, <strong>The Chemical Brothers </strong>closed <a href=\"https://api.crackintheroad.com/images/2011/08/BigChillChemicalBrothers.jpg\"><img class=\"size-archives wp-image-10422 alignleft\" title=\"BigChillChemicalBrothers\" src=\"https://api.crackintheroad.com/images/2011/08/BigChillChemicalBrothers-350x262.jpg\" alt=\"Chemical Brothers 2011\" width=\"350\" height=\"262\" /></a>the day’s performances and kicked off the night’s revelry with a monolithic audio/visual masterpiece. The band started with a distorted abstract of the Beatle’s Tomorrow Never Knows before the opening riff of ‘Another World’ rippled through the audience. Silhouetted cockroaches battled on the big screen & lasers lit up the faces of entranced festival goers. Bass and BPM fuelled the tribal dancing of young and old, their contorted faces full of excitement, energy and of course, ecstasy.</p>\n<p><strong>The Chemical Brother’s</strong> performance explained perfectly how <strong>Tom Rowlands</strong> and <strong>Ed Simons</strong> have spent the last 20 years pioneering dance music, they’re really fucking good at it.</p>\n<p>After the performance, crowds started to disperse. The night was still young but as The Guardian’s <a title=\"Guardian Journalis, Sam Richards\" href=\"https://www.guardian.co.uk/profile/samrichards\" target=\"_blank\">Sam Richards</a> so concisely puts it, after The Chemical Brothers <em>‘everything else feels like a comedown.’</em></p>\n<p>Saturday & Sunday’s escapades coming later this week.</p>\n<p><em><br />\n</em></p>\n","slug":"10091-big-chill-festival-2011-friday1","category":"festivals","date":1314015275000,"wpid":10091,"isSticky":false,"featured_image":{"width":165,"height":136,"src":"2011/08/finfri-165x136.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAJAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAACAT/xAAnEAABAgMFCQAAAAAAAAAAAAABAgMABAUGERIhMQcTIjdRYXOSs//EABUBAQEAAAAAAAAAAAAAAAAAAAEC/8QAGBEAAwEBAAAAAAAAAAAAAAAAAAECETH/2gAMAwEAAhEDEQA/AK9klQk021pacL4n56ZK398VJxOBo54dLxn2HSEsFzFw4G/aDVYXmxQfIr4mEWNBF3Tt6xrun//Z"},"createdAt":1587294013038,"updatedAt":1588403549983,"author":"5e9b68b27a1236eccfeb1d40","old_image":"2011/08/finfri-165x136.jpg","categories":["festivals","music"]}