{"id":"5e9c2f749b6559241525d9af","artists":["5e9b692b7a1236eccfeb23ec"],"title":"Review: Oupa – Forget","content":"<p>Just over six months ago I was sent a handful of tracks composed by <strong>Yuck</strong> frontman <strong>Daniel Blumberg</strong>.</p><p> Not being a particularly huge fan of the brash, grating sound created by the London four piece, it was with considerable caution that I approached <strong><em>The Weakend EP</em></strong>, tagged under the artist name <strong>Yu(c)k</strong>. By the end of opening track<em> Daughter</em>, I was already well and truly sold.</p>\n<p>Gone are the vivacious guitars and shameless <strong>Sonic Youth</strong> impressions, instead replaced by elegant piano sections and <strong>Blumberg’s</strong> heavenly vocals. Now going under the name <strong>Oupa</strong>, new seven track release<strong><em> Forget</em></strong> continues in a similar vein, emotionally haunting and movingly poignant. The title track which was made available around the same time as the original EP is blissfully self-aware and enchantingly regretfully. The vocal delivery and productions hark back to <strong>Bon Iver’s <em>For Emma, For Ever Ago</em></strong>, constantly altering in intonation and pitch, allowing the track to flow seamlessly. <strong>Blumberg</strong> almost weeps <em>‘I’ll be natural, no you can’t forget me now’</em>, it would take an extremely cold heart to deny the sincerity in <strong>Oupa’s</strong> work.</p>\n<p><iframe width=\"400\" height=\"100\" style=\"position: relative; display: block; width: 400px; height: 100px;\" src=\"https://bandcamp.com/EmbeddedPlayer/v=2/track=3287612652/size=venti/bgcol=FFFFFF/linkcol=4285BB/\" allowtransparency=\"true\" frameborder=\"0\"><a href=\"https://boiledegg.bandcamp.com/track/forget\">Forget by Oupa</a></iframe></p>\n<p>As an entirety, the release is dominated by melancholic piano sections, verging upon driving <em><strong>Forget</strong></em> into emotional overload, however there is enough variation in the songwriting to prevent this becoming an inevitability. Opener<em> Driving</em> is drenched in searingly honest regret; <em>‘I have never seen a face, that hit me so hard, with all it’s grace’</em>, bemoans <strong>Blumberg</strong> joylessly. Those whom have been following the progress of <strong><em>CitR</em></strong> favourite <strong>Youth Lagoon</strong>, will be able to hear the comparisons, namely in the wistful tone of the music.  Both excel in transferring emotional complexities from the fragmented mind to musical composition, whilst maintaining a relatable, scrupulous appreciation  for the listener.</p>\n<p><em>New Home</em> feels like<strong> Bowie</strong> performing <strong>Beatles</strong> tracks whilst on antidepressants; epic, honorable and truly veracious, one of the finest tracks Blumberg has written to date. Closing track <strong>Those Are The Senses</strong> is the most enduring of them all, coming in at just under eleven minutes, and featuring the song writing skills of <strong>Daniel’s</strong> brother<strong> Saul</strong>. A repetitive guitar section underpins the entire track, during which the vocal driven tension builds gradually to a divinely emotive, heart-breaking crescendo. Having never bought into <strong>Yuck’s</strong> music, it’s increasingly refreshing to hear a band member craft a work of art so utterly beautiful and startlingly different; staking a claim for the most transcendent release of the year. <strong>Forget</strong> is available on cassette and download via <strong>Boiled Egg</strong>, from <a href=\"https://boiledegg.bandcamp.com/album/forget\" target=\"_blank\">here</a>.</p>\n<p><iframe style=\"position: relative; display: block; width: 400px; height: 100px;\" src=\"https://bandcamp.com/EmbeddedPlayer/v=2/track=465880045/size=venti/bgcol=FFFFFF/linkcol=4285BB/\" frameborder=\"0\" width=\"400\" height=\"100\"></iframe></p>\n","slug":"10147-review-oupa-forget","category":"album-reviews","date":1313527968000,"wpid":10147,"isSticky":false,"featured_image":{"width":165,"height":165,"src":"2011/08/daniel-blumberg-165x165.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAABwQG/8QAJhAAAQIFAwMFAAAAAAAAAAAAAgEDBAUGERIAITETIkEkM1FTYf/EABUBAQEAAAAAAAAAAAAAAAAAAAME/8QAGBEBAQEBAQAAAAAAAAAAAAAAAgEAEkH/2gAMAwEAAhEDEQA/ANEzVcvjYWFGRxc9WUMCQPMRDYD1hx7kzNFILXS3zvz4qar+jgaABqiYNIIoiNo3fD89rxooot1xKEfJDJCxe3vvxokCNisB9S/x9i6lQ5Jp9zh2qzf/2Q=="},"createdAt":1587294068692,"updatedAt":1588403550680,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/08/daniel-blumberg-165x165.jpg","categories":["album-reviews","music"]}