{"id":"5e9c2f6d9b6559241525d9a3","artists":["5e9b68f27a1236eccfeb205b"],"title":"Review: Fionn Regan – 100 Acres of Sycamore","content":"<p>Since <strong>Fionn Regan </strong>thumbed his way gracefully into the public eye with 2006’s <strong><em>The End of History</em></strong>, he’s had a lot to live up to, poor chap.</p><p> Shortlisted for a Mercury, nominated for two Meteor Music Awards and The Irish Album of the Year, and up to its figurative neck in critical acclaim, the album set an early benchmark for <strong>Regan</strong>’s musical career. So it wasn’t much of a surprise that when he followed up his debut with last year’s distinctly more plugged-in <strong><em>The Shadow of an Empire</em></strong>, much of the press and many of his fans hung him out to dry. It’s probably not much of a surprise either that a mere 18 months later, <strong>Regan </strong>has returned with another collection of songs that take the jack lead back out, and see him returning to the more delicate, fingerpicked sound that made <strong><em>The End of History </em></strong>so popular.</p>\n<p>While we’re on the subject of things that aren’t really surprises at all, it’s worth noting that since the meteoric rise of <strong>Fleet Foxes</strong>, a band in the same folksy musical sphere as <strong>Regan</strong>, the Irish songwriter’s voice has taken on a distinctly <strong>Robin Pecknold</strong>esque tone, first showcased on the opening title track. Or maybe that’s horrifically cynical and mean, and <strong>Regan</strong> just likes <strong>Fleet Foxes</strong>. All evidence would seem to point to it – the consistent rustic bass drum and thunderous percussive swells of <em>The Horses are Asleep </em>do nothing to allay the comparison.  And then it happens again toward the end of <em>The Lake District. </em>And again on <em>List of Distractions</em>. You see where this is going.</p>\n<p>This is really where <strong><em>100 Acres of Sycamore </em></strong>falls down. Not that the whole thing sounds like a <strong>Fleet Foxes </strong>album – it doesn’t – but that many of the tracks lack any sort of distinction from each other. Where before <strong>Regan </strong>could write a set of songs in the same vein, and often with minimal backing, each had its own characteristics, by dint of chord sequence, phrasing or speed. But on <strong><em>100 Acres of Sycamore </em></strong>many of the cuts fail to escape from the same pretty, mid-tempo mediocrity. There’s certainly a wider range of instrumentation present here than on <strong>Regan</strong>’s debut, but this does little for variety of sound, especially when coupled with the record’s schmaltzy production. The combination practically removes any sense of intimacy, once <strong>Regan</strong>’s spine-tingling stock in trade.</p>\n<p>Occasionally, things get stripped back to the point where we can remember what made <strong>Regan </strong>so good in the first place. <em>First Day of May </em>pits his naturally fragile, gorgeous voice against some simple picking and quiet, tasteful strings. <em>North Star Lover</em>, whilst revisiting those reverberating <strong>Pecknold</strong>isms and fleshing itself sappily out with banjos and weeping violins, makes for a genuinely affecting listen. However, these moments are too few and far between, and in some cases songs that you can start to get quite excited about let themselves plod on unremarkably into the middle distance. <em>Vodka Sorrow</em> at first presents itself as a drunken lament for the small hours, complete with maudlin piano, and hell knows I’m a sucker for those. But it then insists on swelling up and pounding its way annoyingly and repetitively to the six minute mark, that binge that made so much sense the night before but could not be more agonising the morning after.</p>\n<p>Yes, <strong><em>100 Acres of Sycamore </em></strong>is quite lovely. It could soundtrack a hundred barely-below-radar romantic films a hundred times over. It’ll make homespun girls in flowery dresses sigh wistfully as they sit shoeless on sun-dappled grass. Like I said, it’s quite lovely. But with weaker songwriting than we’ve come to expect from <strong>Regan</strong>, a startling lack of variety, and a slick sheen that robs it of much of its personality, <strong><em>100 Acres of Sycamore</em></strong> doesn’t quite open up into the awe-inspiring panorama that it so badly wants to.</p>\n","slug":"10177-review-fionn-regan-100-acres-of-sycamore","category":"album-reviews","date":1313533457000,"wpid":10177,"isSticky":false,"featured_image":{"width":165,"height":165,"src":"2011/08/100_acres_of_sycamore_packshot-400x400-165x165.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAABgMH/8QAJRAAAgECBQQDAQAAAAAAAAAAAQIDBBEABQYTIRIiI0EUUWKR/8QAFAEBAAAAAAAAAAAAAAAAAAAAAP/EABQRAQAAAAAAAAAAAAAAAAAAAAD/2gAMAwEAAhEDEQA/AB+bZhTx5nPDRRaeoYH245xmjNHKWQju20B6UNgotf0fWGsG0sEYXSFwFAB8PPH6IP8AQD9gYhpaNK7OM5+ai1Fqpk8w6+3bJtz6vzbGnxxRpGqoiqoAAAFgBgP/2Q=="},"createdAt":1587294061261,"updatedAt":1588403550576,"author":"5e9b68b27a1236eccfeb1d3c","old_image":"2011/08/100_acres_of_sycamore_packshot-400x400-165x165.jpg","categories":["album-reviews","music"]}