{"id":"5e9c33f19b6559241525e141","title":"Stag and Dagger: Sparrow And The Workshop & Islet","content":"<p><a href=\"https://admin.</p><p>crackintheroad.com/uploads/2010/06/IMG_1352.jpg\"><img class=\"alignnone size-large wp-image-1217\" title=\"IMG_1352\" src=\"https://api.crackintheroad.com/wp-content/uploads/2010/06/IMG_1352-1024x682.jpg\" alt=\"\" width=\"800\" height=\"532\" srcset=\"https://api.crackintheroad.com/images/2010/06/IMG_1352-1024x682.jpg 1024w, https://api.crackintheroad.com/images/2010/06/IMG_1352-300x200.jpg 300w, https://api.crackintheroad.com/images/2010/06/IMG_1352-165x110.jpg 165w, https://api.crackintheroad.com/images/2010/06/IMG_1352-950x633.jpg 950w\" sizes=\"(max-width: 800px) 100vw, 800px\" /></a>The sun is unashamedly out, the beer is refreshingly chilled, the venues are slowly but surely filling out and most importantly the sensational selection of artists are here and ready to perform to the impatient Glaswegian crowds. The problematic question is, who to go and see? With 7 different stages all across Glasgow, playing host to over 40 of the hottest up and coming artists, including local talent in the form of Scottish rockers <strong>We Were Promised Jetpacks</strong>, American noise brutalists A<strong> Place To Bury Strangers</strong> and Brighton based duo <strong>Blood Red Shoes</strong>.</p>\n<p>After much deliberation, our first port of call was notorious scenester hangout <strong>Captain’s Rest</strong>, in the West End of Glasgow. With the fantastic weather and cold beverages it was tempting to bypass the bands and spend the day bathing in the abnormal heat, however once undertaking the walk downstairs to the cramped basement below, we realised the music was too good to be missed. Scottish adoptees <strong>Sparrow and the Workshop</strong> were just finishing as we entered the venue, but in the couple of songs we did catch they certainly lived up to their hype as one of the most exciting and vivacious young bands around.</p>\n<p>Next up was possibly my personal favourite performance of the weekend from psychedelic rockers <strong>Islet</strong>, who fuse <strong>Animal Collective </strong>beats with a sparkling and seemingly limitless abundance of energy. Like their<strong> Los Campesinos!</strong> support set back in February, they spent a vast majority of their short set in the crowd, as well as continuously swapping instruments and generally providing a brilliant source of entertainment for the partially bewildered audience.</p>\n<p>After <strong>Islet’s </strong>raucous and frenzied set, we caught up with the guys to ask them a few questions. With creating such an original and exhilarating sound, I was keen to find out where their musical inspiration lay, as well as any future plans for album or single releases. When talking of musical influences, there is one band the entire group agree upon; <strong>At The Drive-In</strong>, describing their performance on <strong>Jools Holland</strong> as “amazing”, and to be honest, we can see which aspects they have taken inspiration from. Their invigorating live performances being the most obvious comparison, however the sounds they create also bring about some familiar feelings, with a prominent use of two drumkits.</p>\n<p>They also agreed on the comparisons to last years sensationalists, <strong>Animal Collective</strong>, but were quick to not limit their influences to any one genre, let alone band. When asked about the constant instrument changes in the band, they told us that it was just “hey do you want to play the bass? ok then…”, and there was never any intention to form a band which was seemingly so evolving and mutating. Behind many of the decision they make when performing live seem to be the underlying theme of freedom and opposition to constraints, characterised in particular by the entire bands love of performing both on stage and in the crowd. They wholeheartedly agree that their songs weren’t “anthemic” nor would their performance strategies at the moment necessarily suit larger stages. As the band spend a sizeable time of their sets in the crowd, we were keen to know the reaction that they had received from differing crowds, and whether anything inappropriate had occurred during their forays into the audience. At this point the entire band laughed and told us how it was normally the other way round, with their moustachioed guitarist <strong>Alex Williams</strong> telling how “in Edinburgh, I was running round, and I was all sweaty and just decided to start rubbing my hair against people, and they were like <em>what are you doing?</em>“. They also recalled how in Aberdeen, several members of the crowd took it upon themselves to join the band on stage and give a helping hand with the percussion.</p>\n<p>With this being the first year<strong> Stag and Dagger </strong>has taken place in Glasgow, Islet were quick to applaud the exceptional line-up that organisers had drawn together. Guitarist<strong> Alex</strong> spoke of his love for the “cool guys” of <strong>Crocodiles</strong>, and told us how he would be checking them out later on. <strong>Dub Mental </strong>were described as their “favourite dub group” and <strong>Erland and the Carnival </strong>as “that guy from The Verve who walks round stage like this”, at which point <strong>Alex </strong>hunched his shoulders and hilariously impersonated <strong>Simon Tongs</strong> walk.</p>\n<p>Without wanting to force Islet into giving too much away, we asked about any plans for releases in the near future, to which frontman <strong>Mark</strong> replied “yeah we’ve got plans for what’s called a <em>mini-album… </em>and that’s going to be out in June”. After that they intend to record another similar length EP, before putting together their debut album, which will hopefully be released next year. However, they admit “[we] don’t really know how long any album is meant to be” and that “it’s important to give it a name, but it is just an amount of music…”. When asked of their experiences of playing Scotland, they said “[we] love it, it’s great, the crowd always seem so up for it all the time, someone will always shout something… it’s funny”.</p>\n<p>As if you hadn’t guessed it already, we are extremely excited about the future of <strong>Islet</strong>, and are looking forward to both experiencing their live performances again, as well as hearing any future releases. If <strong>Islet </strong>are touring near you this summer then we wholeheartedly recommend that you take time out to see them perform, and bask in both the energetic atmosphere and thrilling musical compositions.</p>\n<p style=\"text-align: center;\"><a href=\"https://www.isletislet.com/home.html\">Islet Official Site</a></p>\n<p style=\"text-align: center;\"><a href=\"https://sparrowandtheworkshop.co.uk/\">Sparrow and the Workshop Official Site</a></p>\n","slug":"1018-stag-and-dagger-sparrow-and-the-workshop-islet","category":"festivals","date":1275566626000,"wpid":1018,"isSticky":false,"featured_image":{"width":3888,"height":2592,"src":"2010/06/img_1352.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAQH/8QAIhAAAQMDAwUAAAAAAAAAAAAAAQIDEQAEIQUGEhMiMUFx/8QAFQEBAQAAAAAAAAAAAAAAAAAAAAL/xAAYEQACAwAAAAAAAAAAAAAAAAAAAQMSMf/aAAwDAQACEQMRAD8AyHYu3dM1u9thc9Qthl1x5CYmUZ7ZEHE4J8ioXLDTg4oN2TJRJ481r5R6mMT8pSlSlI1h/9k="},"createdAt":1587295217331,"updatedAt":1588403566987,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2010/06/img_1352.jpg","categories":["festivals","interviews","music"]}