{"id":"5e9c33fd9b6559241525e157","artists":["5e9b695d7a1236eccfeb26ca"],"title":"Review: Vinyl Jacket – Self Titled EP","content":"<p>Originating from Wylam in Northumberland, <strong>Vinyl Jacket</strong> is a fresh five-piece indie pop band buoyed by rampant melodies and harmonious vocals.</p><p> Previously known by several other band names, such as <strong>Mild Peril</strong> and <strong>The Farrers</strong>, <strong>Vinyl Jacket</strong> appears to be the final product after years of musical formation. I say this as after listening to the music <strong>Vinyl Jacket </strong>created under their past pseudonyms, the sound in their new three track EP contains a maturation that will be audible to both new and old fans alike.</p>\n<p>The EP is perfectly positioned to be released in time to make it into many people’s summer soundtrack, and rightly so as each track is crafted around a high tempo beat that contains guitar riffs seemingly inspired by <strong>Vampire Weekend </strong>and <strong>The </strong><strong>Holloways</strong>. However this sound is by no means an attempt to mimic these influences, rather it breathes a breath of fresh air into a genre that is at risk of becoming stagnated.  Isabella is the stand out track of the EP, with lead vocalist <strong>Ben Dancer</strong> navigating the track from quiet introduction to emphatic chorus. However while <strong>Dancer</strong>’s vocals dominate all three tracks, he is strongly supported by the backing vocals of the rest of the band. It is this vocal support which perhaps best symbolizes my belief that <strong>Vinyl Jacket</strong> embodies a wholly more directed and professional musical outfit; there is a unity in their sound that is vital in any successful indie pop band.</p>\n<p>With this marking only the beginning of <strong>Vinyl Jacket</strong>’s journey, I am sure that this band will only continue to hone and evolve their sound. However in the meanwhile give their tracks a listen and add them to every soundtrack you have ready for the various BBQ’s and parties that summer will inevitably bring.</p>\n<p><a href=\"https://www.myspace.com/vinyljacketuk\" target=\"_blank\">Vinyl Jacket Myspace</a></p>\n<p><iframe style=\"overflow: hidden; width: 292px; height: 255px;\" src=\"https://www.facebook.com/plugins/likebox.php?id=114090381951328&width=292&connections=10&stream=false&header=false&height=255\" frameborder=\"0\" scrolling=\"no\" width=\"320\" height=\"240\"></iframe></p>\n","slug":"1035-review-vinyl-jacket","category":"music","date":1275239848000,"wpid":1035,"isSticky":false,"featured_image":{"width":165,"height":165,"src":"2010/05/vinyl-jacket-165x165.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAABQIG/8QAIhAAAgIBAwQDAAAAAAAAAAAAAQIDEQAEBjEFFSFRIkFh/8QAFQEBAQAAAAAAAAAAAAAAAAAAAwT/xAAZEQABBQAAAAAAAAAAAAAAAAAAAhESE2H/2gAMAwEAAhEDEQA/AMz0vce9joJYu8zXGoCkNasa8C6/ecLEm8ZQJH6+EZ/kVLNYJ+jl6DwkIHBSyPZwt3YO1M3PvIb1OJPD/9k="},"createdAt":1587295229400,"updatedAt":1588403567172,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2010/05/vinyl-jacket-165x165.jpg","categories":["music"]}