{"id":"5e9c2f1a9b6559241525d92c","artists":["5e9b68cd7a1236eccfeb1e12"],"title":"Review: Balam Acab – Wander / Wonder","content":"<p>It’s official, witch house is dead.</p><p> The much maligned genre has lost any sense of intrigue and is far from the phenomena that so ostentatiously swept the internet a couple of years back. Slowing down <strong>Justin Bieber’s</strong> voice, sampling gameboy sounds and uploading to bandcamp alongside brightly coloured artwork featuring legions of triangles no longer passes for reputable music creation. That said, it would be foolish to write off the music of all musicians who have previously been tarred with the ‘witch house’ brush.</p>\n<p>Exploding onto the scene last year, the soothingly ambient sounds of New York producer <strong>Balam Acab</strong> were initially branded with the witch house tag, however there’s far more intelligence to the music of <strong>Alec Koone</strong> than your bog standard electronic experimental producer. The gloriously triumphant <em>See Birds</em> released last year demonstrated this magnificently; being both simultaneously engaging and relaxing. Comparisons were drawn to the likes of<strong> Pantha du Prince</strong> and <strong>Nosaj Thing</strong>, as well as trip-hop outfit <strong>Salem</strong>, however <strong>Balam Acab</strong> maintains a more soulful, organic feel, not found as evidently in the works of his contemporary’s.</p>\n<p>With his debut album<strong><em> Wander/Wonder</em></strong> released this Monday,<strong> Koone</strong> has a real chance to alter the perceptions of his music, and forge a name for himself. So with that in mind, it’s a bold and bizarre move to find that <em>See Birds</em> doesn’t find it’s way onto the album tracklisting; surely a sign of belief in the quality of his own music? Introductory track <em>Welcome</em> is a slow burner, not revealing <strong>Koone’s</strong> full potential, whilst constructing the atmosphere through dense rhythms and repeated samples. With a minute of the track left, it kicks ferociously into life, showcasing the real engaging side to <strong>Balam Acab’s</strong> music.</p>\n<p>There are tracks that feel like entirely untrodden ground, such as the beautiful <em>Apart</em> and the mystically effervescent <em>Oh, Why</em>; two of the records stand out moments. The elegantly composed <em>Apart</em> with it’s pitch distorted vocals and swirling synths makes for a thoroughly enjoyable listen. It’s disappointing then, that aside from the aforementioned tracks, the rest of <em><strong>Wander / Wonder</strong></em> doesn’t demonstrate the immense talent this young producer has.</p>\n<p><object height=\"81\" width=\"100%\"><param name=\"movie\" value=\"https://player.soundcloud.com/player.swf?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F16690684\"></param><param name=\"allowscriptaccess\" value=\"always\"></param><embed allowscriptaccess=\"always\" height=\"81\" src=\"https://player.soundcloud.com/player.swf?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F16690684\" type=\"application/x-shockwave-flash\" width=\"100%\"></embed></object>  <span><a href=\"https://soundcloud.com/tri_angle_records/balam-acab-oh-why\">BALAM ACAB – Oh, Why</a> by <a href=\"https://soundcloud.com/tri_angle_records\">TriAngleRecords</a></span> </p>\n<p><em>Expect</em> is overly predictable, especially when set against the content of the rest of the LP. It’s the repetitive formula used on several of the tracks that lets <strong>Wander / Wonder</strong> down. Album closer <em>Fragile Hope</em> appears to take influence from post-rock sources, yet the water droplet soundtrack that dominates much of the piece becomes overpowering and slightly perturbing. Where <em>Oh, Why</em> excels through it’s melodic knowledge,<em> Fragile Hope</em> and <em>Except</em> fall rather flat and dour. There’s no doubting the talent of <strong>Balam Acab</strong>, yet for all the breathtakingly stunning moments on his debut LP, there are the times when it aimlessly drifts by, feeling less like a free-moving composition and more like an accidental collection of hurriedly recorded tracks.</p>\n","slug":"10390-review-balam-acab-wander-wonder","category":"album-reviews","date":1314381316000,"wpid":10390,"isSticky":false,"featured_image":{"width":608,"height":449,"src":"2011/08/balam-acab-promo-20101.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAIE/8QAIRAAAQMDBAMAAAAAAAAAAAAAAQIEEQADEgYTIWEFBzH/xAAVAQEBAAAAAAAAAAAAAAAAAAACA//EABgRAAMBAQAAAAAAAAAAAAAAAAABAhEx/9oADAMBAAIRAxEAPwCm3t5o21efEWm19THdQxFzKADlG5jE/THY56rS61VfQ6vIDewoJWRMHnmlKj0NU5Sw/9k="},"createdAt":1587293978702,"updatedAt":1588403549528,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/08/balam-acab-promo-20101.jpg","categories":["album-reviews","music"]}