{"id":"5e9c34019b6559241525e15d","title":"5 Minutes With: Cast of the Capital","content":"<p><a href=\"https://admin.</p><p>crackintheroad.com/uploads/2010/05/GetAttachment1.jpg\"><img class=\"alignnone size-full wp-image-1042\" src=\"https://api.crackintheroad.com/wp-content/uploads/2010/05/GetAttachment1.jpg\" alt=\"\" width=\"640\" height=\"426\" srcset=\"https://api.crackintheroad.com/images/2010/05/GetAttachment1.jpg 640w, https://api.crackintheroad.com/images/2010/05/GetAttachment1-300x199.jpg 300w, https://api.crackintheroad.com/images/2010/05/GetAttachment1-494x328.jpg 494w, https://api.crackintheroad.com/images/2010/05/GetAttachment1-165x109.jpg 165w\" sizes=\"(max-width: 640px) 100vw, 640px\" /></a></p>\n<p>Outside of Glasgow and Edinburgh times are hard for new Scottish bands, with only a handful achieving the success that is deserved for so many and Cast of the Capital are no exception. Hailing from Aberdeen, <strong>Cast of the Capital</strong> are currently trying to break through this curse afflicting many Scottish bands using awe inspiring hard work and dedication which most bands wouldn’t consider doing. Driving their van all across Scotland to play gigs as well as holding down normal jobs are proof of their commitment to forging a career in music. The sound itself isn’t the generic pop-rock spewed out across the UK by people expecting the world to listen, but instead a combination of upbeat melodies and deep lyrics that exudes wit and charisma. With inspirations coming from American bands such as <strong>Death Cab for Cutie </strong>and <strong>Band of Horses</strong> suggests meaningful and thought-provoking lyrics but at certain times it becomes almost whimsical and light hearted, which leaves the listener guessing, emphasising the song writing talent this band has.</p>\n<p><strong>Cast of the Capital</strong> have already released an EP <em>‘Rotten Kids and Haverstacks’</em> which I believe to be a must-have for any indie music connoisseur which has been championed by the likes of <strong>Vic Galloway</strong>, as they have been named in his 50 bands to watch out for in 2010, and rightly so. As this year’s festival season is approaching one can only hope that <strong>Cast of the Capital</strong> will be appearing on stages throughout Britain, as their performances and musical style reflects the fun element that would make any festival goers weekend one to remember. They do have festival experience after performances at Rockness and Belladrum last year so they are yearning for more, and have  toured extensively throughout Scotland which is proof the band are doing everything possible to achieve the recognition they undoubtedly deserve.</p>\n<p><strong>Cast of the Capital</strong> were kind enough to answer a few questions in person to myself and Josh (Ganymede) before their great gig in Dundee:</p>\n<p>CITR: Touted by Vic Galloway as being in the top 50 Scottish bands in 2010 so what do you think of that and what does the future hold for Cast of the Capital?</p>\n<p><strong>We were very happy with that, it rounded our year off nicely last year because he first played us on the radio in either June or July just before the festivals so that was really cool and we spoke to him up at Rockness so when he announced us as one of his top 50 that was really cool and it was good to know he thought we were up to his standard. There was a lot of cool bands in the list and we were proud to be part of that. </strong></p>\n<p>CITR: Yeah I had a brief look through that list the other day and there are some really good bands in that list.</p>\n<p><strong>Yeah definitely, we were really happy and pretty proud of that.</strong></p>\n<p>CITR (Josh): Yeah in terms of places in the UK where the best music is coming from its definitely Scotland by such a long way. I know of so many good bands coming out of Scotland such as The Twilight Sad and Frightened Rabbit</p>\n<p><strong>Yeah definitely, it seems like the scene allows different bands to work together and I think all Scottish bands feel affiliated with one another which is quite nice.</strong></p>\n<p>CITR: You’ve played both at Belladrum festival and Rockness but have you played in any other festival and either way which was your favourite one to play at?</p>\n<p><strong>We played one called Wizard Festival which is like near our house, only about an hours drive or something which was ace, that was probably the best actual gig and there was a really good atmosphere. It was the smallest festival with regards to the actual tent we were in…Belladrum was ace as a festival to enjoy in a non-musical sense as I didn’t really like many of the bands but apart from that just where it was was so cool. The actual tent was on the left as you entered the camp site and didn’t really look like it was open and it kinda looked like it was where people went to get changed but they eventually put up a signpost! Ali was dying of an illness, we diagnosed him with swine flu so no-one was walking to him…(he adds, I was quarantined to the back of the van).</strong></p>\n<p>CITR: What did you think of Rockness as well, I go there most years and think highly of it as a festival…</p>\n<p><strong>I just cannot believe I wasn’t into <em>Flaming Lips </em>last year because now I’m kicking myself for not listening to more of them. To think that we played a festival with <em>Flaming Lips</em> and didn’t really know who they were last year. I think as a festival for me it was the most exciting one because it was the first one we played and it was obviously the biggest and there was quite a lot of hype about the announcements so on the day I was very excited. It was definitely the one that left me with the biggest buzz and we played a good show as well. </strong></p>\n<p>CITR: What festivals, if any, are you playing this year?</p>\n<p><strong>Were still hoping to get confirmed for a couple but nothing has been confirmed as yet but the way it works sometimes is you get asked to do it last minute, not T in the Park this year but maybe next year. I think every Scottish band really strives to get to T break (stage), if you make the cut of the 16 your really going places. T in the Park is a land mark achievement and we would love to have the opportunity to play T in the Park at some point.</strong></p>\n<p>CITR (Josh): I have been there the last 6 or 7 years and Scottish bands get such an amazing reception</p>\n<p><strong>(they agree)</strong></p>\n<p>CITR: On Myspace you state your influences include things like ‘fun’ and not necessarily other bands, could you possibly elaborate on that at all?</p>\n<p><strong>Yeah that is pretty vague (laughs), but first of all we couldn’t really be bothered in writing a list of bands as whatever you write people always go like you sounds like them even if you don’t. My favorite bands are all like <em>Band of Horses</em>, I got their new album today which is ace, <em>Death Cab for Cutie</em> and stuff…</strong></p>\n<p>CITR: Yeah I read that you liked those bands, which are all generally American bands…</p>\n<p><strong>Yeah but then like <em>Frightened Rabbit</em> and stuff are all great, its kind of like a 50/50 between American bands and Scottish bands but all of the Scottish bands we like kinda have the American thing too so it all comes back around on itself, I think its definitely grounded in American music. But with writing I’d say I’m not influenced just from music but so much other stuff as well.</strong></p>\n<p>CITR: Yeah, all of your songs appear very upbeat but if something bad happened to any of you would you start writing negative songs or would you try and have ‘every cloud has a silver lining’ approach to things?</p>\n<p><strong>Its weird because most of our songs at the moment are upbeat, but Its not like we are a band that just writes upbeat songs because I’ve got a lot of songs which aren’t upbeat but I just choose the upbeat ones to play because no-one knows us at the moment so if were playing a gig we basically have to try and keep everyone happy. Once people know you and like you then you can come up with anything they’ll like it…not necessarily but you get what I’m saying. What I mean is then you can start all the kind of stuff you want to do but generally when your writing songs the most fun ones to play as a band are the upbeat and happy ones because they’ve always got the most sense of rhythm to it. The darker ones always need to come out slightly slower or even acoustic…but then again most of our songs <em>are </em>upbeat but I find it insanely impossible to write songs that are actually happy lyrics wise, though the melody is always happy. </strong></p>\n<p>CITR (Josh): is it just you who writes the songs (Matt) or do you all contribute to writing the songs?</p>\n<p><strong>Matt is our dominant song writer in the band but then he takes the demo tracks to us and we fill them out pretty much. </strong></p>\n<p>CITR: You’re band is based in Aberdeen do you find that if you were from Glasgow or Edinburgh you would have gone places quicker?</p>\n<p><strong>I think up until now we have made pretty good progress and have had a lot of fun touring, even outside of Aberdeen hasn’t been too much hard work but the more we start to want to venture down into England and play more shows in Glasgow it gets frustrating with the amount of driving involved. Despite this we are having great fun. I guess in the future we might consider relocating but for now we are happy in Aberdeen. Like anything else money is a bit of an issue (laughs).</strong></p>\n<p>CITR: You released an EP ‘Rotten Kids and Haverstacks’, is there any significance behind that title?</p>\n<p><strong>It is a funny name but Matt wrote a little acoustic track a long time ago and that was the title of it, we always thought was an ace track name and it created cool images in my head, I don’t really know what of but it was very cinematic. We liked the general theme of that, if there is even a theme to it. </strong></p>\n<p>CITR: have you got anything new coming out soon at all?</p>\n<p><strong>We’re toying with the idea of releasing a single in September but nothing is set in stone. </strong></p>\n<p>CITR (Josh): you’ve said films influence you, with bands like Frightened Rabbit and The Twilight Sad have song titles and stuff that has come from films. It seems good when bands state that their influences include things such as film instead of merely just other bands.</p>\n<p><strong>Films make you feel stuff quite strongly, we always would love our music in a soundtrack. Its almost like the lyrics in Matt’s songs are like a little film in itself, he always has an interesting story to listen to.</strong></p>\n<p>Here is the Band’s Myspace page:</p>\n<p><a href=\"https://www.myspace.com/castofthecapital\">https://www.myspace.com/castofthecapital</a></p>\n","slug":"1043-5-minutes-with-cast-of-the-capital","category":"interviews","date":1275227683000,"wpid":1043,"isSticky":false,"featured_image":{"width":640,"height":426,"src":"2010/05/getattachment.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAUG/8QAIhAAAQIFBAMAAAAAAAAAAAAAAQIDAAQFERIGByExE0FR/8QAFAEBAAAAAAAAAAAAAAAAAAAAA//EABsRAAIBBQAAAAAAAAAAAAAAAAECAAMEESEx/9oADAMBAAIRAxEAPwDI6Z3b1XT3n2XHA9JONuqdbuMAMTykHlITbodxZRunSFJBmKZMeYi68cSMvdufsIQaXdRNgwmRXGCOT//Z"},"createdAt":1587295233002,"updatedAt":1588403567235,"author":"5e9b68b27a1236eccfeb1d07","old_image":"2010/05/getattachment.jpg","categories":["interviews","music"]}