{"id":"5e9c33ff9b6559241525e15a","title":"Preview: Dot to Dot Festival 2010","content":"<p>If you are in the Manchester area on the 31<sup>st</sup> May, you’d be wise to start your summer of music at this fantastically wide-ranging festival.</p><p> The <strong>Dot to Dot Festival </strong>began in Nottingham in 2005, and has gone through various transformations over the years until it inaugurated Manchester as it’s new stopping point this year.</p>\n<p><strong>Venues:</strong></p>\n<p><strong>Manchester Academy</strong>: The <strong>Manchester Academy</strong> is the musical hub of Manchester, housing performances from some of the biggest bands to grace the North of England over the years. Most elements of the Academy (2, 3, and Club) will be taking part in the festival, with the<strong> Mystery Jets </strong>performing a headline slot in Academy 2. Other bands that are worth checking out in the Academy are <strong>The Answering Machine</strong>, <strong>Field Music</strong>, and <strong>Goldheart Assembl</strong><strong>y</strong>.</p>\n<p><strong>FAC251</strong>: Created from the ashes of the infamous <strong>Factory Records</strong> and their various musical interests across Manchester, <strong>Peter Hook</strong> reopened Factory’s headquarters as a nightclub named <strong>FAC251</strong>. The nightclub is relatively new to the Manchester music scene, and undoubtedly many of those that pass through its doors will not understand, or even be aware, of it’s significance. However <strong>FAC251</strong> has proved itself as a very capable and well designed club, hosting regular club nights as well as many live DJ’s and gigs. <strong>Zane Lowe </strong>is playing a headline slot here, however be sure to also check out <strong>Gentleman’s Dub Club</strong> and <strong>French-Soler</strong>.</p>\n<p><strong>Deaf Institute</strong>: Located along Oxford Road from the <strong>Manchester Academy</strong>, the <strong>Deaf Institute </strong>is a fantastic venue in it’s own right. Describing itself as a Café, Bar and Music Hall, the <strong>Deaf Institute</strong> is one of the most intimate music venues in Manchester. An experienced host of regular club nights and live gigs, ranging from <strong>Diana Vickers</strong> to <strong>Great Lake Swimmers</strong>, this is certainly a venue worth visiting. Bands playing at the Deaf Institute that should be checked out are <strong>Lunar Youth</strong>, <strong>Alan Pownall</strong>, and <strong>Lissie</strong>.</p>\n<p><strong>Band Tips:</strong></p>\n<p>There are many great bands with diverse sounds playing across the festival, however I have highlighted three that I believe are worth not only seeing at the festival, but worth checking out in their own musical right.</p>\n<p><strong>The Cheek</strong>:</p>\n<p>An indie-pop band from Suffolk, <strong>The Cheek</strong> have created a sound that is both gritty and melodic. Originally called ‘<strong>Cheeky, Cheeky, And The Nosebleeds</strong>’, their name change was explained by the band as ‘<em>It takes about two seconds to say <strong>‘C</strong><strong>heeky Cheeky And The Nosebleeds’,</strong> and we say our band name sometimes 20 times a day. That’s like four-and-a-half minutes every week. More than four hours a year. We’re getting an extra three hours a year back just by becoming ‘<em><strong>The Cheek</strong></em><em>”’<span style=\"font-style: normal;font-weight: normal\">. With a festival date at </span><span style=\"font-style: normal\"><strong>Glastonbury</strong></span><span style=\"font-style: normal;font-weight: normal\"><strong> </strong></span><span style=\"font-style: normal;font-weight: normal\">and a support slot for the </span><span style=\"font-style: normal\"><strong>Doves</strong></span><span style=\"font-style: normal;font-weight: normal\">,</span><span style=\"font-style: normal\"> <strong>The Cheek</strong></span><span style=\"font-style: normal;font-weight: normal\"> are a band to watch out for in the future.</span></em></em></p>\n<p><strong>Lunar Youth</strong>:</p>\n<p>Another indie band, however their electro influences makes them an entirely different entity from <strong>The Cheek</strong>. Compromised of New York Brothers Simon and Adam Berlin, and token Brit Peter Davies, <strong>Lunar Youth </strong>have taken <strong>Tom Petty</strong>-esque melodies and produced a resulting sound that has an attitude that will spread as rapidly through an audience as we were told Swine Flu would around the world, but with wholly more enjoyable consequences. Be sure to check them out at the <strong>Deaf Institute</strong> at the <strong>Dot to Dot Festival</strong>.</p>\n<p><strong>Gentleman’s Dub Club</strong>:</p>\n<p>A nine-piece live dance music outfit originating from Leeds, <strong>Gentlemen’s Dub Club </strong>have created a sound deeply rooted in, unsurprisingly, dub and reggae music. According to their own label, <strong>GDC</strong> produces a <em>‘</em><em>mixture of tight grooves and a dance-floor friendly sound’</em>, and it is hard to disagree with them after I was lucky enough to bare witness to this front of rhythmic bass myself. Playing at <strong>FAC251</strong>, <strong>Gentleman’s Dub Club’s </strong>set rests highly in my recommendations of what to see during the festival.</p>\n<p>And there you have it, if you have any means to get to Manchester on the 31<sup>st</sup> May, be it by land, water, or air, then I can promise you it will be well worth it.</p>\n<p><a href=\"https://www.dottodotfestival.co.uk/\" target=\"_blank\">Dot to Dot Festival Website</a><br />\n<a href=\"https://www.manchesteracademy.net/\" target=\"_blank\">Manchester Academy Website</a><br />\n<a href=\"https://www.factorymanchester.com/\">FAC251 Website</a><br />\n<a href=\"https://www.thedeafinstitute.co.uk/\">Deaf Institute Website</a></p>\n<p><a href=\"https://www.myspace.com/wearethecheek\" target=\"_blank\">The Cheek Myspace</a><br />\n<a href=\"https://www.myspace.com/lunaryouth\" target=\"_blank\">Lunar Youth Myspace</a><br />\n<a href=\"https://www.myspace.com/gentlemansdubclub\" target=\"_blank\">Gentleman’s Dub Club Myspace </a></p>\n<p><iframe src=\"https://www.facebook.com/plugins/likebox.php?id=114090381951328&width=292&connections=10&stream=false&header=false&height=255\" scrolling=\"no\" frameborder=\"0\" style=\"border:none; overflow:hidden; width:292px; height:255px;\" allowTransparency=\"true\"></iframe></p>\n","slug":"1046-preview-dot-to-dot-festival-2010","category":"festivals","date":1275228706000,"wpid":1046,"isSticky":false,"featured_image":{"width":415,"height":330,"src":"2010/05/dot-to-dot-image.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAIAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAYH/8QAHxAAAQMEAwEAAAAAAAAAAAAAAgEDBAAGERIFITFR/8QAFAEBAAAAAAAAAAAAAAAAAAAAAf/EABcRAQEBAQAAAAAAAAAAAAAAAAEAEUH/2gAMAwEAAhEDEQA/AKK9WOajXNJhRoU19x+YRFIjRiyyBSCcBULCC4qiWMbJjXv3Fala8K44Vs8RFe0B1iGy0QuGikiiCIqL7319pSjeSmA3/9k="},"createdAt":1587295231157,"updatedAt":1588403567203,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2010/05/dot-to-dot-image.jpg","categories":["festivals","music"]}