{"id":"5e9c2f2e9b6559241525d94a","title":"Live Review: Alphabet Backwards (Upstairs at the O2, Oxford, 20/08/11)","content":"<p>To be honest I’m still reeling from being given my first ever press pass (oh, shut up and let me enjoy the moment), but luckily I recovered my composure enough to see ‘Mafro-beat’ (yep) combo <strong><a title=\"Nairobi facebook\" href=\"https://www.</p><p>facebook.com/nairobitheband\">Nairobi</a> </strong>cut the metaphorical ribbon of this BBC Introducing event, with a set of offbeat but defiantly major key guitar antics, complete with <strong>Kinsella</strong>esque yelping and endearingly quirky lyrics. Coming across a little like Wantage’s answer to latterday <strong>Maps and Atlases</strong>, the four-piece’s set does contain some of the potholes that youthful math rock often falls prey to – nonlinear songs can feel like a collection of parts rather than a well structured piece. However, <strong>Nairobi </strong>have individuality and enthusiasm in spades and, as is also often the case with bands of their ilk, they don’t drown themselves in earnestness and self-importance.</p>\n<p>The former of which is something <strong><a title=\"CP facebook\" href=\"https://www.facebook.com/pages/The-Cooling-Pearls/175559275823972\">The Cooling Pearls</a> </strong>possess a little too much of. As they take the stage, the septet present an enticing prospect, lugging a veritable cornucopia of instruments along with them. However, as their set trudges on, it becomes fairly clear that they’re not about to break out of their bog-standard, morose indie-folk and into something as interesting as their setup first suggested.</p>\n<p><strong><a href=\"https://www.anchorandthewolf.com/\">Anchor and the Wolf </a></strong>also deal in folk-inflected indie pop, but thankfully go down easier than their predecessors. The four piece initially come on a little like<strong> Ellie Goulding </strong>fronting <strong>Múm</strong>, and from there cascading walls of guitar reminiscent of <strong>Bloc Party</strong>‘s Russell Lissack at his best provide a brightly coruscating backdrop for <strong>Zoe Mead</strong>‘s voice, which could lull you to sleep one second and rally masses the next. Their sound presents few challenges and is certainly nothing exciting, but it’s infinitely palatable and well executed, and with the musical climate as it is, their playing a BBC event is surely a sign of things to come.</p>\n<p>They may have a massive guitar sound, but in their posturing efforts at darkness and depth, <strong><a href=\"https://halfrabbits.co.uk/\">The Half Rabbits</a> </strong>fall flat on their faces. The band trot out a set of swaggering, self-important, sub-<strong>Editors </strong>bollocks that apparently aims for <strong>Smashing Pumpkins </strong>(always a dangerous choice of influence anyway), but ends up somewhere in the vicinity of <strong>U2</strong>. Frontman <strong>Michael Weatherburn </strong>(billed on their website as the ‘main songwriter’, which only adds to the general air of pomposity) makes an attempt at humility between songs, remarking on how great the other bands playing are, before slickly remarking ‘hopefully we’re great too’, and by the time he drawls out a half-boiled line about being an ‘architect of the soul’, I’m a set of deaf ears. Sorry.</p>\n<p>Local heroes <strong><a href=\"https://www.myspace.com/alphabetbackwards\">Alphabet Backwards</a> </strong>are always an act best experienced in the flesh, foregoing moodiness in favour of infectious, sunny guitar pop so effervescent it’s constantly in danger of bubbling over. Their thrilled reception by a packed out room is indicative of their status, and happily, tonight they prove that they’re worthy of the crowd’s adulation. Frontman James remains as engaging a presence as ever, and stage antics occasionally resemble a bouncing competition between members, which to be honest is fairly fitting. Newer cuts like <em>Taller </em>are greeted with the same enthusiasm as favourites <em>Blink of an Eye </em>and <em>Plastic</em>, and while the ridiculous synth line in <em>Elton John </em>really shouldn’t work, when set to the kind of leaping abandon that the four piece do so well, it makes perfect sense. <strong>Alphabet Backwards </strong>do a fine job of warming hearts and spreading grins, and with the summer nearly over, they’re needed more than ever.</p>\n<p><iframe width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/jdtGcliW70M?feature=oembed\" frameborder=\"0\" allowfullscreen></iframe></p>\n","slug":"10545-live-review-alphabet-backwards-upstairs-at-the-o2-oxford-200811","category":"live-reviews","date":1314134375000,"wpid":10545,"isSticky":false,"featured_image":{"width":165,"height":165,"src":"2011/08/james-165x165.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAABQQG/8QAIxAAAgEDAwQDAAAAAAAAAAAAAQIDBBEhAAUSBhMiQTFCYf/EABUBAQEAAAAAAAAAAAAAAAAAAAIE/8QAIhEAAgAEBgMAAAAAAAAAAAAAAQIAAwQRBRIhMTJBUWGB/9oADAMBAAIRAxEAPwDG9H9PbbX7JW1G51ccc1w9OqElyq35C58c4+c4/dRybSwkbtMDHc8SWUEj1cX0FQTSxzqscjqvF8KxA96KmJ70mfsdVYW7Kj3AIzEajx9g1dLLM0LduIO47v6j/9k="},"createdAt":1587293998592,"updatedAt":1588403549798,"author":"5e9b68b27a1236eccfeb1d3c","old_image":"2011/08/james-165x165.jpg","categories":["live-reviews","music"]}