{"id":"5e9c2efd9b6559241525d902","artists":["5e9b68e07a1236eccfeb1f3e"],"title":"Review: Cymbals Eat Guitars – Lenses Alien","content":"<p>Now’s about the time people start to get worried.</p><p> Sophomore efforts are notorious for being tricky beasts, and as an added obstacle this one, from Staten Island’s <strong>Cymbals Eat Guitars</strong>, has to follow up<strong><em> Why There Are Mountains,</em></strong> a debut that received rave reviews pretty much across the board on its release in 2009. Just to further complement the general sense of foreboding, they’ve called the damn thing <strong><em>Lenses Alien</em></strong>, the foreign (and by extension difficult) connotations of which are fairly plain to see.</p>\n<p>However, at this point it’s probably worth remembering that the nine cuts of squalling noise found on <strong><em>…Mountains</em></strong> were hardly easy listening in the first place. And thankfully, opener <em>Rifle Eyesight </em>does a fine job of laying any sort of preconceived jitters to rest. It’s clear over the song’s eight and a half minutes that both the band and producer <strong>John Agnello</strong> have opted for a much more pronounced sense of light and shade this time around – the song ascends and dips through a varied series of peaks and troughs, from those angular <strong>Pavement</strong>isms that endeared <strong>Cymbals </strong>to their public the first time round, to the kind of widescreen <strong></strong>jams that wouldn’t be out of place on a <strong>Built to Spill</strong> record. <strong>Agnello</strong> proves himself a skilled hand at giving the band room to breathe in the spacier moments, and reigning them in for the punchier ones, to the overall effect that the band sound far more in control of their twisting structures and spiralling noise than before.</p>\n<p>In this sense, <em>Rifle Eyesight </em>serves as something of a microcosm for <strong><em>Lenses Alien </em></strong>as a whole. On occasion, <strong>Cymbals</strong> show that they are still more than capable of losing themselves in the storm that they spin, the furious distortion of <em>Keep Me Waiting </em>or the screaming that closes the record on <em>Gary Condit </em>being thrilling cases in point. On others, the quartet’s penchant for melody really comes into its own, <em>Wavelengths </em>in particular having more in common with a band like <strong>The Shins </strong>than any of <strong><em>…Mountains’ </em></strong>noisier reference points. This well-executed marriage of volume to leftfield tunefulness serves <strong><em>Lenses Alien </em></strong>particularly well, making it distinctly easier to take on board the wide range of emotion conveyed by the album’s ten cuts than if they were shrouded in fuzz.</p>\n<p>As another happy by-product of <strong>Agnello</strong>‘s more considered production dynamic, it’s now entirely possible to immerse oneself fully in frontman <strong>Joseph D’Agostino</strong>‘s skillful wordplay. For the most part, syllables and phonemes come bursting around the man’s tongue and from his lips in ever more weird and wonderful variations – the opening of <em>Plainclothes </em>lets up on the verbosity slightly, foregoing <strong>D’Agostino</strong>‘s usual mile-a-minute streams of imagery, and details the story of a man who killed a state trooper, wittingly or unwittingly recalling archetypal American storyteller <strong>Bruce Springsteen</strong>. It only lasts 10 seconds though, until <strong>D’Agostino</strong> drawls ‘once your protons collide, everything, everything changes’, and we’re launched headfirst back into his surreal verbal realms. Similarly, he’s a master of combining these intense images with ones more invitingly homespun and recognisable – the skateboard that rolls on down the hill in <em>Another Tunguska </em>is all the more striking for it’s tangled lyrical surroundings.</p>\n<p>With <strong><em>Lenses Alien</em>, Cymbals Eat Guitars </strong>have produced a powerful, nuanced successor to a debut that garnered a strong critical following. It would have been very easy for <strong></strong>the band to simply recreate <strong><em>Why There Are Mountains </em></strong>a second time around and just about get away with it. But instead, they’ve opted to aim higher, and in doing so they’ve hit that rare pitch between innovative melody and hair-raising noise, and created a record that’s both thought-provoking and visceral in equal measure. <em><br />\n</em></p>\n","slug":"10613-review-cymbals-eat-guitars-lenses-alien","category":"album-reviews","date":1314896045000,"wpid":10613,"isSticky":false,"featured_image":null,"createdAt":1587293949130,"updatedAt":1588441788531,"author":"5e9b68b27a1236eccfeb1d3c","old_image":"generated/27fe47426ccff546e73f48fff10734930fd37dda.jpg","categories":["album-reviews","music"]}