{"id":"5e9c2f0a9b6559241525d914","artists":["5e9b69047a1236eccfeb2180"],"title":"Interview: Jack Mazes – Art Is Cheap","content":"<p style=\"text-align: left;\">On July 29th, <strong>Jack Cooper</strong>, who’s most likely to be found playing guitar and singing with joyous fuzz-pop four piece <strong><a title=\"Mazes Site\" href=\"https://mazesmazesmazes.</p><p>com/\">Mazes</a></strong>, made a post on the band’s website, which read as follows:</p>\n<p style=\"text-align: left;\">‘Art is cheap… people make millions and trillions of pounds out of a brain cell firing successfully. it’s crazy. I’ll write you a song for £10… send me a song title and your email address and I’ll be in touch… a song title or anything, guitar part, drum beat…whatever. I’m feeling inspired. This project will last a week, so be quick</p>\n<p style=\"text-align: left;\">mazesmazesmazes@gmail.com</p>\n<p style=\"text-align: left;\">Jack Mazes x’</p>\n<p style=\"text-align: left;\">On the 22nd of August, Jack posted the first home-recorded song up on the project’s <a title=\"Art Is Cheap\" href=\"https://artischeap.tumblr.com/page/2\">Tumblr</a>, a capriciously upbeat elegy entitled <em>When Sleater-Kinney Died</em>, commissioned by blogger <a title=\"Bank Robber Music\" href=\"https://bankrobbermusic.com/blog/2011/08/mo-money-mo-bloglems-an-lb-joint\">Lauren Bernal</a>. Two more tracks followed that day, and four the next.</p>\n<p style=\"text-align: left;\">Usually I’m a fairly staunch detractor of the lo-fi aesthetic that’s been enjoying a revival for the last little while. In my bloody-minded way, this attitude is partially a reaction to the movement’s popularity – many bands whom I consider to really have very little talent for songwriting or musicianship are suddenly jumping on the bandwagon in droves (both a blessing and a curse of the movement is that it’s practically doable by anyone, regardless of talent or finance) and being lauded by critics for what can be taken as essentially lazy, half-arsed attempts at what I believe should be a considered and moving art form. Art becomes ‘cheap’ in the sense that it becomes an infinitely reproducible commodity, losing its aura along the way, as Walter Benjamin might have it.</p>\n<p style=\"text-align: left;\">I appreciate that in an age of postmodernity (if you subscribe to that school of thought), nothing can be original and we need to find ever different ways of helping music to evolve, and that placing the power of music in the hands of practically anyone can be an exciting prospect for musical evolution. And certainly, homespun recording techniques can create an intimacy and atmosphere that’s lost when you’re playing in solitude behind a glass window, and into a massive desk. I ‘get’ lo-fi on a conceptual level, if not always on a sonic one. But I’m similarly fairly confident that these thoughts don’t enter the heads of many of the artists embracing the techniques that mark out the lo-fi ‘scene’. Of course, Jack’s ear for pop hooks and his laconic, tuneful drawl lend themselves perfectly to the hiss and hum of home recording, making it relatively easy to take pleasure in <strong><em>Art Is Cheap</em></strong>‘s crackly, my-first-tape-deck cuts. But quite simply, if the record collection I’ve amassed over the years is anything to go by, I seem to prefer studio-produced recordings – ones with character, certainly, but nevertheless ones where instruments sound full and vocals clear.</p>\n<p style=\"text-align: left;\">However, <strong><em>Art Is Cheap </em></strong>has certainly had me revising my views on the lo-fi aesthetic, if not wholeheartedly embracing it. I’ve had to stop myself believing (imagining, perhaps) that there’s a whole bunch of bands and critics out there who are embracing lo-fi because it’s receiving a lot of attention, and start discovering the issues at the roots of the movement. The project’s forced me to think about what I’d want – or be able – to play, rather than what I’d want to hear. It’s an intoxicating thought, taking music from the listener and delivering it entirely into the hands of the artist. In removing music from the shackles of funding and major labels, art becomes ‘cheap’ in a positive sense – it doesn’t need money to be created.</p>\n<p style=\"text-align: left;\">In any case, last Thursday I sent poor Jack a hideously wordy email that purported to be an interview, but was mostly just a vehicle for me to expound my own half-baked theories on the issues that he’d introduced with <strong><em>Art Is Cheap</em></strong>, strewn about with a few questions here and there. Being the lovely fella that he is, he got back to me with what seemed a genuine interest and hunger for discussion, and over the course of a few days, we came up with what you see below…</p>\n<p><strong>CitR: You mention a number of ideas on the project’s Tumblr that started you thinking about ‘Art is Cheap’. Was there an actual time or event that you can pinpoint which led to the project actually happening, or was it literally just the amalgamation of those various ideas over time?</strong></p>\n<p>JC: Well originally my idea stemmed from what I personally enjoy the most from music, which is the initial spark of creativity that leads to a melody. That’s what gives me the biggest thrill. I tend to write songs on the move. I’ll just start humming a melody, singing it maybe and then I’ll elaborate on it in my head. To an extent it’s all downhill from there. Figuring out lyrics, working it out on guitar and then eventually recording it are all satisfying but it’s the acorn of an idea I enjoy the most. It’s crazy to think that the greatest pieces of music begin like this…the majority probably never get beyond this point, but then they get recorded, packaged and promoted, and they then have the capacity to earn millions and millions of pounds. I liked the idea that I could write something very quickly…the idea being suggested by someone else and then maybe the ‘commissioner’ and myself could be the only ones to hear it ever. My two ideal scenarios would be to write something for someone, we both listen to it once and then we both delete it. The other would be for a massively established act to ask for a song, record it and for me to lose all control.</p>\n<p><strong>CitR: There were a couple of points in the introduction that got me thinking as well. Firstly, you mention Steve Keene, who once said of his art,</strong></p>\n<p><strong>‘I want buying my paintings to be like buying a CD: it’s cheap, it’s art and it changes your life, but the object has no status. Musicians create something for the moment, something with no boundaries and that kind of expansiveness is what I want to come across in my work.’</strong></p>\n<p><strong>How do you interpret this? Are you a fan of Keene’s work and ideas? You’re a musician. How do you respond to the idea that you create something purely ‘for the moment’? It seems like kind of a reductive statement, pretty much at odds with the ‘expansiveness’ Keene mentions. His ideas are certainly a wonderful antidote to music/art snobbery, but I think there’s some kind of middle ground between that and not giving a fuck about music at all…</strong></p>\n<p>JC: Steve Keene isn’t the only person doing this but that quote in particular was an inspiration. Unfortunately I’m not as well known as him, so I maybe have two requests a day but I like to think if I had ten, I’d be able to push myself into writing ten songs. This interview is really the first time I’ve sat down and actually thought about why I’m doing this and when I’ve explained it to people in the past and I suppose in the answers I give now, a lot of my motives conflict. But yeah I get what you mean about the ‘expansiveness’ thing… it’s slightly contradictory, but that’s life. We’re all hypocrites.</p>\n<p><strong>CitR: Could you go into your statement about ‘Yesterday’ a little more? I’m not trying to court controversy at all, but is there anything you find inherently ridiculous about the song itself, or is it just the fact that it made so much money out of so little effort?</strong></p>\n<p style=\"text-align: left;\">JC: Not at all. I love that song and love The Beatles. I can completely understand why someone wouldn’t like that song though; it’s schmaltzy maybe, definitely overplayed… I get why people don’t like Paul McCartney. My point was that he famously ‘dreamt’ that song and then on getting out of bed, he figured it out on the piano. It probably took him fifteen minutes, disregarding writing the lyrics and arranging it, which to be honest are pretty irrelevant. The song isn’t popular because of the lyrics or the strings etc…most songs aren’t. But for him to have earned millions and millions of pounds out of something so flippant; it’s ridiculous in the grand scheme of things. Someone could work in a factory for 40 years and not even scratch the surface…but again, I DO value art. Paul McCartney’s contributions to society are undoubtedly more significant than a factory worker… that’s not a nice thing to say. I’m coming across like an ill-informed sociology student so I’ll stop…but whatever, it’s interesting.</p>\n<p><strong>CitR: What’s your stance on downloading music? I have this bizarre, double-edged idea that, because I love playing music so much, it’d kind of feel like cheating to make enough money to live out of it, so I kind of support the whole thing, plus it increases exposure. I know being in a band is hard work, but in comparison to a regular job it is literally a dream come true. That said, as a fan rather than a musician, I think that it’s very important to support smaller bands and the record labels that they’re on, and therefore make an effort to buy their records, not to mention the fact that I love owning physical media…<br />\n</strong><br />\nJC: Yeah I feel the same. I’m a hypocrite. I’d love to earn a good living out of making music but I think that has to be a by-product. I illegally download music and I’d never be angry with anyone for downloading ours. I think what is interesting is that it’s almost impossible now to make a career out of music, a financially rewarding career anyway. So in theory money will stop being a motivation. But again, it all has two sides. I like a lot of super-commercial music…</p>\n<p><strong>CitR: Can you sustain any sort of lifestyle from Mazes? Likewise, at my last count, you’ve made 100 quid from the project so far. Are you intending on using the money for anything in particular?</strong></p>\n<p>JC: Mazes wise, no, I don’t earn a living from it. Our record label’s fantastic and they have invested in us. We get to travel, to play our music to people and there’s certainly potential for us to earn a living in the future but at the moment no. Because we’re semi busy with the band, the truth is that it’s also very very difficult to hold down an actual paying job as well. It’s a balancing act. I don’t ever want to bum anyone out and when we got back from America last time, friends would say “You must’ve had a great time!”, and yes we did, but it certainly taints it a little when you’ve spent the 3 weeks in America not working, and wondering how you’re going to pay rent when you get back. I’m not moaning – I love being in this band, but it’s just pretty difficult sometimes.</p>\n<p>£100…I’ve made more than that. A few people have paid a lot more than the £10 and then the majority have given a little extra. The songs on the blog are only 50% of the ones I’ve written… some people didn’t want theirs on the blog (which is completely in the spirit of it). As far as having a plan with the money…not really. I don’t have much of a job at the moment, so when I thank someone for paying me and tell them ‘you just bought me lunch and coffee’, I actually mean it.</p>\n<p><strong>CitR: One song that really got the ol’ cogs whirring was ‘Lick’, commissioned by the frozen yoghurt shop in Brighton of the same name. You write in the blurb above the song ‘Music to promote commerce. A tricky subject. One I’d always felt reasonably strongly about.’ Could you elaborate on that? Did the fact that Lick are a small independent company, whose product you’re a fan of anyway, ease the decision at all? Obviously you decided to record the song in the spirit of the project – but you also note that they paid you a lot more than the ten pound asking price…</strong></p>\n<p>JC: Well everyone knows that licensing songs to adverts or movie companies is one of the only ways a band can make big money nowadays. I don’t think anyone likes doing it – it cheapens the art. It probably goes against most band’s politics, but money talks. I did that song because it would go against my idea to refuse that. I can justify it by saying it was my artistic intention to write a song for whoever asked for one, and for it to be inspired by whatever they ask for. Ideally I’d like the intention to get really stretched…if McDonalds asked for a £10 song, would I do it? Yeah, probably ‘cos it’s so perverse…the EDL? Gary Glitter? Obviously not, but it’d be interesting</p>\n<p><strong>CitR: Have you had a particular favourite in the project so far? Why?</strong></p>\n<p>JC: I really enjoyed the one called ‘A Girl From Miami’… Annette sent me a recording of an autoharp and I figured something out over that. Had to stretch myself a little on that and it felt good.<br />\n<strong><br />\nCitR: Is there any particular conclusion you’re hoping to draw from the project, or indeed hoping other people to draw?</strong></p>\n<p>JC: Not really…I mean I’ve intellectualized it myself, but really it’s just a fun thing to do.</p>\n<p>All the songs from <strong><em>Art Is Cheap </em></strong>can be found <a href=\"https://artischeap.tumblr.com/\" title=\"Art Is Cheap\">here</a>, and you can follow both <a href=\"https://twitter.com/#!/jackmazes\" title=\"Jack Twitter\">Jack</a> and <a href=\"https://twitter.com/#!/M_A_Z_E_S\" title=\"Mazes Twitter\">Mazes</a> on Twitter.</p>\n<p> </p>\n","slug":"10615-interview-jack-mazes-art-is-cheap","category":"editorials","date":1314646704000,"wpid":10615,"isSticky":false,"featured_image":{"width":165,"height":109,"src":"2011/08/mazes-165x109.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAUG/8QAHxAAAQMEAwEAAAAAAAAAAAAAAQIFEQADBAYhIkFh/8QAFQEBAQAAAAAAAAAAAAAAAAAAAQT/xAAgEQABAwIHAAAAAAAAAAAAAAABAAIDBSIEESFhkrHB/9oADAMBAAIRAxEAPwCFuj6161nZjTnsmLlWbRKExaSCgFIWFCZMwoCJjj7WCS/a0Ug3WAquR2PTk+mlKI6dh3i4HTd3hVMdSniNuXFp7C//2Q=="},"createdAt":1587293962005,"updatedAt":1588403549311,"author":"5e9b68b27a1236eccfeb1d3c","old_image":"2011/08/mazes-165x109.jpg","categories":["editorials","interviews","new","music","opinion"]}