{"id":"5e9c33fb9b6559241525e154","title":"Review: Stanley Odd – Oddio","content":"<p><img class=\"alignnone\" title=\"Stanley Odd\" src=\"https://files.</p><p>list.co.uk/images/2010/04/09/Stanley-Odd.jpg\" alt=\"\" width=\"618\" height=\"390\" />As if further proof was needed that the most memorable nights are unplanned and spontaneous, <em><strong>CitR </strong></em>have another eventful and entertaining night out in Dundee haunt<strong> Dukes Corne</strong>r. Arriving shortly after nine in the evening, the place is already bustling with eager gig goers, intent on making the most of a pleasant Friday night. Grabbing ourselves a drink, we took seats near the stage, and began checking out the nights performers, much to our disappointment, hip-hop artist <strong>Gorilla Tactic</strong>s had left the stage just minutes before we arrived, however we picked up a copy of their exciting new mixtape <em>That Ape Shit</em>. Headlining act of the evening were Scottish group <strong>Stanley Odd</strong>, who, to be perfectly honest, I had never heard of before, apart from glancing at their name on this years <strong>T in the Park</strong> lineup. A quick Google search showed up that they were self described as hip-hop/funk, as well as being signed to <strong>Circular Records</strong>, a label known for their backing of the best of unheard talent.</p>\n<p>Fifteen minutes later <strong>Stanley Odd </strong>took the mic, lead vocalist <strong>Solareye </strong>ricocheted carelessly around the stage, whilst female vocalist <strong>Veronika Electronik</strong>a balanced out the scales, standing reasonably motionless during the entire set. Creating a sound not too dissimilar from infamous Brooklyn based outfit <strong>Beastie Boys</strong>, the performance was wonderfully energetic, which combined with the slickly delivered, grime influenced songs, made for a spectacular and encouraging introduction to the band. <strong>Solareye</strong><strong>‘s</strong> elegant social commentary was delivered confidently, in his thick Scottish accent, showing that you don’t have to conform to stereotypes to be able to rap, whereas <strong>Veronika Electronika’s</strong> backing vocals provided catchy choruses and an interesting contrast to the lyrics. What made them so thrilling to watch was the delight that each band member clearly took in performing to the appreciative Dundee crowd, whether it be <strong>Rune Dawg’s</strong> jagged guitar riffs or <strong>B Dot’s </strong>sophisticated beats. Running through numerous songs from Monday’s debut release <em>Oddio</em>, including last years single <em>The Numbness </em>and most recent single<em> Think of a Number</em>. After the gig we spoke to <strong>Solareye</strong>, who informed us of some appealing rap music coming from Scotland, as well as tips on freestyle battle nights to check out in Glasgow. All in all, another thrilling night out at <strong>Dukes Corner</strong>, aided not only by the galvanised venue, but also the engaging music.</p>\n<p>Debut album <em>Oddio</em> from <strong>Stanley Odd</strong> is released today (31/05/10) in the UK on<strong> Circular Records</strong>, and is a telling testament to the state of UK hip hop. By that, I don’t mean the dreadful chart topping N-Dubz or Chipmunk, but more to the sensational music being created in the underground clubs and bedroom studios. Last years single <em>The Numbness</em> is a hit waiting to happen, with <strong>Solareyes</strong> intelligent, provoking story telling being a dominant strength in this song, as well as the album in its entirety. Meanwhile <em>Sun Dance </em>is a chilling ode to a former crush who was forced to turn to prostitution, and may well be one of the most emotionally hard hitting hip hop songs to come from the UK since <strong>Dry Your Eyes</strong>. Live the song really came into it’s own as well, with<strong> Solareye </strong>moulding and caressing every intricately picked word, backed by <strong>Veronika’s</strong> haunting vocals. Another standout track is the guitar driven <strong>Move Forward</strong>, which relies on a jagged riff to carry the lyrics of the frontman, reminiscing of childhood days gone by, as well as name dropping cult interests such as Star Wars and Wrestlemania; further comparisons to the infamous <strong>Beastie Boys</strong>. Whilst there will be those who may write off <strong>Stanley Odd</strong> as an unfortunate component to the machine that is current UK mainstream hip hop, however, give them a chance and you will undoubtably begin to experience their clever story telling lyrics, precise delivery and knack for finding a contagious chorus. Odd they may be, but see beyond their bizarre kookiness and there is an erratic, loveable side to them.</p>\n<p style=\"text-align: center;\"><a href=\"https://www.stanleyodd.com/\">Check out their Official Site</a></p>\n<p style=\"text-align: center;\"><a href=\"https://https://www.myspace.com/stanleyodd\">Check out their Myspace</a></p>\n","slug":"1065-review-stanley-odd-oddio","category":"music","date":1275243323000,"wpid":1065,"isSticky":false,"featured_image":{"width":618,"height":390,"src":"2011/06/stanley-odd.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAGAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAQI/8QAIhAAAQMEAAcAAAAAAAAAAAAAAQIDBAAFESEGEhMiMVGR/8QAFQEBAQAAAAAAAAAAAAAAAAAAAwT/xAAdEQACAgEFAAAAAAAAAAAAAAABAgADsREhIlHR/9oADAMBAAIRAxEAPwDPnDdrakX9iI4pSojranHAQM9oPj1sfDU0y2vIlvpZU10wtQTzDeM6zqlKOrk5B6GTLrUVaFYDfU4X2f/Z"},"createdAt":1587295227722,"updatedAt":1588403567139,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/06/stanley-odd.jpg","categories":["music"]}