{"id":"5e9c2f159b6559241525d923","artists":["5e9b68fe7a1236eccfeb2109"],"title":"Review: Hard-Fi – Killer Sounds","content":"<p>Back in 2005 my music tastes were somewhat different and in hindsight, depressingly limited.</p><p> I had a <strong>Keane</strong> t-shirt, my favourite album was <strong><em>Hot Fuss</em></strong> and I paid £35 to see<strong> Franz Ferdinand</strong>, <strong>Editors</strong> and <strong>The Rakes</strong>…. In the immortal words of<strong> Notorious B.I.G.</strong>;<em> ‘Things Done Changed’</em>. Alongside the plethora of indie bands that emerged around that period, was the rise of Surrey group<strong> Hard-Fi</strong>, who heralded the grittier, more downcast aspect of modern music. Song titles such as<em> Living For The Weekend</em>,<em> Cash Machine</em> and <em>Feltham Is Singing</em> <em>Out</em> were a pretty accurate representation of the ‘born and bred in the working class’ spirit that <strong>Hard-Fi</strong> aimed to embody.</p>\n<p>Six years on and much has changed. The youth are more downtrodden and disillusioned than ever, the gap between the classes is expanding rapidly and money is even scarcer to come by for many. So with new record <em><strong>Killer Sounds</strong></em>, have <strong>Hard-Fi</strong> matured and adapted to the times?</p>\n<p>Well, in short, the answer is no. First single <em>Good For Nothing</em> maintains their Oasis influenced gritpop spirit, fused with dance and soul inspirations. Not a horrendous song, until lead singer <strong>Richard Archer</strong> dejectedly snarls <em>‘Take a long hard look at yourself, you’re just a screw up like everyone else</em>‘. Ouch, thanks Richie.<a href=\"https://api.crackintheroad.com/uploads/2011/08/HardFiKillerSoundsLP600Mg180811.jpg\"><img class=\"alignleft size-archives wp-image-10678\" title=\"Killer Sounds\" src=\"https://api.crackintheroad.com/images/2011/08/HardFiKillerSoundsLP600Mg180811-350x350.jpg\" alt=\"\" width=\"350\" height=\"350\" /></a></p>\n<p>It’s never a good sign when a band announces their new record with the two tracks that make up the opening minutes of the release, yet <strong>Hard-Fi</strong> follow up <em>Good For Nothing</em> with recent single<em> Fire In The House</em>. As an anthemic track, there’s a catchy chorus and danceable rhythms, however it’s not likely to be played in clubs for years to come.</p>\n<p>If anything, this has been what<strong> Hard-Fi</strong> have been missing in their career. Other acts who broke through at a similar time to the Surrey four piece, such as <strong>The Killers</strong>, <strong>Franz Ferdinand</strong> and<strong> Arctic Monkeys</strong>, are still a staple diet of any UK indie club; <strong>Hard-Fi</strong>, not so much. <em><strong>Killer Sounds</strong></em> isn’t completely defunct as a release, there’s some intriguing and worthwhile rhythm sections in particular, like the tribal beat on <em>Feels Good</em> and the funky, piano led <em>Stay Alive</em>. Where debut album <em><strong>Stars of CCTV</strong></em> connected with it’s target audience at the time of release, <strong><em>Killer Sounds</em></strong> says little of any value, whether it be the personal issues of the band members, or a reflection upon modern day society. While writing this review, I began to take pity upon<strong> Hard-Fi</strong> at the fact that out of the crop of British bands who found their feet in the mid 00’s, they are quite possibly the least memorable in the minds of fans and music critics. However, with <em><strong>Killer Sounds</strong></em> they fail to stamp any reputable authority on their own musical creations, portraying exactly why they are so unadorned.</p>\n","slug":"10677-review-hard-fi-killer-sounds","category":"album-reviews","date":1314469620000,"wpid":10677,"isSticky":false,"featured_image":{"width":165,"height":110,"src":"2011/08/hardfi+3070-165x110.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAYH/8QAIRAAAgICAgEFAAAAAAAAAAAAAQMCEQAEBTEGBxQhQWH/xAAVAQEBAAAAAAAAAAAAAAAAAAACA//EABoRAAIDAQEAAAAAAAAAAAAAAAECAAMRISL/2gAMAwEAAhEDEQA/AILi/Vvyjh5P9pvCSIGa1JcJM7bZsk318XfQrNM0C/b0dfZbpRDHLiyQExQJFn7/AHGMjVWqL5GbEzEns//Z"},"createdAt":1587293973376,"updatedAt":1588403549439,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/08/hardfi+3070-165x110.jpg","categories":["album-reviews","music"]}