{"id":"5e9c2eea9b6559241525d8e9","artists":["5e9b690a7a1236eccfeb21f3","5e9b692b7a1236eccfeb2398","5e9b693e7a1236eccfeb24ed","5e9b69577a1236eccfeb2675","5e9b69637a1236eccfeb2753"],"title":"Preview: Bestival 2011","content":"<p>With the days getting shorter, and the nights getting colder, September is upon us, and it is getting very close to the end of festival season, with only student Mecca, <strong>Bestival</strong>, left for us to hide and forget ourselves for a few days.</p><p>  In a year where the whole festival approach was blown apart and we saw cancellations, floodings and Reading offering free tickets on the very morning of their first day, Bestival has pulled a genuinely unrivalled line-up out the bag, boasting exclusive appearances from <strong>The Cure</strong> and<strong> Bjork</strong>, alongside the terminally overplayed<strong> Pendulum</strong>.  Oh well, you can always see <strong>Friendly Fires</strong> at the same time.</p>\n<p>So apart from the obvious draws like<strong> Primal Scream</strong> and <strong>Brian Wilson</strong>, who should you be looking out for, away from the bright lights and brighter costumes?</p>\n<p>1) <strong>Keston Cobblers’ Club</strong></p>\n<p><iframe width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/cYpN6GVjWe8?feature=oembed\" frameborder=\"0\" allowfullscreen></iframe></p>\n<p>My first tip are the criminally underrated <strong>Keston Cobblers’ Club</strong>, hailing from Bromley, Kent and crafting the acoustic magic that Noah and the Whale can only wet dream over.  Perfect for a post-<strong>Health</strong> hangover, this is the sort of hidden gem that you’ll stumble across at a festival, all dazed and confused, and will rewrite your weekend.  I challenge anyone not to singalong to ‘You-Go’, and whilst you may not be heading to the Isle of Wight on the hunt for casual acoustica, you’ll be swimming back to Portsmouth on Monday to listen again, and again, and again.</p>\n<p>2) <strong>Yuck</strong></p>\n<p><iframe width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/Kz7vyrFhFE8?feature=oembed\" frameborder=\"0\" allowfullscreen></iframe></p>\n<p>Next up are <strong>Yuck </strong>who are genuinely one of the bands I’m most excited to catch over the weekend, after witnessing them blow the roof of the John Peel Tent at Glastonbury back in June.  Introduced to the scene in a whirlwind of hype and hearsay, the Cajun Dance Party alumni have stuck to their Dinosaur Jr. guns in delivering fuzzy, shoegaze hit after hit, whilst remaining both accessible and original.  This represents the end of a huge summer for the band, so get down to the front early for the most demure fun you’ll have all weekend.</p>\n<p>3)<strong>SBTRKT</strong><br />\n<iframe width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/ZdUINbi4wSY?feature=oembed\" frameborder=\"0\" allowfullscreen></iframe></p>\n<p>The elusive Aaron Jerome, better known as <strong>SBTRKT </strong>is our next shout, but be prepared for an incredibly packed tent as the London DJ builds on his underground cult reputation to put on a show which will be as sweaty and busy as it will be life-affirming.  Finally an artist under the the extensively vague dubstep tag that doesn’t merely sound like indigestion; there is an explosive minimalism to SBTRKT that builds into a tremendous collage that remains danceable and rich without drifting into experiment.</p>\n<p>4) <strong>Toots and the Maytals</strong></p>\n<p>https://www.youtube.com/watch?v=UhjBiZSfM08</p>\n<p>I think that this song renders any preview redundant.  <strong>Toots and the Maytals </strong>will be so brilliant, I might do a little wee.</p>\n<p>5) <strong>Niki and the Dove</strong></p>\n<p><iframe width=\"500\" height=\"375\" src=\"https://www.youtube.com/embed/BTHPO9uQonk?feature=oembed\" frameborder=\"0\" allowfullscreen></iframe></p>\n<p>Coming across as a lush mix of electro and some sort of implausible euro-trash, <strong>Niki and the Dove </strong>create songs to soundtrack moments, both equally epic and intimate in the immediate disparity of the vocal and hollow electronica of the synths.  Another incredibly hyped act, this is a chance to finally assess a band who look the natural heir to Bjork’s extravagant crown.</p>\n<p>There is such a wealth of talent on this year’s line-up, it is near impossible to narrow favourites down to five acts, so also keep an eye out for <strong>Kitty, Daisy and Lewis, Health, Tom Vek, The Village People </strong>(really), <strong>Tribes, Secret Sisters, Mount Kimbie, Ghostpoet </strong>and about a million and one others.</p>\n<p> </p>\n<p> </p>\n","slug":"10694-preview-bestival-2011","category":"festivals","date":1315147439000,"wpid":10694,"isSticky":false,"featured_image":{"width":3504,"height":2336,"src":"2011/09/bestival.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAGAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAAAAf/xAAgEAABAgYDAQAAAAAAAAAAAAACAQMABAUGESEUMYGh/8QAFAEBAAAAAAAAAAAAAAAAAAAABP/EABgRAAMBAQAAAAAAAAAAAAAAAAABAhEh/9oADAMBAAIRAxEAPwCW2Xc1IpVqOyb9ClZt57QvutopDnXefYnzvCN0yFsxQlVUTCa+whBIp6xtLiP/2Q=="},"createdAt":1587293930061,"updatedAt":1588403548997,"author":"5e9b68b27a1236eccfeb1d4c","old_image":"2011/09/bestival.jpg","categories":["festivals","music"]}