{"id":"5e9c2f059b6559241525d90b","title":"Film review: La Piel Que Habito (The Skin I Live In)","content":"<p>Director: Pedro Almodóvar</p>\n<p>Length: 117 minutes</p>\n<p>Country: Spain</p>\n<p>Language: Spanish</p>\n<p>Few aspects of sexuality can still cause as much controversy and be as difficult for so many people to comprehend as transgender surgery.</p><p> Pedro Almodóvar’s La Piel Que Habito explores medical ethics, transgender sexuality and parental relationships without pretension, but with grace and dignity.</p>\n<p>Starting in media res, Antonia Banderas portrays a brilliant surgeon struggling to come to terms with the death of his wife, and pursuing groundbreaking research into synthetic skin. The sinister nature of his research and motivation unfolds as the film reveals more of his past, before coming to a taut and emotional climax. The juxtaposition of Spanish sun and carnivals with surgical procedure and dark content lends a certain surrealism to the film, while smatterings of humour provide occasional relief.</p>\n<p>The nature of the plot does not allow for much discussion without spoilers, but La Piel Que Habito is simply unmissable, a beautifully crafted masterpiece that subtly invokes empathy and leaves you with plenty to mull over. A gem of European cinema.</p>\n","slug":"10738-film-review-la-piel-que-habito-the-skin-i-live-in","category":"arts","date":1314740047000,"wpid":10738,"isSticky":false,"featured_image":{"width":901,"height":600,"src":"2011/08/theskinilivein.png","placeholder":"data:image/jpeg;base64, iVBORw0KGgoAAAANSUhEUgAAAAoAAAAHCAIAAAC+zks0AAAACXBIWXMAAA7DAAAOwwHHb6hkAAAA5ElEQVR4nAHZACb/ADhCSCEqLwICAiMoKjhDSERGSDY8RTpBSTlASDI5QQA7R04gGhd8YExtUkBwY1fdu5yOhXw3P0k8Qko3PkYAQU5USDs0x5R0kWtUjX5z5NbIyMC1QEhPOUJJOUFIAE1YWkhLSaN1WpBkTYRwZdS+q7ywoj9KUDhDSjhCSgBLVlpOTlJoTUFGLCNkWlLewKzCtq9KT1c2QEk4P0kAQUVHjH5+k4SBWUlCdltI2sGlsZaFYl5jM0BLOUFLADM1Ol9SUMipjMmkhcykhujEo8unibOQdXNtaDE9SR8cUhw0g+0OAAAAAElFTkSuQmCC"},"createdAt":1587293957716,"updatedAt":1588403549232,"author":"5e9b68b27a1236eccfeb1d35","old_image":"2011/08/theskinilivein.png","categories":["arts"]}