{"id":"5e9c2efa9b6559241525d900","artists":["5e9b691e7a1236eccfeb22df"],"title":"Review: Male Bonding – Endless Now","content":"<p>I’ve made no secret on CitR about <a title=\"I really don't much like lo-fi, y'know\" href=\"https://admin.</p><p>crackintheroad.com/music/10615-interview-jack-mazes-art-is-cheap/\">my feelings toward the recent lo-fi boom</a>. And as such, <strong>Male Bonding </strong>frontman <strong>John Arthur Webb</strong>‘s proclamation on <a title=\"Male Bonding don't want to do lo-fi either.\" href=\"https://pitchfork.com/news/41842-male-bonding-talk-bigger-sounding-new-lp/\">Pitchfork</a> that “It would suck to just fucking knock out lo-fi albums once a year” really endeared the Dalston trio to me. To that end, and indeed heightening my expectations, they’ve teamed up with producer <strong>John Agnello</strong>, who also manned the desk for the latest <strong>Cymbals Eat Guitars </strong>record (another sophomore effort, released on the same day as this one), and <a title=\"Cymbals Eat Guitars - Lenses Alien\" href=\"https://api.crackintheroad.com/music/10613-review-cymbals-eat-guitars-lenses-alien/\">I reckon he did a bloody good job</a>. Not to mention the fact that the man’s been involved in the production of some of my favourite artists of all time – <strong>Dinosaur Jr., The Lemonheads, Screaming Trees, The Hold Steady </strong>etc etc etc.</p>\n<p><strong>Agnello</strong>‘s hand in <em><strong>Endless Now</strong></em>‘s overall sound is apparent from approximately nine seconds into opener <em>Tame The Sun</em>. Compared to <em>Year’s Not Long</em>, which had the task of kickstarting debut <em><strong>Nothing Hurts</strong></em>, the band sound huge, which can be a difficult task for a three piece. <strong>Webb</strong>‘s vocals are still airy and detached in that <strong>My Bloody Valentine</strong> kinda way, but they certainly sound like they’re <em>supposed </em>to be like that, rather than like he’s yelling from somewhere from across the room, and fighting to be heard.</p>\n<p>To be honest, that’s kind of all I have to say about <strong><em>Endless Now</em></strong>. Anyone familiar with <strong>Male Bonding</strong> will already know exactly what this record sounds like. <em>Bones </em>toys with the blueprint a little, stretching itself out over six minutes, and <em>The Saddle</em>, towards the end of the album, provides an effective and heartbreaking diversion, a song that’s as miserable in sound as it is in content. But for the most part, it’s the same clanging, fuzzy guitars, breakneck drums, and the odd bassline that wouldn’t sound out of place on a <strong>Blink-182</strong> record. Like I say, <strong>Male Bonding’s</strong> decision to leave lo-fi behind has really worked wonders for them, in terms of product as well as ideology, but this decision is probably the most striking thing about their sophomore effort.</p>\n<p><em><strong>Endless Now</strong></em>, then, is essentially <em><strong>Nothing Hurts</strong></em> v2.0. It sounds bigger, sure, but there’s nothing here that will surprise, or by that token offend, an established <strong>Male Bonding</strong> fan, provided that they don’t take issue with the band’s decision to make a record that doesn’t sound a bit like it was recorded in a garage. Anyone looking for something to really get their teeth into had probably best look elsewhere. But perhaps by dint of its title, <em><strong>Endless Now</strong></em> absolves itself of having to be too substantial. It’s packed to bursting with eminently hummable melodies, and in its grafting of the current vogue for Creation Records onto a joyous pop-punk torso, it’s a frontrunner, comprising of twelve thrashy, tuneful tales of woe that don’t outstay their welcome and as such rarely cease to be enjoyable.</p>\n","slug":"10809-review-male-bonding-endless-now","category":"album-reviews","date":1314967328000,"wpid":10809,"isSticky":false,"featured_image":null,"createdAt":1587293946239,"updatedAt":1588441788504,"author":"5e9b68b27a1236eccfeb1d3c","old_image":"generated/1be6e5795b4eddb2ce121bfd92cc6204f4f155ec.jpg","categories":["album-reviews","music"]}