{"id":"5e9c2ef89b6559241525d8ff","artists":["5e9b68e07a1236eccfeb1f2c"],"title":"Introducing: Crawdad","content":"<p><strong>Michael Crawford</strong> otherwise known as <strong>Crawdad</strong>, a hip hop enthusiast from California may not necessarily be the complete article yet, however recent free download release <em><strong>The Art Of Making Flowetry</strong></em> certainly demonstrates a vast wedge of potential.</p><p> Mixing modern production methods with<strong> Doomtree</strong> influenced verses, the EP is slick and fantastically mixed; quite an achievement for an artist without substantial label funding. Like <strong>P.O.S.</strong>, the instrumentation appears to be fairly heavily <strong>Fugazi</strong> inspired, raw and perfectly synched in to the languidly delivered vocals.</p>\n<p><iframe style=\"position: relative; display: block; width: 400px; height: 100px;\" src=\"https://bandcamp.com/EmbeddedPlayer/v=2/track=4017516554/size=venti/bgcol=FFFFFF/linkcol=4285BB/\" frameborder=\"0\" width=\"400\" height=\"100\"></iframe></p>\n<p>Whilst the title <em><strong>The Art Of Making Flowetry</strong></em> may not be entirely convincing, the tracks speak for themselves, offering up a fresh and invigorating sound. EP highlight <em>Broken Circuits</em> wouldn’t be out of place on a <strong>Doomtree</strong> sampler, complete with charismatic verses and a enviable chorus. There’s an air of intelligence found in the lyrics as well, that are at times, insightful and thought-provoking, maintaining an emotional integrity and self-realism such as <em>‘the fact is that I put nothing above you, it hurts my heart at times to say I love you’</em> on <em>Riddle My Mind</em>. The <strong>De La Sou</strong>l-esque <em>They Don’t Know</em> mixes soulful vibes with the harsh vocal sections that <strong>Crawdad</strong> stamps throughout the release. As mentioned earlier, <strong>Crawdad</strong> is far from the finished product, but with music driven by such a passion and wealth of knowledge, <em><strong>The Art Of Making Flowetry</strong></em> gives numerous reasons to be truly excited about <strong>Michael Crawford’s</strong> work.</p>\n<p>Check out two cuts from the EP on this page, and head over to <strong>Crawdad’s</strong> <a href=\"https://crawdad.bandcamp.com/\" target=\"_blank\">bandcamp</a> to download the entire release for free.</p>\n<p><iframe style=\"position: relative; display: block; width: 400px; height: 100px;\" src=\"https://bandcamp.com/EmbeddedPlayer/v=2/track=3643022390/size=venti/bgcol=FFFFFF/linkcol=4285BB/\" frameborder=\"0\" width=\"400\" height=\"100\"></iframe></p>\n","slug":"10823-introducing-crawdad","category":"introducing","date":1314973896000,"wpid":10823,"isSticky":false,"featured_image":null,"createdAt":1587293944658,"updatedAt":1588441788479,"author":"5e9b68b27a1236eccfeb1d27","old_image":"generated/ab67616d0000b273648f63f30790161b9891d06b.jpg","categories":["introducing","mpfree","music"]}