{"id":"5e9c2ee89b6559241525d8e6","artists":["5e9b69377a1236eccfeb24a8"],"title":"Review: Richmond Fontaine – The High Country","content":"<p>Everyone has a favourite <strong>Richmond Fontaine</strong> album.</p><p> Some prefer the band’s early, punk-inflected output, evident on records like <strong><em>Safety</em></strong>. For others, the devastating minimalism of <strong><em>The Fitzgerald</em></strong> is their favourite facet of the group. Yet others would rather listen to the stately alt-country of <strong><em>Post to Wire </em></strong>or <strong><em>Thirteen Cities</em></strong>. For me, 2009’s <strong><em>We Used To Think The Freeway Sounded Like A River </em></strong>holds the top spot. Where that release arguably saw <strong>Fontaine </strong>at their most consistent and accessible, <strong><em><strong><em>The High Country </em></strong></em></strong>takes <em><strong>Post to Wire</strong></em>‘s <em>Postcard</em> segments to their next logical extreme, telling over its seventeen tracks a series of unhappy and occasionally horrific events concerning frontman and novelist <strong>Willy Vlautin</strong>‘s typically unfortunate characters.</p>\n<p>As a consequence, <strong><em>The High Country </em></strong>is never easy listening, or as enjoyable as a record like <strong><em>Freeway </em></strong>could be – it’s a work as difficult in its presentation as in its plotline. Musically, the record<strong><em> </em></strong>veers between those desperately lonely <em><strong>Fitzgerald</strong></em> acoustics, and the minor-key, grizzled country rock of songs like <strong><em>Post To Wire</em></strong>‘s <em>Hallway</em> or <strong><em>Freeway</em></strong>‘s <em>43</em>, and contains no less than six instrumental mood pieces. The chirpier Mariachi and lounge influences present on <strong>Fontaine</strong>‘s two previous releases have been jettisoned, tracing the character shift from unhappy but urbane citydwellers to speed-crazed, isolated woodsmen and women. Where before there was often hope and redemption for many of <strong>Vlautin</strong>‘s characters, and without wanting to give away the record’s conclusion, here there appears to be none. The sense of claustrophobia created by the music and forest-bound storyline is intense and insurmountable at times, making <strong><em>The High Country </em></strong>in its entirety a genuinely painful experience.</p>\n<p>That said, <strong>Richmond Fontaine</strong> as musicians are as skilful and considered on <strong><em>The High Country </em></strong>as they’ve ever been. More than ever before, the band have had to turn their hands to soundtracking a storyline so distinct, that playing regular songs as a regular unit simply wouldn’t create the correct atmosphere for the record. Drummer <strong>Sean Oldham</strong> in particular proves himself equally adept at shuffling minimalism on tracks like <em>The Mechanic’s Life</em>, where his scratchy beat provides the perfect backdrop for <strong>Dan Eccles</strong>‘ characteristic ringing trem, and foreboding pounding on the nervy howl of <em>Lost in the Trees</em>. Whilst <strong>Vlautin </strong>remains the band’s most obvious figurehead in terms of vision, the other members of <strong>Richmond Fontaine </strong>have once again proved themselves humble and adept at the kind of restrained, subtle musicianship that a record like <em><strong>The High Country </strong></em>requires. Actual parts aside, the record is also arranged beautifully, with motifs appearing and being reprised, and even a little nod to past efforts in the radio broadcast at the start of <em>Driving Back to the Chainsaw Sea</em>, all adding to the album’s cinematic ambience. Likewise, those instrumentals in this instance are indispensable to the record’s flow, where they would break the momentum of a more traditional set of songs.</p>\n<p>Intellectualising the kind of desperately tragic, salt of the earth musicianship and lyricism present on albums like this one is a dangerous endeavour, but being a warm, well-fed graduate and not a homicidal logger, I’ll take a shot at it all the same. My mentioning the many and varied aspects of <strong>Richmond Fontaine</strong>‘s sound by way of an introduction wasn’t purely an exercise in self-indulgence and nostalgia – it’s a perfect example of the band’s constant evolution, which can be a difficult in a genre with as much deep-rooted tradition as country. There’s some sort of connection between <strong><em>The High Country</em></strong>‘s title, and the nature of the album itself. Over the course of their existence, <strong>Richmond Fontaine </strong>seem to have become practitioners of exactly what that moniker suggests – high country, which looks toward the sky from down in the dust, and this has never been more the case than on this release, if only in terms of the band’s vision, rather than the characters’. Whether this application of academia to <strong><em>The High Country </em></strong>detracts from its pronounced humanity, and indeed that of <strong>Richmond Fontaine</strong> as a band, I’m still not sure. But that said, it seems to ring true.</p>\n<p>By dint of its content and concept, <strong><em>The High Country</em></strong> is a particularly harrowing listen, even for the most scar-hearted <strong>Fontaine </strong>devotee, and especially for fans of the band’s more hopeful or song-based records. But as far as <strong><em>The High Country</em></strong>‘s effect goes, the band have written and play the perfect set of musical vignettes for the album’s heartbreaking storyline. Despite some spoken word parts that veer a little too far into the realms of the corny, made-for-T.V. movie (which is arguably their intended effect anyway – those are, after all, the kind of movies you’d expect the record’s characters to watch), there is little chance of coming away from <strong><em>The High Country </em></strong>unscathed, whether you find yourself enjoying its spare musicianship and unconventional format or not. As a piece of genuinely moving art, if not just a collection of songs, <em><strong>The High Country </strong></em>is an unarguable triumph.</p>\n","slug":"10908-review-richmond-fontaine-the-high-country","category":"album-reviews","date":1315226245000,"wpid":10908,"isSticky":false,"featured_image":{"width":165,"height":165,"src":"2011/09/richmond-fontaine-the-high-country-165x165.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFwAAAwEAAAAAAAAAAAAAAAAAAQIECP/EACUQAAIBAQUJAAAAAAAAAAAAAAECAAYDBBJBkREXITEyUmFk0f/EABUBAQEAAAAAAAAAAAAAAAAAAAED/8QAGBEAAwEBAAAAAAAAAAAAAAAAAAECUWH/2gAMAwEAAhEDEQA/AKrvXlPoQbe8NZqeZxtwzyj7zKa9g+S5+zMbu23qOsGJu46xanCKnp//2Q=="},"createdAt":1587293928295,"updatedAt":1588403548972,"author":"5e9b68b27a1236eccfeb1d3c","old_image":"2011/09/richmond-fontaine-the-high-country-165x165.jpg","categories":["album-reviews","music"]}