{"id":"5e9c33f99b6559241525e151","title":"Review: Summer Camp/Slow Club","content":"<p>Friday 28th May saw <strong>Slow Club</strong>, supported by <strong>Summer Camp</strong>, grace the stage at the recently opened <strong>FAC251 </strong>club<strong> </strong>in Manchester.</p><p> For those of you who aren’t aware of the history of <strong>FAC251</strong>, it is contained within the building that once housed the infamous Mancunian record label <strong>Factory Records</strong>. A project led by <strong>Peter Hook</strong> and <strong>Ben Kelly</strong> saw the building redeveloped and transformed into a stylish club that now hosts regular club nights and occasional live gigs. Therefore with such a history behind <strong>FAC251</strong>, one could have expected <strong>Slow Club </strong>and <strong>Summer Camp</strong> to show some sign of nerves performing to what turned out to be a packed audience. However even if these nerves were ever felt, they were definitely not shown in a gig with two fantastically performed sets.</p>\n<p>The gig began with <strong>Summer Camp </strong>emerging from the audience and, with an unassuming and simple introduction, they began their set. Unfortunately due to the horrific and untimely death of my pen (there was ink everywhere), I wasn’t able to record the set lists of both <strong>Summer Camp</strong> and <strong>Slow Club</strong>, so I will unfortunately have to talk in generalities. Before going to the gig I had heard a significant amount of <strong>Summer Camp</strong>‘s music, especially after interviewing them a little while back (see link below). Their dreamy synth-pop immediately caught my attention and, most importantly, held it. The vocals of <strong>Elizabeth Sankey </strong>and <strong>Jeremy Warmsley </strong>are woven with a peaceful passion, while also acting as the driving force behind every track. However I wondered whether this sound, which had caused me to leave these tracks on repeat for days, could be transferred to a live setting without the dreamy synths being subjected to the harsh awakening of a noisy yet cavernous room.</p>\n<p>Any doubts I had were immediately dispelled. Now despite the pen fiasco, I can tell you that the set opened with <strong>Ghost Train</strong>. I was immediately taken in by the track the same way I was when I first heard it on their Myspace, especially as <strong>Sankey</strong>‘s vocals fortunately did not lose any of their serene charm in a live setting. However while I was bordering on entering a state of musically induced hypnosis, I took the time to judge the reaction of the rest of the audience. Underwhelmed seemed to be the unfortunate consensus. This was somewhat reflected in <strong>Summer Camp</strong>‘s performance, with each track simply rolled into another without pause or interlude, knowing most of the audience had bought their tickets in anticipation of <strong>Slow Club</strong>. However this subdued set was endearing towards <strong>Summer Camp</strong>, as there was not a trace of egotistical pomp in their whole performance. Instead, as each track was played, there was a slight but definite feeling of a gaining interest and enjoyment in the audience, all of whom were experiencing, to varying degrees, the feeling of pleasant hypnosis that I swiftly returned to.</p>\n<p>Obviously new to performing as a live band, <strong>Summer Camp </strong>presented themselves as professional yet fun, and refined yet with a raw originality. They played a great deal of their small yet growing catalogue, with <strong>Round the Moon </strong>and <strong>Was It Worth It? </strong>particular highlights. I was even fortunate enough to have <strong>Elizabeth </strong>sing straight at me, which was only topped by her unnecessary yet amusing apology afterwards!</p>\n<p>Startlingly, my <strong>Summer Camp </strong>hypnosis was disrupted by the beginning of <strong>Slow Club</strong>‘s set. Without warning, <strong>Slow Club</strong> played their first track without microphones or amps in the middle of the crowd. This, unsurprisingly, drew the audience’s attention immediately and set the tone for the rest of a set that appeared to rid itself of the ‘fourth wall’. Each track appeared tailored to the audience, with the slow and the sombre balanced finely with the upbeat and enthusiastic. <strong>Slow Club</strong>‘s greater experience of performing live was seen immediately with their more comfortable demeanor on stage, and each track performed was  undoubtedly classic <strong>Slow Club</strong>. However the highlight of their set, barring the rather gentile stage invader, was the introduction of members of <strong>Summer Camp</strong> for the final few songs. Again due to the pen fiasco I cannot report to you the titles of these tracks, however I can assure you it was the perfect climax to a set filled with a reverberating energy.</p>\n<p>On rereading I have realised I’ve attributed a disproportionate amount of reporting to <strong>Summer Camp</strong>. This could be due to the scary possibility that the hypnosis I experienced was in fact real, and that, through music, <strong>Summer Camp </strong>had already embedded in my mind what I would write. However I think the more likely, and sadly less imaginative, reason is that many of you will have already heard <strong>Slow Club</strong> and no doubt experienced their fantastic live sets many times. Therefore I think it far wiser to tell you that <strong>Summer Camp</strong> are a new and exciting musical entity, and they proved this at <strong>FAC251 </strong>on Friday 28th May.</p>\n<p><a href=\"https://www.myspace.com/summercampmusic\" target=\"_blank\">Summer Camp Myspace</a><br />\n<a href=\"www.myspace.com/slowclub\" target=\"_blank\">Slow Club Myspace</a><br />\n<a href=\"https://api.crackintheroad.com/uncategorized/699-5-minutes-with-summer-camp\">Summer Camp Interview</a></p>\n<p><iframe src=\"https://www.facebook.com/plugins/likebox.php?id=114090381951328&width=292&connections=10&stream=false&header=false&height=255\" scrolling=\"no\" frameborder=\"0\" style=\"border:none; overflow:hidden; width:292px; height:255px;\" allowTransparency=\"true\"></iframe></p>\n","slug":"1100-review-summer-campslow-club","category":"music","date":1275407718000,"wpid":1100,"isSticky":false,"featured_image":{"width":600,"height":419,"src":"2010/06/slow-club.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAYH/8QAIBAAAQQCAQUAAAAAAAAAAAAAAQACAwQFESEGEjFBUf/EABUBAQEAAAAAAAAAAAAAAAAAAAAE/8QAGxEAAgEFAAAAAAAAAAAAAAAAAAECAxESIlH/2gAMAwEAAhEDEQA/AJTJOr9PUKksVd0lS1jAx9dkhGrBA3Lo8eQBx9JWZm1kAT3WZC72RK5EUDbg7IV5bY8P/9k="},"createdAt":1587295225875,"updatedAt":1588403567115,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2010/06/slow-club.jpg","categories":["music","reviews"]}