{"id":"5e9c33f49b6559241525e147","title":"Betelgeuse (Or how I learnt to care about supernovas and love science)","content":"<p><a href=\"https://admin.</p><p>crackintheroad.com/uploads/2010/06/ic434large_horsehead_nebula.jpg\"><img class=\"alignnone size-full wp-image-1104\" title=\"horsehead nebula\" src=\"https://api.crackintheroad.com/wp-content/uploads/2010/06/ic434large_horsehead_nebula.jpg\" alt=\"Orion, Horsehead Nebula\" width=\"900\" height=\"595\" srcset=\"https://api.crackintheroad.com/images/2010/06/ic434large_horsehead_nebula.jpg 1500w, https://api.crackintheroad.com/images/2010/06/ic434large_horsehead_nebula-300x198.jpg 300w, https://api.crackintheroad.com/images/2010/06/ic434large_horsehead_nebula-1024x677.jpg 1024w, https://api.crackintheroad.com/images/2010/06/ic434large_horsehead_nebula-165x109.jpg 165w, https://api.crackintheroad.com/images/2010/06/ic434large_horsehead_nebula-950x628.jpg 950w\" sizes=\"(max-width: 900px) 100vw, 900px\" /></a></p>\n<p>Space is boring at the best of times. Yes it’s pretty, but so is the Mezquita at Cordoba, and you can enjoy the entirety of that without breaking your brain with distances, measurements and concepts that include everything that ever will and has been, of which even infinity is one of the easiest to grasp. At the same time, though, there’s a degree of cognitive dissonance at work here as it <em>is </em>pretty damn important and interesting at the same time, just only when considered at the right time (old high school lectures about the solar system in which half the class can’t even grasp that light has speed being a good example of when it can appear boring). Consider this fact: the milky way, our galaxy no less, being composed of 400 billion stars and also only one of billions of other galaxies<strong> </strong>in the <em>visible universe</em><strong>, </strong>is crashing. Then consider that even this is of no real importance to us as individuals, occurring roughly 3 billion years in the future, 2 billion after the Sun turns us in to the planetary equivalent of Paul Gasgoine’s brain, and even if we somehow avoid that, our solar system being flung billions of light years out of the galaxy, as may possibly happen, won’t even have any real perceptible effect to the goings on in our own area. So it would take something pretty damn special to affect us right?</p>\n<p>Betelgeuse is that red star in Orion that the aforementioned high school science lectures taught you about, being the ninth brightest star in the night sky and clearly visible to even the naked eye, though something as simple as a decent pair of binoculars will give you more detail if that’s yr thing. This is mostly down to its size, being one of the largest in the known universe and stands at a staggering 500 times the size of the Sun. Casual facts that stand as the equivalent of the name dropping the self-promoting DJ asshole at every party may try and discuss to other revellers aside, Betelgeuse is old. Old enough to be dying.</p>\n<p>Now, you might know that stars die, you might not, depending on what sort of a child you were. Me? I once got OCD over putting the glow in the dark stars that stuck to my ceiling in to accurate constellations. In the past 17 years, Betelgeuse has shrunk 15% as a result of an endothermic build up of iron reducing the outward pressure in its core that maintains its gravitational stability. Nothing that surprising there, except astronomers at Mauna Kea, a large complex of observatories in Hawaii, have recently gone on record as saying Betelguese is no longer the round, disc shape that characterised its appearance from Earth, rather it has begun to become elliptic, indicating that the gravitational collapse is causing it to deform. In other words, Betelgeuse is collapsing at such a rate that the star itself is becoming unstable, like kicking a really shit football. As a result, there’s increasing amounts of dicussion amongst said astronomers that a Betelgeuse supernova isn’t something that’s going to happen in hundreds to thousands of years (which is still not that long in star lifetimes) but in the coming <em>weeks to months, </em>years at best. Apocalyptic myths aside, it is now expected to be incredibly likely before 2012, but in our lifetimes if the most long term estimate is correct. What will it do? Well the last good supernova that was seen on Earth was in 1054 awnd as bright enough to be seen in daylight for 23 days and in the night sky for <em>653 days.</em></p>\n<p><em> </em>Okay, so something pretty nice looking will be in the sky, that’s not the life altering event I was promised at the start, you may be thinking. Now consider that this resulted in the night time brightness of a full moon when the moon was obscured. Then also that this was ten times the distance away that Betelgeuse is and is believed to have been far smaller in size and intensity. In fact, it is  expected that Betelgeuse will, at the very least, be twice as bright as a full moon, with the upper estimates placing it closer to a second sun in brightness- imagine the sort of ‘bright darkness’ you see at 5am on a summer day and you’re probably close. Even bigger, though, is the fact that for those areas of the world where it is visible during the daytime, it could be like having <em>two suns.</em> So farmers are going to be pissed off.</p>\n<p>So to recap for those of you who use Spark Notes over classic literature, the two reasons why an irreverent individual like yourself should probably care:</p>\n<p>1) Supernovas are bright. The last truely visible supernova was in 1054 and visible <em>night and day</em>. In the day it lasted noticeably for three weeks, at night for <em>two years. </em>It’ll likely be two to three times brighter than a full moon is on a clear night on a <em>cloudy night. </em>For two years.</p>\n<p>2) We may be out of the immediate range of damage from the emitted radiation, but scientists believe some chromosomal damage may be experienced by the vast majority of the earth. It might not cause any noticeable harm, but nor does wireless internet, and you can bet there are enough people right now claiming some sort of injury from that.</p>\n<p style=\"text-align: center;\">* * * * *</p>\n<p style=\"text-align: center;\"><strong>Writer’s soundtrack:</strong> St Vincent – Apocalypse Song</p>\n<p style=\"text-align: center;\">httpv://www.youtube.com/watch?v=68rXwBtNsy8</p>\n","slug":"1102-betelgeuse-or-how-i-learnt-to-care-about-supernovas-and-love-science","category":"life","date":1275470564000,"wpid":1102,"isSticky":false,"featured_image":{"width":1500,"height":992,"src":"2010/06/ic434large_horsehead_nebula.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAQH/8QAIBAAAgICAAcAAAAAAAAAAAAAAQIDBAAhBRESEzFRgf/EABUBAQEAAAAAAAAAAAAAAAAAAAEE/8QAGREBAAIDAAAAAAAAAAAAAAAAAQACA0FR/9oADAMBAAIRAxEAPwDL6U9AcPjW1TlnuOvTLK7gjWl5fBkHZddIxVBoKD4HrGMF3KctRCvJ/9k="},"createdAt":1587295220964,"updatedAt":1588403567037,"author":"5e9b68b27a1236eccfeb1d0b","old_image":"2010/06/ic434large_horsehead_nebula.jpg","categories":["life"]}