{"id":"5e9c33f89b6559241525e150","title":"Review & 5 Minutes With: Anais Mitchell","content":"<p><em>A folk opera,</em> I hear you say, <em>where are the denim shirts, straw hats and abrasive  guitars? </em>Well, to be frank, there’s more than enough copycats artists around producing the same over-hyped, under-thought drivel to quench that thirst for the moment.</p><p> So with a swig so instantly and joyfully refreshing, let me introduce you to <em>Hadestown</em>, the heart-wrenching, magnificent folk opera from Vermont based singer songwriter<strong> Anais Mitchell</strong>. Whilst seemingly opting for a concept album, you may think of it as hazardous and treacherous path to walk, throw into the mix that the story she is choosing to tell is the radiant Greek myth of <strong>Orpheus</strong>, and you know that only a hardened professional and immensely talent performer would be able to pull it off. And not only has she done that, but also in sensational style.</p>\n<p>From the opening notes of <em>Wedding Song</em>, the sound is encapsulating and enchanting, really bringing the listener in to the vulnerability of the story and the exquisitely developed characters. As if writing and performing the music herself isn’t enough, <strong>Mitchell </strong>also brings in a legion of the most creative minds in the music industry, including the <strong>Justin Vernon </strong>of <strong>Bon Iver</strong> fame, prolific American singer <strong>Ani DiFranco </strong>and <strong>Ben Knox Miller </strong>of <strong>The Low Anthem</strong>. With each artist undertaking a role in telling the fable, their varied vocal harmonies add a brilliantly diverse layer of sound to the record, and all are an asset to the collective, which is rare to come across on such a complex and intricate album. Whilst it wouldn’t be fair to impose credit on one person in particular, <strong>Orpheus’s</strong> fragile voice, sung by <strong>Vernon’s </strong>is a highlight on all the tracks he features on, and <strong>Greg Brown’s</strong> deep, illustrative vocals bring a sombre life to the demonic character of <strong>Hades</strong>.</p>\n<p>This is by no means an album to put on shuffle and show a cold-shoulder to; it is an invigorating and emotive experience from start to finish, even more rewarding to those who haven’t heard the cursed myth of <strong>Orpheus</strong> before, as they are taken on a perilous and passionate journey through the depths of robust love and overwhelming dedication. Similarly like picking out exceptional performers, it seems unjust to choose optimum tracks, however the ironically jovial <em>Way Down Hadestown</em> is almost unsurpassed in it’s quality, equivalently the hauntingly transcendent <strong>Vernon</strong> lead ballad <em>If It’s True</em> is a helpless cry inspired by those who have been viciously treated in love. I would go on, but there is a mystical quality to the record which needs to be heard to be fully appreciated. So if the stunning imagery, ravishingly graceful songwriting and elegant performances aren’t enough to convince you, then head along to one of <strong>Mitchell’s </strong>tour dates to see the epic displayed in it’s entirety.</p>\n<p><strong>Anais </strong>kindly took a few minutes out to answer a few questions for <em><strong>CitR</strong></em>.</p>\n<p><em>CitR: </em>What inspired you to produce a “folk opera” and why the story of Orpheus?</p>\n<p><strong>The truth is at first the songs chose me, not the other way around, I didn’t have a grand plan to write an opera, but a few lines came into my head and they seemed to want to tell this story. once it got rolling I was inspired by the Orpheus character (as a songwriter… he’s likable to songwriters), as well as the idea of Hadestown, with its dark, political logic, which I am sure was connected in my mind to the era the first songs were written in; the second term of our previous american president. for me and a lot of people it was a time of feeling really helpless and dejected, politically speaking.</strong></p>\n<p><strong>Whatever the first sparks were that led to me wanting to tell the story, I have to say that there’s no way I’d have had the heart to see it through three drafts if it weren’t for my collaborators, Michael Chorney who wrote the score, Ben mMtchstick who wrote the staging, and later Todd Sickafoose who produced the album. all of those guys are brilliant and it was the desire to impress them, be mutually inspired, be accountable to each other, do justice to each other’s work, that kept the thing rolling for three plus years… I’m really lucky.</strong></p>\n<p><em>CitR: </em>How did you go about choosing the voices of each character?</p>\n<p><strong>Ani DiFranco was the first person I asked and I’m so grateful she said yes at that early stage, it was a real vote of confidence at a time when the project was still kind of on wobbly legs. I had been rewriting some of Persephone’s songs with her voice in mind. I wanted persephone to be this really bold, but also tender, woman. Motherly, comradely, sexy. Ani DiFranco is all of those things. Greg Brown is a songwriting hero of mine from when I was quite young. I used to play his records on the radio in college. I thought of him right away for Hades, as his voice is subterranean and very dramatic, even when he delivers a casual line. I had been hunting for an Orpheus to no avail when I got offered an opening spot on Bon Iver’s tour of europe. I could not believe my ears, Justin’s voice is pure magic, I had a nervous breakdown the first night of the tour and thought, ‘he HAS to be Orpheus!’. I had heard of The Haden Triplets via Todd Sickafoose, the album’s producer, and my manager Slim Moon. It was the one session I wasn’t physically at, but I was on the phone with Slim who was there coaching them at this and that. They arranged the harmonies themselves and they brought such a straight-ahead, awesome attitude to the songs. Ben Knox Miller was the last voice we recorded, he was kind enough to stop off at the studio in Brooklyn during The Low Anthem’s crazy busy album release tour and lay down Hermes. I love his edgy hobo voice. He also has a beautiful ethereal quality sometimes in his voice. I’m so lucky all these people graced the record with their voices and brought not just their voices but their personalities to the thing.</strong></p>\n<p><em>CitR: </em>Is there any chance of performing the album live in it’s entirety with the original cast members or maybe even turning it into a stage production?</p>\n<p><strong>I would love nothing more than to get all those guys on a stage somewhere if the fates allow! But in the meantime, I’m planning to put together a few special shows in different towns using artists from that town to sing the parts. we did something like this in Boston, MA with the Vermont orchestra and all these beautiful Boston people, we called it “Greater Boston sings Hadestown” . It was really fun not just to hear the opera sung by different voices, but to feel that we were celebrating the Boston music community, and having a sort of cultural exchange. This is just a concert, that is, we’re not wearing costumes moving around on stage, it’s more like a radio novela, everyone gathered around a table with microphones, a bottle of wine, and lyric sheets…</strong></p>\n<p><em>CitR: </em>Would you consider doing it again and maybe choosing a different Greek myth to turn into a musical?</p>\n<p><strong>I definitely want to write another opera or music theatre piece. I hadn’t thought of going Greek again. I’m not a big classics gal or anything, the Orpheus thing kinda chose me, not the other way around. I do have another idea that I better not talk about yet, or I might never actually write it, I’m a little superstitious.</strong></p>\n<p style=\"text-align: center;\"><a href=\"https://www.anaismitchell.com/\">Check out her Official Site</a></p>\n<p style=\"text-align: center;\"><a href=\"https://www.myspace.com/anaismitchell\">Check out her Myspace</a></p>\n","slug":"1106-review-5-minutes-with-anais-mitchell","category":"interviews","date":1275410440000,"wpid":1106,"isSticky":false,"featured_image":null,"createdAt":1587295224156,"updatedAt":1587825937319,"author":"5e9b68b27a1236eccfeb1d27","categories":["interviews","music","reviews"]}