{"id":"5e9c2eba9b6559241525d8a0","artists":["5e9b68f87a1236eccfeb20c5"],"title":"Review: Girls – Father, Son, Holy Ghost","content":"<p>I wasn’t there with <strong>Girls</strong> when their 2009 debut, the imaginatively named <strong><em>Album, </em></strong>hit the shelves.</p><p> I wasn’t there when follow-up EP <strong><em>Broken Dreams Club </em></strong>dropped last year either. My first introduction to the San Franciscans was a scant few months ago, when <em>Vomit</em> first started doing the rounds on the internet. I was making a concerted effort to start listening to new music again, but in my curmudgeonly, flint-hearted way, I didn’t think I’d like another band with a pretty frontman, a much-touted back story, and a lone, plural noun for a name. It’s not very mature, but I’m just sort of like that. In any case, <em>Vomit</em> proved to me how very, very wrong I can be. Upon actually hearing the song’s scorching leads and soulful organ stabs, I was irrevocably won over, and made like <strong>Christopher Owens</strong> suggests on the track, letting <strong>Girls </strong>come into my heart.</p>\n<p>As such, <strong><em>Father, Son, Holy Ghost </em></strong>was actually one of the first releases of the year that I was eagerly anticipating, certainly from a reviewing standpoint. By the time I got my hands on the record, I still hadn’t heard anything by the band bar <em>Vomit</em>, and so opener <em>Honey Bunny </em>came as a bit of a non-sequitur for me. I’m not really sure what I was expecting with <em>Vomit</em> as my only reference point, a song that is equal parts minor-key sorrow, soaring gospel, and serious guitar freakout over its six and a half minutes, but I don’t think that galloping surf-pop clocking in at less than three was quite what I’d been envisaging. <em></em>It becomes clear over the course of the record, though, that this is what <strong><em>Father, Son, Holy Ghost </em></strong>is all about – it’s essentially a scrapbooking of some of the best parts of rock and pop from the last half-century, pasted in with <strong>Girls’ </strong>own homemade glue. Or something.</p>\n<p><strong></strong>It’s not long before those whitehot fretboard antics resurface, first for <em>Alex</em>‘s slackerly melancholia<em></em>, where they burn through the song’s grungy jangle, and then much more robustly on <em>Die</em>, which held one of the most genuinely lovely musical surprises of the year for me. <em>Die </em>is practically <strong>Deep Purple</strong>. I had thought that skilfully (even tastefully) reimagining the early years of heavy metal, whilst not unheard of (<strong>Mastodon</strong>, for example), was practically impossible in a pop context. <em>Die </em>has proved me wrong, evolving from a filthy groove into ringing psychedelia, and doing so quite beautifully. Elsewhere, <em>My Ma </em>presents the kind of gorgeous, stately heartbreak befitting the <strong>Elliott Smith </strong>tones in <strong>Owens</strong>‘ voice, where <em>Saying I Love You </em>is an obvious <strong>Beatles </strong>homage, and <em>Love Like a River </em>nods to soul. The breadth of styles and moods present on <strong><em>Father, Son, Holy Ghost</em></strong> prevent <strong>Girls </strong>from ever being too far in thrall to their obvious influences. <em>Magic</em>, the most jaunty thing I’ve heard since <strong>Queen</strong><strong></strong>, is immediately followed by the mountainous peaks and shadowy troughs of <em>Forgiveness</em>, a harrowing eight minute epic that opens with the lines ‘nothing’s gonna get any better’. It’s an approach that neatly sidesteps both plagiarism and boredom, retaining the emotional clout of the songwriting, which ranges from sun-drenched to Seattle, encompassing a lot of middle ground at the same time.</p>\n<p><strong><em>Father, Son, Holy Ghost</em></strong> is something like a musical patchwork quilt, if I’m allowed to go all flowery and metaphorical for a minute. The record is clearly not a groundbreakingly original work, which is not to its detriment, and like as not wasn’t its intention either. Similarly, its eleven tracks don’t seamlessly meld together all the band’s influences by any means – <strong>Girls </strong>can sometimes sound like they listen exclusively to one band one minute, and another the next. However, like my imaginary quilt, <strong><em>Father, Son, Holy Ghost </em></strong>has been artfully, skilfully and honestly put together, and has turned out a product that, whilst made up of what’s come before, is indelibly the work of its (re)creators.</p>\n","slug":"11078-review-girls-father-son-holy-ghost","category":"album-reviews","date":1315858094000,"wpid":11078,"isSticky":false,"featured_image":{"width":165,"height":165,"src":"2011/09/acmx_girls_hires01-165x165.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAABQf/xAAnEAABAwMCBAcAAAAAAAAAAAABAgMEABESBjEFEyEiFUFRYZGh0f/EABQBAQAAAAAAAAAAAAAAAAAAAAT/xAAaEQACAgMAAAAAAAAAAAAAAAABAgARA5Hw/9oADAMBAAIRAxEAPwB3WOXDm46YD0p+WXbuFOAuO5eBuL3xG/uPMUY2ngzjaV+Iye4A9Wmifvr81O9HSpCoGnQp90jmObrPof2rVLmy25byESn0oStQCQ4QAL7CjYkLsaNRDuFAsdqf/9k="},"createdAt":1587293882524,"updatedAt":1588403548368,"author":"5e9b68b27a1236eccfeb1d3c","old_image":"2011/09/acmx_girls_hires01-165x165.jpg","categories":["album-reviews","music"]}