{"id":"5e9c2eb39b6559241525d894","artists":["5e9b68d47a1236eccfeb1e6c"],"title":"Review: Blitzen Trapper – American Goldwing","content":"<p>It’s a good week for records.</p><p> Yesterday I got to review the pop patchwork <em>tour de force </em>that is <strong>Girls</strong>‘ <strong><em><a title=\"I'm not a preacherman\" href=\"https://api.crackintheroad.com/music/11078-review-girls-father-son-holy-ghost/\">Father, Son, Holy Ghost</a> </em></strong>(CitR didn’t like it quite as much as <a title=\"They do seem to think it's the best thing since sliced bread, though\" href=\"https://pitchfork.com/reviews/albums/15811-father-son-holy-ghost/\">Pitchfork</a>, mind), and today I’m taking a stab at this, the sixth LP from Portland, OR’s <strong>Blitzen Trapper</strong>. I have a confessed soft spot for Portland. Aside from being the city that has at one point or another been called home by personal faves <strong>Elliott Smith</strong>, <strong>The Shins</strong>, and <strong>Richmond Fontaine </strong>(whose latest album <a title=\"I wouldn't recommend it if you're feeling sad...\" href=\"https://admin.crackintheroad.com/music/10908-review-richmond-fontaine-the-high-country/\">I reviewed only last week</a>), I recently got back from visiting the Oregon capital for the first time, on a roadtrip from Seattle to San Francisco. With regards to the quality of its <a title=\"Mirror Pond 'til I die\" href=\"https://www.deschutesbrewery.com/locations/portland\">beer</a>, the friendliness of its populace, and its <a title=\"Keep it that way, yo.\" href=\"https://www.keepportlandweird.com/\">laid-back, leftfield ambience</a>, Portland has found itself at the top of my ‘favourite cities’ list. I didn’t know I had one until just now, but there you are.</p>\n<p>With ‘Keep Portland Weird’ being the city’s unofficial slogan,<strong> Blitzen Trapper</strong>‘s back catalogue has played out as a distinct product of their hometown. Whilst being rooted in West Coast Americana, the band’s previous records have always showcased a melange of disparate influences, perhaps coming to a head on the six minute title track of last year’s <strong><em>Destroyer of the Void</em>. </strong>So it’s a small, if not complete surprise to discover that <strong><em>American Goldwing, </em></strong>in keeping with the stock imagery of its title (it’s named after an ’80s motorcycle), is a twangy, fuzzy, down-home slice of relatively straightforward American pop-rock, indebted to the likes of <strong>Big Star</strong>, <strong>Cheap Trick </strong>and early <strong>Wilco</strong>. Frontman <strong>Eric Earley </strong><em></em>details the thinking behind the album’s sound on <a title=\"Ooh look, it's the Sub Pop website! With the bloke from Blitzen Trapper and everything!\" href=\"https://www.subpop.com/releases/blitzen_trapper/full_lengths/american_goldwing\">the Sub Pop website</a>, and of course what’s on offer here will not be unfamiliar to any <strong>Blitzen Trapper </strong>fan, but that’s just the thing. In its familiarity, <strong><em>American Goldwing </em></strong>certainly runs the risk of disappointing those <strong>Trapper </strong>devotees who expect some degree of adventurousness from the band.</p>\n<p>Without the sonic melting pot that birthed their earlier works, <strong>Blitzen Trapper </strong>have been left the fairly difficult task of creating an Americana record that doesn’t fall into the many potholes so readily available to bands of that ilk, who can often sound staid or clichéd in a forward-thinking musical climate (which, for the purposes of this review, we’re in). Luckily, <em>Might Find It Cheap </em>swaggers assuredly out of the blocks with a sunny confidence that’s practically impossible to dislike, and from there, <strong><em>American Goldwing </em></strong>has me. Whilst retreading old ground, <strong>Blitzen Trapper </strong>are songwriters of a discerning cal<strong></strong>ibre, and are still layering up instruments and switching between parts like old hands. It’s much more nuanced this time around, but it lends songs like <em>Astronaut </em>elegance one minute <strong></strong>and pulsing barroom attitude the next. As a result of this skilful craftsmanship, the tracks of <strong><em>American Goldwing </em></strong>rarely fail to elicit the app<strong></strong>ropriate emotional response, whether its the roadworn, whiskey-warm nostalgia of <em>Fletcher</em>, <em>Love The Way You Walk Away</em>‘s gentle melancholy, or the stomping abandon that accompanies <em>Your Crying Eyes</em>. <em>Street Fighting Sun </em>even reprises the riffy psychedelia present on <strong>Trapper</strong>‘s earlier releases, for anyone really missing that facet of the band’s sound, but ultimately, if you’re prepared to accept <em><strong>American Goldwing </strong></em>as a more subtly shaded record, you won’t pine for it at all.  <strong><em></em></strong><em><strong><br />\n</strong></em></p>\n<p>Much like fellow Portland natives <strong>The Decemberists’ </strong>most recent effort, <strong><em>American Goldwing </em></strong>finds its creators revisiting more immediately familiar parts of their young continent’s musical history. As such, the record doesn’t quite strike out into the same realms of diversity that perhaps <strong>Blitzen Trapper </strong>fans have come to expect, but that said, <strong><em>American Goldwing </em></strong>is as strong a slice of modern Americana as anyone could wish for. It’s the sort of album I sure wish I’d had with me on that roadtrip, and as an accompaniment to cold beers with good friends on the last sunny days of this year, it’s pretty damn welcome. <strong><em><br />\n</em></strong></p>\n","slug":"11148-review-blitzen-trapper-american-goldwing","category":"album-reviews","date":1315926968000,"wpid":11148,"isSticky":false,"featured_image":{"width":165,"height":165,"src":"2011/09/blitzen-trapper-165x165.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAABgf/xAAjEAACAQMDBAMAAAAAAAAAAAABAgMABBEGEyEFEhQjMTJR/8QAFQEBAQAAAAAAAAAAAAAAAAAAAQL/xAAZEQEAAgMAAAAAAAAAAAAAAAABABECEiH/2gAMAwEAAhEDEQA/AIHprxFktINm3Ec65lup4t11IznsXIAA+Dmi12saXUywkmNXYKf0Z4pJpqGJ+jXTPGjN7OSoJ+lFqgxdluN8n//Z"},"createdAt":1587293875726,"updatedAt":1588403548266,"author":"5e9b68b27a1236eccfeb1d3c","old_image":"2011/09/blitzen-trapper-165x165.jpg","categories":["album-reviews","music"]}