{"id":"5e9c2eb69b6559241525d89a","title":"Live Review: Rod Stewart in Las Vegas","content":"<p>Although I doubt this particular artist has featured within the realms of <strong>Crack in the Road </strong>before, he is reputed to have sold over 100 million records worldwide.</p><p> Such a claim means that to some he is considered to be one of the most successful musicians of all time.</p>\n<p>Whilst touring the west coast of America a few weeks back I saw Rod Stewart perform to a crowd of just a few thousand at Caesar’s Palace, Las Vegas.</p>\n<p>Despite being 66, it seemed to be the majority of the crowd showing their age, not the singer; The audience prefered to sit back and listen rather than unite their voices together as a younger audience may have done. This, however, was the only negative of the evening and Rod Stewart’s performance was very sleek and classy, with his backing vocalists and band making the night something special.</p>\n<p>Everyone on stage was dressed in  informal 1950’s style suits and dresses which matched the style and ambience of the evening. Rod himself talked to the audience intimately and showed them photos of his family, especially his newborn son. In addition to this, the show was broken down into several parts; a small acoustic set and some full electric covers performed by all the band. Rod’s backing vocalists also displayed enough talent to warrant their own show.</p>\n<p>The way the gig was broken up allowed Rod Stewart to go backstage and change into increasingly outlandish coloured suits. Throughout the near two hour set all of his most popular songs were performed including his number one singles <em><a title=\"Rod Stewart Video\" href=\"https://www.youtube.com/watch?v=h9dlG-iq3F8\">Maggie May</a> </em>and <a title=\"Do you think i'm sexy video\" href=\"https://www.youtube.com/watch?v=OIlHt_syoSE\"><em>Do Ya Think I’m Sexy</em></a>, his distinctive voice as raspy as ever with none of the ostentation that epitomises many of other Las Vegas shows.</p>\n<p>Overall, a great night performed very professionally, if not spectacularly, by one of the legends of music.</p>\n<p> </p>\n<p> </p>\n","slug":"11150-live-review-rod-stewart","category":"live-reviews","date":1315909029000,"wpid":11150,"isSticky":false,"featured_image":{"width":165,"height":165,"src":"2011/09/rod-stewart-165x165.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAABwYI/8QAIhAAAgIBAgcBAAAAAAAAAAAAAQIDBCEABQYHERIxQZGh/8QAFQEBAQAAAAAAAAAAAAAAAAAAAgP/xAAbEQABBAMAAAAAAAAAAAAAAAARAAEDMQQTIv/aAAwDAQACEQMRAD8ANpOH4975SUpdj25m3VVDzqFIZwp7SyjwScYHrRJJUsRyMkkEqupKspQggj0da95fqI+ClMYClaXVSuOh7E8fTq3WhTYAtUrknJJjGfzSih4JtQmyn2OwoL//2Q=="},"createdAt":1587293878741,"updatedAt":1588403548319,"author":"5e9b68b27a1236eccfeb1d07","old_image":"2011/09/rod-stewart-165x165.jpg","categories":["live-reviews","music"]}