{"id":"5e9c2e919b6559241525d85e","artists":["5e9b68e07a1236eccfeb1ef8"],"title":"Review: Chuck Ragan – Covering Ground","content":"<p>I’ve already mentioned that it’s been a good week for records.</p><p> So far, I’ve covered <strong>Girls</strong>‘ overhyped but really rather good <strong><em>Father, Son, Holy Ghost</em></strong>, and <strong>Blitzen Trapper</strong>‘s <strong><em>American Goldwing</em></strong>, which left me pining for the West Coast with the intensity of a recovering addict. And now we have <em><strong>Covering Ground</strong></em>, the third full length LP from <strong>Chuck Ragan</strong>. You know him. He’s also often found sharing vocal and guitar duties with <strong>Chris Wollard </strong>in Gainesville gritmongers <strong>Hot Water Music. </strong>Yeah, <em>that </em><strong>Chuck Ragan</strong>.<strong><br />\n</strong></p>\n<p>And if you know <strong>Chuck Ragan</strong>, then you’ll know what to expect from <strong><em>Covering Ground</em></strong>. The record is fully populated with anthemic, boldly strummed acoustics, and of course <strong>Ragan</strong>‘s gravelly, much-beloved vocal tones. Opener <em>Nothing Left to Prove </em>even begins with the exact same chord as <em>The Boat</em>, which kicked off 2007’s <strong><em>Feast Or Famine</em></strong>. It’s evident from <em>Nothing Left to Prove </em>that <strong>Ragan </strong>has perhaps been listening to a bit more <strong>Springsteen </strong>than before, and it’s tempting to reimagine him in that kind of mould, an updated, niche version of the archetype, the dependable, solid, gruff singer/songwriter. Certainly, <strong><em>Covering Ground</em></strong>‘s songs are grizzled, bighearted and roadworn in the same way that <strong>The Boss </strong>can be at his best. <strong>Jon Gaunt</strong>‘s fiddle lends a country flavour to the proceedings in places, and songs like <em>Nomad By Fate </em>or <em>Meet You In The Middle </em>(featuring <strong>The Gaslight Anthem</strong>‘s <strong>Brian Fallon</strong>) can feel like drinking music for the kids of <strong>Hot Water Music</strong>‘s particular wave of punk rock, who’ve grown up a bit and aren’t really kids any more.</p>\n<p>On the surface, it can seem easy to get the measure of <strong><em>Covering Ground</em></strong>. But <em> Seems We’re Ok</em>, around the halfway point, set me to thinkin’. With its searing harmonica, the track initially comes across all <strong>Springsteen</strong> again, slow-mo this time, and <strong>Ragan</strong>‘s rawhide rasp, usually tougher than the first ten <strong>Tom Waits</strong> impersonators you’d come across, starts to break apart at the edges. It lends a striking vulnerability to the song, and provides a reflective checkpoint. Whilst one might not immediately expect it from <strong>Ragan</strong>, with regards to his ursine stature, sandpaper larynx and the calibre of his day job, <em>Seems We’re Ok</em> highlights just how much of <em><strong>Covering Ground</strong></em> is coloured by themes of fallibility. Lyrics we’ve already heard, like ‘sometimes you reach for the bottle before the sky’, or ‘I shake when I walk, I spin when I’m down’ stop sounding romantic, and take on a distinctly moving, human bearing. <em>Right As Rain</em> sees <strong>Ragan</strong>‘s voice cracking again, and whilst elsewhere the song’s flamenco tones might comes across as contrived or schmaltzy, here they emphasise a very real tenderness. With the presupposed veneer of toughness removed, <em><strong>Covering Ground</strong></em> hits where it hurts much more often than had it simply been throwing musical haymakers left, right and centre, pumping its fists in the air and declaring constant empowerment, whether in positive or negative terms. It’s in this intimacy that the album’s, and <strong>Ragan</strong>‘s, principal strengths lie.</p>\n<p>Much like the other releases that I’ve had the pleasure of reviewing this week, <strong><em>Covering Ground </em></strong>is a record entirely aware of its influences and position, and as such, its listeners will be too. This isn’t covering ground in the sense of musical invention, either in the context of music as a wider entity, or even really <strong>Ragan </strong>himself, but with regard to honesty, passion, and execution, <em><strong>Covering Ground </strong></em>spans miles in minutes, clearing that distance between <strong>Ragan</strong> and his listeners with ease. As the man sings in the closing <em>Lost and Found</em>, ‘there ain’t no wasted time covering our own ground’, and in the case of this record, he’s proved himself right.</p>\n<p> </p>\n","slug":"11252-review-chuck-ragan-covering-ground-2","category":"album-reviews","date":1316173477000,"wpid":11252,"isSticky":false,"featured_image":{"width":165,"height":165,"src":"2011/09/coveringground-165x165.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAABAYI/8QAIxAAAQMCBQUAAAAAAAAAAAAAAQIDBAAFERITIVEUJDJBQ//EABUBAQEAAAAAAAAAAAAAAAAAAAAB/8QAFBEBAAAAAAAAAAAAAAAAAAAAAP/aAAwDAQACEQMRAD8A0ey3otxkR7e2ppaBqLzAZecQRiaE/a4pfcIhAgqO4JHugWWQ8bCpRdcKk7A5jtUZLmy+qe7l/wA1fQ81B//Z"},"createdAt":1587293841272,"updatedAt":1588403547803,"author":"5e9b68b27a1236eccfeb1d3c","old_image":"2011/09/coveringground-165x165.jpg","categories":["album-reviews","music"]}