{"id":"5e9c2e8f9b6559241525d85b","artists":["5e9b68d47a1236eccfeb1e56","5e9b68f87a1236eccfeb20bd","5e9b690a7a1236eccfeb21f3","5e9b691e7a1236eccfeb230f","5e9b692b7a1236eccfeb2398","5e9b693e7a1236eccfeb24ed","5e9b69517a1236eccfeb25fe","5e9b69577a1236eccfeb2675","5e9b69577a1236eccfeb2685","5e9b69637a1236eccfeb2753"],"title":"Review: Bestival 2011","content":"<p>So there it is, the summer festival season is over.</p><p> Concluding on a stunning performance from Bjork and frankly biblical weather, 50,000 intrepid visitors to the Isle of Wight have now just about arrived home with laryngitis, influenza and a huge case of post-festival blues. Firmly making a case for itself as a genuine option in filling next summer’s Glastonbury-shaped hole, this year’s Bestival will be remembered for a fantastically eclectic line-up and incredible weather, leaving some festival-goers taking 22 hours just to get back to Kent. Gutted. For everyone else this was another great year for a festival which is rapidly establishing itself as a big player on the circuit, attracting an unrivaled student audience with the blend of heritage and upcoming acts across the alternative spectrum.</p>\n<p><strong>Thursday</strong></p>\n<p>Following too long in the pub at Southampton to avoid the queues, we committed to the three hour wait to cross the Solent before hitting West Cowes and a further three hour wait for the shuttle buses. Thank goodness for friendly locals and their roomy Volvos eh. After accepting an unsolicited lift we arrived at the site just before sunset and with plenty of time to set up camp and take a wander before heading to catch a new look <strong>Santigold</strong> at the Big Top. With the emphasis on her heavier, dance-y new material and an obnoxiously oversized crowd it wasn’t the ideal act for the end of a long day of lugging round bags, but the same could not be said for <strong>Hercules and Love Affair</strong>; camp as tits and unashamedly reveling in the occasion, their seventies disco got the tent moving and banished the memories of Santigold’s tragic miming. Ending the night in the Psychedelic Worm with <strong>6 Day Riot</strong> was a brilliant end, as their mariachi folk provided a low key yet nonetheless welcome conclusion to the first night. As Bestival looks to stake its claim as a four day festival it provided a hugely decent Thursday line-up, but for me personally it was all about the wait for Brian Wilson on Friday…</p>\n<p><strong>Friday</strong></p>\n<p>And then we were there. After an opening set from <strong>Yuck</strong> with their fuzzy garage rock, and a bit of rockabilly courtesy of <strong>Kitty, Daisy and Lewis</strong>, it was over to <strong>Brian Wilson</strong> and his Beach Boys set to infuse proceedings with a bit of sunshine. ‘Get Around’ provided the first singalong anthem of the weekend, and it was heartwarming to see Brian genuinely enjoying himself, backed by his hugely impressive touring band. Though it times they appear to carry him, they operate together as a finely tuned vehicle for Wilson’s sun-kissed songwriting, and I’ll remember the set as one of the best I’ve seen for years to come. Sidetracked by a Charlie Chaplin impersonator for a good half hour, wicked, we stumbled along to a surprisingly lacklustre <strong>SBTRKT</strong> performance, with the Big Top emptying after ‘Pharaohs’, then took our first jaunt to the Sailor Jerry’s stage for a beautifully intimate show from <strong>Caitlin Rose</strong>. Mixing bluegrass and contemporary folk to tear-jerking levels, the set drew heavily on <em>Own Side Now</em> as well as a cover of ‘Young Blood’ by The Coasters. <strong>Ghostpoet</strong> threw together an impressive show despite technical difficulties at the Red Bull Music Academy, and then we returned to Sailor Jerry’s for <strong>Frank Turner</strong>‘s secret headline show. Doing what he has always done best, performing solo with just his trusty acoustic guitar, the gig was both impassioned and intimate to equally epic levels. A just reward for the persistent fans who refused to settle for what I assume was a shamefully average show from Pendulum. Popping into catch ‘You! Me! Dancing!’ by Los Campesinos! On the way back to the tent ensured the day ended on a raucous high.</p>\n<p><strong>Saturday</strong></p>\n<p>From <strong>Clare Maguire</strong> to <strong>King Creosote</strong>, via <strong>Toots and the Maytals</strong>, the perhaps surprising highlight of the afternoon was <strong>Oh Land</strong>, the classically influenced synth artist from Denmark, who delivered her Psychedelic Worm show with aplomb and more, as her thunderous electro drew on Kate Bush to take her place alongside Niki and the Dove in retrieving the alien diva baton from the eighties. <strong>PJ Harvey</strong>, playing her first show since her Mercury Prize success, performed the majority of <em>Let England Shake</em> to a small yet dedicated crowd as the sun began to set and anticipation grew for <strong>The Cure</strong>. Though infinitely influential, I don’t think I was alone in being perhaps slightly underwhelmed by Robert Smith et al, as they powered through 32 songs over two and a half hours. I will happily admit to only knowing the obvious singles, and in nipping off to catch nineties throwback act <strong>Tribes</strong> we timed our return ideally to catch the beginning of ‘Lullaby’, which moved into ‘Lovecats’. With very little audience interaction, the set had a slightly forced feel to it, but in focusing on the many hits that were played over the duration the show was still a success and relative coup for Bestival. <strong>Primal Scream</strong> however were the main success of the night, bringing <em>Screamadelica</em> to Robin Park, and after opening on ‘Movin’ On Up’ they went from strength to strength with Bobby Gillespie showing, as ever, why he is one of the great frontmen. From the always moving ‘Come Together’ to the anthemic ‘Rocks’, Primal Scream were stupendous, and it makes the wait for the new album next year all the more unbearable.</p>\n<p><strong>Sunday</strong></p>\n<p>As the rain finally hit with a vengeance, we opened the Sunday at the Big Top with <strong>Johnny Flynn and the Sussex Wit</strong>, as the troubadour gained another few thousand women to his army of adoring fans. That boy is just too damn talented. Fortunately he gave the rest of us men a chance by telling a truly bad joke -“What’s the worst thing to hear when giving Willie Nelson a blowjob? “I’m not Willie Nelson…”” Terrible. <strong>The Drums</strong> were underwhelming, and played a <em>Portamento</em>-heavy set that left no time for ‘Let’s Go Surfing’, which seemed optimistic at best and wildly foolish at worst. <strong>Keston Cobblers’ Club</strong> were my pick for the weekend in my preview, and they didn’t fail to succeed, drawing a large crowd to dance their wellies off to a set that looked forward to their upcoming <em>Triptych</em> releases. After the energy and unabashed joy of the Cobblers, <strong>The Maccabees</strong> demonstrated their status as one of the most consistently fine live acts on the scene at the moment as they treated us to tracks from their as yet untitled new album, hinting at a heavier, near-glam sound. Via comedy with Marcus Brigstocke, it was time for Bjork, and the most silent crowd of the weekend, as <em>Biophilia</em> melded with lush visuals to form an ell-encompassing experience, along with a near-tragedy as a chinese lantern was blown narrowly past Bjork’s face to disappear into the wings. Really, who was trying to launch a lantern in the apocalyptic wind? Closing on ‘Declare Independence’, the spectacular weekend was ended with a firework display and a 6am ferry back to Blighty. Unsure what to expect on the Thursday, I’ve been well and truly won over to Bestival, and will definitely be going again. Until next year!</p>\n","slug":"11297-review-bestival-2011","category":"festivals","date":1316177237000,"wpid":11297,"isSticky":false,"featured_image":{"width":875,"height":506,"src":"2011/09/bestival.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAGAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAAAAf/xAAgEAABAgYDAQAAAAAAAAAAAAACAQMABAUGESEUMYGh/8QAFAEBAAAAAAAAAAAAAAAAAAAABP/EABgRAAMBAQAAAAAAAAAAAAAAAAABAhEh/9oADAMBAAIRAxEAPwCW2Xc1IpVqOyb9ClZt57QvutopDnXefYnzvCN0yFsxQlVUTCa+whBIp6xtLiP/2Q=="},"createdAt":1587293839537,"updatedAt":1588403547778,"author":"5e9b68b27a1236eccfeb1d4c","old_image":"2011/09/bestival.jpg","categories":["festivals","live-reviews","music"]}