{"id":"5e9c2e859b6559241525d855","artists":["5e9b69177a1236eccfeb2277"],"title":"Review: Letting Up Despite Great Faults – Paper Crush","content":"<p>Over the past couple of years, we’ve experienced somewhat of a shoegaze revival, with more acts seemingly taking influence from the dreamy, ethereal guitar sounds of the late 80’s.</p><p> <strong>The Horrors</strong> and <strong>The Pains Of Being Pure At Heart</strong> both succeeded in opening up this reborn genre (aptly titled ‘nu-gaze’) to the mainstream media, whilst there are few ‘chillwave’ artists who would deny the effect the likes of<strong> Ride</strong> and <strong>My Bloody Valentine</strong> have had on their own creative output.</p>\n<p>However that’s not to say shoegaze was ever redundant as a genre, just bubbling gorgeously beneath the surface of mainstream recognition. One such band who are now beginning to receive their just desserts are Los Angeles five piece <strong>Letting Up Despite Great Faults</strong>. Over five years since they announced themselves on the scene with their debut EP <strong><em>Movement</em></strong>, and now with plaudits all over the world and fans at Pitchfork and Rolling Stone, <strong>Letting Up Despite Great Faults</strong> are readying the release of a new EP, entitled <strong><em>Paper Crush</em></strong>.</p>\n<p>The shoegaze and dream pop inspirations are plain to see, with opener <em>Repeating Hearts</em> fitting very nicely into the <strong>Pale Saints</strong> styled sound. The guitars are soothingly repetitive and the vocals are drenched in hazy reverb. The track to close <em>Paper Crush</em>, the slow burning <em>Aurora</em> is heavily electronically driven and almost entirely instrumental, serves as a timely reminder as to the talent this three piece possess, in particular songwriter <strong>Michael Lee</strong>. A fitting way to end the release.</p>\n<p>Yet as seen with <strong>The Pains Of Being Pure At Heart</strong>,<strong> Letting Up Despite Great Faults</strong> don’t just reinvent a sound; they succeed in embracing and adding to it, with the twee anthem <em>Teenage Tide</em> portraying this sumptuously. A delightfully laid back teenage love song, destined to fill the playlists of starstruck young lovers. It’s on this track that<strong> Letting Up Despite Great Faults</strong> excel and display the sort of songwriting ability that will elevate them to the realms of their worthy peers.</p>\n<p><object height=\"81\" width=\"100%\"><param name=\"movie\" value=\"https://player.soundcloud.com/player.swf?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F14422322\"></param><param name=\"allowscriptaccess\" value=\"always\"></param><embed allowscriptaccess=\"always\" height=\"81\" src=\"https://player.soundcloud.com/player.swf?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F14422322\" type=\"application/x-shockwave-flash\" width=\"100%\"></embed></object>  <span><a href=\"https://soundcloud.com/lettingup/letting-up-despite-great-2\">Letting Up Despite Great Faults – Teenage Tide</a> by <a href=\"https://soundcloud.com/lettingup\">lettingup</a></span> </p>\n","slug":"11325-review-letting-up-despite-great-faults-paper-crush","category":"album-reviews","date":1316204917000,"wpid":11325,"isSticky":false,"featured_image":{"width":575,"height":383,"src":"2011/09/letting-up-despite-great-faults.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAAAAP/xAAfEAABAwQDAQAAAAAAAAAAAAABAgMRAAQhMQUGUbH/xAAUAQEAAAAAAAAAAAAAAAAAAAAE/8QAGREAAgMBAAAAAAAAAAAAAAAAAAIBBBEx/9oADAMBAAIRAxEAPwC3RO0PcLwCRbtFTKzAg6Maz9qDtw7curfSUQ6SsTvOfKUodjF4KZY0/9k="},"createdAt":1587293829424,"updatedAt":1588403547725,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/09/letting-up-despite-great-faults.jpg","categories":["album-reviews","music"]}