{"id":"5e9c2e339b6559241525d7d1","artists":["5e9b68ec7a1236eccfeb2000"],"title":"Live Review: Emmy The Great (The Cluny, Newcastle)","content":"<p>Everyone knows how over-saturated the world of female singer/songwriters is at the moment.</p><p> From the karaoke warble of <strong>Adele</strong> to the electro-infused whine of <strong>Ellie Goulding</strong>; the fairer sex have experienced an unprecedented flurry of chart success over the past couple of years. One group it has benefited however, are the more ‘alternative’ breed of female singer/songwriters, such as<strong> Feist</strong>, <strong>Lykke Li</strong> and <strong>Laura Marling</strong>, all of whom have received increased exposure due to heightened interest in emotionally connected, folk influenced pop music.</p>\n<p>One such artist who is yet to break through on either side of the barrier, be it into the Radio 1 mainstream, or into the blog over-hyping, Pitchfork loving, ‘independent’ artists, is London songstress <strong>Emma-Lee Moss</strong>, known by her stage name <strong>Emmy The Great</strong>. Before seeing her performance at The Cluny last Monday, I wasn’t particularly an avid listener of her anti-folk styled music; in all honesty, it never really entered my radar.</p>\n<p>Settling down amongst the homely confines of <strong>The Cluny</strong>, and grabbng a few cold ones, it became apparent that much of the crowd were die-hard fans. Not that there’s anything wrong with having complete adoration for someone’s music; however it made for a rather intimidating experience. The set itself was enjoyable, if not rather understated; with many of the tracks blending together into a mass of emotionally unstable folk.</p>\n<p>If anything, this was where<strong> Emmy’s</strong> set slipped up, in that it didn’t prove particularly invigorating or memorable, despite the strength of tracks such as <em>First Love</em> and <em>We Almost Had A Baby</em>. That said, those around me clearly enjoyed it; perhaps not being a huge fan in the first instance meant I found it far more difficult to connect to the intimate, acoustic songs. Either way, it’s going to take something pretty special for <strong>Emmy The Great</strong> to reach the dizzying heights of her contemporaries.</p>\n","slug":"11378-live-review-emmy-the-great-the-cluny-newcastle","category":"live-reviews","date":1317755065000,"wpid":11378,"isSticky":false,"featured_image":{"width":165,"height":165,"src":"2011/10/3017_alta-165x165.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAABwQG/8QAIhAAAgIBBAEFAAAAAAAAAAAAAQMCBBEABQYhURIiIzFC/8QAFAEBAAAAAAAAAAAAAAAAAAAAA//EABkRAAIDAQAAAAAAAAAAAAAAAAACAREhA//aAAwDAQACEQMRAD8AT3LFeVFKNwrUCqwGtRFicuAWSVkCOI5HYOOzjWdfw/crT2WKlyJrtkWKJdAZiTkfnxou58hUdz4gYqWCyI9ZER7vkiO/PWqbYC7boLAjCM5CMY9ADP0NJzW9HeNo/9k="},"createdAt":1587293747139,"updatedAt":1588403546562,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/10/3017_alta-165x165.jpg","categories":["live-reviews","music"]}