{"id":"5e9c2e6f9b6559241525d834","artists":["5e9b69317a1236eccfeb2424"],"title":"Interview: Pearl and the Puppets","content":"<p><a href=\"https://admin.</p><p>crackintheroad.com/music/11391-interview-pearl-and-the-puppets/attachment/pearl_and_the_puppets_becauseido_10b/\" rel=\"attachment wp-att-11393\"><img class=\"alignnone size-full wp-image-11393\" title=\"Pearl_and_The_Puppets_BecauseIDo_10b\" src=\"https://api.crackintheroad.com/uploads/2011/09/Pearl_and_The_Puppets_BecauseIDo_10b.jpg\" alt=\"\" width=\"555\" height=\"832\" srcset=\"https://api.crackintheroad.com/images/2011/09/Pearl_and_The_Puppets_BecauseIDo_10b.jpg 555w, https://api.crackintheroad.com/images/2011/09/Pearl_and_The_Puppets_BecauseIDo_10b-260x389.jpg 260w, https://api.crackintheroad.com/images/2011/09/Pearl_and_The_Puppets_BecauseIDo_10b-165x247.jpg 165w\" sizes=\"(max-width: 555px) 100vw, 555px\" /></a></p>\n<p>Life at the moment is hectic for <strong>Pearl and the Puppets</strong> frontwoman, Katie Sutherland, as her career has seemed to explode in recent months after a change of management. She is currently recording her debut album, and is gigging across the UK to promote it and we at <strong>Crack in the Road</strong> managed to catch her before her performance in Dundee headlining Abertay University’s freshers week. As usual, the Dundee crowd was sub-par (see my other reviews in Dundee, its all the same) which is miles away from the crowds she has performed in front of before which include gigs with <strong>Elton John, Sugababes </strong>and <strong>McFly</strong> as well as a tour with <strong>Alphabeat</strong>.</p>\n<p>However, the performance was well receieved by the few that were there and rightly so, she sang beautifully and with true professionalism and was accompanied by an equally trendy backing band consisting of keys, guitar and a cajon. She performed some songs that are undoubtedly on her album including <em>Make Me Smile </em>and what I hope to be her first single <em>Because I Do</em>, which is an equisitly simple pop song that one can’t help but like. From what I have gathered, Katie’s current label is really pushing this girl’s music and providing her with sufficient resources to get her battling with the big players within the chart, and rightly so as chart music today is getting ludicrisly stale with the same half a dozen or so artists fighting out for top spot every week.</p>\n<p><strong>Pearl and the Puppets</strong> therefore, could be the saviour of popular music, and bring it back to the great, cheery pop songs of the late ninties and early noughties. Below is the chat I had with Katie about everything from singing lessons from <strong>James Blunt</strong> to her very precise way of eating steak:</p>\n<p><strong>CitR: I have read that you received singing tips from James Blunt, how did this come about?</strong></p>\n<p>At the time we had the same management but I was not signed at the time. I had the flu really badly and I dont often get ill. My manager phoned me when I left the studio who was with James at the time and he spoke to me and told me to eat a spoonful of marmite and my voice would get better. He swears by it, he even keeps a jar of it underneath his piano at every gig. But it didnt work for me.</p>\n<p><strong>CitR: Your old management company was headed by Elton John, what is he like?</strong></p>\n<p>He is a great guy who really nurtured me well, he owned the management company but he did a lot of the work himself which was really good.</p>\n<p><strong>CitR: You have supported a wide range of acts from Elton John to McFly, does this show that you appeal to a wide audience?</strong></p>\n<p>Most of those were one off shows, I have only been on a proper tour with <strong>Alphabeat</strong>. I suppose my music is acoustic and pop so it appeals to a lot of people. Supporting <strong>Sugababes </strong>in 2008 was weird as I met one of them recently and didn’t realise but I was introduced to them as one of their support acts from years ago and I was unsure of the lineup so It could have been one of the new ones and not one I supported.</p>\n<p><strong>CitR: I have read that you are more nervous before smaller shows, why is this the case?</strong></p>\n<p>Yeah thats true, I need a couple of glasses of wine before small shows! I suppose its because you can see peoples’ eyes which is nervewracking, and with a big crowd they are more likely to cheers together and small venues can be quite claustrophobic too.</p>\n<p><strong>CitR: Who is the best Katie in music?</strong></p>\n<p>This is a hard question….If we’re allowed Kate’s I would choose <strong>Kate Bush</strong>.</p>\n<p><strong>CitR: Did music happen by accident for you as you were a student prior to being a professional musician?</strong></p>\n<p>Yeah, it was something I fell in to, I suppose at the time I didnt realise I could do it as a job, but I am now and its great.</p>\n<p><strong>CitR: What is your favourite live song to play?</strong></p>\n<p>My new song called <em>Sinner </em>is my favourite with a full band, but I don’t have a full band with me tonight.</p>\n<p><strong>CitR: What song in history do you wish you’d written?</strong></p>\n<p>I have a few but the top two would be <em>Linger </em>by <strong>The Cranberries </strong>and the song that goes ‘…and its always you and me, always and forever’ (sings) that is in the soundtrack for Romeo and Juliet.</p>\n<p>When you read this Katie the song is <strong>The Wannadies, </strong><em>You and Me Song.</em></p>\n<p><strong>CitR: You have an album coming out, when is it due and how do you feel about it?</strong></p>\n<p>There is no definate release date but it will be in early 2012, I am still recording it now but its a very exciting time and I cant wait for it. The new people I am working with are very nurturing and letting me be free to do what I wish.</p>\n<p><strong>CitR: And finally…how do you eat steak?</strong></p>\n<p>I have something called a flash steak….it is medium rare and wrapped in parma ham, and alongside it there must be chunky chips, rocket, and a red wine sauce. And a glass of wine too.</p>\n<p>Check out the facebook page <a href=\"https://www.facebook.com/pearlandthepuppets\">here</a></p>\n<p>Check out the myspace page <a href=\"https://www.myspace.com/pearlandthepuppets\">here</a></p>\n<p>Check out the official site <a href=\"https://www.pearlandthepuppets.com/\">here</a></p>\n<p>  Life at the moment is hectic for Pearl and the Puppets frontwoman, Katie Sutherland, as her career has seemed to explode in recent months after a change of management. She is currently recording her debut album, and is gigging across the UK to promote it and we at Crack in the Road managed to catch her before her performance in Dundee headlining Abertay University’s freshers week…</p>\n","slug":"11391-interview-pearl-and-the-puppets","category":"interviews","date":1316525780000,"wpid":11391,"isSticky":false,"featured_image":{"width":165,"height":165,"src":"2011/09/pearlandthepuppets-165x165.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAABgcI/8QAIxAAAgIBBAEFAQAAAAAAAAAAAQIDERIABAUhMSIyQUJRgf/EABUBAQEAAAAAAAAAAAAAAAAAAAAB/8QAFREBAQAAAAAAAAAAAAAAAAAAAAH/2gAMAwEAAhEDEQA/AM6cCGl5FcQtqcxnWPXYu+quh/dPtxx8jzyM42mRYk4tHV38evxqa8Y7JOSjMpKkEg10fI0l2k8p2kNyv7F+x/NKr//Z"},"createdAt":1587293807253,"updatedAt":1588403547441,"author":"5e9b68b27a1236eccfeb1d07","old_image":"2011/09/pearlandthepuppets-165x165.jpg","categories":["interviews","live-reviews","music"]}