{"id":"5e9c2e399b6559241525d7e0","artists":["5e9b69377a1236eccfeb249a"],"title":"Crack in the Replica 1 – Autonomic Movements","content":"<p>Knowing south coast based DJ <strong>Replica</strong> is like having your very own breakbeat Sherpa.</p><p> It’s been four years since my feet first started moving to processed beats out of enjoyment rather than necessity, after someone stuck on the <strong>Andy C </strong>side of a Drum&Bass Arena mix at a house party, but I’m still a distinct, if enthusiastic, novice in the world of dance music. So when Replica started sending me his own mixes as and when they began appearing, by way of introducing me to what I might be missing, I suggested that we share the love with the world, and Crack in the Replica (see what we did there?!) was born.</p>\n<p>Why, then did this mix come into existence? “I’d love to tell you that my motivation was part of a higher calling to educate and expose you and the world to a largely misunderstood sub-culture,” says Replica, pint halfway to his lips, “but in truth, I just love to do it, I like to think people enjoy listening, and I had some time on my hands. Although,” he grins “if you want to believe the former, please do.”</p>\n<p>The term ‘Autonomic Movement’, from which Replica’s first CitR-exclusive mix takes its name, first came to my attention after <strong>dBridge </strong>and<strong> Instra:mental</strong> collaborated on <strong><em>Fabriclive 50</em></strong>. Obviously, pigeonholes like this are most artists’ worst nightmare, but Replica is keen to set the record straight. “This type of sound has been creeping into the breakbeat scene for a couple of years now,” he says, “it’s not necessarily new. It’s been dripping through the cracks for some time.” Always critical of a holier-than-thou, first on the scene attitude, I press him for more, and he relents a little. “I do believe that Fabriclive album was a real yardstick in terms of how far the sound, if you like, has come.” Getting into the swing of things, he volunteers a little more reverence, noting “Fabriclive 50 helped confirm and announce the existence of the style. If we are seeing the birth of a new ‘genre’, then that was certainly the water breaking. That’s why a lot of people are naming the genre after that mix. But I can’t see the label sticking.” he adds cautiously, wanting to preserve some sense of artistry. “It shows how fresh it is, that it’s even lacking a name. We’re all on a journey of discovery, no one knows what’s coming next.”  Here, Replica returns to a healthy sense of humility, a glimpse into his love for the artists that he mixes, and his genuine excitement at the sound that they exhibit. “This is a bunch of collective talents who are no longer willing to be hemmed in by genre defining elements,” he theorises, “The more creative and forward-thinking members of whom are finding new and interesting ways of expressing themselves. The results,” he cocks an eyebrow sarcastically, and hams up his voice for the occasion, just managing to control a smile, “are what you hear on this collection.”</p>\n<p>With that excitement in mind, I ask him what he thinks the sound and attitude that can loosely be grouped under the Autonomic umbrella means for breakbeat as a larger entity. “Honestly,” he replies, “I wouldn’t say it’s exciting at all for drum and bass. I think it will be greeted with the same passive acceptance that the dance community tacitly gives everything. And thank God.” I’m surprised at first, this coming from the man whose sense of forward-thinking, and joy at the prospect of evolution, is quite obvious. He goes on to clarify. “That doesn’t dishearten me at all. I think that sometimes, the best way to destroy something’s potential is to realise it.” I ask if he can explain further, so he presents an example. “Take dubstep as a case study. It exploded onto the music scene like a food fight in a cafeteria. When you consider its short journey from relative obscurity to obnoxiously brash commercialism, a considerable portion of its artistic credibility lived a fairly short life – the higher it flies, the harder it falls.” He pauses to drain the last of his beer, and studies the bottom of his empty glass. “I don’t wish the same fate on this music.”</p>\n<p>For all the dramatics, and after I’ve bought him a fresh pint, Replica’s still upbeat. “I think that the sounds you’ll hear in the mix stand as a shining testament to the mostly overlooked and underrated ability of ‘dance’ producers.” He says. “It’s a common misconception that it’s all paint by numbers and admittedly, a lot of material you’d hear on Johnny Everyman’s iPod will be a more than a little guilty of that, which in any case is arguably a by-product of success rather than anything.” I watch his earlier enthusiasm begin to return, considered and sure, and it’s thoroughly infectious. “I’ve just always thought of the breakbeat family as containing the most talented producers – the calibre is so high.” Replica smiles warmly. “This music really allows them to showcase their talent, flex their creative muscles and give us some real groundbreaking and innovative stuff to digest.”</p>\n<p>Does Replica think that the Movement has any sort of future? On this subject, the man waxes typically balanced. “It could be something ephemeral, or it could be a long and quiet existence” he notes, “I can certainly see it paving the way for new innovations, new influences and sounds – the thing that influences the people who influence the music scene as it is today. Certain aspects are right on point at the moment – the 80’s vibe in particular, we’re going to see a lot more of that I think.” At first I’m dubious. It feels like there’s been a strong tendency toward 80’s nostalgia in music for at least the last five or six years. But we’re not talking <strong>Calvin Harris</strong>‘ rose-tinted necrophilia here. It’s evident from Replica’s choice of opening track, <em>Invisible Cities </em>by Dutch producer <strong>Croms</strong>, that it’s an altogether more subtle take on the synths and decadent darkness of that era that he’s talking about.</p>\n<p>Whether the term ‘Autonomic’ is a genuine and empowering emblem, a lazy pigeonhole, or just a bit of a laugh between producers, Replica’s love of the sounds that have come to be grouped with it is happily obvious. “Whether or not the whole thing has, or indeed should, have legs, doesn’t matter that much to me,” he says, “it will always stand as a remarkable demonstration of what could have been.”</p>\n<p><object width=\"100%\" height=\"81\" classid=\"clsid:d27cdb6e-ae6d-11cf-96b8-444553540000\" codebase=\"https://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=6,0,40,0\"><param name=\"allowscriptaccess\" value=\"always\" /><param name=\"src\" value=\"https://player.soundcloud.com/player.swf?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F24049790\" /><embed width=\"100%\" height=\"81\" type=\"application/x-shockwave-flash\" src=\"https://player.soundcloud.com/player.swf?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F24049790\" allowscriptaccess=\"always\" /></object> <span><a href=\"https://soundcloud.com/replica101/autonomic-mix\">Autonomic mix</a> by <a href=\"https://soundcloud.com/replica101\">Replica101</a></span></p>\n<p>Tracklist:</p>\n<p>00:00 : Croms – Invisible Cities<br />\n06:02 : Instra:mental – End Credits<br />\n09:25 : Stray – Pushed<br />\n10:55 : D-Bridge – Love Hotel<br />\n12:26 : Alix Perez – 1984<br />\n15:04 : Mount Kimbie – Ode to Bear<br />\n17:55 : Royalston – The Test<br />\n20:44 : Alix Perez – Suffer In Silence feat. Zero T<br />\n23:33 : Nuage – Missing You<br />\n25:49 : Subreachers – Elysian Fields<br />\n28:27 : Kharm – White Picket Fences<br />\n30:20 : Riya – Seems Like<br />\n33:43 : Lung – Relapse<br />\n35:37 : Circa – Ida<br />\n38:00 : Burial – Fostercare<br />\n40:50 : Eleven8 – Colour Distance<br />\n44:05 : Jamie Woon – Wayfaring Stranger (Burial Mix)<br />\n48:06 : Scuba – You Got Me</p>\n<p>Photo © Joe Gilder</p>\n<p> </p>\n","slug":"11447-crack-in-the-replica-1-autonomic-movements","category":"interviews","date":1317383733000,"wpid":11447,"isSticky":false,"featured_image":{"width":900,"height":603,"src":"2011/09/replicalrg.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAYH/8QAIBAAAQMEAgMAAAAAAAAAAAAAAQIDEQAEEiEFMQYiMv/EABUBAQEAAAAAAAAAAAAAAAAAAAUG/8QAHBEBAAICAwEAAAAAAAAAAAAAAQIDAARBUaGx/9oADAMBAAIRAxEAPwDLPG+LZ41+6tXXEvFVqpZDafYT85ZCCdg66k7mpNRGRnuaUo3WsbJK9D9ym2qymojHiSeRz//Z"},"createdAt":1587293753738,"updatedAt":1588403546692,"author":"5e9b68b27a1236eccfeb1d3c","old_image":"2011/09/replicalrg.jpg","categories":["interviews","introducing","new","mixtapes","music"]}