{"id":"5e9c2e4e9b6559241525d801","artists":["5e9b69577a1236eccfeb2664"],"title":"Review: Thrice – Major/Minor","content":"<p><strong>Thrice</strong> hold a particularly special place in my heart.</p><p> Around the time <strong><em>The Artist in the Ambulance</em></strong> was released, I experienced something of an adolescent musical sea change, and that record was instrumental in steering me down the route I would take for the next few years. I ended my strict three year diet of ’90s grunge and, for better or worse, I devoured the loud guitars, raw-throated screaming, and general anguish (wait a minute…) of the burgeoning early noughties emo/post-hardcore scene. There were good bands, there were terrible bands, and there were <strong>Thrice</strong>. Whilst the majority of my favourite musical ensembles from that period have fallen by the wayside by dint of frankly poor recent output (<strong>Taking Back Sunday, Saves The Day, </strong>even the once-mighty <strong>Thursday</strong>…yeah, a lot of their names ended in ‘day’), <strong>Thrice </strong>have not only remained consistent in terms of quality, but they’ve struck determinedly out into the realms of invention and self-discovery. <strong><em>Vheissu </em></strong>completely ditched the metalcore influence present on its predecessors (which was immensely popular at the time, not to mention the fact that it became that way almost exactly around the time of release of <strong><em>Artist</em></strong>) for a moodier sound that practically eschewed hooks in favour of music boxes, Fender Rhodes and chain-gang chanting. Whilst <strong><em>The Alchemy Indexes</em></strong> were definitely patchy, even pretentious, it’s impossible to fault <strong>Thrice</strong>‘s sense of adventure, especially when they returned with an album as reigned in, focused and near-perfect as 2009’s <strong><em>Beggars</em></strong>.</p>\n<p>So here we are, seven albums in, with the California quartet’s latest offering, <strong><em>Major/Minor</em></strong>. Early reports of the record’s sound piqued my interest for reasons that will by now be clear to you, with frontman <strong>Dustin Kensrue </strong>quoting in <a title=\"It's definitely well alternative\" href=\"https://www.altpress.com/features/entry/in_the_studio_thrice/\">AP</a> that the album ‘definitely has some elements of underground ‘90s grunge’. Whilst it’d be an outright lie to suggest that <strong>Thrice </strong>have quite adopted the filth and sleaze of, say, <strong>Mudhoney</strong>, <strong><em>Major/Minor </em></strong>certainly fits into the (correct or incorrect) grunge template of ‘band with loud guitars and heaps of earnestness’. Which could have described <strong>Thrice </strong>at any point, but yeah, the chords that open <em>Blinded </em>are a little like an out of context <strong>Dinosaur Jr.</strong>, <em>Cataracts </em>bears a clear <strong>Soundgarden </strong>influence, and the thick leads on <em>Treading Paper </em>owe a debt to that well-documented Seattle sound.</p>\n<p>Musically, <strong><em>Major/Minor </em></strong>is certainly consistent. There’s few of the dynamic shifts that populated <strong><em>Beggars</em></strong>, and instead the new record is characterised by, for the most part, relatively straightforward rock music. It’s all carried out with the band’s usual sonic excellence – they’ve spent a long time dialling in the perfect instrumental tones, to the point where I’m not sure there’s a better guitar sound in contemporary rock music than <strong>Teppei Teranishi</strong>‘s thick, tensile crunch, and the whole thing exudes the perfect balance of polish and grit. But here’s the kicker – <strong><em>Major/Minor</em></strong>, for all its energy, feels rather staid and unremarkable, much like the latter stages of the musical movement it’s taken influence from. There are a few distinct standouts – <em>Call It In The Air </em>in particular serves as a reminder of how <strong>Thrice </strong>can be brilliant, switching up deftly between beautiful and brutal, and closer <em>Disarmed </em>provides a welcome change of pace and a touching farewell. But really, <strong><em>Major/Minor </em></strong>seems to have revealed most of its secrets by the closing section of second track <em>Promises – </em>big, crashing chords, overlayed by bright, ringing arpeggios from <strong>Teranishi</strong>.</p>\n<p>This would all practically be forgiveable, if it weren’t for the calibre of <strong><em>Major/Minor</em></strong>‘s lyrics. At times, they’re simply, vague, tautological and uninspiring – ‘if anything means anything, there must be something meant for us to be’ from the chorus of <em>Treading Paper </em>being an obvious example. But, perhaps inevitably, <strong>Dustin Kensrue </strong>seems to have finally strayed the wrong side of the didactic line. I have been listening to <strong>Thrice </strong>for eight years, and I’ve always been aware of, and perfectly comfortable with,<strong> Kensrue</strong>‘s moral leanings. Pitched right, as on <em>The Weight </em>from <strong><em>Beggars</em></strong>, his words depict a fierce and unwavering loyalty that’s often sadly (and at times, unforgivably) lacking in modern relationships. But on <em>Promises</em>, that song’s logical continuation, he reiterates the points he’s already made with so much fervour it becomes alienating. I’ll say it. I’m uncomfortable with evangelism, if not every facet of Christianity, and so by the time <strong>Kensrue </strong>roars ‘listen to me, though I speak of sober things’ on <em>Listen Through Me</em>, I can’t reconcile my own attitudes with <strong><em>Major/Minor</em></strong> any more. Perhaps it’s drastic, maybe this is just music, but that’s how I listen to records, especially records by <strong>Thrice</strong>.</p>\n<p>Whether I’ve finally grown out of <strong>Thrice </strong>or whether <strong><em>Major/Minor </em></strong>really is a weaker release than its predecessors is difficult for me to say. The band’s seventh album is certainly a solid modern rock record. But using <strong>Thrice</strong>‘s past successes and daring as a watermark, it’s difficult to elevate <strong><em>Major/Minor </em></strong>above anything much better than unremarkable. In the presence of so much lyrical guilt-tripping, the whole experience can be plain uncomfortable.</p>\n","slug":"11482-review-thrice-majorminor","category":"album-reviews","date":1316794239000,"wpid":11482,"isSticky":false,"featured_image":{"width":165,"height":165,"src":"2011/09/thrice__album_art_high_res-1024x1024-165x165.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFwAAAwEAAAAAAAAAAAAAAAAAAgYHCP/EAB4QAQABBQADAQAAAAAAAAAAAAECAAMEBREjUZPR/8QAFQEBAQAAAAAAAAAAAAAAAAAABAX/xAAWEQEBAQAAAAAAAAAAAAAAAAAAERL/2gAMAwEAAhEDEQA/AJLf0eynax+2sm7GURPE8KXXXZoo4eV8ZflbUlEB4B2i6+2pxe6//9k="},"createdAt":1587293774762,"updatedAt":1588403546999,"author":"5e9b68b27a1236eccfeb1d3c","old_image":"2011/09/thrice__album_art_high_res-1024x1024-165x165.jpg","categories":["album-reviews","music"]}