{"id":"5e9c2e499b6559241525d7f8","artists":["5e9b69637a1236eccfeb274e"],"title":"Review: Youth Lagoon – The Year Of Hibernation","content":"<p>It’s always mildly rewarding when a musician that you’ve been tipping for a while breaks into the world of mainstream recognition.</p><p> Since hearing the two debut tracks from Boise solo sensation <strong>Trevor Powers</strong> aka<strong> Youth Lagoon</strong>, way back in May, his debut record <strong><em>The Year Of Hibernation</em></strong> instantaneously became my most anticipated release of 2011. The epically fragile <em>July</em> and the more upbeat yet sincere<em> Cannons</em> modestly crept throughout the blogosphere, gradually charming and entrancing listeners the world over.</p>\n<p>After announcing his signing to <strong>Fat Possum</strong> and allowing another track to find it’s way into the grasps of eager bloggers, in the form of the angelic <em>Montana</em>, Powers disappeared for several months to ready his live show. Reemerging at the start of September, <em><strong>The Year Of Hibernation</strong></em> is set to hit the shops on Monday, and will no doubt be under close scrutiny.</p>\n<p><iframe style=\"position: relative; display: block; width: 400px; height: 100px;\" src=\"https://bandcamp.com/EmbeddedPlayer/v=2/track=3220424321/size=venti/bgcol=FFFFFF/linkcol=4285BB/\" frameborder=\"0\" width=\"400\" height=\"100\"></iframe></p>\n<p><strong>Power’s</strong> brand of lo-fi bedroom pop produces a sound so expansive that one could be forgiven for not believing that it’s entirely the work of one young man. Although not actually recorded in the confines of his own room, as many originally assumed, each track maintains a raw edge and appears gracefully under-produced. Album opener <em>Afternoon</em> works as a gentle introduction to <strong>Youth Lagoon’s</strong> music, showcasing the tender piano and the precarious vocals belonging to <strong>Powers</strong>. Often indecipherable at times, they verge upon spoken word, whilst remaining fantastically comforting.</p>\n<p>Throughout, the lyrics are honorably personal; whether it’s ‘<em>I have more dreams than you have posters of your favourite team</em>‘ (<em>Cannons</em>) or ‘<em>you wore a hoodless sweatshirt on your bed that night. with black leggings, I’ve never seen your face so white</em>‘ (<em>Montana</em>), each track tells a poetically soulful story. Since playing <em>July</em>, <em>Cannons</em> and <em>Montana</em> to death, I knew that to produce a record of similar quality would be an undeniably troublesome task. Amongst the new songs there are some glistening gems, the subdued album closer <em>The Hunt</em> and the piano led ballad <em>Seventeen</em> being prime examples.</p>\n<p>Where <em><strong>The Year Of Hibernation</strong></em> stutters ever so slightly is in the variety of songwriting, with several of the tracks following similar formula’s. However, it hardly drags the record down, and I’m convinced that <strong>Powers</strong> is more than capable of keeping his tracks original and engaging in the future. Album highlight <em>Montana</em> portrays this winning method in sublime style; melancholic verses crescendoing to a transcendent finale. ‘<em>There’s a spirit in Montana and in your chest, a note, that rings like the bells of cathedrals rung by the village scapegoat</em>‘ proving possibly the most emotionally stirring moment of the record.</p>\n<p><object width=\"100%\" height=\"81\" classid=\"clsid:d27cdb6e-ae6d-11cf-96b8-444553540000\" codebase=\"https://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=6,0,40,0\"><param name=\"allowscriptaccess\" value=\"always\" /><param name=\"src\" value=\"https://player.soundcloud.com/player.swf?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F14538159\" /><embed width=\"100%\" height=\"81\" type=\"application/x-shockwave-flash\" src=\"https://player.soundcloud.com/player.swf?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F14538159\" allowscriptaccess=\"always\" /></object> <span><a href=\"https://soundcloud.com/youth-lagoon/montana\">Montana</a> by <a href=\"https://soundcloud.com/youth-lagoon\">Youth Lagoon</a></span></p>\n<p>With the title stemming from personal experiences, the record feels as much like a diary as it does an honest insight. As an album, it’s delicate, poignant and divinely beautiful, showcasing exactly why <strong>Youth Lagoon</strong> have generated such astounding praise and astronomical expectations. With<em> <strong>The Year Of Hibernation</strong></em>, <strong>Powers</strong> will no doubt impress many; yet more importantly, it’s a record that will move people in a way that few artists are capable of. Whoever knew that such seemingly downcast, tender music could be so utterly inspirational?</p>\n","slug":"11492-review-youth-lagoon-the-year-of-hibernation","category":"album-reviews","date":1316813209000,"wpid":11492,"isSticky":false,"featured_image":{"width":900,"height":574,"src":"2011/09/youth-lagoonreview.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAGAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAMF/8QAIhAAAQQBAgcAAAAAAAAAAAAAAQACAxEhBBIFBhYxMoGR/8QAFQEBAQAAAAAAAAAAAAAAAAAABAX/xAAYEQADAQEAAAAAAAAAAAAAAAABAiEAA//aAAwDAQACEQMRAD8AyNHynFJC2YP3Aee5xBq6xXv6q9P8PGAH0MDsiKc/Z5cwqGF3/9k="},"createdAt":1587293769502,"updatedAt":1588403546905,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/09/youth-lagoonreview.jpg","categories":["album-reviews","music"]}