{"id":"5e9c2e3b9b6559241525d7e3","artists":["5e9b68e57a1236eccfeb1f50"],"title":"Review: Dan Mangan – Oh Fortune","content":"<p><a href=\"https://admin.</p><p>crackintheroad.com/music/11533-review-dan-mangan-oh-fortune/attachment/dan-mangan-oh-fortune-album-cover_digital/\" rel=\"attachment wp-att-11534\"><img class=\"alignleft size-singlepost wp-image-11534\" title=\"Dan Mangan Oh Fortune album cover_digital\" src=\"https://api.crackintheroad.com/uploads/2011/09/Dan-Mangan-Oh-Fortune-album-cover_digital-950x950.jpg\" alt=\"\" width=\"760\" height=\"760\" srcset=\"https://api.crackintheroad.com/images/2011/09/Dan-Mangan-Oh-Fortune-album-cover_digital-950x950.jpg 950w, https://api.crackintheroad.com/images/2011/09/Dan-Mangan-Oh-Fortune-album-cover_digital-165x165.jpg 165w, https://api.crackintheroad.com/images/2011/09/Dan-Mangan-Oh-Fortune-album-cover_digital-260x260.jpg 260w, https://api.crackintheroad.com/images/2011/09/Dan-Mangan-Oh-Fortune-album-cover_digital-640x640.jpg 640w, https://api.crackintheroad.com/images/2011/09/Dan-Mangan-Oh-Fortune-album-cover_digital.jpg 1417w\" sizes=\"(max-width: 760px) 100vw, 760px\" /></a></p>\n<p>Oh, Dan. What happened to you? What horrendous, depressing event was inflicted on you in the last few years? In the past, the albums of Canadian folk artist <strong>Dan Mangan </strong>have hardly been easy-listening, and sure, there was always an underlying sense of sadness to the way that Mangan composed his songs, but it was done in a way that kept things optimistic. What we have here in <strong><em>Oh Fortune </em></strong>is something even grimmer, darker, and really rather more depressing.</p>\n<p>The contrast with past albums that is initially more obvious though, is the instrumental composition of each song on the album. From the opening track, <em>About As Helpful As You Can Be Without Being Any Help At All</em>, which features Mangan’s trademark voice backed by what could very well be a full orchestra, it’s clear that the formula used on past albums – instrumentation taking a backseat to Mangan’s vocal work – has, if not quite been abandoned, certainly been altered. That is not to say, however, that the vocals on <strong><em>Oh Fortune</em></strong> are any worse for wear – much of his previous success has been based on his incredibly powerful voice, and that voice is just as strong on this record as ever – most recognisably in <em>Daffodil</em>, a minimalist, downbeat track that comes out as one of the album’s best – but the instrumentalisation of <strong><em>Oh Fortune</em></strong>, unlike past albums, goes past a few trumpets and the twang of an electric guitar and into orchestral/full-band territory.</p>\n<p>Lyrically, <em><strong>Oh Fortune</strong></em> is (to put it bluntly) extremely downbeat. Although Mangan’s previous works were hardly sunshine and roses when it came to his storytelling, there was always a strange sense of charm and even a little bit of humour to the way he sang. Here, there is nothing of the sort. From “<em>Cast out to see/Friendly with waves/There were sharks beneath me/Hungry for meat”</em> to Mangan asking “<em>Should the daylight forgive the awful things that I did?”,</em> it seems pretty clear that the charm is dead. This is, of course, not necessarily a bad thing – replacing the mixture of charm and sadness is all-out melancholy, and had Mangan kept to the instrumental style of <em><strong>Nice, Nice, Very Nice </strong></em>and <strong><em>Postcards and Daydreams</em></strong>, it might not have worked quite so well. Luckily, the addition of large backing vocal sections (such as in <em>Rows of Houses</em>) strings (as in <em>About As Helpful…</em>) and just a little bit of vocal manipulation (<em>Daffodil)</em>, means that the album presents a radical enough change in musical direction to justify a descent into the lyrical pit of despair.</p>\n<p>All in all, then, this isn’t music to listen to on a sunny day when you’re feeling good. <strong><em>Oh Fortune</em></strong> never, unfortunately, throws out a truly <em>Robots</em>-esque classic either. However, the change in musical direction makes the album intruiging enough, and some tracks (such as <em>Daffodil, Oh Fortune </em>and <em>Rows of Houses</em>, for example) do stand out as being particularly brilliant. This adds up to an album which, though never quite reaching the heights of <strong><em>Nice, Nice, Very Nice</em></strong>, is absolutely worth a listen – or, if you’re feeling down, ten.</p>\n<p><a href=\"https://admin.crackintheroad.com/music/8705-exclusive-unplugged-session-dan-mangan/\" target=\"_blank\">Check out <strong>Dan Mangan’s </strong>acoustic session (including <strong>Oh Fortune</strong>) for us this Summer.</a>   </p>\n","slug":"11533-review-dan-mangan-oh-fortune","category":"album-reviews","date":1317323558000,"wpid":11533,"isSticky":false,"featured_image":{"width":165,"height":165,"src":"2011/09/dan-mangan-oh-fortune-album-cover_digital-165x165.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAABAUH/8QAJBAAAQMEAAYDAAAAAAAAAAAAAQIDEQAEBRITFiEiMUFykdH/xAAUAQEAAAAAAAAAAAAAAAAAAAAG/8QAGhEAAgMBAQAAAAAAAAAAAAAAAhEAAQQDUf/aAAwDAQACEQMRAD8A08ZlDl6w/c4y2e4Kd2Fg6qRPuT4+qTzkx6xzkfIflRMeSu3uNyVa2piesdoobKiWUEkzqKBkVtOL+eHMQuw8n//Z"},"createdAt":1587293755964,"updatedAt":1588403546718,"author":"5e9b68b27a1236eccfeb1d16","old_image":"2011/09/dan-mangan-oh-fortune-album-cover_digital-165x165.jpg","categories":["album-reviews","music"]}