{"id":"5e9c2e3d9b6559241525d7e6","artists":["5e9b69047a1236eccfeb216b"],"title":"Review: Into It. Over It. – Proper","content":"<p>Much like their name, <strong>Into It.</p><p> Over It. </strong>(or rather, Chicago native <strong>Evan Weiss</strong> and friends) are a band of two halves. Amongst the boyish excitement and rampant sentimentality of <a title=\"Crikey, I did let go a bit. Sorry about that.\" href=\"https://api.crackintheroad.com/music/10510-new-into-it-over-it-where-your-nights-often-end/\">my last post concerning IIOI</a>, I mentioned Weiss’ fitting position on a bill between pop-punkers <strong>Grown Ups</strong>, and <strong>Shoes and Socks Off</strong>‘s skewed take on the singer/songwriter trope. In the case of Weiss’ last ‘album’ (that is, a release that wasn’t a split), <strong><em>52 Weeks</em></strong>, this was evidenced by the literal division in the sound of its tracks. One minute he’d be right next to the mic, fingerpicking and shrouded in static, and the next rocking out with amps turned up loud and a full band’s worth of instruments behind him. On <em><strong>Proper</strong></em>, the first…er…proper IIOI album, that effective middle ground is still occupied, if a little more subtly.</p>\n<p>Sonically, <strong><em>Proper </em></strong>is a pretty damn watertight release. Getting Ed Rose, longtime collaborator with <strong>The Get Up Kids</strong>, to man the desk for the album has proved an excellent choice. Every track on <strong><em>Proper </em></strong>sounds absolutely perfect, and considering that the<strong></strong> homegrown acoustic textures which populated much of <em><strong>52 Weeks</strong></em> have largely been replaced by Weiss’ occasionally techy, pop-punk leanings, it’s to <em><strong>Proper</strong></em>‘s benefit that everything has been polished up and pushed forward, where Weiss’ further forays into that style on the <em><strong>Twelve Towns </strong></em>songs sometimes lacked extra punch. Upbeat tracks like <em>Discretion and Depressing People </em>or<em> An Evening With Ramsay Beyer </em>exhibit the wealth of Rose’s experience, and indeed the instrumental prowess of Weiss and drummer/<strong>Castevet </strong>guitarist<strong> Nick Wakim</strong>, who lock in with each other at a particularly satisfying level of tightness.</p>\n<p>A significant part of IIOI’s appeal on previous releases, bar the conceptual hijinks, is the sense of intimacy that Weiss is capable of creating. Whether through quiet instrumentation and bedroomesque recording<em></em>, heavy use of first names and personal references, or engaging with his hometown’s neighbourhoods on the <strong><em>IIOI/KOJI </em></strong>split, Weiss has always concerned himself with the particularly personal. Similarly, the very process that begat <strong><em>52 Weeks </em></strong>fostered a distinct sense of personality – each week’s events and feelings found themselves channeled intensely and specifically into a single song. On first glance, it can seem that much of this intimacy isn’t present on <strong><em>Proper</em></strong>, lost amid the shiny mix and loud guitars. Similarly, Weiss’ lyrics, whilst hardly buried in abstraction this time around, aren’t quite so self-referential as before. Originally, it seemed that this fresh distancing was to <strong><em>Proper</em></strong>‘s detriment, but it’s actually quite the opposite.</p>\n<p>Firstly, it would be preposterous of me to suggest that there are no reflective moments on <strong><em>Proper</em></strong>. <em>Where Your Nights Often End</em>, the very track my last post concerned, has that intimacy in spades (and, as an aside, has simply failed to get old in any way at all in the month between first hearing it and <strong><em>Proper</em></strong>‘s release), and the same goes for a considerable number of the record’s cuts, the touching minute and a half snapshot of <em>No Good Before Noon </em>and <em>Connecticut Steps</em>‘ aching vulnerability among them. The midtempo <em>Midnight: Carroll Street</em> actively benefits from Rose’s more buoyant recording techniques, ending as it does in a fuzzy crescendo with Weiss yelling ‘you will find me’ beneath layers of warm overdrive, which is given a cinematic quality that wouldn’t have been as distinct before. <em>The Frames That Used To Greet Me</em>, which quietly lets itself out at the record’s close, provides <em><strong>Proper</strong></em>‘s first and final exhibition of that gentle acoustic sound that I was first introduced to Weiss with. At a hair over two minutes long, and after a record that’s louder (in a confined space, at least) than IIOI have ever done before, the song has far more effect than if it were placed on a record full of other songs like it.</p>\n<p>This is, after all, IIOI’s debut ‘proper’. And rather than simply being a generic label and obvious signpost for the status of the record, the title carries just as much conceptual baggage as those of the IIOI records that came before it. It’s a normal-length set of songs from Weiss, released on a single record, recorded by a single producer with a long history of working with similar artists. Where <em><strong></strong></em><strong><em>52 Weeks’ </em></strong>recording process and <em>raison d’etre </em>meant that it often came off self-referential and close, <em><strong>Proper</strong></em> does’t have any obligation, conceptual or otherwise, to be that way. Instead, it stands out as an exceptional set of adult pop-punk songs, which show their creator still successfully playing around with the boundaries of a genre that can often be facile and uninventive, while retaining its sense of emotional immediacy.</p>\n<p><strong><em>Proper </em></strong>is out now on <a title=\"YOU BUY IT\" href=\"https://nosleeprecs.com/release.php?id=83\">No Sleep Records</a>.</p>\n","slug":"11550-review-into-it-over-it-proper","category":"album-reviews","date":1317297540000,"wpid":11550,"isSticky":false,"featured_image":{"width":500,"height":500,"src":"2011/09/iioiproper.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFwAAAwEAAAAAAAAAAAAAAAAABAUGB//EACMQAAECBQMFAAAAAAAAAAAAAAECAwAEBRESISIxBgcjUWH/xAAUAQEAAAAAAAAAAAAAAAAAAAAA/8QAFBEBAAAAAAAAAAAAAAAAAAAAAP/aAAwDAQACEQMRAD8AuOhaopVOm2pmpidW09hiG8QwMEkI1JvpY3+wYupNZq3DmMz7fqUE14gkEzoub8+FuGTi15q3K59wH//Z"},"createdAt":1587293757450,"updatedAt":1588403546744,"author":"5e9b68b27a1236eccfeb1d3c","old_image":"2011/09/iioiproper.jpg","categories":["album-reviews","music"]}