{"id":"5e9c2e389b6559241525d7dd","artists":["5e9b695d7a1236eccfeb26fe"],"title":"Live Review and Interview: Wheatus","content":"<p><a href=\"https://admin.</p><p>crackintheroad.com/music/11587-live-review-and-interview-wheatus/attachment/wheatusarticlegordonbibby/\" rel=\"attachment wp-att-11588\"><img class=\"alignnone size-singlepost wp-image-11588\" title=\"wheatusarticlegordonbibby\" src=\"https://api.crackintheroad.com/uploads/2011/09/wheatusarticlegordonbibby-950x625.jpg\" alt=\"\" width=\"950\" height=\"625\" srcset=\"https://api.crackintheroad.com/images/2011/09/wheatusarticlegordonbibby-950x625.jpg 950w, https://api.crackintheroad.com/images/2011/09/wheatusarticlegordonbibby-260x171.jpg 260w, https://api.crackintheroad.com/images/2011/09/wheatusarticlegordonbibby-640x421.jpg 640w, https://api.crackintheroad.com/images/2011/09/wheatusarticlegordonbibby-165x108.jpg 165w, https://api.crackintheroad.com/images/2011/09/wheatusarticlegordonbibby.jpeg 954w\" sizes=\"(max-width: 950px) 100vw, 950px\" /></a></p>\n<p>Although it was possibly the oddest line-up Dundee had ever seen; Sundays gig at Dexters has to have been the densest crowd I have ever been a part of, and perhaps one of the best. Once the first act had finished, who were so memorable I have already forgotten how many members were in it, let alone their name, the real music began.</p>\n<p>The next two acts <strong>Math the Band </strong>and <strong>MC Frontalot </strong>define themselves as ‘electro-punk spazz’ and ‘nerdcore hip-hop’ respectively, and the confusing titles have nothing on the nature of the acts. <strong>Math the Band </strong>are a male-female duo who use several video games systems including a Commodore 64 and a Gameboy, as well as drums, keys, synths, guitar and both vocals during every song. The mind boggles when they’re on stage, the noise they can muster between the two of them surpasses that of most 5-piece bands and with great talent and passion too.</p>\n<p><strong>MC Frontalot</strong>, self proclaimed 579<sup>th</sup> best rapper in the world, really excited the crowd with songs such as <em>Tongue-Clucking Grammarian </em>and <em>Goth Girl</em> and again it is really hard to put into words what this man achieved, especially with the backing of disguised <strong>Wheatus </strong>members playing their regular instruments. Both these acts were truly phenomenal in their own right and set the scene perfectly for the band who has the 4<sup>th</sup> highest selling rock song of the 21<sup>st</sup> century, <strong>Wheatus</strong>.</p>\n<p>I am very thankful I was not one of the people who came to see one song, i’ll let you guess which one, as I was reminded throughout the set that <strong>Wheatus </strong>are much more than a band with one song in its repertoire. Playing songs such as <em>Hump’em N’ Dump’em</em>, <em>Leroy</em>, and <em>Truffles</em> took me back to when I bought this album over a decade ago and I am so very thankful that a large chunk of the crowd remembered these songs too as it made for such a memorable evening. The band themselves appeared to really enjoy themselves too, playing along with the very Scottish chant of ‘Here we Fucking Go’ and constantly stating what I have already been told (see the previous interview) of how much they love Scotland and its people.</p>\n<p>In a controversial move perhaps designed to frustrate the people who were only there for one song, <em>Teenage Dirtbag </em>was cut up into sections as <strong>MC Frontalot </strong>came back on stage and sang a small piece and the band stopped at various points to chat to the audience. I personally enjoyed the way they performed this song, they added suspense to the infamous “<em>I’ve got two tickets to Iron Maiden baby…” </em>section of the song and in my opinion it made the event of that song being played much more dramatic. Overall the entire gig was a rousing success and a night much surpassing my expectations. Before the gig I managed to have a chat with frontman Brendan Brown as a follow-up to the previous interview:</p>\n<p><strong>CitR: You mentioned you are playing a cover song in your set during this tour, could you now reveal what it is?</strong></p>\n<p>We don’t really have set-lists, we go on what the crowd asks for but the cover is <em>My Name is Jonas</em> by <strong>Weezer.</strong></p>\n<p><strong>CitR: Your song </strong><em><strong>Wannabe Gangster </strong></em><strong>includes a cameo by Bruce Dickinson and in other songs you reference Iron Maiden a lot, are you a big fan of the band or is it all coincidence?</strong></p>\n<p>I listened to Maiden, Rush and Metallica growing up so I love the band. Working with Bruce was great He is a real renaissance man; a pilot a fencing expert and a real knowledgeable dude.</p>\n<p><strong>CitR: How has the tour started so far, have there been any stand out gigs as yet?</strong></p>\n<p>Well we have played Derby, Hatfield, Kingston and a few more, but Kingston has been the best so far, 1800 people and really high energy.</p>\n<p><strong>CitR: Have you got any famous fans that you know of?</strong></p>\n<p>Roger Daltrey asked us to go to a hospital for cancer sufferers that he is a part of which was a great honour. I think <strong>The Who </strong> are the best British band ever. <strong>James </strong>who sing (sings) ‘Oh sit down, Oh sit down, sit down next to me’ are also really good guys. Oh and Kylie came up to us and said hi at the Top of the Pops awards a while ago.</p>\n<p><strong>CitR: You seem to cover songs and get songs covered by Weezer, are you two bands close?</strong></p>\n<p>I have chatted to Rivers a bit on twitter but otherwise that is about it. I really like the B-side to the Red Album called Miss Sweeney.</p>\n<p><strong>CitR: You seem to have a lot of Scottish references to your songs such as in </strong><em><strong>Sunshine </strong></em><strong>there is a line ‘under my kilt’, and in the past interview you have said how much you love the country. Have you Scottish ancestry at all?</strong></p>\n<p>Actually I have Irish ancestry and an Irish citizen I just really like Scotland and it is the best place to do shows.</p>\n<p><strong>CitR: How do British festivals and shows compare to those in the USA?</strong></p>\n<p>Festivals are more standardised here, more steady. Different crowds too but I wouldn’t say either were better or worse than the other.</p>\n<p><strong>CitR: </strong><em><strong>Story of the Eggs </strong></em><strong>appears to be more laid back and less frantic than a lot of your old songs, what are the reasons behind this?</strong></p>\n<p>Well the types of stories are much darker now, check the comic books. The whole Jupiter EP is dark.</p>\n<p><strong>CitR: Obvious question, how did you come up with the name Wheatus?</strong></p>\n<p>My Dad called me and my siblings it as children, its a devolution of the word ‘little’.</p>\n<p><strong>CitR: What are the best support acts you’ve had, or any band you feel should get increased notoriety?</strong></p>\n<p><strong>Math the Band </strong>and <strong>MC Frontalot </strong>who are on tour with us now are really great. Also <strong>Matt and Kim </strong>and <strong>Bomb the Music Industry! </strong>too are really good. Although it was possibly the oddest line-up Dundee had ever seen; Sundays gig at Dexters has to have been the densest crowd I have ever been a part of, and perhaps one of the best…</p>\n","slug":"11587-live-review-and-interview-wheatus","category":"interviews","date":1317396486000,"wpid":11587,"isSticky":false,"featured_image":{"width":165,"height":165,"src":"2011/09/wheatusarticlegordonbibby-165x165.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAABgQH/8QAJhAAAQMCBgAHAAAAAAAAAAAAAQIDIQQRAAUGEhNBBxQxQlFxsf/EABUBAQEAAAAAAAAAAAAAAAAAAAQF/8QAGhEAAgIDAAAAAAAAAAAAAAAAAgMAAQQREv/aAAwDAQACEQMRAD8AGeKOpmMz1cw5QMGg8vT3e2ob5G1+hQrpaO5g3gi8ZDUVi1vuK4im6ibBG0Cfjr6wo1MAvMnCsBRNOq5M3hWI2QOFuPaPzEvGEVKHVRbK6Kf/2Q=="},"createdAt":1587293752217,"updatedAt":1588403546667,"author":"5e9b68b27a1236eccfeb1d07","old_image":"2011/09/wheatusarticlegordonbibby-165x165.jpg","categories":["interviews","live-reviews","music"]}