{"id":"5e9c2e349b6559241525d7d4","artists":["5e9b69117a1236eccfeb2234"],"title":"Review: La Dispute – Wildlife","content":"<p>Call me impressionable, but I’m a real sucker for the whole <a title=\"Because writers just LOVE a scene to cling desperately to.</p><p>..\" href=\"https://www.caughtinthecrossfire.com/music/la-dispute-interview/\">Wave</a> thing that’s been going on the last few years. That it’s a fairly tongue-in-cheek term coined by <strong>La Dispute </strong>doesn’t really sap my faith in it at all – if anything, I think it offsets the earnestness of the bands under its umbrella (<strong>Defeater</strong>, <strong>Make Do And Mend</strong>, <strong>Pianos Become The Teeth </strong>and <strong>Touché Amoré </strong>included), reminding us that amongst all the explosive guitars, heart-on-sleeve lyricism and schizoid, razor-throated yelling, these are bands who really don’t mind too much about poking fun at themselves, creating something that feels more like a bunch of buddies enjoying themselves than an exclusive clique. And with that, The Wave (whether or not it had actually been named) has made listening to contemporary post-hardcore OK again, after years of largely boring, insubstantial efforts from genre newcomers, replacing teary-eyed sentimentality with intelligence and grit. This year has already seen stellar full-length releases from Defeater and Touché, and with another coming (hopefully) from Pianos in November, it’s up to La Dispute to fill the void between now and then.</p>\n<p><strong><em>Wildlife</em></strong> is presented as a collection of unpublished short stories, boundaried by four interjections from their author. The conceptual approach has been explored by Defeater as well, highlighting the tendency toward musical adventure that places the Wave bands so highly in my estimations. That said, <em><strong>Wildlife </strong></em>has learned (whether consciously or not) from the mistakes of all the overblown prog records that have come before it, and the album never engages with its format to the expense of its songs.<em> Safer in the Forest – Love Song for Poor Michigan </em>is a particular highlight, which comes across all <em>Paint It Black </em>(really) at first, but thanks to the progression of its intertwined arpeggios and a delightfully fidgety almost-Amen from drummer Brad Vander Lugt, it retains a masterful sense of pent-up nerve that only finds release when absolutely necessary. Similarly, album centrepiece <em>King Park</em>, <strong><em>Wildlife</em></strong>‘s longest cut at five seconds shy of seven minutes, does much better than its counterpart on <strong><em>Somewhere At The Bottom Of The River Between Vega And Altair</em></strong>, <em>The Last Lost Continent </em>, at building tension – there’s not a moment of overindulgence on the band’s part, or boredom on ours, at any point during the song’s progress. Jordan Dreyer proves that he’s as apt a storyteller as the record’s nameless author, recounting the shootings around which the song is centred with characteristic verve. As the band’s stuttering noise builds at the song’s close, Dreyer breathlessly repeating ‘can I still get into heaven if I kill myself?’, it’s utterly convincing, the desperate moral questioning of a scared young man who knows he’s on the brink of death, one way or another.</p>\n<p><iframe style=\"position: relative; display: block; width: 400px; height: 100px;\" src=\"https://bandcamp.com/EmbeddedPlayer/v=2/track=3687987895/size=venti/bgcol=FFFFFF/linkcol=4285BB/\" frameborder=\"0\" width=\"400\" height=\"100\"></iframe></p>\n<p>Occasionally, Dreyer’s voice does stray just a little <em>too </em>close to Aaron Weiss’, on the quieter moments of <em>a Poem </em>in particular. The frontman’s vocals have long been the aspect of La Dispute that the majority of the band’s detractors cite as their primary issue, and certainly Dreyer forces his way into your ears with unprecedented changes in style, from wild-eyed, stream of consciousness slam poetry to brokendown sobbing to tonsil-rending screams. It’s understandable that this isn’t to everyone’s taste, but on a personal level, I’ve always enjoyed Dreyer’s take-no-prisoners style, and if anything, it works to much better effect on <strong><em>Wildlife </em></strong>than La Dispute’s debut, by virtue of the new release’s lyrics. On <strong><em>Somewhere…</em></strong> the songs were often focused around those ubiquitous relationship-based themes, with countless uses of ‘darling’, and tearfully resigned lines like ‘if I can’t love you as a lover, I will love you as a friend’. As such, the record’s songs were occasionally rendered a little too emotionally fraught by Dreyer’s delivery. However <strong><em>Wildlife</em></strong>‘s ambitious intentions are carried as much by the words that populate its tangled structure as the twisting sonic turbulence that’s built it. <em>I See Everything </em>details the terrifying decline of a seven year old with cancer, through the device of journal entries written by the writer’s teacher in 1980, which she later reads to her class. In the hands of a vocalist without Dreyer’s conviction and dramatic bent, the song could sound maudlin or trite. But frankly, I’m not sure there’s anyone else who could make a list of dates sound so damn vital – I’d never gotten goosebumps from the words ‘April twelve’ until now. Likewise, we’re viewing the issue at hand through so many fractured lenses – a boy dies of cancer, his last months are written about, then read out loud years later, then recounted with a personal spin by a fictional writer, then vocalised for us by La Dispute. It’s a stunningly multifaceted, literary take on post-hardcore that’s exemplary of the band and <em><strong>Wildlife</strong></em> as a whole.</p>\n<p><iframe style=\"position: relative; display: block; width: 400px; height: 100px;\" src=\"https://bandcamp.com/EmbeddedPlayer/v=2/track=2811824501/size=venti/bgcol=FFFFFF/linkcol=4285BB/\" frameborder=\"0\" width=\"400\" height=\"100\"></iframe></p>\n<p>Happily, <strong><em>Wildlife </em></strong>easily hits the watermark set earlier this year by <strong><em>Parting The Sea Between Brightness and Me </em></strong>and <strong><em>Empty Days and Sleepless Nights</em></strong>. Debating which release is the best would be counterproductive in this situation, but in terms of its individual merit, <strong><em>Wildlife </em></strong>succeeds by building on the sounds exhibited on <strong><em>Somewhere At The Bottom</em></strong>…, and pitting them against a potentially restrictive structure, that in fact finds the band the perfect engineers for its evolution. Where it loses some of the more immediate thrills of La Dispute’s debut full length, <strong><em>Wildlife </em></strong>shows itself to be the assured creation of a band who are opening up avenues of experimentation in what had become a relatively desolate area of musical landscape.</p>\n<p><strong><em>Wildlife </em></strong>is out now on <a title=\"I'm a jobless writer, so I can't buy it. You totally should. No, what on earth's a 'hypocrite'?\" href=\"https://nosleeprecs.com/release.php?id=84\">No Sleep Records</a>. The Wave Tumblr can be found <a title=\"Props to them, for serious bands, they sure do know how to raise a smile\" href=\"https://fuckyeahthewave.tumblr.com/\">here</a>. <em>King Park </em>can be streamed below.</p>\n<p><iframe style=\"position: relative; display: block; width: 400px; height: 100px;\" src=\"https://bandcamp.com/EmbeddedPlayer/v=2/track=94565983/size=venti/bgcol=FFFFFF/linkcol=4285BB/\" frameborder=\"0\" width=\"400\" height=\"100\"></iframe></p>\n","slug":"11615-review-la-dispute-wildlife","category":"music","date":1317724528000,"wpid":11615,"isSticky":false,"featured_image":{"width":950,"height":950,"src":"2011/10/front_cover__wildlife_-950x950.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAABgf/xAAkEAACAgEDAgcAAAAAAAAAAAABAgMEEQAFEgYxByEiJEFCUv/EABQBAQAAAAAAAAAAAAAAAAAAAAT/xAAbEQABBAMAAAAAAAAAAAAAAAAAAQIREgMxYf/aAAwDAQACEQMRAD8AFeHL0bHS92a5YnltRTrOKJl9MrKCEKqft3+dT7cUhfcLTxI6xtKxVWdcgZOAdVyjWgarPyhiPHAGUHkMDR56dbm3t4e/4GjW4LZhtMro/9k="},"createdAt":1587293748501,"updatedAt":1588403546587,"author":"5e9b68b27a1236eccfeb1d3c","old_image":"2011/10/front_cover__wildlife_-950x950.jpg","categories":["music","reviews"]}