{"id":"5e9c2e2a9b6559241525d7c2","artists":["5e9b69577a1236eccfeb2654"],"title":"Review: The-Dream (Terius Nash) – 1977","content":"<p>Those of you who frequent <strong>Pitchfork</strong> will no doubt have been exposed to the downtempo, hip hop vibes of Toronto’s <strong>The Weeknd</strong>.</p><p> Personally, I haven’t quite bought into it yet; finding it rather sickly sweet, not to mention unappealingly sleazy. One such producer-come-songwriter whom I have warmed to however is North Carolina born maestro <strong>The-Dream</strong>, otherwise known as <strong>Terius Nash</strong>. With production credits on records including <strong>Jay-Z & Kanye West</strong>, <strong>Beyonce</strong> and<strong> Bieber</strong>, it’s fair too say that Nash sits atop the glittering pinnacle of his game.</p>\n<p>With his three albums to date, all released through <strong>Def Jam</strong> and reaching the top 40 in the US charts,<strong> The-Dream</strong> has made an 11 track ‘mixtape’ available for free download. Entitled <em><strong>1977</strong></em>, after the year he was born, it’s a deeply insightful glance into the life of a millionaire hip hop star. Lead track <em>Long Gone</em> is an R’n’B classic, owing much to<strong> R Kelly’s</strong> <em>Trapped In The Closet</em> series; documenting the emotional turmoil of a fractured relationship.</p>\n<p>In fact, relationships are a dominating theme throughout the record, dealing with jealously, spite and harrowing pain. <em>Wedding Crashers</em> is an intoxicated tale of longing and despair, with <strong>Nash</strong> contemplating questioning a bride-to-be (and presumably ex) at the altar. With the way that celebrity lifestyles are portrayed, many people lose touch with the emotional reality that harbour our true feelings, and it’s this that <strong>The-Dream</strong> exploits. Swinging from the grossly exaggerated <em>This Shit Real Nigga</em>, featuring <strong>Pharrell Williams</strong> and boasting about buying <em>‘a Porsche off the internet’</em> and <em>‘a house from the toilet’</em> to the beautifully tender <em>1977 (Miss You Still)</em>, an ode to <strong>Nash’s</strong> late mother.</p>\n<p>As to be expected, the production is immaculate throughout; slick and focused, allowing the vocals to hit home, especially on the more soulful tracks. The aforementioned <em>1977 (Miss You Still)</em> is comfortably one of my favourite’s from 2011 thus far, proving admirably heartwarming. Paraphrasing <strong>Jay-Z’s</strong> <em>Song Cry</em> – <em>‘if you can’t see the tears running down my eyes, I guess I’ve got to make this song cry’</em>, Nash understands the implications of penning a ballad about the loss of his mother, yet realises exactly how to convert their unique mother to son bond into a stirring musical creation. If you only listen to one track from <em><strong>1977</strong></em>, make sure that it’s <em>Miss You Still.</em></p>\n<p><iframe src=\"https://www.youtube.com/embed/P5ewdNjK52A\" frameborder=\"0\" width=\"560\" height=\"30\"></iframe></p>\n<p>So as a free mixtape, it’s an undeniable success, proving stronger than a vast majority of R’n’B full length records. <strong>The-Dream</strong> succeeds where <strong>The Weeknd</strong> and<strong> Frank Ocean</strong> slip up, in managing to balance songwriting ability with production duties, whilst maintaining unrivalled quality throughout an entire release. The variety showcased on <em><strong>1977</strong></em> opens doors that had previously been securely locked with regards to <strong>Nash’s</strong> brand of silky smooth hip hop, a trait that is both magnificent to experience, and greatly exciting for future releases.</p>\n<p><strong><em>1977</em></strong> is available to download for free from <a href=\"https://radiokillarecords.com/\" target=\"_blank\">here</a>.</p>\n<p> </p>\n","slug":"11638-review-the-dream-terius-nash-1977","category":"album-reviews","date":1317843092000,"wpid":11638,"isSticky":false,"featured_image":{"width":165,"height":114,"src":"2011/10/the-dream-1040x724_2-165x114.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAUI/8QAIRAAAgEDBQADAAAAAAAAAAAAAQIDAAQRBQYSEzEHIUH/xAAUAQEAAAAAAAAAAAAAAAAAAAAA/8QAFBEBAAAAAAAAAAAAAAAAAAAAAP/aAAwDAQACEQMRAD8An6J83XB3Su4b6BhHcPHps1qsjsoVV5mVQTgHJH0PcH9NaElOpTSPJbzWHS5LJz7A3E+ZwPcUpQf/2Q=="},"createdAt":1587293738086,"updatedAt":1588403546430,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/10/the-dream-1040x724_2-165x114.jpg","categories":["album-reviews","mpfree","music"]}