{"id":"5e9c2e279b6559241525d7bc","artists":["5e9b68d47a1236eccfeb1e32"],"title":"Review: Rinse 16: Ben UFO","content":"<p>A far as “massive” mixes go, these days you can either go two ways: a selfish mix for your own vanity and gain, or one for the people.</p><p> There have been a few high-profile mixes this year, some all <strong>Pete Tong</strong>-laden (<strong>Buraka Som Sistema</strong>, <strong>Kode9</strong>, <strong>Julio Bashmore</strong>) or the brilliant FACT mix series (too good many to mention). Others have been sold: <em>FabricLive</em> mixes (<strong>Ramadanman</strong>, <strong>Jackmaster</strong>, <strong>Four Tet</strong>) or <em>DJ-Kicks</em> for <strong>!K7</strong> (<strong>Apparat</strong>, <strong>Scuba</strong>, forthcoming <strong>Gold Panda</strong>). What’s interesting about the <strong>Rinse </strong>mix series is that they’re a pirate radio station pushing a commercial, purchasable mix on people. I suppose they have to get their profit from somewhere, but you can’t help thinking most of their mixes are just released for the sake of it.</p>\n<p>The difference with <strong>Ben UFO</strong>’s latest is he is not a producer, therefore this is likely not to be a vanity project. He’s the co-founder of the mighty <strong>Hessle Audio</strong> alongside <strong>Pangaea</strong> and <strong>Pearson Sound</strong>, yet all he can do is spin. Then again, that’s all he should be doing, because he is one talented individual. He’s often compared against contemporaries <strong>Oneman</strong> and <strong>Jackmaster</strong>, all three championed as <em>the</em> DJ’s of our generation.</p>\n<p>Not since <strong>Alexander Nut</strong>’s effort in ’09 has a Rinse mix been so impressively diverse. Starting things off with beautiful techno/house cuts from <strong>Aaron Carl</strong> and <strong>Kassem Mosse</strong>, things are set to be casual. It soon becomes apparent we’re going to be thrown around quite a bit by the time <strong>Dro Carey</strong>’s weird and wonderful aural highs pop up. More familiar territory grounds the mix, with turns from Dutch genius <strong>2562</strong>, <strong>Jam City</strong>, and <strong>Objekt</strong>. This is also about working together – collaborative tracks from <strong>Pariah</strong> and <strong>Blawan</strong>, <strong>Boddika</strong> and <strong>Joy Orbison</strong> – and contrasts – <strong>Champion</strong> back-to-back with <strong>Actress</strong>? <strong>General Levy</strong> in the same tracklist as <strong>How To Dress Well</strong>? Only here.</p>\n<p>The diversity of the mix is astonishing, and it’s interesting how there is no hierarchy to the maturity on show – here, <strong>Carl Craig</strong> is just as relevant as <strong>Bok Bok</strong>. It’s evident this mix is full as heavy hitters, and is probably as good as you can get in terms of mix of the year. Huge club tunes up against lesser-knowns and garage rarities make this an exciting listen. This somehow manages to seem child’s play to <strong>Ben UFO</strong>, but it caters perfectly to the current club climate – a great mix, and possibly one worth the price tag. Not going to be put in a time capsule I’m sure, but good enough for the time being.</p>\n<p><object height=\"81\" width=\"100%\"><param name=\"movie\" value=\"https://player.soundcloud.com/player.swf?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F23992033\"></param><param name=\"allowscriptaccess\" value=\"always\"></param><embed allowscriptaccess=\"always\" height=\"81\" src=\"https://player.soundcloud.com/player.swf?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F23992033\" type=\"application/x-shockwave-flash\" width=\"100%\"></embed></object>  <span><a href=\"https://soundcloud.com/i-d-6/ben-ufo-for-i-d-online\">Ben UFO for i-D online</a> by <a href=\"https://soundcloud.com/i-d-6\">i-D</a></span> </p>\n","slug":"11644-review-rinse-16-ben-ufo1","category":"album-reviews","date":1317884413000,"wpid":11644,"isSticky":false,"featured_image":{"width":165,"height":165,"src":"2011/10/ben-ufo-165x165.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAABgf/xAAjEAACAgECBgMAAAAAAAAAAAABAgMEEQAhBQYSEzFxIlFh/8QAFAEBAAAAAAAAAAAAAAAAAAAAAP/EABQRAQAAAAAAAAAAAAAAAAAAAAD/2gAMAwEAAhEDEQA/AD1c25rkdOC5PZEIClpOnuO+QGOW2A/APvzphHxiMIoapUVsDI6s4Opby5I55149l2OAjDfwcDf3qi1flVhJ3JQEk+tB/9k="},"createdAt":1587293735937,"updatedAt":1588403546371,"author":"5e9b68b27a1236eccfeb1d10","old_image":"2011/10/ben-ufo-165x165.jpg","categories":["album-reviews","mixtapes","music"]}