{"id":"5e9c2e2b9b6559241525d7c5","artists":["5e9b693e7a1236eccfeb24c0"],"title":"Review: Rustie – Glass Swords","content":"<p>I want to start out by saying you can’t really go wrong if you’re Warp Records.</p><p> This year alone they’ve peddled some incredible records cherry-picked from the perfect roster: <strong>Battles, Africa Hitech, Hudson Mohawke, Babe Rainbow, Prefuse 73, Brian Eno, Plaid, Grizzly Bear’s Chris Taylor</strong>, and the exciting upcoming project from <strong>Damon Albarn</strong> (and his new buddies…<strong>Actress</strong>, <strong>Kwes</strong>, <strong>Dr Who Dat?</strong>) – <strong>DRC Music</strong>.</p>\n<p>But after their release of last years <strong><em>Sunburst EP</em></strong>, there’s been an aftertaste left in our mouths for something more substantial from the Glaswegian producer. You know which one I’m talking about of course. <strong>HudMo</strong> seems to be loved for his campy indulgence in the current commercial US sound, but it’s <strong>Rustie</strong> who will come out on top this time around. He’s remixed almost everyone he admires, from <strong>Zomby</strong> to <strong>PVT,</strong> and he may have released a tune a while ago called <strong><em>Inside Pikachu’s Cunt</em></strong>, but this time he’s brought a dragon to a cockfight.</p>\n<p>From the crackling chimes on the album opener there’s immediate contrast with a hair-guitar solo – from here the pace picks up, but the ambience doesn’t let down. If there’s one thing to say about <strong>Glass Swords</strong>, it’s that it will continue to surprise you – it’s a retarded pastiche of genres. I can hear <strong>Phil Collins</strong> drums, synthesized sax, ‘Seinfeld’-like slap-bass…all set within a crystal pyramid of bass; an outstanding trifecta of hip-hop, dubstep and grime. Add to that equally subtle amounts of prog-rock, trance and funk, thrown in for good measure, and you’ve got yourself one of the most impressive electronic albums in recent years.</p>\n<p>I’ve got to say: the first few bars of some tracks here can throw you off – the trance set-up of Death Mountain quickly mutates into a crunchy hip-hop rhythm. Similarly, After Light dashes across rising synth chords into a bottomless chasm of trumpet-bass…and back again. Here, Rustie is a composer as much as producer, except this orchestra is from ‘Tron’.</p>\n<p>Just to set things straight though: this isn’t a sugary affair. The immediacy and aggressiveness of City Star shows the producer’s audacity to produce the perfect grime beat with no need for proper vocals – something Bristol’s <strong>Joker</strong> has haphazardly done with his debut (The Vision, 4AD). This album is a romantic testiment to the current British bass culture – Glasgow? London? Does it matter? – and a kick in the face of the ‘Pimp My Ride’ generation. At the same time it’s insular – <strong>Rustie</strong>’s treading ground that has only been breached previously by a handful of acts such as <strong>Lone</strong>, <strong>Com Truise</strong> and <strong>Harmonic 313</strong>, but with none of these with such focus and intensity.</p>\n<p>Of course there’s still always going to be comparisons to HudMo with this output, and others too (<strong>Lunice, Dam-Funk</strong>), but in my opinion <strong>Rustie</strong> goes further into the light. It’s an elevating experience to hear something with this amount of nostalgia for the eighties/nineties aesthetic without being too sickly sweet. There’s seems to be a weight to this sound that is hypnotic, almost. It may be the Sega 8-bit attack, or the 80’s prog allusions, but overall it doesn’t particularly matter. It’s fresh. If his previous yield was a bull-run, then <strong><em>Glass Swords</em></strong> is the china shop at the end of the street.</p>\n","slug":"11642-review-rustie-glass-swords","category":"album-reviews","date":1317841555000,"wpid":11642,"isSticky":false,"featured_image":{"width":165,"height":165,"src":"2011/10/rustie-165x165.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFwAAAwEAAAAAAAAAAAAAAAAABAUGB//EACYQAAIBAgUCBwAAAAAAAAAAAAECAwQRAAUSEyEGMRQVQlJhcYL/xAAUAQEAAAAAAAAAAAAAAAAAAAAB/8QAGBEBAQADAAAAAAAAAAAAAAAAAQARITH/2gAMAwEAAhEDEQA/AFMGQ0s0sb5hNIG8QullFyGJFyQSQx/N+T3wUM1rXGtukKmoZuTNugbh91jLfnvigro088toXiOR+3q2Dz9/OMYzGkplzCpVaeEKJWAAQWAucPAxBtb/2Q=="},"createdAt":1587293739625,"updatedAt":1588403546456,"author":"5e9b68b27a1236eccfeb1d10","old_image":"2011/10/rustie-165x165.jpg","categories":["album-reviews","music"]}