{"id":"5e9c33f79b6559241525e14d","title":"You’re Not From Round Here Are You","content":"<p><a href=\"https://admin.</p><p>crackintheroad.com/uploads/2010/06/EDL.jpg\"><img class=\"aligncenter size-full wp-image-1167\" src=\"https://api.crackintheroad.com/wp-content/uploads/2010/06/EDL.jpg\" alt=\"\" width=\"643\" height=\"423\" srcset=\"https://api.crackintheroad.com/images/2010/06/EDL.jpg 643w, https://api.crackintheroad.com/images/2010/06/EDL-300x197.jpg 300w, https://api.crackintheroad.com/images/2010/06/EDL-494x324.jpg 494w, https://api.crackintheroad.com/images/2010/06/EDL-165x108.jpg 165w\" sizes=\"(max-width: 643px) 100vw, 643px\" /></a></p>\n<p>‘You’re not from round here are you’ ‘Yeah’ ‘Where you from then?’ ‘Newcastle’ ‘No you’re not you’re coloured f*** off’.</p>\n<p style=\"text-align: center\">The Fascists had taken over Newcastle.</p>\n<p>This weekend’s EDL march and subsequent UAF counter march was a timely social barometer of the underlying political and racial tensions creeping evermore into the public’s consciousness. Given the size of previous political demonstrations in Newcastle, a low key affair was expected despite the local media predictions of anarchy in the build up to the event. Therefore walking out of monument station at around 12 o’ clock to instantly stumble upon a minor leftist rally complete with lax policing, was hardly surprising. However after travelling further into the city the scale of the demonstrations began to resemble the media forecast. Hundreds of police, including the cavalry divisions cut a swathe toward the epicentre of the issue; Central station.</p>\n<p>Keeping bias out of an article such as this is painstakingly difficult; however the congregation outside of the Gotham Town pub was a sight to stir the emotions of either side of this argument. England flags and ‘patriotic’ banners were held aloft, as a crowd of clean shaved, tattooed men gathered to sing football chants in an apparent effort to eliminate radical Islam. Perhaps most disturbing was the amount of young people brought to the EDL rally, yet more casualties of the EDL’s ignorance.</p>\n<p>The simultaneous UAF rally, carefully plotted by the police to avoid to the EDL, made its statement next to Newcastle’s ‘Gate’ complex. A strong fervour for the demolition of nationalist ideology was palpable, as chants of liberalism and freedom echoed through this busy area of Newcastle. Undoubtedly inspiring stuff, yet I couldn’t help think they were preaching to the converted. Amongst the EDL, the message was both primitive and confused; their speeches riddled with contradictions and misinformed attacks on Islam, and the apparent rise of Sharia law. Most startling was the EDL’s complete ignorance to their own message. The transcription above of the conversation a member had with Crack in the Road’s Joel Chima served as sufficient evidence. For a ‘movement’ that at first glace seems so motivated to achieve a common goal, I was surprised to see EDL’s as confused and divided as they were.</p>\n<p>The day in the end fizzled out with no arrests made and very little violence, in many ways this was a testament to the quality and discretion of the policing. Both the UAF and the EDL departed seemingly pleased at the awareness they had raised. The EDL left almost as quickly as they had arrived, returning to their home towns on coaches and trains. The UAF, made up of a primarily north east contingent, made their far shorter journeys home. The general consensus was for a ceasefire to be declared and for the music to begin; as the Evolution Festival took over Newcastle’s attention once again.</p>\n<p><strong>Written by Sam Heaney</strong></p>\n","slug":"1166-youre-not-from-round-here-are-you","category":"life","date":1275413705000,"wpid":1166,"isSticky":false,"featured_image":{"width":643,"height":423,"src":"2010/06/edl.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAUH/8QAIRAAAgEEAQUBAAAAAAAAAAAAAQMCAAQFESESFCMxcZH/xAAVAQEBAAAAAAAAAAAAAAAAAAAAAf/EABYRAQEBAAAAAAAAAAAAAAAAAAABIf/aAAwDAQACEQMRAD8AzfCvyTMheXmH7e3giLmLt3SkyBMdn8IB4O/Q3U92KyTXTYy4V1ykZS8pHJ+LpSpMg//Z"},"createdAt":1587295223465,"updatedAt":1588403567089,"author":"5e9b68b27a1236eccfeb1d24","old_image":"2010/06/edl.jpg","categories":["life"]}