{"id":"5e9c2e269b6559241525d7b9","artists":["5e9b69517a1236eccfeb2643"],"title":"Interview: The Veils","content":"<p><a href=\"https://admin.</p><p>crackintheroad.com/music/11680-interview-the-veils/attachment/finn-andrews2web/\" rel=\"attachment wp-att-11681\"><img class=\"alignleft size-homepage wp-image-11681\" title=\"finn-andrews2web\" src=\"https://api.crackintheroad.com/uploads/2011/10/finn-andrews2web-660x439.jpg\" alt=\"\" width=\"660\" height=\"439\" /></a></p>\n<p><strong>Crack in the Road</strong> sits down with <strong>Finn Andrews</strong>, songwriter and frontman of pop-noir New Zealand rock band <strong>The Veils</strong>, to discuss their upcoming fourth album.</p>\n<p><em>CITR: Can you give us a quick update on what you’ve been doing since the release of Troubles of the Brain, at the start of this year?</em></p>\n<p><strong>Finn: It’s been all the way, really. We’ve taken this year off entirely from touring to write the record, and we’ve dedicated a chunk of time to just focus on that. After 8 or 9 years of pretty solid touring, it’s been great. So it’s nearly together, and we’re just starting to plan recording for the fourth record now, and we’ll be recording in December. So it’s just been everyday writing, living a very solitary life.</strong></p>\n<p><em>CITR: How has the sound of this album progressed onwards from previous releases?</em></p>\n<p><strong>Finn: It’s hard to say now without having recorded it, but I’ve never spent such a dedicated amount of time to writing and I think that’s allowed me to go much further into the words than I ever had before. I’ve spent periods of time writing songs that have come out fairly quickly, and having this time means the words have taken on a whole new aspect. It’s been really enjoyable, it’s always been one of the parts I’ve enjoyed the most so I’ve been able to focus on that.  When you tour, I think you end up keeping very strange hours so it’s been good keeping a 9-to-5 existence. It’s been very productive. </strong></p>\n<p><em>CITR: What are the themes and ideas you’re putting forward on this album?</em></p>\n<p><strong>Finn: A lot of references to nature, this time around. Lots of birds and trees, lots of detail. Similar themes are always, I suppose. I’ll always write about the same themes in different ways. I wrote a song about lepers, yesterday. Lepers in love. I don’t know if it’s going anywhere, to be honest.  The chorus goes, “<em>I’ll give you my heart</em>”. It’s a love song. For lepers. That might well die on its feet.</strong></p>\n<p><em>CITR: What musical inspiration have you utilised in writing this album and past albums?</em></p>\n<p><strong>Finn: I tend to listen to the same thing I listened to when I was fifteen. My taste has changed very little in that time. The only thing I do discover is more old music that I haven’t heard before. I do feel very inundated a lot of the time at how much music there is around. Sophia, our bass player, is very much out in the world so she acts as a filter in that way, but I wouldn’t know where to start. </strong></p>\n<p><em>CITR: What are your tour plans for the next few months?</em></p>\n<p><strong>Finn: It would be good to get out there early next year I think. I’m hoping we’ll have the record finished by January. It’d be great to get back on the horse.</strong></p>\n<p><em>CITR: What was your best moment on stage?</em></p>\n<p><strong>Finn: I remember the first gig we did at the Paradiso in Holland. I was 18, and had my first electric guitar that I ever had. I loved it very much and had quite excessive tendencies back then. In the last song in the set, I held my guitar by the bass, threw it in the air above me and it came back down in a straight line, hit the ground and exploded. That must have been quite the spectacle. I was electrocuted in Berlin as well, continuously electrocuted. Just the right amount to add atmosphere. Maybe it was intentional.</strong></p>\n<p><em>CITR: What differences have you found in audiences in the UK and elsewhere, such as New Zealand?</em></p>\n<p><strong>Finn: New Zealand is a thing unto itself. It feels like a homecoming going there. America has been a relatively recent thing, us touring in the States. We’ve found it incredible exciting over there, and I haven’t found London crowds to be as reserved as everyone says they are. America’s great though, they don’t hold back – they let you know how they feel.</strong></p>\n<p><em>CITR: If you could be any animal, what would you be? </em></p>\n<p><strong>Finn: I was having a discussion about this the other day, actually. Did you ever read those Philip Pullman books? <em>His Dark Materials</em>. Someone was talking about that the other day, the idea of having a demon or an external spirit animal. No one could pin mine down at all. I thought a table would be quite good – it’s not an animal, but they didn’t really touch on that in the book. I don’t know if inanimate objects are allowed. I kind of feel like that, though. It’s a hefty, pain-in-the-arse thing that you carry around, and it gets in the way on the bus, but you can keep a drink on it. I was in a story-telling workshop when I was about six with my dad, and we had to stare into the trees for our spirit animal, and everyone else was seeing tigers and leopards and polar bears and stuff and all I could see was this little mouse. That was really annoying. But in the book it’s the evil people with the ostentatious animals. I think people with mice and tables are usually alright.</strong></p>\n<p>  </p>\n","slug":"11680-interview-the-veils","category":"interviews","date":1318000576000,"wpid":11680,"isSticky":false,"featured_image":{"width":900,"height":600,"src":"2011/10/finn-andrews2web.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAYH/8QAHxAAAgICAQUAAAAAAAAAAAAAAQIAAwQFBxEiMWGB/8QAFAEBAAAAAAAAAAAAAAAAAAAAAP/EABQRAQAAAAAAAAAAAAAAAAAAAAD/2gAMAwEAAhEDEQA/AMR441GFuE3NeYrladTdkCwgE0sjr3J8PqQbeT0iIH//2Q=="},"createdAt":1587293734449,"updatedAt":1588403546345,"author":"5e9b68b27a1236eccfeb1d16","old_image":"2011/10/finn-andrews2web.jpg","categories":["interviews","music"]}