{"id":"5e9c2e159b6559241525d7a0","artists":["5e9b693e7a1236eccfeb24c3"],"title":"Review: Ryan Adams – Ashes and Fire","content":"<p>There’s one thing about my taste in artists, records and songs that has become abundantly clear to me, over the time I’ve spent nurturing and developing my casual obsession with music.</p><p> I love nearly all things miserable. Earlier this year, at the release of long-standing favourite Death Cab for Cutie’s latest effort <strong><em>Codes and Keys</em></strong>, <a title=\"Ooh, Rob has a Tumblr you say? What's that? No I am not a 'fifteen-year-old girl'. Oh, piss off and give it a follow, will you?\" href=\"https://robhollamby.tumblr.com/post/10767741923/death-cab-for-cutie-codes-and-keys\">I bemoaned the Washington quartet’s newfound emotional distance</a>, where, say, <strong><em>All Eternals Deck </em></strong>by The Mountain Goats presented a 2011 release that <a title=\"Seriously. Contender for sad song of the year.\" href=\"https://www.youtube.com/watch?v=azZDtf50pNQ\">I could really get sad to</a>. However juvenile or self-indulgent or retrogressive it may seem, I am a semi-bashful devotee of those records that do well soundtracking lonesome, late night whiskey drinking and overflowing ashtrays. <strong>Ryan Adams</strong>, I think we can all agree, has proved himself a past master at making exactly those sorts of records.</p>\n<p>You can probably see where this is going. That <strong><em>Ashes and Fire</em></strong>, Adams’ thirteenth studio album, and first since leaving The Cardinals in 2009, begins with the line ‘last time I was here it was raining, it’s not raining any more’, is particularly fitting. Adams has been keen to dismiss the idea that his songs should be taken as a literal extension of what he’s feeling at any given time, telling <a title=\"Am I allowed to do this? I am now. \" href=\"https://drownedinsound.com/in_depth/4143701-i%E2%80%99m-always-in-a-good-place-when-i%E2%80%99m-working-on-music-dis-meets-ryan-adams\">Drowned In Sound</a>‘s David Edwards simply “I’m always in a good place when I’m working on music”. So it’s not necessarily Adams’ marriage to Mandy Moore, or his positive decision to continue with music in the face of Ménière’s Disease, that have contributed to the more relaxed themes and sound present on <strong><em>Ashes and Fire</em></strong>, as one might have expected. But true or not, the notion certainly seems applicable.</p>\n<p>The Cardinals must’ve had a hard time of it, rarely critically respected as anything more than Adams’ competent but relatively unremarkable backing band. That said, their mark on those albums they played on is indelible – it’s particularly clear that <strong><em>Ashes and Fire </em></strong>is not a Cardinals record, largely consisting as it does of strummed acoustics, gentle percussion, and nary a country thrashathon in sight. The lack of musical urgency on<strong><em> Ashes and Fire</em></strong> influenced my early judgment of the album – where a song like <em>Save Me</em> isn’t particularly cheerful in tone, it’s gentle, gospel-inflected sound certainly doesn’t elevate it to <em>Meadowlake Street</em>‘s miserable heights. With the customary vitriol I reserve for artists who <em>dare </em>to go even the slightest bit happier on me, I was perfectly ready to write off <strong><em>Ashes and Fire </em></strong>as unremarkable and await the next release that would pander to my ridiculous demands.</p>\n<p>A reassessment of values was needed at this point. Obviously, dismissing an album as poor simply because it’s not as tearjerking as an artist’s previous output would be ridiculous, self-indulgent, and probably downright unhealthy as well. For a start, there are undeniably a scattering of those moments on <strong><em>Ashes and Fire </em></strong>that can light a sad-addict up inside, not least on <em>Come Home</em>, which is just as longing as it’s similarly-titled counterpart from <strong><em>Cold Roses</em></strong>, and the title track puts paid to any notions that Adams can’t do rollicking without the Cardinals. Similarly, both <em>Do I Wait </em>and<em> Lucky Now</em> are as good as anything that Adams has ever produced before, the former blooming from soft beginnings into something altogether more substantial, and the latter the closest he’s got to <em><strong>Pneumonia </strong></em> in years. So it’s a little unfortunate that the second half of the <strong><em>Ashes and Fire </em></strong>does have a tendency toward indistinctness. The aforementioned <em>Save Me</em>, <em>Kindness</em>, and the closing <em>I Love You But I Don’t Know What To Say </em>are all relatively lengthy, end-credits numbers that schmooze softly into each other with the minimum of effect, whatever the sentiment behind them.</p>\n<p><strong><em>Ashes and Fire </em></strong>is not Ryan Adams’ best record, emotional calibre notwithstanding. That said, it’s certainly not his worst either, and taking the record out of the context of a critical review for a moment, it’s delightful to hear the man sounding so settled, especially with his battle with Ménière’s Disease in mind. Trading in bourbon-soaked self-destruction for the kind of gentle jams that your parents could quite happily nod their heads to without getting too involved seems to me to have sapped much of the vitality from Adams’ music. But hell, maybe I’m just not ready to stop being a miserable fucker just yet.</p>\n","slug":"11693-review-ryan-adams-ashes-and-fire","category":"album-reviews","date":1318344978000,"wpid":11693,"isSticky":false,"featured_image":null,"createdAt":1587293717463,"updatedAt":1588441788425,"author":"5e9b68b27a1236eccfeb1d3c","old_image":"generated/af6ceb1cfbbc221a3f02ecf37ef0fdfe7a510040.jpg","categories":["album-reviews","music"]}