{"id":"5e9c2e169b6559241525d7a1","artists":["5e9b69577a1236eccfeb265e"],"title":"New: This Town Needs Guns – Adventure, Stamina & Anger","content":"<p>In a tone befitting the end of an era, I’m going to get all sentimental for a moment.</p><p> I can still remember the first time I really listened to <strong>This Town Needs Guns</strong>. It was probably nearly exactly four years ago. Walking home on a bright, brisk autumn day much like this one, I fished my phone out of my pocket to find a text from a friend, saying simply, ‘Listen to <em>26 is Dancier than 4</em> by This Town Needs Guns’. When I got in, I dutifully fired up the computer, pulled up MySpace, and did so.</p>\n<p>I think that no sooner had the song’s last notes faded out (maybe for the third or fourth time), I dialled the individual who had set me on this path and unleashed a torrent of unintelligible gibberish down the line, the gist of which was that TTNG’s marriage of barefaced, unapologetic angst to ultra-melodic hypertapping, was, y’know, just my kind of thing. Suddenly a whole bunch of bands with Kinsella influences proudly on sleeves seemed to appear. Some of them were good. Some were bloody awful, and it all got a bit boring in the end. But I heard This Town Needs Guns before I heard the rest of ’em, and I don’t think they ever really got outdone.</p>\n<p><strong><em>Adventure, Stamina & Anger </em></strong>is the swansong of Guns’ frontman and sometime guitarist Stuart Smith, who’s departing on particularly happy terms for the realms of fatherhood. Listening to it alongside oldies like <em>26…</em> it’s apparent how much more competent the Oxford-based four piece have become. Where I used to pine for the distorted chording that characterised Guns’ split with Cats & Cats & Cats, the mellifluous clusters of notes that populate <strong><em>Adventure</em></strong> wouldn’t make sense in that context, but thoroughly do in this one.</p>\n<p><iframe style=\"position: relative; display: block; width: 400px; height: 100px;\" src=\"https://bandcamp.com/EmbeddedPlayer/v=2/album=2687617187/size=venti/bgcol=FFFFFF/linkcol=4285BB/\" frameborder=\"0\" width=\"400\" height=\"100\"></iframe></p>\n<p>This Town Needs Guns are continuing onward with Henry Tremain (him from <a title=\"They're not around any more. Shame.\" href=\"https://www.myspace.com/pennines\">Pennines</a>) in place of Smith, and head into the studio to record their second full length next week. You can download <strong><em>Adventure, Stamina & Anger </em></strong>via the Guns <a title=\"I'm spent.\" href=\"https://thistownneedsguns.bandcamp.com/album/adventure-stamina-anger\">bandcamp</a>, or head over to <a title=\"Hello, merch!\" href=\"https://hellomerch.com/sh/index.php?option=com_virtuemart&page=shop.browse&category_id=43&Itemid=2\">hellomerch</a> to preorder a physical copy. Keep track of goings on in the This Town Needs Guns camp via their <a title=\"A real website, too.\" href=\"https://www.thistownneedsguns.co.uk/\">website</a>.</p>\n<p>Photograph courtesy of Oswaldo Guadarrama</p>\n","slug":"11739-new-this-town-needs-guns-adventure-stamina-anger","category":"music","date":1318326015000,"wpid":11739,"isSticky":false,"featured_image":{"width":165,"height":165,"src":"2011/10/peterweb-165x165.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAABgP/xAAfEAACAQUBAAMAAAAAAAAAAAABAgMABAURIVFBcXL/xAAVAQEBAAAAAAAAAAAAAAAAAAABAv/EABcRAQEBAQAAAAAAAAAAAAAAAAEAETH/2gAMAwEAAhEDEQA/AAWCxiSQhIDGrxxCZkkk0x0QDrfx3f0KnJj7IyMTdgdPPKPWsjrZ30iuwkbHXaMwPSuo+E+dPKdmCIEgRJr8igahOZf/2Q=="},"createdAt":1587293718781,"updatedAt":1588403546135,"author":"5e9b68b27a1236eccfeb1d3c","old_image":"2011/10/peterweb-165x165.jpg","categories":["music","new"]}