{"id":"5e9c2e139b6559241525d79d","artists":["5e9b691e7a1236eccfeb22ce"],"title":"Review: M83 – Hurry Up, We’re Dreaming","content":"<p>My first live experience of French electro-pop outfit <strong>M83</strong> was at <strong>T in the Park</strong> several years back.</p><p> Sandwiched between the then fresh faced <strong>Vampire Weekend</strong> and <strong>MGMT</strong> in the King Tuts Tent, their set was almost entirely instrumental. As you can imagine, this didn’t go down well with those who had merely stumbled into the tent to shout ‘<em>hey hey hey hey</em>‘ and bellow drunkenly during the chorus in <em>Kids</em>; which unfortunately was the vast majority of the crowd. However it was a hugely engaging performance, with the group conjuring up luscious shoegaze inspired soundscapes, adding a pivotal moment of clarity between the overhyped chaotic acts either side of them on the bill.</p>\n<p>Several years on, and<strong> M83</strong> are yet to unearth the sort of success that the aforementioned groups have found, solely down to the fact that they haven’t written a ‘hit’. Their fifth album from 2008,<strong><em> Saturdays = Youth </em></strong>was an accomplished record in it’s own right, but didn’t contain the sort of out-and-out anthems that would propel it onto day time radio. Always championed as a sensational live act, their sixth album, <em><strong>Hurry Up, We’re Dreaming</strong></em> aims to capture the energy of their performances and channel it into a full length release.</p>\n<p>If there’s something <strong><em>Hurry Up, We’re Dreaming</em></strong> cannot be accused of, it’s lacking anthems. Lead single<em> Midnight City</em> contains one of the most frustratingly infectious choruses since <strong>MGMT</strong> molested our ears; a festival favourite in waiting that is destined to be chanted inanely whilst slurping on a can of strongbow’s finest. Obvious and immediate comparisons can be drawn to<strong> U2</strong>, in the formulaic songwriting procedure, a trait that isn’t especially endearing and makes for a rather impersonal listen. With the opening track, ingeniously titled<em> Intro</em>, featuring goth pop songstress<strong> Zola Jesus</strong>, it’s a sure fire signal of intent; <strong>M83</strong> want these tracks to be heard, by everyone.</p>\n<p>The list of stadium fillers goes on, with<em> Reunion</em> following an unsurprisingly similar method to <em>Midnight City</em>. It’s not offensive as such, or either unlistenable, just rather predictable and without any real character. If<strong><em> Hurry Up, We’re Dreaming</em></strong> was comprised of nine or ten tracks of ball-busting anthems, then that would be perfectly acceptable, albeit probably not to my taste. However coming in at over eighty minutes, it’s a fairly hefty listen and begins to feel cumbersome around the half way point.</p>\n<p>Whilst it may not work especially well as a collection of tracks, there are some hidden gems, such as the slow burning, remorseful <em>Wait</em> and album highlight <em>Raconte-Moi Une Histoire.</em> Sampling a young girl telling a charmingly innocent story, it’s tracks like <em>Raconte-Moi.</em>… where <strong>M83</strong> excel, not written as a singalong yet strangely entrancing. By the time the record rolls into <em>New Map</em>, it would take a very patient listener to still be alert, despite there still being almost half the album remaining. The epic <em>Steve McQueen</em> is one of the few examples of the stadium born anthems that really works and makes for pleasant listening.</p>\n<p>Twenty two tracks is simply too many for an album written in such an outwardly pop orientated style; a shame because there are some interesting moments within the release. <em><strong>Hurry Up, We’re Dreaming</strong></em> is an ambitious step up from the <strong>T in the Park</strong> performance all those years back, and I suspect an album like this would have been far more accommodating to the crowd on that day. Containing more hooks than a casting call for a theatre production of Peter Pan, <em><strong>Hurry Up, We’re Dreaming</strong></em> will fascinate some, and severely disappoint others; with <strong>M83</strong> undoubtedly forming a staple part of next years festival season.</p>\n<p>Head over to the <a href=\"https://www.urbanoutfitters.co.uk/page/m83\" target=\"_blank\">Urban Outfitters</a> site to stream the album in full.</p>\n","slug":"11743-review-m83-hurry-up-were-dreaming","category":"album-reviews","date":1318349771000,"wpid":11743,"isSticky":false,"featured_image":{"width":165,"height":165,"src":"2011/10/m83_mp3h1704-165x165.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFwAAAwEAAAAAAAAAAAAAAAAAAwQFB//EAB8QAAICAgMAAwAAAAAAAAAAAAECAxEABAUhMRJBUf/EABUBAQEAAAAAAAAAAAAAAAAAAAQF/8QAGBEBAQEBAQAAAAAAAAAAAAAAAQIAEQP/2gAMAwEAAhEDEQA/AMR4TjmbkNbUjb5bEjAFUN0PsdX3WNbG7Mk8iRSRiNWIW3DGr6sj3IGmxRpGQlWBNEGiMGruFADN5+4ElVV12/SZ4Bw3/9k="},"createdAt":1587293715929,"updatedAt":1588403546108,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/10/m83_mp3h1704-165x165.jpg","categories":["album-reviews","music"]}