{"id":"5e9c2e039b6559241525d78c","artists":["5e9b69517a1236eccfeb2637"],"title":"News: The Stone Roses Announce Reunion","content":"<p>At 3:00pm this afternoon, Manchester four piece <strong>The Stone Roses</strong> officially announced that they will be reforming for a host of live dates next year.</p><p> It’s been indie music’s worst kept secret since <strong>Clash</strong> mistakenly revealed that <strong>Brown</strong>, <strong>Squire</strong>, <strong>Mani</strong> and <strong>Reni</strong> were set to hold a press conference today (18/10/2011) at London’s Soho Hotel. Their return will be marked by two shows at Heaton Park, Manchester on the 29th and 30th June, followed by a full world tour.</p>\n<p><iframe src=\"https://www.youtube.com/embed/cRwR7avc5Oc\" frameborder=\"0\" width=\"560\" height=\"315\"></iframe></p>\n<p>When asked about the possibility of new material, <strong>Brown</strong> replied <em>“We hope so. But we said that before didn’t we?”</em>. It’s been more than fifteen years since the lad rock outfit performed together, so expectations will be extremely high when all four original members take to the stage next summer. It had appeared talks were on the rocks when drummer <strong>Reni</strong>, always seen as the most reluctant to reform, stated that <em>“Not before 9T will I wear the hat for the Roses again.” </em><strong>The Stone Roses</strong> had 12 top 40 UK singles, including <em>She Bangs The Drums</em>, <em>One Love</em> and <em>Love Spreads</em>, the latter being their highest charting, peaking at number two.<em></em></p>\n<p>Information on tickets can be found via the new <a href=\"https://www.thestoneroses.org/\" target=\"_blank\">Stone Roses</a> website. Tickets go on sale this Friday at 9.30am.<em><br />\n</em></p>\n<p>So, what’s your opinion? Excited or hugely apathetic? Let us know in the comment section underneath the article.</p>\n","slug":"11795-news-the-stone-roses-announce-reunion","category":"music","date":1318946121000,"wpid":11795,"isSticky":false,"featured_image":null,"createdAt":1587293699390,"updatedAt":1588441788317,"author":"5e9b68b27a1236eccfeb1d27","old_image":"generated/b402bab4eb25e953eef911e1fde6076e116ce0b2.jpg","categories":["music","news"]}