{"id":"5e9c2df59b6559241525d780","artists":["5e9b68e57a1236eccfeb1f69","5e9b691e7a1236eccfeb2301","5e9b693e7a1236eccfeb2500"],"title":"Review: Davis – Davis","content":"<p><a href=\"https://admin.</p><p>crackintheroad.com/music/11846-review-davis-self-titled/attachment/davis001/\" rel=\"attachment wp-att-11850\"><img class=\"aligncenter size-homepage wp-image-11850\" src=\"https://api.crackintheroad.com/uploads/2011/10/davis001-660x660.jpg\" alt=\"\" width=\"660\" height=\"660\" /></a>Must admit, I usually get impatient with something calling itself an album when it clearly is not. But despite <strong>Leaving Records</strong> releasing this new collaboration as just that – an album – I immediately forgive the short length of material. With this, quality overcomes quantity, as it should always do, and when I mention the name <strong>Matthewdavid</strong>, or mention the word <strong>Brainfeeder</strong>, you know what you’re looking at in terms of quality, right?</p>\n<p>Right. <strong>Matthewdavid</strong> (full name Matthew David McQueen) gave us his tense, hazy love letter to Los Angeles earlier this year with <em><strong>Outmind</strong></em>, and since then (and before), has been messing around on little-known record label (now cassette label), <strong>Leaving Records</strong>. I found out about <strong>Leaving</strong> much earlier in the year when they released the EP by ultimate weirdo beatmaker and insane <a href=\"https://twitter.com/WANDAGROUP\" target=\"_blank\">Twitter terrorist</a> <strong>Dem Hunger</strong>, which was as incredible as it was surreal. Since then I’ve kept a loose eye on their movements – stuff from <strong>Ras G</strong>, <strong>Johnwayne</strong>, and even <strong>Anticon</strong> head, <strong>Odd Nosdam</strong>. Their releases on <strong>Leaving</strong> seem to all be quite chilled out, experimental and atmospheric, which is strange when it comes to this new combination: LA-based <strong>Matthewdavid</strong> and Chicago’s <strong>Serengeti</strong>.</p>\n<p><strong>Serengeti</strong> is someone I’ve seen somewhere else before but can’t put my finger on him – looking into it I’ve noticed he’s done some stuff with pretty much all underground beatmakers and rappers, including <strong>Buck65</strong>, <strong>DJ Crucial</strong>, <strong>Tobacco</strong> and <strong>MF Grimm</strong>. But if anything, this EP (I’m gonna call it an EP really) shows he’s a confident, conscientious, and down-to-earth voice in underground rap. Apparently, these tracks are merely little flavours put together over the last summer…but <strong>Matthewdavid</strong>‘s talent is used to full potantial, his haunting production pushed to extra-catchy heights to accommodate the vocals, with just enough kick to keep <strong>Serengeti</strong>‘s voice rolling consistently.</p>\n<p>When I said down-to-earth, I meant it – this guy can drop cringey contemporary mentions of Google and Facebook and hide them tastefully in the lyrical spread. Puns on Jay-Z lyrics, and a short ballad on ‘sexting’ (aptly titled <em><strong>Sexting</strong></em>) may put some off when they read this sentence, but somehow they’re fresher and more unique than I make them sound. I really hope these two do more than just this EP – this EP having a total running time of 18 minutes. These two together are like a solved Rubick’s cube. With <strong>Serengeti</strong>, McQueen’s beats aren’t distracted by the temptations and potential pitfalls before him – melancholy, abstraction, chillwave. And <strong>Serengeti</strong> has the perfect platform on which to lay his rhymes across with the sparsity and carefulness of McQueen’s productions. I really look forward to another release from these two, hopefully again on <strong>Leaving</strong>, who really are an important label for our generation. Cassette tapes are enjoying a renaissance, and creators of experimental hip-hop – including the recent <strong>Death Grips</strong> – are the perfect bedfellows.</p>\n<p><em>Listen to a few tunes from <strong>Davis</strong>‘ self titled mini-album below. Out now on cassette and download on <strong>Leaving Records</strong>.</em></p>\n<p><em>Better When You Flow</em></p>\n<p><iframe src=\"https://www.youtube.com/embed/JGliEF0tAgI\" frameborder=\"0\" width=\"560\" height=\"25\"></iframe></p>\n<p><em>Stepson</em></p>\n<p><iframe src=\"https://www.youtube.com/embed/0XYPU_DGSO4\" frameborder=\"0\" width=\"560\" height=\"25\"></iframe></p>\n<p><em>#Nope</em></p>\n<p><iframe src=\"https://www.youtube.com/embed/DhoP7zn54ls\" frameborder=\"0\" width=\"560\" height=\"25\"></iframe>  </p>\n","slug":"11846-review-davis-self-titled","category":"album-reviews","date":1319060905000,"wpid":11846,"isSticky":false,"featured_image":null,"createdAt":1587293685134,"updatedAt":1588441788148,"author":"5e9b68b27a1236eccfeb1d10","old_image":"generated/f8714f6514e0d4848ba92da8ed746ec8f97d37f3.jpg","categories":["album-reviews","music"]}