{"id":"5e9c2df39b6559241525d77f","artists":["5e9b69637a1236eccfeb2725","5e9b69637a1236eccfeb2745"],"title":"Live Review: WU LYF (Other Rooms, Newcastle, 17/10/11)","content":"<p>Having stepped out of the shadows and released one of the debut albums of the year in the form of <em><strong>Go Tell Fire To The Mountain</strong></em>, Manchester’s odd-pop quartet <strong>WU LYF</strong> are currently embarking on their largest UK tour to date.</p><p> Kicking off in Newcastle on Monday, it’s great to finally see the guys bringing the <strong>World Unite</strong> experience to wider audiences. Whilst the crowd was partially comprised of people purely there to either ‘be seen’ or to check out the ‘next big thing’, presumably off the back of <strong>WU LYF’s</strong> recent NME dispute, it was certainly the busiest I’ve ever seen <strong>The Other Rooms</strong>, and surely a rewarding sight for the group given the hard-work they’ve put in.</p>\n<p>With Birmingham based beat-maker <strong>Young Montana?</strong> taking to the stage first, it was a while before the mildly bemused crowd warmed to <strong>Jon Pritchard’s</strong> sample-driven dance tracks. However by the time he eased his way into <em>Sacre Cool</em>, and his remix of <strong>WU LYF’s</strong> <em>We Bros</em>, the entire venue was well and truly ‘vibing’. It was real testament to the quality of <strong>Young Montana’s</strong> set, that after he walked off stage, I heard several people asking for the name under which <strong>Pritchard</strong> records. Always an indication that you’ve made some form of impact.</p>\n<p>It was past ten o’clock by the time <strong>WU LYF</strong> clambered onto the stage, clearly in high spirits and eagerly anticipating their forthcoming run of tour dates. Opening with previous single<em> L Y F</em> and it’s trademark organ led introduction, they rarely stopped to draw breath throughout their fifty minute performance. <strong>Ellery’s</strong> huskily strained vocals were cleaner than on record, yet the vast majority of the crowd still appeared to find it difficult to decipher what he was saying, with him encouraging the Newcastle audience to <em>‘howl like dogs… no, not like dogs, like cats, howl like little cats’.</em></p>\n<p>Running through <em><strong>Go Tell Fire Fire To The Mountain</strong></em> almost entirely in order, aside from next single <em>We Bros</em> which was used to close the set, it was an enigmatic performance by a group undoubtedly flushed with confidence. Portrayed perfectly by a two track breakdown midway through the set, used for <strong>Tom</strong> to showcase one of his solo works, in the form of the delicate <em>Brooklyn Girls</em>, before the full band rejoined with a bizarrely moving cover of <strong>Chris Isaak’s</strong> <a href=\"https://www.youtube.com/watch?v=UAOxCqSxRD0\" target=\"_blank\"><em>Wicked Game</em></a>.</p>\n<p>Despite the strength of their debut album, one moment stood head and shoulders above the rest when translated to a live situation. Flowing straight from the nigh on deranged shriek of <em>Spitting Blood</em> into the call-to-arms, percussion heavy rendition of <em>Dirt</em> was a fitting tribute to just how far this once timid four piece have come. With the crowd literally howling back each and every word, it’s clear that the <em><strong>World Unite Lucifer Youth Foundation</strong></em> are beginning to fulfill their so early diagnosed potential.</p>\n<p>Image courtesy of <a href=\"https://www.worldunite.org/\" target=\"_blank\">World Unite</a>.</p>\n","slug":"11877-live-review-wu-lyf-other-rooms-newcastle-171011","category":"live-reviews","date":1319124217000,"wpid":11877,"isSticky":false,"featured_image":null,"createdAt":1587293683817,"updatedAt":1588441788121,"author":"5e9b68b27a1236eccfeb1d27","old_image":"generated/ab67616d0000b2730a3dadd5bf2758f97dbea040.jpg","categories":["live-reviews","music"]}