{"id":"5e9c33f59b6559241525e14a","title":"Review: The Cellophane Flowers – If I Was A Girl EP","content":"<p><img class=\"alignnone\" title=\"TCF\" src=\"https://c4.</p><p>ac-images.myspacecdn.com/images02/82/l_645ebc40c55946228f660d82b9fc19e3.jpg\" alt=\"\" width=\"600\" height=\"400\" />Based in London, but featuring members from all over the world, including a female Italian lead vocalist, a multi-instrumental Australian and a guitarist from England; The Cellophane Flowers are avant-garde pop personified. This week sees the release of their debut EP entitled If I Was A Girl, which is an energetic and optimistic affair, confirming the bands position as enthralling newcomers. Opener Yes I Am contains a heavy, brooding guitar riff, not too amiss from from that of early shoegaze Cure songs, and draws comparisons to that of Sonic Youth, with Francesca’s quirky vocals being comparable to that of Kim Gordon. As stated on their myspace, their influences are far ranging and non-containing, allowing for a dense and progressive sound, shown best on EP highlight Freeze Me, which could easily have fitted in on Yeah Yeah Yeah’s fantastic critically acclaimed Show Your Bones. Each song is carefully crafted, no strings attached pop, with each track coming in at under the four minute mark, making for a restless and invigorating experience. Jovial title track unashamedly exposes their pop influences, containing a funky, reverb-laden guitar riff, not too dissimilar to that of genius songstress PJ Harvey. With a unique style, and inspired musical offerings, The Cellophane Flowers are definitely one to watch over the coming months. Any readers from London make sure to check out their EP launch tonight at Peter Parkers Rock and Roll Club.</p>\n<p style=\"text-align: center;\"><a href=\"https://www.myspace.com/thecellophaneflowers\">Check out their Myspace</a></p>\n<p style=\"text-align: center;\"><a href=\"https://www.thecellophaneflowers.co.uk/\">Check out their Official Website</a></p>\n","slug":"1195-review-the-cellophane-flowers-if-i-was-a-girl-ep","category":"music","date":1275464775000,"wpid":1195,"isSticky":false,"featured_image":{"width":188,"height":188,"src":"2011/06/l_645ebc40c55946228f660d82b9fc19e3-188x188.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAABgMH/8QAIxAAAQMEAQQDAAAAAAAAAAAAAQIDEQAFEiEEBhYiMUFCUf/EABQBAQAAAAAAAAAAAAAAAAAAAAD/xAAUEQEAAAAAAAAAAAAAAAAAAAAA/9oADAMBAAIRAxEAPwDE7l0fw+DZGHWbgl3mmXHgggthJjFsbkqjZ0BuPiijlqdLijKNk/amC22+xbSrBOSiuTGztdVU03kfBPv8oP/Z"},"createdAt":1587295221733,"updatedAt":1588403567063,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/06/l_645ebc40c55946228f660d82b9fc19e3-188x188.jpg","categories":["music","reviews"]}