{"id":"5e9c2ddd9b6559241525d76f","artists":["5e9b69317a1236eccfeb240e"],"title":"New: Pariah – Left Unsaid","content":"<p><em><strong>Safehouses</strong></em> was an incredible acheivement for a first EP.</p><p> Debut single on <strong>R&S</strong> was also astounding – <strong><em>Detroit Falls</em></strong> is possibly one of the best debut singles I’ve heard by a producer. These days, <strong>Pariah</strong> has been keeping a bit quiet though, on the solo side of things. But that’s fair enough, seeing as he’s been buddying up with fellow fresher <strong>Blawan</strong> both collaboratively, under the moniker <strong>Karenn</strong>, and through setting up a record label together, <strong>Works The Long Nights</strong> (listen to previews of their first release <a title=\"Rubadub\" href=\"https://www.rubadub.co.uk/music/techno/sheworks-001\" target=\"_blank\">here</a>).</p>\n<p>But enough about that – he’s back, that’s what’s important. When I saw him DJ at a rawkus night at The Cellar in Oxford, he showed up fellow basshead <strong>Gemmy</strong>, who you could argue has been on the map for a lot longer. So why is this guy headlining? Probably because he’s one of the brightest sparks on the electronic music scene at the moment. I can see why he associates himself with <strong>Blawan</strong>, who I saw as the new Untold at the time – they both have their ears very close to the ground, <strong>Blawan</strong> taking a very matter-of-fact approach and developing his own aesthetic, whilst <strong>Pariah</strong> branches out, delivering a diverse range of productions that, at second glance, are incredibly well composed. They sound sculpted, the attention to detail near impeccable, and they’re alright in the club too. Not bad?</p>\n<p><em><strong>Left Unsaid</strong></em> has <strong>Pariah</strong> converging with the aforementioned <strong>Untold</strong> style. Drops and pauses, rapid, and very percussive. He’s put some nice chopped up vocals in there too. The lovely thing about this one though is the intense lift it creates – when that disorientating bass comes in after the second drop, you’ve gotta admit, you’re hooked. And there’s no resolve, it just keeps going – no letting down with this lad. I can even see him competing with <strong>Ramadanman</strong> once the track starts coming to close. According to <strong>R&S</strong>, this is going to part of a new compilation released on the 31st, entitled <em><strong>IOTDXI</strong></em> (In Order To Dance ’11 I suppose) of which the second disc is full of fresh new tunes from <strong>Lone</strong>, <strong>Bullion</strong>, and a few other producers already mentioned in this article. Fuckin’ sweeeeet.</p>\n<p><em>Listen to Left Unsaid below.</em></p>\n<p><object width=\"100%\" height=\"81\" classid=\"clsid:d27cdb6e-ae6d-11cf-96b8-444553540000\" codebase=\"https://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=6,0,40,0\"><param name=\"allowscriptaccess\" value=\"always\" /><param name=\"src\" value=\"https://player.soundcloud.com/player.swf?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F25284423&show_comments=false&auto_play=false&color=000000\" /><embed width=\"100%\" height=\"81\" type=\"application/x-shockwave-flash\" src=\"https://player.soundcloud.com/player.swf?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F25284423&show_comments=false&auto_play=false&color=000000\" allowscriptaccess=\"always\" /></object></p>\n","slug":"11974-new-pariah-left-unsaid","category":"music","date":1319218299000,"wpid":11974,"isSticky":false,"featured_image":null,"createdAt":1587293661075,"updatedAt":1588441787880,"author":"5e9b68b27a1236eccfeb1d10","old_image":"generated/ad07bb1c0f552d65d53763e28e7ae4e83aa0d6a2.jpg","categories":["music","new"]}