{"id":"5e9c2dc89b6559241525d764","artists":["5e9b68d47a1236eccfeb1e70","5e9b690a7a1236eccfeb21ee"],"title":"Review: Kele – The Hunter EP","content":"<p>It’s safe to say that <strong>NME</strong> haven’t been making themselves any friends of late.</p><p> From purposefully taunting and provoking <strong>WU LYF</strong>, to prematurely claiming that <strong>The Stone Roses</strong> reunion was a sure-fire no go; it’s not too difficult to see why sales of the magazine are stuttering. Another fur-rah that the publication was recently caught up in involved them wrongly announcing <strong>Kele Okereke’s</strong> dismissal from his band of nine years, <strong>Bloc Party</strong>. It remains to be seen whether the story was backed by some truth or indeed pure fabrication; either way it’s a classic example of <strong>NME’s</strong> stringent sensationalism that has proved so detrimental to the reputation of the magazine.</p>\n<p>The article in question was written after a phone interview with <strong>Bloc Party</strong> frontman <strong>Kele</strong>, supposedly to promote his forthcoming release, <em><strong>The Hunter EP</strong></em>. Having made no secret of his house and dance music influences, it’s a shame that he’s yet to write anything that is even lightly comparable in quality to <strong>Bloc Party’s</strong> 2007 dance orientated single <em>Flux</em>. Lead single <em>What Did I Do?</em> featuring 18 year old <em>Lucy Taylor</em> on vocals is perhaps the closest he’s come through his solo output, a track that owes much to the likes of chart mainstays <strong>David Guetta</strong> and <strong>Armin Van Helden</strong>.</p>\n<p>Elsewhere on the EP, <strong>Kele</strong> takes <strong>Q Lazzarus’s</strong> <em>Goodbye Horses</em> and transforms it into a synth driven anthem, with his distinctive vocals proving a particular highlight. It’ll probably feature in the playlists of ‘indie’ DJ’s, however is unlikely to cause any waves with regards to mainstream success. <em>Cable’s Goodbye</em> is Bloc Party through and through; emotionally fraught and luscious in sound, combining flutes and pianos to form the standout moment on <em><strong>The Hunter</strong></em>. In many ways it’s unfortunate for <strong>Kele</strong> that <strong>Bloc Party</strong> have set such high standards with their releases, as the chances are that any solo work will pail in comparison. EP closer <em>You Belong To Someone Else</em> is criminally unsure of it’s own characteristics, prancing clumsily between tribal-inspired beats and gratingly dreadful dance sections, sounding like something offensively unlistenable that forces it’s way under the door of my brothers bedroom.</p>\n<p>There are individual glimpses of clarity on the EP, such as the aforementioned <em>Cable’s Goodbye</em>, however the songwriting ability of <strong>Russell Lissack</strong> is glaringly evident. Does <em><strong>The Hunter</strong></em> feel natural? Most probably. Is it any good? Well that’s far more up for debate.</p>\n<p>Check out <em>Cable’s Goodbye</em> below.</p>\n<p><iframe src=\"https://www.youtube.com/embed/K4UrxuAFT1E\" frameborder=\"0\" width=\"560\" height=\"30\"></iframe></p>\n<p>Image courtesy of <a href=\"https://treeswingers.com/2011/10/13/kele-covers-goodbye-horses/\" target=\"_blank\">Tree Swingers</a>.</p>\n","slug":"11996-review-kele-the-hunter-ep","category":"album-reviews","date":1319471568000,"wpid":11996,"isSticky":false,"featured_image":{"width":165,"height":165,"src":"2011/10/n1-165x165.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAABQYH/8QAIBAAAgEDBQEBAAAAAAAAAAAAAQIRAwQFAAYSMUEhB//EABUBAQEAAAAAAAAAAAAAAAAAAAME/8QAGBEAAwEBAAAAAAAAAAAAAAAAAAECETH/2gAMAwEAAhEDEQA/AMU2th8Za00yGbRbmzJhUWsFMiZ5L3HzzSFX9Js6dV0tdq4EW6sRTDWasePkk9mPdQ1wzcHEmAsj7os96obwGZ3p/9k="},"createdAt":1587293640745,"updatedAt":1588403545849,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/10/n1-165x165.jpg","categories":["album-reviews","music"]}