{"id":"5e9c2da29b6559241525d72e","artists":["5e9b68f27a1236eccfeb2067"],"title":"Review: Florence And The Machine – Ceremonials","content":"<p>Is there anyone in the entire world more annoying than <strong>Florence Welch</strong>? From whoring out her soulless wail for duets with anyone able to stump up the dollar, to her aural molestation that disguises itself as a cover of <strong>The Source’s</strong> 1986 classic <em>You Got The Love</em>, I can’t be alone in wishing the Machine would veer off the tracks into a stifling ditch of obscurity.</p><p> Her now infamously atrocious songwriting skills are put even more into perspective, due to the fact that her debut single <em>Kiss With A Fist</em> is actually a brilliant track, and far more invigorating and energetic than anything that’s been squeezed out of her since.</p>\n<p>Having re-released her debut album more times than I care to count, thus ensuring each and every track was forcibly driven into the ears of the susceptible British public, <strong>Welch</strong> returns next Monday with her sophomore attempt <em><strong>Ceremonials</strong></em>. Lead single <em>What The Water Gave Me</em> appeared online back in August, to a slightly underwhelming reception. A spacious, atmospheric pop track, owing much to elegant songstress <strong>Regina Spektor</strong>, but ultimately falling rather flat and lifeless. Focusing almost entirely on her vocals, and following the bland formula that pretty much every track on her debut adopted, <em>What The Water Gave Me</em> trundles along rather disinterestedly before descending into a stereotypical, unintelligible<strong> Florence</strong> bawling fit.</p>\n<p>Luckily, <em>Shake It Out,</em> the first single proper taken from <strong>Ceremonials</strong> is far more interesting, and an example of good old-fashioned songwriting rather than merely stretching her tedious vocals out over a generic indie instrumentation section. There’s heaps of catchy choruses and a vivid sense of personality within the track. Ace.</p>\n<p>Unfortunately it’s not long before <strong>Welch</strong> reverts to her usual monotonous wail, such as the horrendous <em>Lover To Lover</em>, proving to be more of a spectacular face plant that a mere stumble. In a year when <strong>PJ Harvey</strong> claimed the Mercury Prize for a record breaking second time, it’s hard to imagine <strong>Florence</strong> ever reaching those sort of songwriting capabilities, especially since she appears determined to stick to such a predictable composition structure. There’s the <strong>Tori Amos</strong> imitation on <em>Heartlines</em>, which isn’t dreadful, but hardly earth-shatteringly moving, ‘<em>your heart is the only place that I call home</em>‘ being a fine example of <strong>Florence’s</strong> childlike lyricism.</p>\n<p>Where <strong>Ceremonials</strong> trips itself up is with it’s frightening lack of personality; there’s nothing tangible to grab hold of or cling to. It’s neither emotionally desolate nor beautifully uplifting, with the lukewarm <em>All This And Heaven Too</em> being the closest <strong>Welch</strong> comes to ever striking a chord with the listener. Whilst her sophomore effort may be a noticeable step-up from her debut record<strong><em> Lungs</em></strong>, mainly down to <em><strong>Ceremonials</strong></em> containing far fewer Radio 1 hungry anthems, <strong>Florence’s</strong> apparent self obsession and thirst for fame is undoubtedly preventing her <strong>Machine</strong> from reaching it’s top gear.</p>\n<p><a href=\"https://katemassey1.blogspot.com/2010/09/script.html\" target=\"_blank\">Image source.</a></p>\n","slug":"12148-review-florence-and-the-machine-ceremonials","category":"album-reviews","date":1319740205000,"wpid":12148,"isSticky":false,"featured_image":{"width":942,"height":623,"src":"2011/10/florence-the-machine.jpg.png","placeholder":"data:image/jpeg;base64, iVBORw0KGgoAAAANSUhEUgAAAAoAAAAHCAIAAAC+zks0AAAACXBIWXMAAAsTAAALEwEAmpwYAAAA5ElEQVR4nAHZACb/AJ6amqCbmqOgn4NdRk8mED8cDJFeMZ6ViYmJjH58fQChnp6lpaaZjIN1PR6DSiRxPiKaYy64mm+OjpKCgIEAqqCarqagk3trci0IfDsZVSMNUyIGon1YmJWVhIOEALyroM2xln9QL5tlPc2tjr6ceXRAH2s6HKaHcJ6JfgCxq6ivloGuhl3CnXnFk3ewfGC8lHOUakqvkXmZjogAuaeJbUwpn4VxvJZ2bjcfbDgh0LKXmX1nW0Mzh4OBAKqRa7+mfcmwmLCLdX9ZMZlxRtS3pGJJPj0XAIN0aSUJZFbEK0AXAAAAAElFTkSuQmCC"},"createdAt":1587293602012,"updatedAt":1588403545405,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/10/florence-the-machine.jpg.png","categories":["album-reviews","music"]}