{"id":"5e9c2d9f9b6559241525d72b","artists":["5e9b69377a1236eccfeb249a"],"title":"Crack in the Replica 2 – Darkstep","content":"<p>Ah, this guy.</p><p></p>\n<p>“I love it” shouts <strong>Replica</strong>, wildeyed with characteristic puppydog enthusiasm, “when something you’ve heard a thousand times can still sound so fresh in a different listening context.” We’re pushing our way through the doors at the back of Brixton’s O2 Academy, ducking out of <strong>Death From Above 1979</strong>, and sadly, it’s not Messrs Grainger and Keeler that Replica’s getting all excited about. Rather, it’s this month’s CitR-exclusive mix, specifically <strong>Spectrasoul</strong>‘s remix of the <strong>BTK</strong> track <em>Things I Do</em>, which wobbles in just shy of the seventeen minute mark. “I was listening to it,” he recalls, “and I knew that it alone was original and interesting enough to base a whole mix on.” By this time we’ve made it to one of the venue’s upstairs bars, and as when I spoke to Replica last month, we’ve broached the subject of genre. I’m probing the DJ as to why he’s tagged his offering this month as ‘Darkstep’, where the whole idea came from. Replica’s methods are refreshingly uncalculating. “I hear a track that inspires me,” so, that Spectrasoul remix, in this case, “and I hold on to it and use it as a cornerstone for the mix. I try and select other tracks that share the same qualities as that one track.” Being the noncreative party in this series of collaborations, I’m wary of stamping a label on anything for the sake of reductive journalism, but Replica is far more relaxed. “Genre tagging at a sub-genre level is quite fluid and subjective,” he muses, toeing a dark, sticky smudge on the floor “and it’s only after I’ve put it all together that it needs a name – I think darkstep is one of a few close approximations of what the overarching sound of this mix is.”</p>\n<p>The difference in breaks between Replica’s two CitR mixes so far is immediately apparent, from the moment that <strong>Sunchase</strong>‘s <em>Lapdance</em> locks in off the roll of waves and some gorgeous, ethereal chiming. What prompted the decision to work with a selection of more traditional breaks? “I was apprehensive at first, because I know the stigma that comes with the more traditional D’n’B beat,” explains Replica, “so I was very careful with my selections. I tried to keep the beats minimal and the basslines as deep as possible.” Far from deriding drum’n’bass, though, Replica’s keen to point out that the ol’ dancefloor warhorse has life in it yet. “People find it so hard to let go of their preconceptions, that they just hear the Amen break and totally let go of the production. As soon as the beat kicks in with that ‘dug dug DAH dugga dugga dugga DAH'” – I take a step back to avoid getting soaked in overpriced Tuborg – “you can see people’s eyes rolling and they start switching off.” So why go with this school of production in particular, in bringing round those who can’t see past the Amen? “A lot of the production from last month’s mix seemed to be very appealing to a lot of people,” Replica shrugs, “and that same kind of production can be found in places in this mix.”</p>\n<p>The difference beatwise aside, I’m glad that Replica has drawn parallels between his Darkstep and Autonomic mixes. I wouldn’t have presumed to make the comparison myself, but the thought that the two mixes are largely similar in tone certainly played on my mind. What would the man say in his defense, to anyone who might suggest he’s been lazy and delivered more of the same? “I was a long way down a completely different path before I switched to this one. I was going to do a trip hop mix, I will do that another time in the future.” Ah, c’mon, that’s a cop out isn’t it? Anyone could say that. Pushed, Replica elaborates. “I just felt, after the warm reception the last mix got, I should play to that strength.” he says, clearly a little humbled by the reaction from last time around. “This is still only the second mix in the series. But it’s not going to just be this kind of stuff…” The lines ‘<em>come here baby, I love your company</em>…’ batter their way past the bar’s closed swing doors, and both of us turn and look toward their source. Replica’s face breaks into a sunny grin, and he turns back to me, continuing. “I’m a massive dance music slut, I’ll fuck anything that moves” he says, before quickly adding “except Donk, that stuff’s fucking shit.”</p>\n<p>Still, even with the knowledge that he could have opted for an entirely different style of mix, Replica’s eager to point out that whilst his second CitR outing has its similarities to his first, it’s only through offering a new perspective, whilst continuing to showcase the calibre of certain producers. “I had a few people asking me why we kept talking about D’n’B last month, when there was an apparent lack of it on the mix”, he says. “This month’s mix is, I guess, the sort of thing those artists were and are making outside those newer, um, ‘autonomic’, areas. If you think the two mixes sound the same – maybe these areas of music aren’t for you. The production is pure quality either way.” With the nous of a born showman, Replica smiles again, adding as an afterword, “But don’t worry, keep listening. There’s a veritable smorgasbord of totally different genres lined up for future mixes!”</p>\n<p>Whatever parallels can be drawn between Replica’s two mixes so far for CitR, and whether those parallels are for better or worse, there’s an unmistakable sonic variety to this month’s. I was particularly taken by the astounding one-two punch of <strong>Phace</strong>‘s <em>Cold Champagne</em>, which is so surprisingly hectic I think I actually jumped the first time it came in, and <strong>Beastie Respond</strong>‘s <em>Syncopy</em>, which, following Phace’s mentalism, comes over all dubby and organic. ‘Brilliant,” Replica laughs, ‘that Phace track was a last minute addition – it’s a classic, I remembered about it in the shower on the morning that i recorded it!” What would he consider standout tracks, then? “The tracks that really stick out for me in particular are, I suppose, <em>I Feel U</em> (by <strong>Icicle</strong>) – despite being quite minimal, that snare kicks like a 12 gauge. <em>Spadge </em>by <strong>Chook </strong>as well, because of the insane wobble board bass effect. And the bassline in (<strong>8bits</strong>‘) <em>So Good </em>is nice and deep. Soulful.”<strong></strong></p>\n<p>The final notes of <em>Do It </em>have crashed in past the black bar doors, and with both of us eager to get out of the Academy before the crowds swell and make movement impossible, I put one final question to Replica, asking him what his intention for this month’s mix was. He pauses for a moment, before answering. “You described this mix as being a lot more ‘danceable’, and certainly there are some ‘gunfinger'” – yes, he does the dance, his mouth twisted into a gurn – “moments, but I think if you manage to get up and actually dance to this…” He trail off, trying another tack. “I mean, I love Drum and Bass, but I went to a club recently, they were only playing stuff like this, and I left!” Ooh, you Philistine! The man’s quick to explain himself though, saying “I wouldn’t consider this music for dancing and having a great time to, it’s more of a vibing to on your earphones kind of thing. It’s a much more personal experience, not so communal.” Replica puts his empty plastic down on the bar, and looks around at the crowd, beginning to emerge from the Academy’s inner sanctum. We become as rats, and move to the street.</p>\n<p><object width=\"100%\" height=\"81\" classid=\"clsid:d27cdb6e-ae6d-11cf-96b8-444553540000\" codebase=\"https://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=6,0,40,0\"><param name=\"allowscriptaccess\" value=\"always\" /><param name=\"src\" value=\"https://player.soundcloud.com/player.swf?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F26474737\" /><embed width=\"100%\" height=\"81\" type=\"application/x-shockwave-flash\" src=\"https://player.soundcloud.com/player.swf?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F26474737\" allowscriptaccess=\"always\" /></object> <span><a href=\"https://soundcloud.com/replica101/replica-darkstep-mix\">Darkstep mix</a> by <a href=\"https://soundcloud.com/replica101\">Replica101</a></span></p>\n<p>Tracklist:</p>\n<p>00:00 – Sunchase – Lapdance Feat. Dissident<br />\n04:30 – Triad – Last March<br />\n05:37 – 8Bits – So Good<br />\n07:30 – Icicle – I Feel U<br />\n09:44 – SpectraSoul & D Bridge – Glimpse<br />\n13:08 – Chook – You Are All You Have feat Claudine Muno<br />\n14:38 – D Bridge – 5th Floor<br />\n16:53 – BTK – Things I Do (Spectrasoul Remix)<br />\n19:09 – Phace – Cold Champagne<br />\n21:47 – Beastie Respond – Syncopy<br />\n24:03 – Mode – Stepping Stones<br />\n27:03 – Bulb – Default Settings<br />\n29:19 – Survied & Bullet Time – Dejah Thoris<br />\n31:57 – Cyantific – Empty Streets<br />\n33:50 – S.P.Y – Go With The Flow<br />\n36:05 – Triad – Last Gasp<br />\n38:21 – Chook – Spadge<br />\n40:37 – Alix Perez – Behind Time<br />\n41:45 – >>DJ Fresh – Starfall>><br />\n43:37 – Commix – Belleview – D Bridge Belle-Reviewed Mix</p>\n<p>Photo © Joe Gilder</p>\n","slug":"12179-crack-in-the-replica-2-darkstep","category":"editorials","date":1319822905000,"wpid":12179,"isSticky":false,"featured_image":{"width":165,"height":109,"src":"2011/10/photo10-165x109.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAAAAb/xAAiEAABAwMDBQAAAAAAAAAAAAABAgMEABESBiExBQciQWH/xAAUAQEAAAAAAAAAAAAAAAAAAAAA/8QAFBEBAAAAAAAAAAAAAAAAAAAAAP/aAAwDAQACEQMRAD8AlmtaaPgyZM+MnqL7geecaZUPFJLirC5GwxN9hyflTb/cOO484vCQjJRVjgg43PF/dKUH/9k="},"createdAt":1587293599896,"updatedAt":1588403545379,"author":"5e9b68b27a1236eccfeb1d3c","old_image":"2011/10/photo10-165x109.jpg","categories":["editorials","interviews","new","mixtapes","music"]}