{"id":"5e9c33e69b6559241525e12c","title":"Review: Dot to Dot Festival (Manchester)","content":"<p>Last week saw the urban music festival <strong>Dot-to-Dot</strong> invade Manchester, providing fans with a chance to witness many new and established bands perform on intimate platforms across the city.</p><p> The main hub of activity centred around the <strong>Manchester Academy</strong>, which hosted bands in <strong>Academy 2, 3, Club, and the Council Chambers</strong>, while the <strong>Deaf Institute</strong> provided a more serene atmosphere until <strong>FAC251</strong> hosted acts until well in to the early hours.</p>\n<p>Arriving at the <strong>Manchester Academy</strong>, I immediately felt a buzz in the air quite distinct from that of arriving at a regular gig. There was no queue, there was no one space in which every fan was crammed in to, there was no predictability of two of three bands one after another. Rather there was a feeling of community, and of a communal excitement born out of the chance to dodge between venues to watch bands from a huge spectrum of genres. Set times clutched in my hand, Josh (Ganymede) and I rushed to the <strong>Council Chambers</strong>, just in time to catch <strong>The Cheek</strong>‘s set. With a sizable audience, <strong>The Cheek </strong>produced a set that was raucous and entertaining. Filled with heavy indie guitars and prominent drums, <strong>The Cheek </strong>produced a sound that was buoyed by an anarchic energy that could be heard in the suave vocals of <strong>Rory Cottam</strong>. Announcing their final song, <strong>Hung Up</strong>, <strong>Rory</strong> announced it was about ‘<em>hung parliaments and telephones</em>‘, and with this not so topical political reference the band launched into the song with the same powerful enthusiasm that will inevitably help push this band to their deserving great musical heights.</p>\n<p>Moving through to <strong>Academy 3</strong> immediately after <strong>The Cheek</strong> had finished turned out to be the only mistake Josh and I made all day. Admittedly we should have realised our mistake as soon as we walked in and saw the crowd of about thirteen, however we persevered incase the hundreds of other festival go-ers had skimmed over a hidden gem. How awfully mistaken we were. <strong>Lawson</strong>, a generically manufactured boy band, were performing the seemingly impossible; producing a sound with even less integrity and range than that of <strong>Busted</strong>. However I may be being a bit harsh on <strong>Busted </strong>here, as at least their songs were memorable. All I can remember is leaving swiftly on hearing that their next song was about ‘<em>a girl that broke up with me’ …</em></p>\n<p>After managing that lucky escape, we wandered into <strong>Academy 2, </strong>where <strong>Answering Machine </strong>were opening up a stage that was to later host <strong>Blood Red Shoes </strong>and <strong>Mystery Jets</strong>. Obviously nervous, the on stage atmosphere created by <strong>Answering Machine </strong>was somewhat dull. However this was made up by their loud sound, that had no difficulty filling a venue that many would have perhaps thought too large for <strong>Answering Machine</strong>. Their sound is somewhat stuck between <strong>The Strokes </strong>and Indie pop, with effervescent guitars matched by clear and powerful vocals that harmonize fantastically to create a powerful melancholy within each track.<strong> </strong>Well received by a largely expectant crowd, <strong>Answering Machine </strong>are well worth watching out for in the future.</p>\n<p>In the dark and underground settings of the <strong>Club Academy</strong>, <strong>Chapel Club </strong>performed a subdued set with mixed reviews. Seemingly lacking any real energy, the band rattled off one song after another with any real engagement with the crowd. However <strong>Chapel Club</strong>‘s saving grace proved to be that despite any real showmanship, their tracks spoke for themselves. With echoes of <strong>The Smiths </strong>and <strong>Beck</strong>, each track matched the underground ambience provided within the <strong>Club Academy </strong>and powered through even to me at the back of very crowded room. However if we were short on energy, this was immediately corrected by <strong>Dog is Dead </strong>up in the <strong>Council Chambers</strong>. A five piece band compromising of all males, they are thankfully a world apart from <strong>Lawson</strong>. Immediately walking into the room I felt the genuine nature of what I was about to listen to; a powerful collective of vocals and eclectic instrumentals. In a post set interview, they playfully described their sound as ‘<em>complicated pop-music for jazz junkies and choir folk</em>‘. This tongue-in-cheek explanation embodies the ethos of the band, as a group of young men simply making up tempo fun music intended to convey their energy in a form that anyone can enjoy. A definite inclusion on anyone’s summer playlist.</p>\n<p>A swift walk across to <strong>Academy 3</strong> allowed us to catch London alternative rockers <strong>Goldheart Assembly, </strong>performing one of the highlights of the festival with a packed out room of baying fans. Another fantastically powerful collective, <strong>Goldheart Assembly </strong>have been known to be very experimental in creating their sound, including using various objects such as metal radiator guards, doors and steam engines. However they suffered a musical casualty in for the form of lead guitarist <strong>Dominic Keshavarz </strong>dropping out of the band, and their tour manager having to be brought in to somewhat cover his role! Despite this,<strong> Goldheart Assembly </strong>produced a fantastic set and revealed they are big fans of <strong>Greggs Bakers</strong> (check out our interview with them in another article!).</p>\n<p>Away from the intimate settings of <strong>Goldheart Assembly</strong>, in <strong>Academy 2</strong>, <strong>Blood Red Shoes </strong>took to a stage with a <strong>Mystery Jets </strong>back drop. This constant reminder of the headline act almost led to them being upstaged by a magnificent set by the Brighton duo, who produced track after track of powerful rock gold amongst a dazing light show. Marking the end of my stay at the <strong>Manchester Academy</strong>, I headed across to another venue included in the festival, the <strong>Deaf Institute</strong>.</p>\n<p>Arriving at the <strong>Deaf Institute</strong>, it was clear that not many had decided to venture away from the <strong>Academy </strong>in search for other musical acts. Such a sparse crowd was a shame in such a fantastically intimate venue, and somewhat underwhelmed the idea of the transcendental nature of the urban festival. However thankfully this did not deter the bands performing, as I walked into the start of <strong>The Crookes </strong>set. Seemingly named after a district of Sheffield, the band members met at Sheffield University and have taken great strides since. Performing a lively set, their tracks are dominated by harmonious and pop-like vocals combined with light indie guitars. Their pleasant upbeat sound was very well received, especially as they performed an impromptu acapella set in the crowd. Make sure to check out our interview with them to learn more about this fantastic new band and their future plans.</p>\n<p>Sadly this article will have to conclude on a cliche. However, like most cliches, this is very much true; the best was saved for last. Originating from Little Rock in America, <strong>Lissie</strong> took to the stage with an air of a country rock star. Accompanied by two dread-locked musicians, <strong>Lissie </strong>immediately engaged the audience with some of the strongest vocals I have heard live since <strong>Regina Spektor</strong>. Her sound, obviously influenced by country stars like <strong>Dolly Parton</strong>, resonated true with the country genre of storytelling, as her track ‘Oh Mississippi’ tells the tale of a river flushing away bad memories of times past. However by no means is she limited to this, as her sound is eclectic in the way it incorporates elements of rap and rock, with her track ‘When I’m Alone’ producing a much more contemporary feeling. Be sure to check out our post set interview with <strong>Lissie</strong>, as it truly gives an intimate insight into this new rising artist.</p>\n<p>I chose to write this article in a chronological order, marking our constant movements between venues, as to try to portray to you the beauty of the urban festival. We were able to listen to folk in one room, then listen to rock in another. <strong>Dot to Dot Festival </strong>allowed fans of all genres to come together to witness bands they had already heard and bands they may not have otherwise have ever discovered. Unfortunately this concept is still relatively young across here in the UK, as it is has no way achieved the lofty successes of the <strong>SXSW Festival </strong>in Texas. The sparse crowd at the <strong>Deaf Institute </strong>highlights this, perhaps as we are too content or too expectant that bands will all be presented to us one after another, with the accepted twenty minute stage change in between. We need to broaden our sights, and develop a sense of discovery about our music. The urban festival encourages this discovery, and I am confident that the <strong>Dot to Dot Festival </strong>marks the beginning of the move to a new found land of engagement with live music.</p>\n<p>Be sure to keep checking back over the coming days for interviews with the bands mentioned in this article, and others including <strong>Zane Lowe, Los Campesinos, </strong>and <strong>The Chapman Family!</strong></p>\n<p><iframe src=\"https://www.facebook.com/plugins/likebox.php?id=114090381951328&width=292&connections=10&stream=false&header=false&height=255\" scrolling=\"no\" frameborder=\"0\" style=\"border:none; overflow:hidden; width:292px; height:255px;\" allowTransparency=\"true\"></iframe></p>\n","slug":"1220-review-dot-to-dot-festival-manchester","category":"festivals","date":1276126417000,"wpid":1220,"isSticky":false,"featured_image":{"width":389,"height":484,"src":"2010/06/dot-to-dot-manchester.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAANAAoDASIAAhEBAxEB/8QAFwAAAwEAAAAAAAAAAAAAAAAAAwQFB//EAB8QAAIBBAMBAQAAAAAAAAAAAAECAwAEBSERElET0f/EABUBAQEAAAAAAAAAAAAAAAAAAAAE/8QAGxEAAQUBAQAAAAAAAAAAAAAAAQACAxEhIpH/2gAMAwEAAhEDEQA/AM4wuKxs+FuprpoBdxMqpCrakBG2bfuuB7USbEJ9X6tGB2PAAGqYss3IVAaFCeNnX5QJc3OZXPRNk0aNKqmk4bRr3V//2Q=="},"createdAt":1587295206986,"updatedAt":1588403566806,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2010/06/dot-to-dot-manchester.jpg","categories":["festivals","music"]}