{"id":"5e9c2d8a9b6559241525d713","artists":["5e9b68f27a1236eccfeb2039"],"title":"New: FAMY – Mother Benita / DOGG DOGG","content":"<p>Having changed their name from<strong> FAMILY</strong> to <a href=\"https://www.</p><p>facebook.com/pages/FAMY/148719931815786?sk=wall\" target=\"_blank\"><strong>FAMY</strong></a> a couple of weeks back, the London based folk-pop outfit have now complicated things even more by removing the majority of their music from their <a href=\"https://family.bandcamp.com/album/12\" target=\"_blank\">bandcamp</a> site. However, don’t fret son, as they still have a handful of tracks to stream and download over at their <a href=\"https://soundcloud.com/famy\" target=\"_blank\">soundcloud</a>; although I suspect it won’t be long before these disappear as well. Alongside this mystery building, the group have also announced their first physical release, a 12″ featuring a re-recorded version of <em>Mother Benita</em> and a new track on the B-side in the form of <em>DOGG DOGG</em>.</p>\n<p>Both tracks were recorded in December, with the help of <strong>WU LYF</strong> guitarist<strong> Evans</strong>, and continue in the church-choir influenced vein that we’ve come to expect from the London outfit. <em>Mother Benita</em> glides in somewhere between <strong>Noah and the Whale</strong> and <strong>Guided By Voices</strong>; harmonious, tender and moving, yet without straying too far from their comfort zone. B-Side <em>DOGG DOGG</em> is arguably the more admirable track, with the lead singer yearning ‘<em>you let go of the things that you know’</em>, proving instantaneously intriguing. Towards the latter half of the track, the now stereotypical reverb-laden guitar of<strong> Evans</strong> (<strong>WU LYF</strong>) can be heard, alongside shrieked vocals, vaguely reminiscent of their Manchester friends. With these two tracks, <strong>FAMY</strong> have well and truly reasserted the belief that 2012 is destined to be a big year for them.</p>\n<p><iframe style=\"position: relative; display: block; width: 400px; height: 100px;\" src=\"https://bandcamp.com/EmbeddedPlayer/v=2/album=1963853906/size=venti/bgcol=FFFFFF/linkcol=4285BB/\" frameborder=\"0\" width=\"400\" height=\"100\"></iframe></p>\n","slug":"12233-new-famy-mother-benita-dogg-dogg","category":"music","date":1320248744000,"wpid":12233,"isSticky":false,"featured_image":null,"createdAt":1587293578068,"updatedAt":1588441787589,"author":"5e9b68b27a1236eccfeb1d27","old_image":"generated/462831929a3fe56c2e651d2ba9a236654a6ac9c5.jpg","categories":["music","new"]}