{"id":"5e9c2d3b9b6559241525d6da","artists":["5e9b68e07a1236eccfeb1eec"],"title":"Review: Cher Lloyd – Sticks & Stones","content":"<p>It’s widely acknowledged that the first step towards solving a problem, is admitting that said problem exists.</p><p> So here goes, I’ll say it. I like <strong>Cher Lloyd</strong>. She’s cute, her ‘attitude’ is adorable and, well, she’s has a cracking voice. In many ways, her rise through the X-Factor was the ideal opportunity for her to gain vital career experience, as well as promote her talent to potential producers and collaborators. It speaks volumes that whilst last years winner <strong>Matt Cardle</strong> was recording a horrendous version of an already dire <strong>Biffy Clyro</strong> track,  <strong>Lloyd</strong> was jetting off to the States to work with world renowned producer <strong>Red One</strong>.</p>\n<p>Her debut album <strong><em>Sticks & Stones</em></strong>, released on Monday appears as a rather bizarre collection of tracks, almost solely down to the numerous production credits listed on the album. With six different producers across only ten tracks, it was always going to feel rather disjointed, especially with THAT track sitting amongst the middle. So, before going any further I’ll get THAT track out the way.</p>\n<p>Is <em>Swagger Jagger</em> a good song? No, not really. Is it the worst song ever written? Hell no, it’s not even the worst song featuring the word Jagger in it (congrats <strong><a href=\"https://www.youtube.com/watch?v=iEPTlhBmwRg\" target=\"_blank\">Maroon 5</a></strong>). Scanning down the charts, and the majority of the top ten is currently comprised of tracks that are in a similar league quality wise. The critical dismissal <em>Swagger Jagger</em> received owes much to the modern age of exaggeration, and of those insecure and naive enough to feel obliged to adopt the opinions of few and treat them as gospel.</p>\n<p>So with that out the way, it only seems right to mention one of the best pop singles of the year, in the form of<strong> Cher’s</strong> <em>With Ur Love</em>. Annoying text-speak title aside, it’s a cracking track, more than making up for the failings of <em>Swagger Jagger</em>. Well, that is until the downright creepy <strong>Mike Posner</strong> pipes up, sleazily delivering the lines ”<em>I could slow it down, speed it up, how you want it girl, all night long</em>” and “<em>1st date, 1st base, 2nd date, 2nd base, 3rd date, you’re looking at me funny</em>” with all the charm of a convicted sex offender.</p>\n<p>Elsewhere on <em><strong>Sticks & Stones</strong></em>, opener <em>Grow Up</em> is a signal of intent if I ever heard one, with <strong>Lloyd</strong> snarling “<em>I don’t know what you heard ’bout me, don’t remember holding out my pinky. I’m gonna finish off these MCs, like they were my cup of tea</em>“. It this attitude that has contributed to the hate/love relationship she currently has with the public; and personally, I love it. Sure, there are times when she comes across as a diluted<strong> Nicki Minaj</strong>, yet it’s refreshing to hear an artist with such passion for their own creative output.</p>\n<p>That’s not to say<strong> Lloyd</strong> doesn’t suffer from overconfidence, with the dreary balladry of <em>Beautiful People</em> and album closer <em>End Up Here</em> being fine examples of such slips ups. The criminally embarrassing <em>Dub On The Track</em> deserves any panning that comes it’s way, with what is merely an attempt to jump upon a current dance-driven bandwagon, ala <em>Swagger Jagger</em>. It’s also a shame that she fails to deliver on her earlier promises of ‘<em>finish[ing] off MC’s</em>‘, with the aforementioned <em>Grow Up</em> and the <strong>Red One</strong> produced <em>Playa Boi</em> being the only real opportunities where her vocal delivery showcases her stereotypical bite.</p>\n<p>The latter is possibly the highlight of <strong><em>Sticks & Stones</em></strong>; a number one in waiting if I ever heard one. Ridiculously catchy choruses, unquenchable attitude, and no uses of that vile word ‘swag’. Perfect. When coupled with the hugely R’n’B influenced <em>Superhero</em>, it makes for the finest pairing on the record.</p>\n<p>It goes without saying that <em><strong>Sticks & Stones</strong></em> hardly breaks any boundaries with regards to lyrical content, ‘<em>I rhyme like a bee but I sing like a flower</em>‘ (<em>On The Moon</em>) and ‘<em>I’m a princess, I don’t wanna be the queen, please don’t say a thing Mr Bean</em>‘ (<em>Grow Up</em>) being laugh-out-loud examples of childish inexperience.</p>\n<p>So all in all, there’s plenty to enjoy on <strong>Cher’s</strong> debut attempt, namely the in-your-face pop tracks and the unshakeable knack for finding a winning hook. On the downside, I was hoping for an out and out fragile ballad in the mold of her cover of <a href=\"https://www.youtube.com/watch?v=1xqIdFU0TRg\" target=\"_blank\">Stay</a>, and perhaps slightly more of <strong>Cher’s</strong> unfazeable raw attitude that initially attracted me to her in the first place. That aside, it’s an accomplished pop record, cementing <strong>Cher Lloyd</strong> as one of the most exciting young entertainers around at the moment.</p>\n<p> </p>\n","slug":"12273-review-cher-lloyd-sticks-stones","category":"album-reviews","date":1321031161000,"wpid":12273,"isSticky":false,"featured_image":null,"createdAt":1587293500000,"updatedAt":1588441786702,"author":"5e9b68b27a1236eccfeb1d27","old_image":"generated/fd800c71038196dd35a285fe72099ce057b63f36.jpg","categories":["album-reviews","music"]}