{"id":"5e9c33ef9b6559241525e13e","title":"Stag and Dagger: The Antlers and Blood Red Shoes","content":"<p><strong>The Antlers</strong> are the first band to grace the main stage at <strong>Stag and Dagger Festival </strong>in Glasgow, beginning their performance at shortly after seven o’clock.</p><p> <em>Hospice</em>, last year’s critically acclaimed epic release from the band, is played in almost it’s entirety, and unlike the majority of the album, their show features a prominent use of the drums. Whilst many of<strong> The Antlers </strong>finest songs rely on the fragility and beauty of <strong>Peter Silberman’s </strong>vocals, live they feel the need to translate the songs into more accessible anthems. Unfortunately, the songs lost the edge which had made them so perfectly intricate and transcendent, however it was still enjoyable to experience <strong>Silberman’s</strong> fantastic vocal harmonies, despite them being almost drowned out by percussion.</p>\n<p>Shortly after the set we caught up with frontman<strong> Peter Silberman</strong>, who is was reserved and thankful for any praise the band received from passersby. During our conversation he is keen to assert the group as a band, and not just a solo project as they were previously, even confirming that for their next album it will be a “joint effort” with all parties having equal influence over the recordings. When asked about the deeply emotional <em>Hospice</em>, and whether <strong>Silberman</strong> was writing from personal experience, he told us “some of it, some was other peoples”. <strong>Silberman </strong>spoke of his exciting at performing at <strong>Latitude Festival </strong>later in the year, especially playing directly before <strong>The National</strong>, which should be a thrilling opportunity to perform to an appreciative and well-suited crowd.</p>\n<p>Earlier in the day outside <strong>The Captains Rest</strong>, we chatted with<strong> Steven</strong> and<strong> Laura-Mary</strong>, or duo Brighton rock duo <strong>Blood Red Shoes </strong>as they are better known. With their headlining set in the downstairs venue underneath the pub in a few hours, <strong>Stephen </strong>spoke of his excitement at playing in such a small and compact venue. We also queried the guys on any plans for the rest of the summer, and the possibility of future releases.</p>\n<p><em>CitR: </em>Which bands did you take inspiration from when you first started?</p>\n<p><strong>I don’t think we had a main inspiration, we just wanted to start a band. We didn’t have like one band that we were like “shit we want to be in a band”. We both were in bands before, so it was more the fact that we liked each others previous bands.</strong></p>\n<p><em>CitR: </em>When you’re on tour, which are your favourite places to play, which cities do you especially enjoy playing in?</p>\n<p><strong>Amsterdam, Berlin, Hamburg are very cool, Tokyo as well. And in the UK… Manchester is quite nice, it’s cool, and Leeds. The last show we did in Brighton was really good. We did Great Escape there, that was really fun, it was just complete chaos!</strong></p>\n<p><em>CitR: </em>What kind of venues do you like playing in? Like smaller ones downstairs, or larger stages?</p>\n<p><strong>I actually really like bigger places, when we first started playing bigger places I was really worried it wasn’t going to be as fun, that it might be really weird, disconnected from the audience, but actually it was really good! The last tour we did, we were usually playing 500 to 1,000 sized places, that size is good. You can make it really fucking loud, and you’re still really near the audience, so when they really react, it’s really cool. We played last night in a place that was a tiny bit bigger than this, and that was really fun. The slightly bigger places, sound bigger, and louder, I like it when the PA is bigger, so you can fucking really create a massive noise!</strong></p>\n<p><em>CitR:</em> Do you ever feel any pressure from your record label to produce an album that is going to sell?</p>\n<p><strong>Nope! (laughs) We don’t really have a conventional record deal, we have like a licensing deal, and without going into the technical stuff, basically it means that we pay for the recording of the album. It just means that we make the record and give it to the label, and sign a deal which means they have the right to release it in a certain amount of countries. We deliver it, and do the artwork, and they set up the process of it going into the shops and releasing it. You can do that, or you can go for loads of money, that means they have loads of clauses, we went for way less money, but more control. Much more fun that way as well.</strong></p>\n<p><em>CitR: </em>Yeah, quite a few bands seem to be doing similar things these days, giving away or having more control over the content of the album.</p>\n<p><strong>Yeah, well now that the conventional way of releasing a record has changed, the industry is changing as well.</strong></p>\n<p><em>CitR: </em>What are your plans for the rest of the year?</p>\n<p><strong>We’re going to play fucking loads, loads of festivals round the world then we’re going to come back and tour the UK and US, all round Europe and Japan, then Australia. Then next year we’re going to release a new EP, if we get time to write it and record it!</strong></p>\n<p><em>CitR: </em>How do you find touring in the US?</p>\n<p><strong>We haven’t done it yet actually! This is going to be our first time. We’re going literally back to zero, starting at that point where we are trying to prove to the audience that we are worth it.</strong></p>\n<p><em>CitR : </em>It’s a pretty small place down there (Captains Rest), how do you think it will go?</p>\n<p><strong>Yeah it’s a square box, the stage is alright actually. I think it’s cool, as long as it’s loud enough, then it’ll be really fun. The only problem you ever get with small places is if the PA isn’t loud enough, then you can’t hear the vocals, and then people just don’t know what the fuck is going on.</strong></p>\n<p><em>CitR: </em>Any bands you’d recommend going to see today?</p>\n<p><strong>Turbofruits, I’m not really sure who else is playing, they’re the only band who I really wanted to see.</strong></p>\n<p style=\"text-align: center;\"><a href=\"https://www.bloodredshoes.co.uk/\">Check out Blood Red Shoes Official Site</a></p>\n<p style=\"text-align: center;\"><a href=\"https://antlersmusic.com/\">Check out The Antlers Official Site</a></p>\n","slug":"1227-stag-and-dagger-the-antlers-and-blood-red-shoes","category":"festivals","date":1275655556000,"wpid":1227,"isSticky":false,"featured_image":{"width":2741,"height":2313,"src":"2010/06/img_1674-e1275659345871.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAIAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAEH/8QAHhAAAgEEAwEAAAAAAAAAAAAAAQIDAAQREgUhURP/xAAUAQEAAAAAAAAAAAAAAAAAAAAC/8QAFREBAQAAAAAAAAAAAAAAAAAAABH/2gAMAwEAAhEDEQA/AMBitUuGtFYfIFhu5Oc576A88qT8JIJ5BElw8YY6sLdhsM9HFKUxr//Z"},"createdAt":1587295215458,"updatedAt":1588403566962,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2010/06/img_1674-e1275659345871.jpg","categories":["festivals","interviews","music"]}