{"id":"5e9c2d079b6559241525d6b8","artists":["5e9b695d7a1236eccfeb26dd"],"title":"Competition: Warehouse Project – Fake Blood 2nd December","content":"<p>It still hasn’t settled for me that this really is the end of Store Street.</p><p> While I admit I came late to the wonder that is <strong>Warehouse Project, </strong>you’d be hard pressed to live in Manchester and not have attended, or even affected by, a night at Store Street. Season after season the folk behind <strong>WHP </strong>have brought in some of the world’s finest DJ’s and electronic acts, and in doing so made sure Manchester remains an important, and relevant, music city.</p>\n<p>However before we get too sentimental, this final furor of 5am finishes and unforgettable sets stands to be one of the finest examples of <strong>WHP </strong>to date. We’ve already been luck enough to send two lucky people to see <strong>Boys Noize</strong>, and <strong>Will </strong>was able to enjoy all but the unfortunate disappointment that was <strong>Jamie XX</strong>‘s headline slot. Therefore what better next step than to be able to offer <strong>a pair of tickets</strong> to see <strong>Fake Blood </strong>& co perform on the 2nd December. You can find the full event listing <strong><a href=\"https://www.thewarehouseproject.com/eventProfile.php?eid=27\">here</a></strong>, however the sterling line up includes <strong>Erol Alkan, Boy 8 Bit, Bowski, Clouds, XXXY, </strong>and a rare performance by the great <strong>Jacques Lu Cont</strong>. Needless to say this stands to be an absolutely amazing night.</p>\n<p>To stand a chance to win a pair of tickets to this sold out event, all you have to do is comment beneath this article (it can be anything, but bonus points will be awarded for something that makes us laugh), or retweet it from our <strong><a href=\"https://twitter.com/#!/crackintheroad/status/137142875459813377\" target=\"_blank\">Twitter</a></strong>. This competition will run until 11:59pm on the 30th November, and the winner announced at Midday on the 31st November.</p>\n<p>Winners will be chosen at random and notified via Twitter or Facebook. Double entries via Twitter and Facebook are allowed. All tickets will be available to pick up via the guestlist to prevent ticket touts. All entrants must be 18+. Get sharing!</p>\n<p> </p>\n","slug":"12306-competition-warehouse-project-fake-blood-2nd-december","category":"competitions","date":1321525812000,"wpid":12306,"isSticky":false,"featured_image":null,"createdAt":1587293447467,"updatedAt":1588441786090,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"generated/ab67616d0000b273084e7654924396fd1bccf30c.jpg","categories":["competitions","music"]}