{"id":"5e9c2d619b6559241525d6fb","artists":["5e9b69317a1236eccfeb2435"],"title":"Review: Pianos Become The Teeth – The Lack Long After","content":"<p>It’s a plight generally confined to the fanboys, the critics, the librarians of popular music, but occasionally, something happens, and you start to want to reassess your tried and trusted pigeonholes with a conviction that wasn’t there before.</p><p> I don’t think I’m ashamed of my use of those pigeonholes. My business is words more than anything else, and so I like having words to call things by, even if they do end up becoming misinterpreted, warped, loaded, and reviled, which is how this whole situation arose.</p>\n<p><strong>Pianos Become The Teeth</strong>, as evidenced first by last year’s storming debut full length <strong><em>Old Pride</em></strong>, make their music with loud guitars, abrasive in tone but melodic in output, leavened with a judicious uses of delay and reverb. They underpin this with tightly controlled explosions of spastic rhythm, and fling desperate screams over the top of it all. I’m sure you know which of your favourite new musical terms you would apply to this description.</p>\n<p>I do not want to call <strong><em>The Lack Long After</em></strong>, Pianos’ sophomore effort, a hardcore record, because it’s not. I do not want to call it post-hardcore, an unwieldy and academic label that’s become so confused and overapplied that it’s lost most of its clout. I do not want to call the record screamo, because the term is ridiculous. ‘Real screamo’, doubly so. So I’ll settle, in my perverse desire for definition, for saying this. <strong><em>The Lack Long After </em></strong>is a fantastic record, a fantastic follow up to a fantastic debut that, if anything, exceeds its predecessor in quality. None of the above terms do it justice. This is not a lazy statement.</p>\n<p>For all my dramatics, the last thing I want is to place an inordinate amount of hype on the Baltimoreans’ shoulders, or throw empty hyperbole around. The songs contained within <strong><em>The Lack Long After</em></strong> are not wildly musically original – every ‘for fans of’ tagline that invariably comes with a band’s press reads as accurate. It’s easy to hear the likes of Envy, Funeral Diner, and City of Caterpillar in Pianos’ sound. But whilst Pianos Become The Teeth aren’t the saviours of modern music, if such a thing can or needs to exist, they are producing music of exceptional quality within (and hell, without) the boundaries of their sound.</p>\n<p><strong><em>The Lack Long After </em></strong>is largely about the loss of vocalist Kyle Durfey’s father. It’s a tough subject to commit to tape, both from his point of view and ours, but Pianos’ music, furious and elegiac in equal measure, presents itself here as a particularly effective way to express those issues. Where a song like <em>Shared Bodies </em>carries itself with much of the threatening lumber of hardcore, it sits comfortably next to <em>Such Confidence</em>, which drifts in on plangent clean tones before cutting loose. The approach isn’t a new one, but it’s one that works perfectly in this context, and when Durfey sob-screams ‘if you could only read my mind’ at a lull in the opening <em>I’ll Be Damned</em>, it’s symptomatic of <strong><em>The Lack Long After </em></strong>as a whole. This is a man who’s put very little distance between his life and his recorded output and, without wanting to become fanciful, <strong><em>The Lack Long After</em></strong> seems at least a glimpse into that mind, both in sound and lyrical content. Certainly from that line onward, if not from the crashing guitars that open the record and make up the minutes preceding it, there’s very little ground between the listener and the band. It can be uncomfortable – sentiment moves slow and painful over the course of the record, from ‘I’ll Be Damned’, to ‘I’ll Get By’, encompassing some interesting middle ground (I think the clerical putdown in <em>Such Confidence </em>is my favourite) on the way, and at the close of <strong><em>The Lack Long After</em></strong>‘s weighty thirty nine minutes, the first signs of progression into healing are genuinely (and I mean genuinely) pleasing to note, carried on gentle, floating chords.</p>\n<p>I still find myself without satisfactory nomenclature for the music contained on <strong><em>The Lack Long After</em></strong>, but I do know this. I know that <em>Good Times </em>is one of the best born from turmoil guitar songs that I’ve heard all year. I know that Durfey’s admission at the close of <em>I’ll Get By</em>, that ‘it’s a hell of a thing’, is as singular in intent and diverse in meaning and powerful in effect as one could wish for from a lone line. And I know that <strong><em>The Lack Long After </em></strong>represents a triumph for Pianos Become The Teeth, that they’ve expressed themselves near-perfectly in their personal trials, and that the dogged and unassuming quality of the record represents a triumph in music as a whole. Sometimes it’s easier to look like you’re pushing at boundaries than to exist at your level best within them, and with <strong><em>The Lack Long After</em></strong>, Pianos Become The Teeth have begun mastering the latter.</p>\n<p><strong><em>The Lack Long After </em></strong>is out now via <a title=\"BECAUSE I COULD LOVE AND DROWN IN YOUR GODDAMN SMILE LINES\" href=\"https://www.topshelfrecords.bigcartel.com/product/pianos-become-the-teeth-the-lack-long-after-lp-2nd-pressing\">Topshelf Records</a></p>\n<p> </p>\n<p> </p>\n","slug":"12329-review-pianos-become-the-teeth-the-lack-long-after","category":"music","date":1320788439000,"wpid":12329,"isSticky":false,"featured_image":null,"createdAt":1587293537206,"updatedAt":1588441787075,"author":"5e9b68b27a1236eccfeb1d3c","old_image":"generated/4cc8018f558e6cb879f84ff104047dc0562efd54.jpg","categories":["music","reviews"]}