{"id":"5e9c33ed9b6559241525e138","title":"More Than a Kick-About","content":"<p><a href=\"https://admin.</p><p>crackintheroad.com/uploads/2010/06/footballers-at-the-piazza-san-giovanni0041.jpg\"><img class=\"aligncenter size-full wp-image-1251\" src=\"https://api.crackintheroad.com/wp-content/uploads/2010/06/footballers-at-the-piazza-san-giovanni0041.jpg\" alt=\"\" width=\"630\" height=\"422\" srcset=\"https://api.crackintheroad.com/images/2010/06/footballers-at-the-piazza-san-giovanni0041.jpg 630w, https://api.crackintheroad.com/images/2010/06/footballers-at-the-piazza-san-giovanni0041-300x200.jpg 300w, https://api.crackintheroad.com/images/2010/06/footballers-at-the-piazza-san-giovanni0041-494x330.jpg 494w, https://api.crackintheroad.com/images/2010/06/footballers-at-the-piazza-san-giovanni0041-165x110.jpg 165w\" sizes=\"(max-width: 630px) 100vw, 630px\" /></a></p>\n<p>As this summer’s world cup looms large the traditional English cocktail of mesmerisation, celebration and commiseration will be served, not always in healthy measures, across the pubs and clubs of this Island nation. The countries passion, pride and emotional prosperity are irreversibly intertwined with what we like to call ‘the beautiful game’.</p>\n<p>However, this is a sport much like the tragic-comedy masks of theatre; a fitting simile with a perverse undercurrent, one far less pleasing than the other. An association notoriously scrutinised by the media, the correlation between football and violence is unavoidable. In 1886 the modern game got its first taste of what was later to become the casual movement, as ‘Prestonians’ clashed with Queen’s Park ‘ruffians’ under the archaic arches of the Preston Train station. In this country especially men have always fought men to protect the ‘valour’ of their chosen club, it is a societal ailment which has spread across the world; yet commonly dubbed the ‘English disease’.</p>\n<p>Conversely a far less reported tale is of the domestic divisions and the often bloody collision’s which occur following an international defeat, or even victory, as outwardly pleasant homes across the nation are temporarily incensed . Statistics state that inter-spousal aggression more often than not come from the male party, this figure can rise up to as much as 10% more on match day weekends, as the fervour for the game boils over in the confines of fan’s homes. This is a statistic that is undoubtedly shocking and quite disastrously demonstrates the importance a single game or result can have on a select few. It is obvious that for many football goes beyond a game; it is an uncontrollable and inherent way of life.</p>\n<p>In South Africa itself, away from the Floodlit Mecca of the 94,700 capacity Johannesburg Soccer City Stadium, there lies a dark underbelly of South African poverty, desperation and drugs; which in many ways poses a far superior problem to that of the ‘English Disease’. Ironically the infamous township of Soweto lies just next to this incongruous architectural triumph, an example of the extremities of South African society that may become a symbol of world cup violence. Excluding the obligatory Panorama special illuminating the legacy left by Apartheid and Mandela, there is in fact a distressingly small amount of  genuine and pro-active international action or insight being taken, to ensure equilibrium in this most disproportionate of micro societies. Crystal Meth or as it is more commonly known in these townships as ‘Tik’, is cooked up as often as a kettle is boiled in Britain; the word narcotic, meaning ‘reality distortion’ is one of particular significance and requirement here. The average lifespan for those in the townships is around 31, yet with so many mixed up in the gang culture this figure is somewhat presumptuous.</p>\n<p>The ghoulishly named numbers gangs of the 26’s 27’s and the 28’s haunt these townships with their prison inflicted tattoos and notoriously remorseless mentality. Murder, prostitution and drugs become a necessary currency, as members attempt to climb the rickety ladder of gang recognition. Although this gang is more renowned as an organised prison gang, it has an almost complex set of tentacles that reach far into deprived areas to exploit the next generation of hopeless youth. Needless to say the argument between national and private healthcare isn’t too hotly debated here. Life will suffice.</p>\n<p>As the extravagance and razzmatazz of the finals will hopefully take centre stage, the networking power of football will entwine the nations of the world with a romance greater than any Veronese love tale. World leaders such as Obama, Berlusconi, and dare I say it Cameron, will pile clichéd praise on the hope which blossoms out of such enormous international sporting events. It is these same leaders who will transfer their election manifesto clichés of defiance and equality onto the suffering of those helplessly trapped within the townships, and those affected by football related violence. This goes beyond a game.</p>\n<p><strong>Written by Sam Heaney</strong></p>\n","slug":"1247-more-than-a-kick-about","category":"life","date":1275855570000,"wpid":1247,"isSticky":false,"featured_image":{"width":630,"height":422,"src":"2010/06/footballers-at-the-piazza-san-giovanni0041.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAAAAb/xAAiEAABAwMDBQAAAAAAAAAAAAABAgQFAAMhBhExBxMUIkH/xAAVAQEBAAAAAAAAAAAAAAAAAAABAv/EABYRAQEBAAAAAAAAAAAAAAAAAAEAIf/aAAwDAQACEQMRAD8Ai+qsZGQpbmMiEN2d9ZR3/IUpe4A9QDxwc5OTUa2jtOqb2jdfPRcKQVAJwDtn5SlBpU43/9k="},"createdAt":1587295213037,"updatedAt":1588403566909,"author":"5e9b68b27a1236eccfeb1d24","old_image":"2010/06/footballers-at-the-piazza-san-giovanni0041.jpg","categories":["life"]}