{"id":"5e9c2d369b6559241525d6d5","artists":["5e9b68ec7a1236eccfeb1ffc"],"title":"Video: Embers – Tunnel Vision","content":"<p>Much is made of the negative aspects surrounding the ‘internet age’.</p><p> We’ve all heard bands moan about not seeing an immediate return on recording costs, but what of the positive elements regarding the ever-morphing industry? One such avenue that I believe has immeasurable potential, is the power of visuals to accompany music. With the likes of <strong>WU LYF</strong>, <strong>Christian AIDS</strong> and everyone’s favourite punching bag <strong>Lana Del Rey</strong> embracing modern times with fantastic visual creations, there’s no doubting the extra level of emotional and intellectual integrity it adds to the music.</p>\n<p>Manchester’s <a href=\"https://www.facebook.com/pages/Embers/212719658738967\" target=\"_blank\"><strong>Embers</strong></a> have just released a trio of videos for their three debut tracks, <em>Tunnel Vision</em>, <em>Days Turn Into Weeks</em> and <em>Without Fear or Favour</em>, all of which are thought-provoking experiences. My choice cut, the deliriously rampant<em> Tunnel Vision</em> is a fuzz-driven number, accompanied by sampled clips torn from various sources, showing desolation, isolation and desperation at their most extreme. Static echoes throughout the track, alongside the choppy images and hazy shots of bleak, harsh loneliness. Check out <em>Tunnel Vision</em> below, and head over to the <strong>Embers</strong> <a href=\"https://www.youtube.com/embersembers#p/a/u/0/lh8CDWTneQg\" target=\"_blank\">Youtube</a> channel for the two other videos.</p>\n<p><iframe src=\"https://www.youtube.com/embed/lh8CDWTneQg\" frameborder=\"0\" width=\"560\" height=\"315\"></iframe></p>\n","slug":"12497-video-embers-tunnel-vision","category":"music","date":1321054502000,"wpid":12497,"isSticky":false,"featured_image":null,"createdAt":1587293494171,"updatedAt":1588441786649,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/11/screen-shot-2011-11-12-at-00.33.14-165x165.png","categories":["music","new","videos"]}