{"id":"5e9c2d2b9b6559241525d6cd","artists":["5e9b68e07a1236eccfeb1ef1"],"title":"Introducing: Cholombian","content":"<p>Turn off X-Factor, put your phone on silent and recall your finest pair of headphones, ‘cus <strong>Cholombian</strong> is taking you on a journey.</p><p> Hailing from Southampton, his ambient soundscapes are engrossing in a way that is rarely possible. On his new EP, entitled <em><strong>II</strong></em>, there’s a delicately moving knowledge of atmosphere that elevates it above the vast majority of instrumental producers, fusing piano chords, glitchy beats and reverbed samples to expert effect. <em>Bitter Ends</em> draws the listener right to the edge, dangling them precariously before jolting them back into reality, flowing straight into the simplistically resplendent <em>Like Caged Animals</em>.</p>\n<p>Technically, there’s no ground breaking musicianship, but it’s <strong>Cholombian’s</strong> ability to piece together his tracks in such a versatile way that allows this EP to succeed. A wash with drone based synths and lose hi-hats, you will find few listening experiences like it this year. There’s an underlying post-rock influence to his work, that prevents it from becoming stagnant and self-indulgent, leading the listener on a stimulatingly organic experience. Check out <em>Bitter Ends</em> below, and head over to <strong>Cholombian’s</strong> <a href=\"https://cholombian.bandcamp.com/\" target=\"_blank\">bandcamp</a> to grab the rest of the EP for free.</p>\n<p><iframe style=\"position: relative; display: block; width: 400px; height: 100px;\" src=\"https://bandcamp.com/EmbeddedPlayer/v=2/track=1060235676/size=venti/bgcol=FFFFFF/linkcol=4285BB/\" frameborder=\"0\" width=\"400\" height=\"100\"></iframe></p>\n","slug":"12524-introducing-cholombian","category":"introducing","date":1321208675000,"wpid":12524,"isSticky":false,"featured_image":null,"createdAt":1587293483402,"updatedAt":1588441786515,"author":"5e9b68b27a1236eccfeb1d27","old_image":"generated/708990c9685ff4345982bd18ae5a5f757664a0c2.jpg","categories":["introducing","mpfree","new","music"]}