{"id":"5e9c2d269b6559241525d6ca","artists":["5e9b69257a1236eccfeb2383"],"title":"Interview: Neon Indian","content":"<p><a href=\"https://admin.</p><p>crackintheroad.com/music/12547-interview-neon-indian/attachment/neon_indian_aug_11_417/\" rel=\"attachment wp-att-12548\"><img class=\"alignleft size-singlepost wp-image-12548\" title=\"NEON_InDIAN\" src=\"https://api.crackintheroad.com/uploads/2011/11/NEON_INDIAN_AUG_11_417-950x633.jpg\" alt=\"\" width=\"950\" height=\"633\" /></a>A few days before taking to the stage at London’s Heaven, Alan Polomo, better known as <strong>Neon Indian</strong>, sits down with <em><strong>CitR</strong></em> to talk drugs, Vegas, and (you guessed it) chillwave.</p>\n<p><strong>CitR: Can you give a brief outline of how Neon Indian came about?</strong></p>\n<p><em>AP:  I was in Austen, Texas and had just wrapped up <strong>VEGA</strong>, which is another project of mine, and I started writing these songs as a creative exercise – I didn’t really have criteria for what they were supposed to sound like. The first one was Should Have Taken Acid With You, which was written as a tongue-in-cheek apology for an ex-girlfriend who I had arranged to have an acid date with in Texas, where we both grew up, and I kind of flaked out on that so I wrote her this song. I tried to rewrite it as a <strong>VEGA</strong> song, but it just didn’t work and I just reached the conclusion that I needed to write more songs in that style, and in a month and half’s time I had <strong>Psychic Chasms</strong>.</em></p>\n<p><strong>CitR: Do you regard Psychic Chasms and Era Extraña as separate entities, or do you see the latter as a thematic and stylistic continuation of the former?</strong></p>\n<p><em>AP:  I don’t really document things very well – if I’m in a room, I don’t take pictures. I try to keep a journal, and after three or four days I get tired of it and just stop and pick it up later. So in a weird way, when I sit down and write a record I try to make it feel like this amalgamation of all the things I’ve been thinking and listening to. The reason I sampled <strong>Todd Rundgren</strong> in the last record is because it’s all I was listening to, or if I sample my dad because it was an important part of my life and that definitely makes its way onto the lyrical subject matter. For Era Extrana I suddenly found myself in this place where I could think about the last year and a half, and I was listening to a lot of the same records that I was checking out in high school – early <strong>Sonic Youth</strong>, <strong>Bad Moon Rising</strong>, <strong>My Bloody Valentine</strong> – a lot of records that were very much guitar driven, and I felt like I was writing songs that could be played on guitar but were reimagined with synths.</em></p>\n<p><strong>CitR: You mentioned acid before. Do you find drug use influences your music in any way?</strong></p>\n<p><em>AP: Not much, really. It’s certainly part of the narrative of where I grew up and what my life is like, but I generally find that I can’t really write under the influence of psychedelics. They’re more about the defining experiences that I have with people and that teenage sense of indestructability which permeates itself into your subconscious. It’s part of the story, but it’s not driving the narrative.</em></p>\n<p><strong>CitR: Era Extraña leaked before release. Do you find that particularly disheartening or flattering?</strong></p>\n<p><em>AP:  It is what it is, in the current climate. I can’t act like I’ve never downloaded music so to get up in arms about it would be hypocritical. If anything, I was surprised that it leaked so late. In the US, it leaked when we finally put up a stream of it. These days, if you want someone to buy your record they have to believe that its justified and really believe in it. If anything, it forces the artist to make a record that can generate that sort of hype.</em></p>\n<p><strong>CitR: Do you regard yourself, as a lot of blogs and websites have, as one of the artists on the forefront of…</strong></p>\n<p><em>AP:  Chillwave? I kind of feel that whereas musical movements, even 5 or 6 years ago, arose out of the same cities and aesthetic choices, now it just takes a blog to notice that three or four artists sound the same and call it a movement.  I didn’t know anyone from those bands until they wrote about us in the same sentence. But at the same time, I remember when I heard a band I’d want to hear everything that sounded like it – I’d feel like I was tapping into something even if I wasn’t, so it might expose you to a set of bands that make it seem like there’s an on-going aesthetic similarity and I don’t see a problem with that.</em></p>\n<p><strong>CitR: What have been your best and worst moments of your current tour?</strong></p>\n<p><em>AP:  Best moment – Moogfest, getting to see <strong>Suicide </strong>play <strong>Suicide</strong>. Worst moment… happened in Las Vegas. That’s all I’m going to say. Not for the reasons that you’d think, but more so for trashed hotel rooms. They definitely do everything in their power to put you in that mindset of “You’re in Vegas, baby, anything could happen”. </em></p>\n<p><strong>CitR: Any plans for 2012?</strong></p>\n<p><em>AP: Obviously for this record, I’ll be on the road for a while yet. I think at some point I’d like to focus more on recording than touring, because I feel like more of a studio creature by habit. I’d like to put out another <strong>Neon Indian</strong> and another <strong>VEGA</strong> record in the next year.</em></p>\n<p><strong>CitR: If you could collaborate with any artist, who would it be?</strong></p>\n<p><em>AP:  I feel like <strong>The Flaming Lips</strong> were those dudes, that was one of the most surreal days of my life. And even then I had the pleasure of getting to meet some of these artists, like <strong>M83</strong> and <strong>Flying Lotus</strong>, and if I could make a track with someone like that would be pretty awesome.</em></p>\n<p><strong>CitR: Where would you like to be in 5 or 10 years time?</strong></p>\n<p><em>AP: I feel like I had more of an understanding of something like that at the end of High School, where you feel like the world exists in one way and it has one dimension to it. Once every six months if you ask me that question it’ll mean something completely different. At this point, I’d like to wake up and be able to do something creative under whatever medium. As long as I’ll be doing that, I’ll be happy.</em></p>\n<p>Check out our review of <strong><em>Era Extraña </em></strong><a title=\"Review: Neon Indian - Era Extraña\" href=\"www.crackintheroad.com/music/10967-review-neon-indian-era-extrana\" target=\"_blank\">here</a>. </p>\n","slug":"12547-interview-neon-indian","category":"interviews","date":1321301131000,"wpid":12547,"isSticky":false,"featured_image":null,"createdAt":1587293478155,"updatedAt":1588441786464,"author":"5e9b68b27a1236eccfeb1d16","old_image":"2011/11/neon_indian_aug_11_417-950x633.jpg","categories":["interviews","music"]}