{"id":"5e9c2d1d9b6559241525d6c3","artists":["5e9b68e57a1236eccfeb1f4a"],"title":"New: Dam Mantle – Spirit","content":"<p>I often find at the end of the year everybody sits back and reflects on the musical seasons the year’s been through, and I also find that a lot of the most interesting and promising music trickles down to this latter part of the year.</p><p> Bands and producers alike have been sitting on things they’ve been cooking for a while, and decide it’s the right time to tease us with what’s ahead.</p>\n<p><strong>Dam Mantle</strong> recently put out this fantastically executed electronic pastiche, and I find myself really intrigued with where 2012 will bring us. He really shows progress from his focused but somewhat hyperactive earlier productions, and his very comfortable recent output. This singular tune shows the most promise from this guy.</p>\n<p><em>Spirit</em> blends the two together with confidence and maturity, and seems to hold some kind of middle ground in terms of atmospheric electronic music. In a similar vein to previous <strong>Four Tet</strong> stuff, but with a bit more of a free-jazz nature to it. The piano is handsome and <strong>Eno</strong>-like, the track nearly dipping into <strong>Plaid</strong>-influenced abstraction. It’s really tender, and I suggest you book this into your listening schedule.</p>\n<p><em>Listen to Spirit below.</em></p>\n<p><center><object height=\"81\" width=\"100%\"><param name=\"movie\" value=\"https://player.soundcloud.com/player.swf?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F28004320&show_comments=false&auto_play=false&color=000000\"></param><param name=\"allowscriptaccess\" value=\"always\"></param><embed allowscriptaccess=\"always\" height=\"81\" src=\"https://player.soundcloud.com/player.swf?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F28004320&show_comments=false&auto_play=false&color=000000\" type=\"application/x-shockwave-flash\" width=\"100%\"></embed></object></center></p>\n","slug":"12573-new-dam-mantle-spirit","category":"music","date":1321380635000,"wpid":12573,"isSticky":false,"featured_image":null,"createdAt":1587293469526,"updatedAt":1587825910469,"author":"5e9b68b27a1236eccfeb1d10","categories":["music","new"]}