{"id":"5e9c2d1a9b6559241525d6c1","artists":["5e9b68da7a1236eccfeb1ec5","5e9b69377a1236eccfeb24b5"],"title":"MPfree: Cant – Answer (Round Table Knights Edit)","content":"<p>We all know how European house music can be – all noise and no substance.</p><p> Labels like <strong>Sound Pellegrino</strong> and <strong>Club Cheval</strong> and producers like <strong>Brodinski</strong> and <strong>Tensnake</strong> show some hope in terms of taste, and they can also be great DJ’s, mind. Some of them are able to rustle up some great house edits of ‘indie’ stuff. And in a similar vein to <strong>Erol Alkan</strong>, one of my favourite tracks of the year has had a very nice and very ‘club-friendly’ edit by Swiss duo <strong>Round Table Knights</strong>.</p>\n<p>I don’t know what it is about these edits, but it does make them stand out a bit more as a track alone – as a single, rather than part of an album. In my opinion, again comparing with the aforementioned Alkan, some edits are maybe done of the wrong track – thinking back to Alkan’s last few edits, that electro-bravado <strong>Tame Impala</strong> version (<em>Why Won’t You Make Up Your Mind</em>) kinda worked, but the <strong>Metronomy</strong> one (<em>The Bay</em>) was a tad unnecessary, don’t you think?</p>\n<p>I suggest these tracks just need small tweaks, a mild disco re-tune just to settle the track on uneasy dancefloors – <strong>DFA</strong> are usually the masters of handling this, now I think about it. Of course, some may argue edits and remixes are futile, and dilute the resonance of the tune at hand, but in this case I’m fairly confident in putting before you a respectable effort. <strong>Chris Taylor</strong>‘s masterful piece can’t really be improved upon, but in this particular case it’s interesting to say the least. Give this one a try.</p>\n<p><em>Stream and download Round Table Knights’ edit of Cant’s Answer below.</em></p>\n<p><center><object height=\"81\" width=\"100%\"><param name=\"movie\" value=\"https://player.soundcloud.com/player.swf?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F27988062&show_comments=false&auto_play=false&color=000000\"></param><param name=\"allowscriptaccess\" value=\"always\"></param><embed allowscriptaccess=\"always\" height=\"81\" src=\"https://player.soundcloud.com/player.swf?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F27988062&show_comments=false&auto_play=false&color=000000\" type=\"application/x-shockwave-flash\" width=\"100%\"></embed></object></center></p>\n","slug":"12580-mpfree-cant-answer-round-table-knights-edit","category":"mpfree","date":1321383444000,"wpid":12580,"isSticky":false,"featured_image":null,"createdAt":1587293466857,"updatedAt":1588441786331,"author":"5e9b68b27a1236eccfeb1d10","old_image":"generated/3bdd7f3afbe9a819781a2b1f84c151cfb03b80de.jpg","categories":["mpfree","music"]}