{"id":"5e9c2d159b6559241525d6bd","artists":["5e9b69177a1236eccfeb22b0"],"title":"Review: Love Among The Mannequins – Radial Images","content":"<p>The logic ran thus: if you’re going to have the bare-faced audacity to write yet ANOTHER review of yet ANOTHER record by yet ANOTHER band with drums and electric guitars, you’d at least better make sure you’re doing something interesting.</p><p></p>\n<p><em><strong>À la recherche du temps perdu </strong></em>(Eng<em>. In Search of Lost Time</em>, prev. <em>Remembrance of Things Past</em>) – Most famous work of French novelist <strong>Valentin Louis Georges Eugène Marcel Proust</strong>. Nearly 1.5 millions word in length. Not often referenced in rock songs.<br />\n<strong></strong></p>\n<p><strong>Amateurs</strong> – <em>n. </em><strong>1 </strong>pl. of <strong>amateur</strong>, or a person who engages in pursuit of a pastime rather than a profession. <strong>2 </strong>Previous moniker of Brighton-based guitar band <strong>Love Among The Mannequins</strong>.<br />\n<strong></strong></p>\n<p><strong>angular</strong> – <em>adj. </em><strong>1 a </strong>having sharp angles or corners <strong>b </strong>(of a person) awkward in manner <strong>2</strong> stock phrase in music criticism, often used to describe <strong>post-hardcore </strong>bands.</p>\n<p><strong>Brahma</strong> – First God in the Hindu trimurti. Responsible for creation. Has four heads and four arms.</p>\n<p><strong>Crooked Mountain, Crooked Sea</strong> – Four piece <strong>post-punk </strong>(<em>ref needed</em>) band from Brighton. Releases include <strong><em><a href=\"https://crookedmountaincrookedsea.bandcamp.com/album/i-watched-it-from-the-roadside\">I Watched It From The Roadside</a> </em></strong>(2010) and <a href=\"https://crookedmountaincrookedsea.bandcamp.com/album/whats-there-to-write-about\"><strong><em>What’s There To Write About?</em></strong></a> (2011). Member <strong>Steven Andrew Robert Stride </strong>also plays in Brighton-based <strong>Love Among The Mannequins</strong>, but was not involved in the recording of their debut album <strong><em>Radial Images</em></strong>.</p>\n<p><strong>Distortion </strong>–<em> n. </em><strong>1 </strong>the act of distorting <strong>2</strong> the quality or state of being distorted<strong>;</strong> a product of distorting; as <strong>a</strong> a lack of proportionality in an image resulting from defects in the optical system <strong>b </strong>falsified reproduction of an audio or video signal caused by change in the wave form of the original signal. Distortion is mostly unwanted but can be desirable, as with the distortion of <strong>electric guitars</strong>.</p>\n<p><strong>Function Records</strong> – Independent record label based in London, UK. <a href=\"https://www.functionrecords.com/\">Recent releases include</a> <strong><em>Radial Images</em></strong>, debut album by Brighton-based guitar band <strong>Love Among The Mannequins. </strong></p>\n<p><strong>Love Among the Mannequins</strong> – <strong>1 </strong>A line from <strong><em>The Atrocity Exhibition</em></strong> (1970), an experimental novel by British writer <strong>J.G. Ballard</strong>, specifically the story <em>The Summer Cannibals</em>, originally published in <em>New Worlds</em> #186 (1969) <strong>2 </strong>Brighton-based guitar band, comprising <strong></strong><strong>Alexander Ross Petersen</strong>,<strong> Jonathan Stephen Baker</strong>,<strong> Steven Andrew Robert Stride</strong>, and<strong> Tobias James Dylan Hayes</strong>. Influences include <strong>Autolux</strong>, <strong>Drive Like Jehu </strong>and <strong>Pavement</strong>.</p>\n<p title=\"Poetry\"><strong>Mephistopheles</strong> – a demon with origins in German folklore. First appeared in literature in the <strong>Faust chapbooks</strong> (c.16), first dramatised by Marlowe’s <strong><em>The Tragicall History of the Life and Death of Doctor Faustus</em></strong><em>, </em>and<em></em> brought further recognition by German writer <strong>Johann Wolfgang von Goethe</strong>‘s famous reading of the<strong> </strong>legend. Not to be confused with <strong>Mr. Mistoffelees</strong>, a feline character in <strong>T. S. Eliot</strong>‘s <strong><em>Old Possum’s Book of Practical Cats</em></strong>, and <strong>Andrew Lloyd Webber</strong>‘s stage adaptation, the musical <strong><em>Cats</em></strong>.<br />\n<strong></strong></p>\n<p><strong>O You Broken Eyes</strong> – ‘Brittle, symphonic, wine-soaked folk’ septet based in Brighton. Guitarist <strong>Alexander Ross Petersen </strong>and drummer <strong>Jonathan Stephen Baker </strong>also play in Brighton-based <strong>Love Among The Mannequins.</strong> <em>See also: </em><strong>Crowns On The Rats Orchestra</strong><br />\n<strong></strong></p>\n<p><strong>Radial Images</strong> – <strong>1 </strong><em>poss. </em><strong>Radial Patterns</strong>, patterns that appear to radiate from a central point, e.g. <strong>spokes 2 </strong>Idea ruminated on by Russian philosopher <strong>Nikolai Fyodorovic Fyodorov</strong>. A radial image contains the essence of a human’s being, their personality etc., and survives after their death. <strong>3</strong> debut full-length record by Brighton-based guitar band <strong>Love Among The Mannequins</strong>, released on independent UK record label <strong>Function Records </strong>on 07/11/2011<br />\n<strong></strong></p>\n<p><strong>George Robert Price</strong> – American population geneticist. Developed a mathematical theory of <strong>Altriusm</strong>. Friend to the homeless. Committed suicide on January 6, 1975, using a pair of nail scissors to cut his <strong>carotid artery</strong>. Thought that entropy could outmaneuver empathy.<br />\n<strong></strong></p>\n<p><strong>Shiva</strong> – Third god in the Hindu trimurti. Responsible for destruction. Blue face and throat.<br />\n<strong></strong></p>\n<p><strong>Shoes and Socks Off</strong> – <a href=\"https://www.bsmrocks.com/band_shoes.html\">‘Tobias Hayes, son, brother, uncle, dude and boo-hoo merchant, has been playing stubbed-toe blues under the name ‘Shoes and Socks Off’ since 2007. It started off as a joke.’</a> Toby also plays in Brighton-based <strong>Love Among The Mannequins</strong>.<br />\n<strong></strong></p>\n<p><strong>That crazy Petersburg Shuffle (Oh My)</strong> – Hot new dance step currently causing a stir in The Russian Federation and England’s South Coast. Appropriated from interpretation of the dreams of <strong>Rodion Romanovich Raskolnikov</strong>, protagonist of <strong>Fyodor Dostoevsky</strong>‘s <strong><em>Crime and Punishment</em></strong>, specifically the dream in which Raskolnikov witnesses a mare beaten to death by an angry mob. Dancers will crowd around a central point and mimic the beating of Raskolnikov’s horse. Sometimes the mare is represented by another dancer (or dancers), sometimes it is simply imagined. Often performed to the music of Brighton-based guitar band <strong>Love Among The Mannequins</strong>. <em>See also</em>: <strong>That Petersburg Tango (Oh Me)</strong>.</p>\n<p><strong>Vishnu</strong> – Second god in the Hindu trimurti. Responsible for the preservation and protection of the universe. Blue skin and four arms. Always represented carrying the <strong>Conch</strong>, the <strong>Chakra</strong>, the <strong>Lotus Flower</strong>, and the <strong>Mace</strong>.<br />\n<strong></strong></p>\n<p><strong>Wordplay </strong>– <em>n. </em>use of words to witty effect<strong><br />\n</strong></p>\n<p><a href=\"https://loveamongthemannequins.tumblr.com/\"><em>I wonder what this cryptic allegory could possibly mean?</em></a></p>\n","slug":"12596-review-love-among-the-mannequins-radial-images","category":"music","date":1321392586000,"wpid":12596,"isSticky":false,"featured_image":null,"createdAt":1587293461219,"updatedAt":1588441786221,"author":"5e9b68b27a1236eccfeb1d3c","old_image":"generated/924f10dea5f38ab144653d03fbba3e08c7b19ab7.jpg","categories":["music","reviews"]}