{"id":"5e9c2d0d9b6559241525d6bc","artists":["5e9b68e07a1236eccfeb1f15"],"title":"Review: Coldplay – Mylo Xyloto","content":"<p><strong>Coldplay</strong> receive their fair share of criticism, undeservedly so at times in my opinion.</p><p> Sure, they have a handful of tracks that leave you resisting the temptation to rip your ears off, move to the Atacama and never hear another piece of music again in your life, yet in their fifteen year career they have written some truly fantastic songs. I still stand by the quality of their debut record <strong><em>Parachutes</em></strong>, one of the finest indie albums released in the 00’s.</p>\n<p>Another undeniable attribute that <strong>Coldplay</strong> possess is within their live performances, that are always impressive. After witnessing them headlining <strong>T in the Park</strong> earlier this year, it’s not difficult to see just why they are the biggest band in the world. Their shows are energetic, tight and most importantly, always tailored to occasion and setting. There’s no screwing around with obscure B-Sides; it’s all about hit after hit after hit, reminding the crowd exactly why and who they are there to see.</p>\n<p>After only one listen to their fifth album, the nigh-on unpronounceable <em><strong>Mylo Xyloto</strong></em>, I immediately recognised several tracks from their T performance in July, namely<em> Hurts Like Heaven</em>, <em>Charlie Brown</em> and lead single <em>Every Teardrop Is A Waterfall</em>. It’s always a sure sign of an album written for the live circuit when the audience comes away practically humming tunes that haven’t yet been released, and <strong>Coldplay’s</strong> performance in Scotland felt very much like that.</p>\n<p>No doubt many of you will have heard<em> Paradise</em>, the lead single from <em><strong>Mylo Xyloto</strong></em>, a diabolical composition, featuring arguably worse lyrics than <strong>Rebecca Black’s</strong> infamous <em>Friday</em> – “<em>When she was just a girl, she expected the world</em>“. It’s the <strong>Kaiser Chiefs</strong> equivalent of <em>Ruby</em>, with the tracks only saving grace being <strong>Chris Martin’s</strong> always impeccably smooth vocals. The aforementioned<em> Hurts Like Heaven</em> is another thorn in the side of the record, feeling like an outtake from <em><strong>Viva La Vida</strong></em>.</p>\n<p>To be perfectly honest, aside from the acoustic beauty of <em>Us Against The World</em>, the first half of the <strong><em>Mylo Xyloto</em></strong> is no more than a false start, failing to leave the blocks correctly. By the time teaser single <em>Every Teardrop Is A Waterfall</em> explodes into life, I’d imagine the majority of listeners have already fallen into a deep sleep. A shame really, as it’s arguably the album’s finest moment.</p>\n<p>Despite what I’ve said, I have no doubt that his record will probably spawn another couple of top ten singles (<em>Princess Of China</em>), as well as leading to a host of festival headlining slots and a full arena tour. I don’t begrudge <strong>Coldplay</strong> for their astronomical success, purely down to the fact that they’ve worked tirelessly to get to this level, so you can forgive them for slipping up a few times along the way.</p>\n<p> </p>\n","slug":"12590-review-coldplay-mylo-xyloto","category":"album-reviews","date":1321446742000,"wpid":12590,"isSticky":false,"featured_image":null,"createdAt":1587293453640,"updatedAt":1588441786197,"author":"5e9b68b27a1236eccfeb1d27","old_image":"generated/c942640d486338e4ae144a497f0cfd3f35ceb7af.jpg","categories":["album-reviews","music"]}