{"id":"5e9c2d089b6559241525d6b9","artists":["5e9b69047a1236eccfeb2193"],"title":"Review: Jamie XX – Warehouse Project","content":"<p>Jamie Smith’s mixes are some of the best around.</p><p> Take, for example, his half-hour live set for Benji B on the DJ’s Radio 1 show last year. Eclectisism is the man’s strong point; no genre goes left unturned, no sound left unsampled. While this approach works tidily for the casual listener – perfect for radio, for example – in the live environment (and certainly given the crowd the XX producer has now achieved), it makes for somewhat of a frustrating experience.</p>\n<p>On an otherwise sound Warehouse Project line-up, Jamie XX sits uncomfortably atop the pile. “Uneasy lies the head that wears the crown”, supposedly. Where Jay Electronica’s confident, swaggering set sees him sashay into the crowd, offer his trilby and jewellery to the front-row contingent and regularly drop the beat for five minutes at a time to spit aggressively meticulous, often political lyrics, Smith seems unsure of what he wants to achieve. For someone so obviously strong in both the DJ and production arenas, he spends much of his set trying to size up his crowd instead of launching, confidently, into what he knows he does best.</p>\n<p>Smith’s faults lie in his expectations of tonight’s crowd being wildly off the mark and his inability to read a room that wants more from the speakers than “interesting” electronica. With his success, Smith now has a different core fanbase to that which he may have intended and at something like Warehouse Project, that’s only amplified; for the focal member of a band whose debut album went platinum – and whose own productions are now being sampled by Drake and Rihanna – it’s churlish of Smith to expect tonight’s brand of moody, downtempo electronica to pacify a mainstream crowd, pressed against the walls and baying for the sort of drops that have made his Gil-Scott Heron collaboration LP ‘We’re New Here’ one of the highlights of the year.</p>\n<p>Indeed, his first half is so mundane, calm even, that we soon forsake the grumbling crush of Room 1 for the high-octane set proffered by John Talabot. A wise choice, considering the explosive 90 minutes of free, looping techno the Barcelonan producer whips together. Talabot – a pseudonym for an otherwise anonymous musician – ditches the 115-BPM groove of his productions in favour of a fist-pumping, kick drum-led sound that mixes disco, funk and techno without prejudice. The Spaniard has taken influence from the likes of Andrew Weatherall in his approach and his back-room set – which even in its moments of relative composure never approaches the disappointing tedium of tonight’s headliner – is a whirlwind of warm and brisk electronics.</p>\n<p>The same goes for Kyle Hall, who closes the back room in typically ebullient, atmospheric style. The young Motor City producer is perhaps the most vocal-orientated producer on the line-up, ideal for the closing set of a night mostly devoid of lyrics. Hall’s fader-happy style – cutting treble and bass in and out, flicking the filter with careless abandon – is refreshing and surprising and recalls Floating Points’ analog mixer sets, where the Londoner – like Hall a young, vinyl-only DJ – will often go whole verses with no bass or mid-range. Where Jamie XX builds up to his set’s drops with a half-hour introduction of middling disco, Hall has two, three or four falling at arbitrary and unpredictable points in each track. For those hardy souls still partying at gone 4am, it’s a reward and for those off to the afterparty, it’s a necessary energy boost.</p>\n<p>Words by <strong>Will Orchard</strong></p>\n","slug":"12628-review-jamie-xx-warehouse-project2","category":"music","date":1321522255000,"wpid":12628,"isSticky":false,"featured_image":null,"createdAt":1587293448613,"updatedAt":1588441786116,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"generated/0f3e2bba969cf51ab4dcde8adf70af197803eceb.jpg","categories":["music","reviews"]}