{"id":"5e9c2d009b6559241525d6b0","artists":["5e9b68e07a1236eccfeb1f11"],"title":"Introducing: Coasts","content":"<p><strong>WU LYF</strong> created one of the albums of the year.</p><p> Not only that, but their marketing approach was undeniably intelligent, regardless of whether or not it was planned. So, with that in mind, it’s inevitable that their method will be impersonated, however to shamelessly copy <strong>WU LYF’s</strong> entire concept, sound and image, well, that’s just downright ridiculous.</p>\n<p>Earlier this evening I saw an advert down the side of my Facebook, advising me that ‘If you’re a fan of WU LYF, you’ll love COASTS’. Fair enough, using Facebook’s technology to promote to an engaged audience is acceptable, but they didn’t stop there…</p>\n<p><a href=\"https://api.crackintheroad.com/music/12660-introducing-coasts/attachment/screen-shot-2011-11-17-at-21-59-28/\" rel=\"attachment wp-att-12661\"><img class=\"size-full wp-image-12661 alignright\" title=\"COASTS ADVERT\" src=\"https://admin.crackintheroad.com/uploads/2011/11/Screen-shot-2011-11-17-at-21.59.28.png\" alt=\"\" width=\"250\" height=\"160\" /></a></p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>Using a <strong>WU LYF</strong> image to promote their own page?! Do they have no shame? After only a minute of browsing their facebook page, I noticed the following similarities:</p>\n<p><strong>WU LYF</strong> play ‘Heavy Pop’ – <strong>Coasts</strong> play ‘Big Beat Tropical Pop’</p>\n<p><strong>WU LYF</strong> began as anonymous – There are no names or band photos on the<strong> Coasts</strong> Facebook page</p>\n<p><strong>WU LYF</strong> love <strong>Ol’ Dirty Bastard</strong> – <strong>Coasts</strong> list <strong>Tupac</strong> as an influence</p>\n<p>For those wondering, Coasts are in fact comprised of: Ben Street (Drums), James Gamage (Bass), Liam Willford (Guitar), David Goulbourne (Keys) and Chris Caines (Vocals). Also, Coasts have previously gone under the names Dinosaur Outfit and Lego Castles.</p>\n<p>Now, I’m going to be hugely hypocritical, as the provocative advertising clearly worked on me. I checked out <strong>Coasts</strong> music, and to be perfectly honest, it’s not all that bad. Sure, it sounds like a diluted version of <strong>WU LYF</strong>, with the guitars on Breathe being almost a direct replica and the sample used at the start mirroring the Mancunian ‘heavy pop’ outfits attempt to integrate the work of <strong>O.D.B</strong> into their work. The vocals lack the urgency and strain that <strong>Ellery Roberts</strong> musters, and the songwriting is far from the same level, however, as two standalone tracks they are far from diabolical.</p>\n<p>So, what’s the deal with <strong>Coasts</strong> then? Well, it appears to be a marketing ploy gone disastrously wrong, especially when you learn that they already have a booking agent (<strong>Popular Company</strong>) and a record label (<strong>Intruder Records</strong>) on board. As well as <strong>WU LYF</strong> creating such fantastic music, they were also so exciting because they explored avenues that the internet generation hadn’t fully traversed before.<strong> Coasts</strong> just end up coming across as rather meek and unimaginative, and that’s before you even hear the music.</p>\n<p>My advice? Drop the plagiarized act, cut the shameless advertising, and concentrate on making music worth talking about, because at the end of the day, that’s what you’re going to be judged upon.</p>\n<p>If after all that you still want to check out <strong>Coasts</strong>, you can hear a couple of their tracks <a href=\"https://listn.to/coastsband/player\" target=\"_blank\">here</a>.</p>\n<p>  </p>\n","slug":"12660-introducing-coasts","category":"introducing","date":1321565752000,"wpid":12660,"isSticky":false,"featured_image":{"width":165,"height":165,"src":"2011/11/333903_276791582338093_266159040068014_1384944_3099530_o-165x165.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAABgIF/8QAJRAAAQIEBAcAAAAAAAAAAAAAAQIDAAQFIQYRUVISExVhcZHS/8QAFAEBAAAAAAAAAAAAAAAAAAAAA//EABkRAAIDAQAAAAAAAAAAAAAAAAECAAMRBP/aAAwDAQACEQMRAD8AyZTFDRpaBL0Z1acsuIuoGvfx7g27XWC4s9OduTt+oKUN50MoAcWBztx0MQADc3JuSYdOl1JyO9CHJ//Z"},"createdAt":1587293440197,"updatedAt":1588443777420,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/11/333903_276791582338093_266159040068014_1384944_3099530_o-165x165.jpg","categories":["introducing","music"]}