{"id":"5e9c2cf79b6559241525d6ab","artists":["5e9b68ec7a1236eccfeb1fbd"],"title":"Review: Drake – Take Care","content":"<p>It’s been almost fifteen months since <strong>Drake</strong> released his debut LP <em><strong>Thank Me Later</strong></em>, a boisterously self-assured record that cemented his name as a true popstar.</p><p> Yet despite it’s commercial success, there was an underlying feeling that we hadn’t quite seen the best of him, with the release lacking depth outside of it’s four singles. Now, with a years more experience under his belt, Drake returns with <em><strong>Take Care</strong></em>, possibly the most highly anticipated R’n’B release of the 2011, a fairly impressive feat when you take into account that this is the same year <strong>Jay-Z</strong> & <strong>Kanye</strong> collaborated on<strong><em> Watch The Throne</em></strong>.</p>\n<p>In the album notes on Drake’s sophomore album, <em><strong>Take Care</strong></em>, the Canadian singer thanks <strong>Soulja Boy</strong>, <strong>Wacka Flocka Flame</strong>, <strong>Jamie XX</strong> and Fifa 11/12, amongst numerous other high profile names. Whatever you think about the guy, that’s a fairly eclectic mix of influences, surely providing a diverse palette of sounds to work with. Another artist whom clearly had a pivotal role to play on <em><strong>Take Care</strong></em> is <strong>Abel Tesfaye </strong>with his sleazy brand of soulful R’n’B stamped mercilessly throughout the record, even featuring on fourth track <em>Crew Love</em>.</p>\n<p>Lead single <em>Headlines</em> quite rightly took the charts by storm, both in the US and the UK, seeing Drake oozing with an exuberant confidence. It’s a swagger not too dissimilar to that found on <strong>Kanye’s</strong> <em><strong>The College Dropout</strong></em>, an undoubtedly talented rapper clearly enjoying the high-life. If there’s one element <strong>Drake</strong> appears keen to be portray, it’s his lavish lifestyle, with <em>Over My Dead Body</em> setting the standard, “<em>Just performed at a Bar Mitzvah over in the states</em><br />\n<em> Used half of the money to beat my brother’s case</em>“. It’s not long before <strong>Drake</strong> is exercising his echo again, “it’s been two years since someone asked me who I was” and “<em>walking like a man, finger on the trigger, I got money in my pocket, I’m an uptown nigga</em>” on the relentless <em>Under Ground Kings</em>.</p>\n<p>Thematically, <strong><em>Take Care</em></strong> is a mish-mash of contrasting emotions, swinging between the downright broken heart (<em>Marvin’s Room</em>) to the upbeat, cocksure (<em>HYFR</em>). It’s important to remember that <strong>Drake</strong> is still a youngster compared to many of his counterparts, at just 25, it’s inevitable that his lyrical content and life perspective will be fairly different to the likes of <strong>Kanye</strong> and <strong>Jay-Z</strong>.</p>\n<p>The triple whammy of <em>Headlines</em>, <em>Crew Love</em> and <em>Take Care</em> is one of the records highlights, three tracks that show distinctive personalities of the singer. <em>Headlines</em> being the out and out chart hit, whilst<em> Crew Love</em> has <strong>The Weeknd</strong> plastered all over it, with it’s soulful, Motown-on-prozac vibes. The only slip-up on the series of tracks is the decision to include <strong>Rihanna</strong> on <em>Take Care</em>, singing the <strong>Gil Scott Heron</strong> sample, made infamous by <strong>Jamie XX</strong>‘s remix from earlier in the year. Her ridged drawl is devoid of the inspiration and guts that the late <strong>Gil Scott</strong> conjures up, and the choice to include the Bajan singer appears to be purely for commercial reasons.</p>\n<p>Elsewhere, the elegant <em>Marvin’s Room</em> is a desperate drunken plea to a former lover, now in the arms of another man, a track that wouldn’t have fitted onto <em><strong>Thank Me Later</strong></em>, but is one of the highlights of<strong><em> Take Care</em></strong>. Despite all the improvements from his debut album, <strong>Drake’s</strong> lyricism and flow still leave much to be desired, with him often stumbling clumsily over words. Epitomized on <em>HYFR</em> (<em>Hell Ya Fucking Right</em>), a track where <strong>Weezy</strong> far outshines the Canadian rapper.</p>\n<p>As a complete release, it feel slightly schizophrenic, with <strong>Drake</strong> unsure whether he wants to embody the sensual, seductive flair of <strong>The Weeknd</strong>, or the brash, all-out fury of<strong> Lil Wayne</strong>, and instead ends up somewhere in the murky in-between. Personally, I find it works when he sticks to the charismatic yet relatable, such as the balladry of<em> Look What You’ve Done</em> and the aforementioned <em>Marvin’s Room</em>. <strong><em>Take Care</em></strong> is a clear and confident step up from <em><strong>Thank Me Later</strong></em>, yet this still very much feels like <strong>Drake</strong> is finding his feet as both a person and a recording artist.</p>\n<p><a class=\"twitter-share-button\" href=\"https://twitter.com/share\" data-count=\"vertical\" data-via=\"crackintheroad\" data-related=\"joshdaltonn\">Tweet</a><script type=\"text/javascript\" src=\"//platform.twitter.com/widgets.js\"></script></p>\n","slug":"12693-review-drake-take-care","category":"album-reviews","date":1321825692000,"wpid":12693,"isSticky":false,"featured_image":null,"createdAt":1587293431522,"updatedAt":1588441785958,"author":"5e9b68b27a1236eccfeb1d27","old_image":"generated/drake-4ee7f60700885.jpg","categories":["album-reviews","music"]}