{"id":"5e9c33e99b6559241525e12f","title":"A Class Apart","content":"<p><a href=\"https://admin.</p><p>crackintheroad.com/uploads/2010/06/harryDM010407_468x419.jpg\"><img class=\"aligncenter size-full wp-image-1278\" src=\"https://api.crackintheroad.com/wp-content/uploads/2010/06/harryDM010407_468x419.jpg\" alt=\"\" width=\"668\" height=\"463\" srcset=\"https://api.crackintheroad.com/images/2010/06/harryDM010407_468x419.jpg 668w, https://api.crackintheroad.com/images/2010/06/harryDM010407_468x419-300x207.jpg 300w, https://api.crackintheroad.com/images/2010/06/harryDM010407_468x419-494x342.jpg 494w, https://api.crackintheroad.com/images/2010/06/harryDM010407_468x419-165x114.jpg 165w\" sizes=\"(max-width: 668px) 100vw, 668px\" /></a></p>\n<p><strong>Written by Sam Heaney </strong></p>\n<p>Newcastle is a city of an inspiring cosmopolitan nature. An acceptance of all colour and creed is branded into the very essence of the ‘Toon’.  Nonetheless, the primordial issue amongst student circles, surprising given the nature of the modern day societal hierarchy, is class. The annual mass migration of students from their, in my cases dour Northern towns or quaint Southern Hamlets, only adds fuel to this burning sub-community debate; Reality versus the ‘Rah’.</p>\n<p>Before I launch into this article, a brief description of what determines a ‘Rah’ must be attempted. Loosely speaking, ‘Rah’s’ are generally of Southern extraction and from a privately, and almost definitely, costly educational background. Jesmond has become the citadel of ‘Rah’ lifestyle.  From a brief 9 month stay as the enemy within, I can tell you it is more of a philosophy than a life choice, their unwavering dedication to their overblown typecast is one that sparks resisted admiration.  Muscle-bound males clad in Canterbury regalia saunter majestically alongside the svelte and willowy opposite gender of this clan. The boys hint at metro sexuality whilst retaining their ‘rugger’ induced macho status. The girls, often and quite peculiarly huskily voiced, perhaps from the intake of Dunhill cigarettes from around the age of twelve, exude an air of confidence whilst nonchalantly preserving their femininity. At times you can’t help but feel these kids have won the genetic and financial lotteries in one large and sickening roll-over.</p>\n<p>As Jack Will’s bags are strewn simultaneously across the laminated floors of a hundred ‘des-res’’ across Jesmond, Radley purses are blithely packed to the brim with daddy’s Christmas bonus, and the Pimm’s begins to flow…. things change. Figure hugging Hollister t-shirts are wedged on over un-naturally large pectorals, as the sex from Venus slide their most desirable Westwood dress over pristine flaxen hair-do’s. And using up the last of the fragrance obtained from the gap-year in India, they quietly hope it will gracefully float like a gondola down the Venetian canals into the nostrils of a Coutts executive’s son and heir. Aesthetics aside, the drink starts flowing and this lot undergo a complete personality change.</p>\n<p>Blueline drivers are insulted by what passes as, and I lay claim to this coinage, ‘Rah-ish wit’, as the silver spoon brigade are full steam ahead toward ‘Madame Coo’s’ or ‘Perdu’ to indulge in another night on the ‘lash’. We have all seen the ‘Youtube’ satire; hauntingly it isn’t far off the mark.</p>\n<p>For the rest of us hopelessly encaged in an economic downturn, (of course recession isn’t applicable to the average ‘Rah’, bank bonuses saw to that), it’s on with the Topman T-shirt and Burton belt, as being a fashionista on a shoe-string is a far more difficult discipline. Smart price noodles are washed down with enamel decaying double strength cordial, then it’s on with the ‘pre-sesh’ where a blitz like mentality and coercion begins to snowball in correlation with the amount of ‘Shit-mix’ or ‘M-kat’ consumed. The boy’s are still handsome and the girl’s still elegant, yet a greater degree of decorum is evident, as fertility isn’t flung into your face here, not quite yet. Metros are boarded, nothing concerning the monetary element; we just prefer the romance of a potentially free journey. Gamblers to our very core.</p>\n<p>Newcastle city centre subsequently becomes a sexual version of the Somme, as the quest for sexual pleasure ensues. The textbook two tiered mating ritual of the annihilation of taste buds through the medium of trebles in Basement, before the coup de grace of borderline legal groping is carried out in a clockwork fashion by the now sweat-soaked Hollister brigade. This, it could be argued is fair game, but it is the ruinous mélange of alcohol and arrogance that ignites the dispute. This article is satirical, stereotypical and for the most part written with sarcasm, yet on a serious note, the quantity of this particular species that find it necessary to shoulder-charge their way through ranks of students at the bar, to give Alistair and Camilla a rousing welcome to a haunt they frequent weekly is alarming. If not moderately humorous.</p>\n<p>The ‘Rah’ conduct in takeaways is something else. Their uber-confident belief that they are unquestioningly, head and shoulders above all others is as infuriating as it is gratuitous. I for one can claim to be no Florence Nightingale after a couple of scoops of the black stuff, and for that matter nor can the majority of us students who fall into the ‘reality’ bracket, but the average ‘Rah’ takes  drunken etiquette to a new level.</p>\n<p>In the world of the honorary Geordie student, this disagreement rarely, if ever comes to blows. It could even be debated that a gentle sober ribbing of our respective worlds adds a unique and appealing dimension to life in the ‘Toon’. Additionally, this is not an argument of ‘Poly versus Posh’ as both universities bristle with a combination of its home grown aristocracy, county set and Noveau Riche; though it is undeniable their stronghold is most positively the red-brick.</p>\n<p>Love them or loathe them, the ‘Rahs’ are entrenched in Jesmond and will not be leaving inaudibly; sherried-up or otherwise. More importantly they are a newly adopted piece of Geordie culture. A Newcastle minus our genteel brothers and sisters might not be so luminous after all.</p>\n","slug":"1273-a-class-apart","category":"life","date":1276120438000,"wpid":1273,"isSticky":false,"featured_image":{"width":668,"height":463,"src":"2010/06/harrydm010407_468x419.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAQH/8QAIBAAAQMEAgMAAAAAAAAAAAAAAQIDBAAFBiESMRMiM//EABUBAQEAAAAAAAAAAAAAAAAAAAQF/8QAIBEAAQMCBwAAAAAAAAAAAAAAAQACAwQRBRIhIlGBsf/aAAwDAQACEQMRAD8AzTGLfBYxuDIu4cmRVrMg28/NbiklKFE96FSR7pjwYbBgPqPEe3ib3rvZpSj095Ac3J9VXFI2QOYI222jvQFf/9k="},"createdAt":1587295209019,"updatedAt":1588403566833,"author":"5e9b68b27a1236eccfeb1d24","old_image":"2010/06/harrydm010407_468x419.jpg","categories":["life"]}