{"id":"5e9c2cb19b6559241525d65f","artists":["5e9b69257a1236eccfeb2379"],"title":"Introducing: Nately’s Whore’s Kid Sister","content":"<p>If there’s one way for a band to endear themselves to an obsessive bookworm before said bookworm has even heard a note from them, it’s by naming themselves after a relatively minor character in some work of literature or other.</p><p> And while this particular bookworm had heard <em>Fix My Corrections</em>, penultimate track from <strong>Nately’s Whore’s Kid Sister</strong>‘s latest EP <strong><em>Ribs</em></strong>, before he registered their name, his noting the <em>Catch-22 </em>related moniker about halfway through the song certainly didn’t do any harm to his estimations of the band.</p>\n<p><object width=\"100%\" height=\"81\" classid=\"clsid:d27cdb6e-ae6d-11cf-96b8-444553540000\" codebase=\"https://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=6,0,40,0\"><param name=\"allowscriptaccess\" value=\"always\" /><param name=\"src\" value=\"https://player.soundcloud.com/player.swf?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F28165184\" /><embed width=\"100%\" height=\"81\" type=\"application/x-shockwave-flash\" src=\"https://player.soundcloud.com/player.swf?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F28165184\" allowscriptaccess=\"always\" /></object> <span><a href=\"https://soundcloud.com/nwkidsister/fix-my-corrections\">04 Fix my corrections</a> by <a href=\"https://soundcloud.com/nwkidsister\">NWKidSister</a></span></p>\n<p><em>Fix My Corrections</em>‘ greyedout clank and bottomfeeding rumble had already spoken for themselves, however, and the worm was hooked. So. Just who the fuck are Nately’s Whore’s Kid Sister?</p>\n<p>As it turns out, they’re Jim, John, Matt, Stuart and Michael from Newcastle Upon Tyne, five young adult males who sound like they exist on a diet of booze, blunts and raw beef. To call <em><strong>Ribs</strong></em> heavyweight would be an understatement, but at risk of sounding like pretty much every toilet band ever’s press release, there’s a second head to this chipped ol’ battleaxe. <em>Just Below the Ribs</em>, which opens proceedings, encapsulates neatly the appeal of Nately’s. It’s those doomy moments on Soundgarden’s <strong><em>Superunknown</em></strong>, played by Red Sparowes fans on Telecasters, stretched out over seven minutes and sung by Seraphim. It’s lovely, but it’s horrible. Something like Edmund Burke’s notion of the Sublime, if I’ve remembered my schoolin’ right.</p>\n<p>Elsewhere, <em>Babies </em>and <em>Regards, Bison </em>forego their predecessor’s warped beauty for deadweighted and snarling disgust, whilst <em>Man outside Cumberland Arms, Byker, 11/07/11 </em>is nothing short of utterly terrifying. I don’t know which one of Nately’s had the stones to risk making the field recording that runs through the song like poisoned blood, but he’s a bigger man than I.</p>\n<p>If you’re from the band’s presumably grim northern climes, you should probably make yer way over to The Tyne Bar on the twelfth night of December, for a four pound night of festive cheer entitled <a title=\"Yeah man, fuck that shit man. Yeah man. \" href=\"https://www.facebook.com/#!/event.php?eid=197864416962330\">Fuck Christmas</a>. Like all young and aspiring darlings of doom, Nately’s are consummate advocates of that social networking thang. You can find them <a title=\"Mancamp\" href=\"https://nwkidsister.bandcamp.com/\">here</a>, <a title=\"Grumblr\" href=\"https://nwks.tumblr.com/\">here</a>, <a title=\"Disgracebook\" href=\"https://www.facebook.com/nwkidsister\">here</a> and <a title=\"Wouldn't hurt a flyspace\" href=\"https://www.myspace.com/natelyswhoreskidsister\">here</a>. <strong><em></em></strong></p>\n<p><strong><em>Ribs </em></strong>is up for digital release on Christmas Day. We can only hope that somehow, it’ll make its way into a cathedral.</p>\n","slug":"12744-introducing-natelys-whores-kid-sister","category":"introducing","date":1322600614000,"wpid":12744,"isSticky":false,"featured_image":null,"createdAt":1587293361748,"updatedAt":1587825909116,"author":"5e9b68b27a1236eccfeb1d3c","categories":["introducing","new","music"]}