{"id":"5e9c33dc9b6559241525e117","title":"Film Review: Greenberg","content":"<p style=\"text-align: center;\"><a href=\"https://admin.</p><p>crackintheroad.com/uploads/2010/06/greenberg.jpg\"><br />\n</a></p>\n<p style=\"text-align: left;\">Noah Baumbach’s latest picture Greenberg sees the ‘Mumblecore’ movement meet the mainstream in an excruciating and ultimately emotionless example of cinema. Although the film won’t pull at your heartstrings, a solid script from the director himself, as well as delicate and believable performances from the film’s cast gives this film something to show for the Ben Stiller price tag.</p>\n<p>Greenberg played by Stiller is a 40 something year old who currently dedicates his life to “doing nothing”. Moving to Los Angeles from New York after a nervous breakdown, he’s tasked with taking care of his successful brother’s home after he leaves for a six week holiday with his family to Vietnam. Greenberg is awkward, obnoxious and self righteous, although it’s not imperative for the audience to like every lead that graces a screen, it would have been nice for Baumbach to give us something. He struggles to look after his brother’s dog, starts a mind boggling affair with the house’s personal assistant Florence Marr (Greta Gerwig) and generally goes out of his way to moan about the state of the world, portrayed rather inventively with Greenberg’s repeated complaint wring throughout the film. Because of this the film fails to achieve any sort of emotional resonance; the lonely walks with the dog, his fear of the youth and inability to deal with his past or the mistakes he’s made, ultimately become futile attempts to draw the audience in.</p>\n<p>Florence Marr (Greta Gerwig) the house’s assistant however is a marvel; wonderfully created she demonstrates perfectly the more interesting aspects of Baumbach’s writing. Cute, awkward, stuttering and bizarrely mature despite her child like nature she gives the film the likable quality that’s so missed throughout the rest of the picture. With her likability however comes another of the film’s problems; Baumbach gives us almost no reason for them to be together. Although Florence insists throughout the film that she’s just come out of a “long term relationship”, this seems more contrived than anything else. While saying this, the wonderfully excruciating situations Baumbach creates with the two characters are exceptional, at least in isolation. The films ‘sex’ scene being a particular highlight, Florence embarrassingly mutters “I’m wearing kind of an ugly bra” as the Greenberg attempts to disrobe her; all this after the couple share a Corona light in complete silence; poetically awkward is almost the only way to describe.</p>\n<p>Despite the drab central character, the ideas behind the narrative will stay with most after the final credits.  With Greenberg fresh out of a mental asylum, Baumbach attempts to question the central thesis behind madness and sanity. Characters constantly talk of their shrinks and the analysis they pay for, they range from the insightful to the blunt and obvious but still manage to present the whirlwind that is American mental health culture in an interesting way. When the credits do roll, the feeling will undoubtedly be an empty one, however the film packs enough intellectual punch to make you think, even if you don’t feel.</p>\n","slug":"1275-review-greenberg","category":"arts","date":1276459192000,"wpid":1275,"isSticky":false,"featured_image":{"width":650,"height":356,"src":"2010/06/greenberg.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAFAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAYH/8QAIBAAAQMDBQEAAAAAAAAAAAAAAQACAwQSIQURFCJRcf/EABQBAQAAAAAAAAAAAAAAAAAAAAT/xAAYEQEBAAMAAAAAAAAAAAAAAAABAAIDIf/aAAwDAQACEQMRAD8Ay+p1Ezy1jZ4y+6HcOLstcRdcD71A+KY5chz6iIeJyXtAC//Z"},"createdAt":1587295196078,"updatedAt":1588403566627,"author":"5e9b68b27a1236eccfeb1d24","old_image":"2010/06/greenberg.jpg","categories":["arts"]}