{"id":"5e9c2cdb9b6559241525d690","artists":["5e9b69177a1236eccfeb22a8"],"title":"Album Review: Los Campesinos! – Hello Sadness","content":"<p><a href=\"https://admin.</p><p>crackintheroad.com/music/12877-album-review-los-campesinos-hello-sadness/attachment/lc-sadness/\" rel=\"attachment wp-att-12879\"><img class=\"alignnone size-large wp-image-12879\" title=\"LC sadness\" src=\"https://api.crackintheroad.com/uploads/2011/11/LC-sadness-640x640.jpg\" alt=\"\" width=\"640\" height=\"640\" /></a></p>\n<p><span class=\"Apple-style-span\" style=\"font-size: small;\">It is unusual for <em><strong>Crack in the Road</strong></em> to have seemingly ignored an album such as </span><em style=\"font-size: small;\"><strong>Hello Sadness</strong></em><span class=\"Apple-style-span\" style=\"font-size: small;\"> for so long after its release, two weeks ago I believe. Being a band who have been integral to growth of this website, featuring in a handful of live reviews and interviews, any release from <strong>Los Campesinos!</strong> is always hotly anticipated. Yet I can’t help feeling that our lack of urgency in reviewing their third LP is down to the relatively mediocre quality of the record. If <em><strong>Hello Sadness</strong></em> was truly dreadful it would have been snapped up by us just as quick as had it been a revolutionary album, however it sidles along somewhere in the murky in-between. That said, one aspect that must be praised is the admirably innovative nature of  the concluding few songs.</span></p>\n<p><em style=\"font-size: small;\"><strong>Hello Sadness </strong></em><span class=\"Apple-style-span\" style=\"font-size: small;\">announces itself with a whimper as opposed to a bang, with the fairly lacklustre </span><em style=\"font-size: small;\">By Your Hand</em><span class=\"Apple-style-span\" style=\"font-size: small;\">, which even after several listens appears to lack depth. It is by all accounts a drastic change from what we’re accustomed to from </span><strong style=\"font-size: small;\">Los Campesinos!</strong><span class=\"Apple-style-span\" style=\"font-size: small;\">, and I for one assumed their recent success with the Budweiser TV commercial and increased radio exposure would have pointed their sonic masts in the direction of mainstream recognition. Other reviews I have read justify this change as the band ‘maturing’, but there’s a subtle difference in gaining a new-found level of understanding and perception, and simply providing a watered down version of previous outings. Songs such as their cover of </span><em style=\"font-size: small;\">C is the Heavenly Option </em><span class=\"Apple-style-span\" style=\"font-size: small;\">and<em> </em></span><em style=\"font-size: small;\">You, Me Dancing</em><span class=\"Apple-style-span\" style=\"font-size: small;\"> were personal favourites of mine and seem like a distant memory when compared to the majority of their new material. I for one would have understood them creating a ‘dark’ album, as it appears to be in vogue currently with artists of a similar ilk, if only it were executed better.</span></p>\n<p><span class=\"Apple-style-span\" style=\"font-size: small;\">The first song that really strikes a chord with me isn’t found unti</span><span class=\"Apple-style-span\" style=\"font-size: small;\">l seven tracks in, with </span><em style=\"font-size: small;\">The Black Bird, the Dark Slope,</em><span class=\"Apple-style-span\" style=\"font-size: small;\"> showcasing the first real introduction of female vocals on <strong>Hello Sadness</strong> coming to the fore, after 6 previous songs consisting primarily of Gareth experiment with lower vocals. This is a pleasant surprise, despite the morbidity of the lyrics themselves, an example being ‘</span><em>The black bird feasts upon my guts and bears its beak to fight’. </em>I suppose I look on this song favourably as it reminds me so much of their old stuff, with the same twee-pop vibe they had not only mastered but finely tuned in previous releases.</p>\n<p>The only other song that protrudes it’s head above the battlements of mediocrity is the penultimate song on the album, <em>Baby I Got the Death Rattle</em>. Primarily due to the distortion of Gareth’s voice entwining mercilessly with the dark subject matter and confusing nature of the instruments and effects.</p>\n<p><span style=\"color: #000000;\">Overall, it’s a disappointing attempt at ‘maturing’, if that was indeed the path they had intended to traverse. As a full release, <em><strong>Hello Sadness</strong></em> appears hurried and disjointed; a shame for all of the fans who enjoyed hearing some light-hearted pop treats every now and again when listening to their mp3 players on shuffle. However, I will keep my ears open for future releases and keep hoping they return to the days of <em><strong>Hold on now Youngster… </strong></em>and <em><strong>We are Beautiful, We are Doomed</strong></em>. It is unusual for Crack in the Road to have ignored an album such as Hello Sadness for so long after its release, 2 weeks ago I believe. However there is a good reason for this, its pretty mediocre… It is unusual for Crack in the Road to have ignored an album such as Hello Sadness for so long after its release, 2 weeks ago I believe. However there is a good reason for this, its pretty mediocre…</span> It is unusual for Crack in the Road to have ignored an album such as Hello Sadness for so long after its release, 2 weeks ago I believe. However there is a good reason for this, its pretty mediocre… It is unusual for Crack in the Road to have ignored an album such as Hello Sadness for so long after its release, 2 weeks ago I believe. However there is a good reason for this, its pretty mediocre… It is unusual for Crack in the Road to have ignored an album such as Hello Sadness for so long after its release, 2 weeks ago I believe. However there is a good reason for this, its pretty mediocre… It is unusual for Crack in the Road to have ignored an album such as Hello Sadness for so long after its release, 2 weeks ago I believe. However there is a good reason for this, its pretty mediocre…</p>\n","slug":"12877-album-review-los-campesinos-hello-sadness","category":"album-reviews","date":1321997068000,"wpid":12877,"isSticky":false,"featured_image":null,"createdAt":1587293403894,"updatedAt":1588441785635,"author":"5e9b68b27a1236eccfeb1d07","old_image":"2011/11/lc-sadness-165x165.jpg","categories":["album-reviews","music"]}