{"id":"5e9c33e59b6559241525e129","title":"Interview: The Wonder Villains","content":"<p style=\"text-align: center\">An indie-pop quartet from Derry City, <strong>The Wonder Villains</strong> are only 17 but have already supported the likes of <strong>Scouting for Girls </strong>and <strong>New Young Pony Club</strong>.</p><p> Energetic and exuberant vocals are matched by playful synths and indie guitars, all mixed to produce a sound that is endearingly youthful. However as a result there is a certain lack of solidarity to their sound, which risks many dismissing the band as a group of teenage synth junkies who are somewhat pleasant  to listen to. While this may be right to a certain extent, one must consider that <strong>The Wonder Villains</strong> are very much at the beginning of their musical evolution, and the early signs are very promising. Personally, I’d advise you to enjoy the raw energy of their sound now before any evolution occurs and add it to all of your summer playlists. <strong>Crack in the Road </strong>were lucky enough to catch up with lead vocalist <strong>Eimear Coyle</strong>.</p>\n<p style=\"text-align: center\"><em>CITR:</em> If you had to cite one band/artist as a major influence upon you, who would it be?</p>\n<p style=\"text-align: center\"><strong>Well we’re all going to see blink-182 in Dublin at the end of the summer which I’m really psyched about! Obviously they’re not a big influence in any direct way but I really like way they have some killer energetic tunes and seem to have loads of fun while they’re at it!</strong></p>\n<p style=\"text-align: center\"><strong> </strong></p>\n<p style=\"text-align: center\"><em>CITR:</em> What has been your favourite gigging experience to date?</p>\n<p style=\"text-align: center\"><strong>It has to be Radio 1’s Big Weekend. We got the boat over and had to stay over in a wee hotel and the weather was amazing so it just felt like the band had gone on a great holiday! We were able to watch back some videos of our show which I really enjoyed. Looking Awesome</strong>!</p>\n<p style=\"text-align: center\"><strong> </strong></p>\n<p style=\"text-align: center\"><em>CITR:</em> How did ‘The Wonder Villains’ come into existence?</p>\n<p style=\"text-align: center\"><strong>It’s extremely complicated but the official story goes that me and Cheylene were the only ones at our school doing both art and music – so we obviously had to start a band. Neither of us had really been in bands before so no one in our school would take us seriously. Luckily my brother Kieran and his friend Ryan didn’t think we were crazy, so they were allowed to join.</strong></p>\n<p style=\"text-align: center\"><strong> </strong></p>\n<p style=\"text-align: center\"><em>CITR: </em>Your sound has been described as ‘energetic electro-pop’, would you agree? What inspires you to create your sound?</p>\n<p style=\"text-align: center\"><strong>‘Energetic electro-pop’, they’re all really nice words but we recently had a band meeting where we decided that ‘indie-pop’ sounded cooler. At the minute we’re going with that.</strong></p>\n<p style=\"text-align: center\"><strong> </strong></p>\n<p style=\"text-align: center\"><em>CITR: </em>You are set to perform on the BBC Introducing Stage at the Radio 1 Big Weekend. Do you believe this marks the beginning of ‘The Wonder Villains’ wider recognition?</p>\n<p style=\"text-align: center\"><strong>I really hope so! As far as i know, there are at least ten people in Wales into the band now – that’s cool! We got a pretty good crowd and people came to see us instead of going to the bigger stages. That was really s</strong>weet.</p>\n<p style=\"text-align: center\"><strong> </strong></p>\n<p style=\"text-align: center\"><em>CITR:</em> You’ve recently supported ‘Scouting For Girls’, how was that as an experience?</p>\n<p style=\"text-align: center\"><strong>Yeah, that was really cool as well! I think they were Number 1 in the charts when we played that show with them. We were psyched about that, and I’m sure they were too!</strong></p>\n<p style=\"text-align: center\"><strong> </strong></p>\n<p style=\"text-align: center\"><em>CITR:</em> Do you believe that growing up in Derry affected your musical style at all?</p>\n<p style=\"text-align: center\"><strong>I think that it’s fair to say that the music has absolutely nothing to do with Derry. Most of the songs are something to do with films or TV and sunny places. None of that happens here</strong>…</p>\n<p style=\"text-align: center\"><strong> </strong></p>\n<p style=\"text-align: center\"><em>CITR: </em>What was the first gig you ever went to as a fan?</p>\n<p style=\"text-align: center\"><strong>Like pretty much every other girl I know, my first gig was with my mammy to see Westlife supported by SIX, which was obviously amazing! I still have a huge foam hand that I still use.</strong></p>\n<p style=\"text-align: center\"><strong> </strong></p>\n<p style=\"text-align: center\"><em>CITR: </em>Can we expect to see a debut album in the not so distant futur<strong>e?</strong></p>\n<p style=\"text-align: center\"><strong>We hope to release something sometime soon but at the moment we’re just writing and recording as much as possible.</strong></p>\n<p style=\"text-align: center\"><strong> </strong></p>\n<p style=\"text-align: center\"><em>CITR:</em> PC or Mac?</p>\n<p style=\"text-align: center\"><strong>Mac all the way! Our dad has been rocking the Macs since like the 80s, so growing up me and Kieran couldn’t play all the ‘cool’ PC games. Maybe that’s why there are no songs about computer games yet.</strong></p>\n<p style=\"text-align: center\"><strong> </strong></p>\n<p style=\"text-align: center\"><em>CITR:</em> What piece of trivia might we not know about ‘The Wonder Villains’?</p>\n<p style=\"text-align: center\"><strong>I’m actually the Captain of our local roller-hockey team! We’ve only got four members and two pairs of blades so far but we’ve got BIG plans…</strong></p>\n<p style=\"text-align: center\"><a href=\"https://www.myspace.com/thewondervillains\" target=\"_blank\">Check out The Wonder Villains Myspace!</a></p>\n<p><iframe src=\"https://www.facebook.com/plugins/likebox.php?id=114090381951328&width=292&connections=10&stream=false&header=false&height=255\" scrolling=\"no\" frameborder=\"0\" style=\"border:none; overflow:hidden; width:292px; height:255px;\" allowTransparency=\"true\"></iframe></p>\n","slug":"1291-interview-the-wonder-villains","category":"interviews","date":1276191552000,"wpid":1291,"isSticky":false,"featured_image":{"width":1119,"height":845,"src":"2010/06/the-wonder-villains.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAIAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAUH/8QAHxAAAQMFAAMAAAAAAAAAAAAAAQIDBAAFERIhBhMi/8QAFAEBAAAAAAAAAAAAAAAAAAAABP/EABsRAAICAwEAAAAAAAAAAAAAAAECAANBUdHh/9oADAMBAAIRAxEAPwCI14lZpcpmM5JuDi1wXZTDqdD7CjTO/epO/wA4wADg9HMjuUNuPcZTMW8bx23VobUeZSCQDgqyOUpQ6nJcrr2IurVQCM8E/9k="},"createdAt":1587295205289,"updatedAt":1588403566780,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2010/06/the-wonder-villains.jpg","categories":["interviews","music"]}