{"id":"5e9c2ca79b6559241525d65b","artists":["5e9b69117a1236eccfeb2244","5e9b69117a1236eccfeb2245"],"title":"New: Lana Del Rey – Born To Die","content":"<p><strong>Lana</strong>, whatever shall we do with you? You make us all fall head over in heels in love with your touching honesty and scandalous lips, before crushing our sordid dreams by revealing the extent of the PR campaign behind your music.</p><p> Anyway, 2011’s most controversial artist is back with new single<em> Born To Die</em>, taken from her debut album of the same title, due for a January release.</p>\n<p>The track isn’t as immediate as <em>Video Games</em>, nor as emotionally straining, yet it’s arguably better, utilizing <strong>Del Ray’s</strong> vocals to splendid effect. With her drawled vocals layered over the top of a simplistic beat and sampled soul track, it’s far more innovative and interesting than I’d expected from her. It’s sensually arousing, combining elements of 60’s pop with more modern, darker elements, sounding like it should be played during the closing credits of an epic independent film, with<strong> Lana</strong> bemoaning <em>“I was so confused as a little child, trying to take what I couldn’t get.”</em> Say what you like about <strong>Elizabeth Grant</strong>, she knows how to pull off a cracking pop tune.</p>\n<p>Check out <em>Born To Die</em> below, and before you rush to the bathroom and proceed to vomit into the sink for several hours, take note that the hideously creepy clip below is not the official video for <em>Born To Die</em>. For those obsessives amongst you, also notice that the lyrics on the album version will be changed to<em> “let me fuck you hard in the pouring rain”</em> from <em>“let me kiss you hard…”</em>, this is for radio friendly reasons.</p>\n<p><iframe src=\"https://www.youtube.com/embed/eGR1iDuKabU\" frameborder=\"0\" width=\"560\" height=\"315\"></iframe></p>\n","slug":"12947-new-lana-del-rey-born-to-die","category":"music","date":1322840559000,"wpid":12947,"isSticky":false,"featured_image":null,"createdAt":1587293351283,"updatedAt":1588441785532,"author":"5e9b68b27a1236eccfeb1d27","old_image":"generated/6e8dc460cfb6b89d7970302259febd0aa73b38c6.jpg","categories":["music","new"]}