{"id":"5e9c2ca19b6559241525d657","artists":["5e9b68f87a1236eccfeb20a5","5e9b692b7a1236eccfeb238d"],"title":"MPfree: Gang Gang Dance – Chinese High (NGUZUNGUZU Remix)","content":"<p>I may have not given <strong>Gang Gang Dance</strong>‘s newest album <em>Eye Contact</em> enough attention, but they’re still a great band.</p><p> I just can’t take them seriously since that track with<strong> Tinchy Stryder</strong>. You know the one. That’s not to say it’s a bad track either (in fact it’s my favourite track on <em>Saint Dymphna</em>) – but more to the point, they do attract talent of a similar certain calibre.</p>\n<p>Since releasing this new one, they’ve been remixed brilliantly by <strong>Lee ‘Scratch’ Perry</strong>, and now LA-based trendy duo <strong>NGUZUNGUZU</strong> have had their turn – and the lovely folks at 4AD thought they’d treat us for free!  The duo really are converging with the distinctive <strong>Night Slugs</strong> sound, thanks to their dabblings with sister label <strong>Fade To Mind</strong> (run by the excellent <strong>Kingdom</strong>, of all people). The remix is unmistakably catchy, turning the original into a chopped-up tribal drum infestation with retro sampling, vocals hopping about playfully, and the usual necessary amounts of ‘n-tsh’ house percussion. This is a great little footstepper, layered and sequenced as acutely as any of <strong>NGUZUNGUZU</strong>‘s own productions. Cop this one yo.</p>\n<p><em>Stream and download NGUZUNGUZU’s mix of Chinese High below.</em></p>\n<p><center><iframe src=\"https://widgets.beggarspromo.com/chinesehighremix/widget.php\" style=\"margin: 0; padding: 0;\" frameborder=\"0\" scrolling=\"no\" width=\"290\" height=\"375\" data-audio-widget-jspf=\"https://widgets.beggarspromo.com/chinesehighremix/jspf\"></iframe></center></p>\n","slug":"12955-mpfree-gang-gang-dance-chinese-high-nguzunguzu-remix","category":"mpfree","date":1322852625000,"wpid":12955,"isSticky":false,"featured_image":null,"createdAt":1587293345339,"updatedAt":1588441785503,"author":"5e9b68b27a1236eccfeb1d10","old_image":"generated/b9215ee1891a04000fa67d56d8991790c8efe151.jpg","categories":["mpfree","music"]}