{"id":"5e9c2c939b6559241525d651","artists":["5e9b69517a1236eccfeb261b"],"title":"New: The Lulls In Traffic – Silver Bells Are Ringing Only Grey","content":"<p>Call me Scrooge, but aside from a few choice exceptions, all Christmas songs are crap.</p><p> All the classics (<em>Fairytale of New York</em>, <em>The Snowman</em>) are played to death, and it goes without saying that the majority of modern festive tracks reek of tediously forced commercialization. However, every year there are always a handful of a tracks that choose to focus on the more spiritual elements of Christmas, such as tear-jerking memories and intimate relationships.</p>\n<p>This new cut from Lakeland’s <a href=\"www.thelullsintraffic.com/\" target=\"_blank\"><strong>The Lulls In Traffic</strong></a> does entirely that, although you’d be forgiven for thinking otherwise when reading the lyrics to the first verse –<em> ‘Well here comes my Santa on his way. I know that he has something beautiful for me somewhere on his sleigh. I was pretty good this year, at least I tried.’</em> Yeah, I know what you’re thinking; ouch. Luckily, it doesn’t dwell on those issues for long, and instead morphs into a remorseful ballad, that anyone alone at this time of year can relate to. After the much improved chorus, a minimal, hip-hop beat kicks in, with the other half of <strong>The Lulls In Traffic</strong> taking over; not the slickest rap verse you’ll ever hear but it’s grounded in real life emotions, proving vitally important to the general feel of the track. Check out <em>Silver Bells Are Ringing Only Grey</em> below, and download it if you fancy.</p>\n<p><iframe style=\"position: relative; display: block; width: 400px; height: 100px;\" src=\"https://bandcamp.com/EmbeddedPlayer/v=2/track=1477310967/size=venti/bgcol=FFFFFF/linkcol=4285BB/\" frameborder=\"0\" width=\"400\" height=\"100\"></iframe></p>\n","slug":"12985-new-the-lulls-in-traffic-silver-bells-are-ringing-only-grey","category":"mpfree","date":1323100577000,"wpid":12985,"isSticky":false,"featured_image":null,"createdAt":1587293331799,"updatedAt":1588441785425,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/12/lana-del-rey2-165x139.jpg","categories":["mpfree","new","music"]}