{"id":"5e9c2c729b6559241525d63f","artists":["5e9b69117a1236eccfeb2203"],"title":"Review: King’s Daughters And Sons – If Then Not When","content":"<p>Louisville, KY’s <strong>King’s Daughters And Sons </strong>carry the yoke of the past heavy across their collective backs.</p><p> A cursory read of their press release from Chemikal Underground, the label on which their debut <strong><em>If Then Not When </em></strong>is released, makes the band’s involvement with history well known. It details the members’ previous outfits, Louisville cult darlings The Shipping News and Rachel’s among them, the band’s roots sunk deep into Kentucky soil. The bio also names King’s Daughters And Sons, in that hyperbolic way that only press releases can, as “part William Faulkner, part Led Zeppelin”, which sets the watermark even higher than the troupe’s own separate previous merits. They’re on the back foot before they’ve started – despite their base similarity, lines like ‘in the kitchen, whiskeydrunk’ can’t really elevate a guitar band, even one possessed of the history and gravitas of King’s Sons And Daughters, to the standing of a literary monolith. Even the band’s name brings with it all the baggage of generations, the blossom and decay of bloodlines, the expectation of behaviour engrained in royal descent.</p>\n<p>With <strong><em>If Then Not When</em></strong>, King’s Sons And Daughters have drawn on the past – that of themselves and others – and crafted an apt soundtrack for all the chronic weight. The record looks to post-rock for its drama, slowcore for severity, and country’s rich heritage of yarnspinning and morose twang.  The band think nothing of presenting a gripping 8 minute narrative based around the explosion of a still and the deaths of two betrothed, as on <em>The Anniversary</em>, and setting it to martial snares and tense arpeggios, which build to a typically crashing peak. Equally, they’ll spin out the barest of spidery folk whispers, as on <em>Lorelei</em>, for the same amount of time, and not vary the volume once.</p>\n<p>It’s here that the members’ past experience, their revered Louisville lineage, is so evident. For such lengthy songs, not a single note is wasted, and no post-rock pitfalls are unhappily happened upon. Glacial opener <em>Sleeping Colony </em>remains as taut and alive as powerlines after rain throughout its seven minutes, and for all its worthiness, <strong><em>If Then Not When </em></strong>is more often than not a genuine delight to listen to, rather than the kind of hard work that dense and expansive records can sometimes be. It’s easy to take immediate joy from playful excursions like the cowboyish affectations of <em>A Storm Kept Them Away</em>, or <em>Dead Letter Office</em>’s swaggering Will Oldham-meets-Low jangle, and where the band’s tendency toward the epic is clear, there’s a plain humanity at work here too. <em>Volunteer </em>pits soft voice against Rachel Grimes’ gentle piano swell, a spare beat, icy electrics. When Joe Manning and Michael Heineman break out from their hushed trappings and into full-throated yelps, it’s to a gut-punch that can so often be faked in this kind of setting. But it hits here.</p>\n<p>The ever-quotable Faulkner once noted that “the past is never dead. In fact, it’s not even past”. The meaning loaded in the line has been debated to varying conclusion, and here too, it’s applicable in a variety of ways. For King’s Daughters And Sons and <strong><em>If Then Not When</em></strong>, the past may still be present, in both senses of the word, but it’s proven malleable in such capable hands.</p>\n","slug":"12996-review-kings-daughters-and-sons-if-then-not-when","category":"album-reviews","date":1323372179000,"wpid":12996,"isSticky":false,"featured_image":null,"createdAt":1587293298956,"updatedAt":1588441785268,"author":"5e9b68b27a1236eccfeb1d3c","old_image":"generated/ab67616d0000b273c12f8a4bfbb4862e5f6dbdf0.jpg","categories":["album-reviews","music"]}