{"id":"5e9c2c659b6559241525d63a","artists":["5e9b68e57a1236eccfeb1f50"],"title":"Interview: Dan Mangan","content":"<p><a href=\"https://admin.</p><p>crackintheroad.com/music/13050-interview-dan-mangan/attachment/dan-mangan-color1/\" rel=\"attachment wp-att-13051\"><img class=\"alignleft size-singlepost wp-image-13051\" title=\"Dan-Mangan-color1\" src=\"https://api.crackintheroad.com/uploads/2011/12/Dan-Mangan-color1-950x633.jpg\" alt=\"\" width=\"950\" height=\"633\" /></a></p>\n<p><strong>CitR: Describe your sound in your own words.</strong></p>\n<p><em>Dan: It’s a lyric-heavy collection of indie rock and folk and jazz and several other ambiguous and vague genres. </em></p>\n<p><strong>CitR: Since you were in the UK <a title=\"Exclusive Session: Dan Mangan\" href=\"https://admin.crackintheroad.com/music/8705-exclusive-unplugged-session-dan-mangan/\" target=\"_blank\">last summer</a>, what have you been up to?</strong></p>\n<p><em>Dan: We toured basically all year. Over the last winter we recorded this newest record, <a title=\"Review: Dan Mangan - Oh Fortune\" href=\"https://admin.crackintheroad.com/music/11533-review-dan-mangan-oh-fortune/\" target=\"_blank\"><strong>Oh Fortune</strong></a>, and kind of made it on and off the road, and in February or March we started touring more heavily. It’s been one of the most intense tours of my life, and I’ve slept in my own bed fifty or sixty times all year. After this trip I’m done, and get to go home and have two months off, which is nice.</em></p>\n<p><strong>CitR: What are the general themes and inspirations behind <em>Oh Fortune?</em></strong></p>\n<p><em>Dan: Existence. I think it’s a fairly philosophical record, and there’s a lot of talk of death and life and burning. There are a lot of questions asked. I didn’t set out to try to answer a lot of questions, so much as pose them. There are a lot of different things going on – even the title, it’s a good phrase to describe all of the chaos and beauty and danger and incredibleness and all the different, very complicated, different aspects of what it is to be alive and have a life.</em></p>\n<p><strong>CitR: [At his show the night before] you mentioned Guatemala in regards to certain war crimes that happened there. Do you find politics influences your songwriting at all?</strong></p>\n<p><em>Dan: I think that I’m definitely an opinionated person, and I certainly have some ideas when it comes to politics and society. And I would never consider myself a political singer or a protest singer or anything like that, but I think it’s inevitable that if something’s on your mind it’s going to work its way out through whatever you’re creating. So there’s a lot of social criticism on the record. There’re a lot of punchy lyrics and I think it’s a really healthy thing to take the piss out of people – not in a menacing or malevolent wa</em>y, <em>but prompting the idea that questions can be asked about a whole lot of things that maybe don’t get asked about.</em></p>\n<p><strong>CitR: There we some quite dedicated people there last night, and a lot of requests. Would you rather have that small, dedicated fanbase, or would you be happier with mainstream recognition?</strong></p>\n<p><em>Dan: Every gig is different. I’ve played a lot of gigs to ten people, and I’ve played some gigs to thousands and thousands of people. They’re all special in their own ways and they’re all exciting in different ways. I think if you only played one kind of gig all the time you’d go a little bit crazy with the stagnancy. It was nice to play that gig last night, but I think that, hopefully, if you work for long enough with enough steadfast sincerity and hard work, you can have your cake and eat it too. There are a lot of people who are successful in the typical sense but are also able to keep their credibility and their musical intentions. I think that’s great and I look to a lot of people who are able to not succumb to any pressure to make their musical commercial but at the same time have found a healthy career in music.</em></p>\n<p><strong>CitR: Do you find there are any differences between British crowds and Canadian crowds?</strong></p>\n<p><em>Dan: Britain is not the easiest place to play. I think there’s so much music in this place already that people tend to approach performances slightly more indignantly. I don’t mean that to be too harsh. I just think this is a very saturated place, whereas if you go and play in some nether town in Germany, people who come to the gig are glued to what you’re doing because there’s not a lot of entertainment coming through town. It’s just different. But at the same time, it doesn’t matter where you go in the world – there’re good people everywhere and there’re dicks everywhere. Every kind of archetype of person exists in all places. So as long as you can tap into the good people wherever you go, then you’re fine.</em></p>\n<p><strong>CitR: Best moment onstage?</strong></p>\n<p><em>Dan: We’ve been very fortunate. We’ve played some very big festivals and some really cool venues all around the world, and I think some of the most memorable gig moments have come from this year. In our hometown we played a big outdoor show for Vancouver’s 125<sup>th</sup> anniversary in Stanley Park, and it was just the best. It was a free show for the people of Vancouver, and we had a fifteen-piece band with horns and strings and the whole thing was also a couple of weeks after Vancouver had a riot over a hockey game, so it was nice that the city could come together and not break things.</em></p>\n<p><strong>CitR: What music do you listen to on tour?</strong></p>\n<p><em>Dan: A lot of different stuff. Recently I’ve been listening to a lot of Canadian stuff – an album buy a guy named <strong>Bryan Webb</strong> who used to be in a band called <strong>Constantines</strong> that were quite big in Canada. He has a solo record out that I just think is stunningly beautiful. <strong>Colin Stetson</strong>, the saxophone player, who’s played with a lot of big names like <strong>Bon Iver </strong>and <strong>Arcade Fire</strong>, he’s got a solo record out this year that’s just mindblowing. <strong>Bon Iver</strong>. <strong>Radiohead</strong>. Lots of good stuff.</em></p>\n<p><strong>CitR: What would you like to be doing in ten years?</strong></p>\n<p><em>Dan: I think I’d like to be doing what I’m doing now, but with a little more time off. If I could tour for five or six months of the year instead of nine or ten but still get to go around the world and make music and record records and have cool experiences, that’s all I really want to do.</em></p>\n<p><strong>CitR: If you could be any animal, what would it be?</strong></p>\n<p><em>Dan:  My last name is Mangan, so there was a period of time where I was called Mongoose. I don’t really know much about a mongoose. But maybe it’s better to pick a mongoose than a lot of animals that get picked right away, and you don’t want the mongeese of the world to get left out. </em> </p>\n","slug":"13050-interview-dan-mangan","category":"interviews","date":1323626771000,"wpid":13050,"isSticky":false,"featured_image":null,"createdAt":1587293285594,"updatedAt":1588441785137,"author":"5e9b68b27a1236eccfeb1d16","old_image":"2011/12/dan-mangan-color1-950x633.jpg","categories":["interviews","music"]}