{"id":"5e9c2bde9b6559241525d5cb","title":"Interview: Matt Edwards of Skatterbrain","content":"<p>In 2004 a college boy from Maryland discovered how easy it was to use the internet to find the music he loved.</p><p> This boy’s name was Matthew Edwards and despite never meeting him,  Matthew Edwards introduced me to more music than my own parents.</p>\n<p>We all develop individual opinions of everything based on personal taste & past experience. Music is definitely no exception but this exploration of palate is limited by accessibility to fresh content. You wouldn’t’ discover a passion for swordfish by eating Burger King everyday and you wouldn’t have heard of <a href=\"https://www.youtube.com/watch?v=2BEMwNhT5iw\">Math & Physics Club</a> if you only read <a href=\"https://www.metalhammer.co.uk/\">Metalhammer</a>.</p>\n<p>Accessing new music used to be much more difficult. Twenty years ago buying a new record would have probably meant leaving the house but nowadays you can indulge in entire discographies & read about hundred’s of new bands without even getting out of bed.</p>\n<p>The internet & blogging have changed everything in such a relatively small period of time. Early demos once reserved for record label executives & ‘real’ journalists are everywhere & individuals writing for love not money are spewing out gigabytes of new content daily. Throughout my youth it was music bloggers that opened my ears to the world, leading me from the depths of circuit bent noise rock to the peaks of twee pop trios.</p>\n<p>So following the news that one of my childhood treasure troves, a 7 year old indie music blog called Skatterbrain, was ‘relaunching’ to tumblr, I caught up with graphic designer, Matthew Edwards to talk to him about his second life as a wildly popular bedroom blogger.</p>\n<p><strong>SG: Hi Matt. Firstly could you start from the beginning and explain to the CITR readers how it all came about.</strong></p>\n<p>ME: Hey Sam. Well towards the end of 2004 I had started using the internet to find the music I wanted to hear and I was in love with it. I wanted to share it with my friends and get them into it, so I started doing this “mp3 of the day” thing on my MySpace profile (this also one of my earliest forays in to messing with css.) This eventually transitioned into a music blog by way of a livejournal profile that I had set up. The livejournal blog lasted a few weeks before I was eventually convinced by a few music blogging peers (mainly Matt from <a href=\"https://www.youaintnopicasso.com/\">You Ain’t No Picasso</a>) that setting up home on blogspot was the way to go. That’s when Skatterbrain was born.”</p>\n<p><strong>SG: Do you think your taste has developed with Skatterbrain over the years & are you still as enamoured with the music you posted then?</strong></p>\n<p>ME: A look back at my ‘<a href=\":https://www.skatterbrain.org/2005/11/skatterbrains-top-20-of-2005.html\">Favorite Records of 2005</a>‘ post gives you an idea of what Skatterbrain was all about at that time. Since then, Skatterbrain has become more and more focused every year in accordance with how my musical interests have changed and, to be honest, there are only two or three records on that 2005 list that I’d be interested in even hearing again.</p>\n<p>For the past several years Skatterbrain has become very indiepop / shoegaze / noisepop / garage focused because that’s where my tastes lie and that’s what I want to tell people about.</p>\n<p><strong>SG: So since you started writing we’ve seen the rise and fall of so many blogs, what has made you stick around & what do you feel you get back from the experience?</strong></p>\n<p>ME: Hah, yeah. Blogs come and go at a ridiculous rate these days. There’s only a few I read anymore because I really respect their writer’s tastes. I’m not entirely sure why I’ve stuck around; I guess because I really care about the music that I love and that’s the only music I write about. As the blog became more and more focused genre-wise, the amount of readers became smaller and smaller. Those who’ve stuck around are as passionate as I am and they are the kind of people I want to have reading the blog. If someone falls in love with a band or buys a record that I write about, that’s what makes it all worthwhile. The songs I love bring me a lot of happiness and I’m just trying to share some of that happiness.</p>\n<p><strong>SG: So now you’re relaunching Skatterbrain on the social media platform Tumblr to encourage interactivity, I know you’ve thrown around the idea for a while but what has made you take that step? Do you think it may see you return to more regular posts?</strong></p>\n<p>ME: That’s the plan. I’ve had another <a href=\"https://matthewedwards.tumblr.com/\">personal tumblr</a> for a few years now and my favorite thing about tumblr is its community building tendencies. Skatterbrain (and music blogs in general) used to feel like so much more of a community and I guess I’m trying to get back to that a little bit. The goal is to return Skatterbrain to a blog with regular posts and I think tumblr is going to help out a lot with that!</p>\n<p><strong>SG: So despite a drop in readership over the last two years you must get a lot of musicians & their PR agencies contacting you through the blog, how do you decide what to listen to and what makes you want to write about it?</strong></p>\n<p>ME: Yes, I still get a lot of emails. If I like the band or the label or something like “jangly” or “fuzzy guitars with overlapping reverbed female vocals” pops out then I’ll read it, but let’s just say that that I have 54,000+ unread emails in my gmail account. Most of the stuff I listen to and write about has been found on my own or recommended by friends. I like looking for music, it’s a rewarding process!</p>\n<p><strong>SG: One of the most well known elements of Skatterbrain that had a definite influence on my music taste over the last seven years are the </strong><strong><a href=\"https://www.skatterbrain.org/post/15216737031\">mix tapes</a></strong><strong>, complete with magnificent cover art that I’m guessing comes from your real job as a graphic designer.</strong></p>\n<p>Thanks! The mixes are probably part of the reason that Skatterbrain has stuck around this long, actually. They’re a lot of fun for me to make—especially the cover art. I always make the mixes and the covers myself. The covers don’t tie into work. In fact, they’re kind of some of the only personal design work I do these days so I always really look forward to doing them. The response to the mixes is always really wonderful, too, so it’s all very rewarding.</p>\n<p><strong>SG: Is there one track you’d like to share with the readers of crack in the road to give them a taste of what they can expect if they decide to pick up on the latest from Skatterbrain on your new </strong><strong><a href=\"https://www.skatterbrain.org/post/15216737031\">Tumblr</a></strong><strong>?</strong></p>\n<p>ME: Sure! The track I’m sending is “Take Care Of Yourself” by a new-ish band called The Whines. It’s jangly, fuzzy, and super catchy. It’s got basically all little bit of everything I love all wrapped up into one perfect little pop song!</p>\n<p><object width=\"100%\" height=\"81\" classid=\"clsid:d27cdb6e-ae6d-11cf-96b8-444553540000\" codebase=\"https://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=6,0,40,0\"><param name=\"allowscriptaccess\" value=\"always\" /><param name=\"src\" value=\"https://player.soundcloud.com/player.swf?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F32437598\" /><embed width=\"100%\" height=\"81\" type=\"application/x-shockwave-flash\" src=\"https://player.soundcloud.com/player.swf?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F32437598\" allowscriptaccess=\"always\" /><br clear=\"none\" /><br clear=\"none\" /><br clear=\"none\" /></object></p>\n<p><strong>SG: Thanks a lot for talking to me and, more importantly, a massive thank you from myself and the thousands of other twenty-two yearolds who spent too much time on the internet as kids. Finally, What do you think the best thing to come from blogging is? You never know, you might leave a bored college kid with an urge to take to the keys.</strong></p>\n<p>ME: The best thing that’s come from Skatterbrain is probably all of the great friends that I’ve made all over the world. The second greatest thing thing is all of the design opportunities that have come about as a result of Skatterbrain and the monthly mixes being out there. Thanks Sam. This was fun!</p>\n<p><em>Matthew Edwards is now 26, a graphic designer & living in Philadelphia. He likes: autumnal ephemera, skipping, cider & fuzz. Check out Skatterbrain & grab yourself one of Matt’s monthly mixes over at </em><em><a href=\"https://www.skatterbrain.org\">www.skatterbrain.org</a></em></p>\n","slug":"13058-one-of-oldest-indie-music-bloggers","category":"interviews","date":1325788857000,"wpid":13058,"isSticky":false,"featured_image":{"width":950,"height":591,"src":"2012/01/74117168_1d919c5c10_b-950x591.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAGAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAAAAb/xAAjEAABAwIFBQAAAAAAAAAAAAACAQMEAAUGERITISJBUXKh/8QAFQEBAQAAAAAAAAAAAAAAAAAAAAH/xAAXEQEBAQEAAAAAAAAAAAAAAAABAAIh/9oADAMBAAIRAxEAPwCEn3CVIvzolKkNAsw4iI04Q5rqXqLnnjx8qSkYouTUh1veNdBKOe4fZfalKuSL2//Z"},"createdAt":1587293150914,"updatedAt":1588443776694,"author":"5e9b68b27a1236eccfeb1d40","old_image":"2012/01/74117168_1d919c5c10_b-950x591.jpg","categories":["interviews"]}