{"id":"5e9c2c5e9b6559241525d634","artists":["5e9b69517a1236eccfeb25fb"],"title":"Interview: The Correspondents","content":"<p><a href=\"https://admin.</p><p>crackintheroad.com/music/13070-interview-the-correspondents/attachment/correspondents/\" rel=\"attachment wp-att-13075\"><img class=\"alignleft size-singlepost wp-image-13075\" title=\"correspondents\" src=\"https://api.crackintheroad.com/uploads/2011/12/correspondents-950x960.jpg\" alt=\"\" width=\"950\" height=\"960\" /></a></p>\n<p>We briefly mentioned <strong>The Correspondents</strong> in our <a href=\"https://admin.crackintheroad.com/music/9412-review-secret-garden-party-2011/\" target=\"_blank\">Secret Garden Party review</a> earlier this year. Mixing a unique live show with an eclectic range of musical styles, the swing/hip-hop/drum and bass/dubstep/jazz/electro duo quite easily qualify as ones to watch for 2012.</p>\n<p><strong>CitR: How did you begin as an act?</strong></p>\n<p><em>Chucks: I was producing some jazzy hip-hop at university, and Bruce was MCing and hosting club nights up in Edinburgh.</em></p>\n<p><em>Mr. Bruce: And after uni we got back to London and started making a few tunes and playing at a few mates’ parties.</em></p>\n<p><em>C: We kept going from there, really. We never had a meeting where we said, ‘let’s be a band’.</em></p>\n<p><em>B: We really had no intention of doing this and we were both very happy in our jobs at the time, and we found ourselves doing more gigs than we could handle. So we did it full-time. Which is the best way to be, in a sense, because we don’t really have massive aspirations. We want to see how far we can take it and push our potential. We haven’t got any particular aspirations towards fame. But we really enjoy it. It’s a really amazing job.</em></p>\n<p><strong>CitR: Briefly describe your sound in your own words.</strong></p>\n<p><em>B: It’s always a bit of a tricky one for us because we’re basically multi-genre. Our sets move from swing to jazz to electro to dubstep to drum and bass.</em></p>\n<p><em>C: Everything inbetween, really. Dance music of all eras.</em></p>\n<p><em>B: I think the joy of being a two-man band is that you’re not restricted by having a band with guitars and drums and everything else. I think Chucks just makes everything to his fancy.</em></p>\n<p><strong>CitR: Do you find it easier or harder to get noticed due to having such a unique sound?</strong></p>\n<p><em>B: I don’t know if it’d be easier to get noticed if you had strict genre that came with you. We don’t really want to be pinned down.</em></p>\n<p><em>C: It’s probably harder for you guys really. It’s quite hard to write 150 words and the problem is, whenever people do, they always mention the live shows which are just one aspect of us. It’s quite hard to pin us down without irritating us.</em></p>\n<p><em>B: We’re still wanting to come up as some fixed term of what music we make, so every time we do we’re thinking we’re going very much on electro with horns and jazz elements, and then that completely changes and Chucks starts doing drum and bass or some curious form of dubstep.</em></p>\n<p><strong>CitR: Influences?</strong></p>\n<p><em>B: In the car we listen to pretty much anything. We try to give ourselves a bit of a music education with some old stuff – Chucks has been into a bit of 60s beat stuff recently. We got really into the <strong>James Blake</strong> album. Lyrically, I really like <strong>The Black Keys</strong>.</em></p>\n<p><strong>CitR: Do you see yourselves as primarily a live act, or do you prefer to put equal focus on recorded music?</strong></p>\n<p><em>B: The live shows are a means of supporting ourselves, and how we can do <strong>The Correspondents</strong> as a full-time career. We’re in quite a curious position in that we’ve been going for four years and for the first three we didn’t release anything apart from a bootleg EP. Then we properly released an EP in April, and we want to shift the emphasis more to the recorded stuff. So far it’s quite difficult because everyone immediately compares our recorded stuff to our live shows. We, probably self-consciously, want them to be quite different. People say, ‘this track is interesting because it’s nothing like your live show’. But I’m not jumping about in your kitchen or joining you on the tube when you’ve got your headphones in, so you can’t necessarily expect it to be the same thing. </em></p>\n<p><strong>CitR: You played three separate sets at Secret Garden Party this year. Do you find you have a particular connection to that festival?</strong></p>\n<p><em>B: Yeah, certainly. That festival was the first festival that we did a main stage gig. We pretty much fell into it because another band dropped out and we were told two or three days before the festival that we would be doing this gig. I didn’t know about the festival at all, to be honest. All we knew was that it was a main stage gig, and it was a really hot Sunday afternoon and we thought no one was going to be there, and because of the way the festival is set out, because it was a really sunny day, everyone just congregated there and that ended up being a watershed moment for us. So we do have a connection to it, though I don’t know if we’re going to be doing it this year.</em></p>\n<p><strong>CitR: Is your songwriting process a joint effort, or is it something one of you undertakes individually?</strong></p>\n<p><em>B: We start off with Chucks, really.</em></p>\n<p><em>C: I’d say there are three parties involved. I make the beat, Bruce will write the lyrics and then we’ll record it, and then we’ll probably go perform it live a load of times so we can see what the crowd thinks, and then we’ll finish it. Now, for the album, it’s harder playing so many gigs where they’re gagging for new material so we’re going to hold back until the album is finished. Just because every time we release something, everyone’s heard it.</em></p>\n<p><em>B: It’ll be nice to have something really fresh.</em></p>\n<p><strong>CitR: Would you trade in your cult following for more mainstream recognition?</strong></p>\n<p><em>B: Everything would have to be done very carefully.</em></p>\n<p><em>C: We’d like more people to try our music, definitely, but our fanbase is great.</em></p>\n<p><em>B: We really get to know them personally.</em></p>\n<p><em>C: That makes it sound like there’s ten of them. My answer would be no, definitely. I much prefer a smaller fanbase. But I’d also like one that actually bought some of our music.</em></p>\n<p><em>B: I think my biggest fear would be to be perceived as selling out and lose the original group that came and saw us. I’d much rather keep all the people who supported us right from the very beginning than risk losing them. I think you can build it up, bit-by-bit. A good example of that is in <strong>The Flaming Lips</strong>, who had loads of albums before becoming recognised and they still have a cult following- it’s not like everyone knows <strong>The Flaming Lips</strong> but they headline major festivals and I think that’s a good way to do it.</em></p>\n<p><strong>CitR: Any plans for the foreseeable future?</strong></p>\n<p><em> B: Release an album. I think it’d be nice to change people’s perspective of us a little bit through the recorded music. We will have some jump-up, party dance tracks on the album but we’ll also have a few different tracks. Our latest single, ‘Cheating With You’, is a slight change of tact for us. Production-wise, it’s not an obvious party tune. It’s a bit grittier; it’s a bit heavier and dirtier and has this strange tempo change halfway through.</em></p>\n<p><em>C: We don’t reject our old sounds at all, but it’s always the angle we get represented, our previous swing-type stuff. To bring that to the centre-ground of where we are you have to do a whole load of stuff way out there on the other side.</em></p>\n<p><em>B: It’s a practical thing as well – I love doing the live shows, but they are physically very exhausting, and I know that my knees have a lifespan, so it would be good to maybe push out some good music and if people got into the tracks that were slightly slower and less dance-orientated, that’d give us a chance to have a bit of a break in the set</em></p>\n<p><strong>CitR: Best gig?</strong></p>\n<p><em>B: I think we’ve got different ones.</em></p>\n<p><em>C: First Secret Garden Party, on that main stage. That was a watershed moment and completely unexpected.</em></p>\n<p><em>B: We did Bestival’s main stage two years ago. It was weird to play before so many people. We were on before <strong>Mumford & Sons</strong> and there were about 20 or 25,000 people there. They weren’t there to see us by any stretch of the imagination, but it was amazing to play to that many people.</em></p>\n<p><em>C: I think we managed to catch some of the <strong>Ellie Goulding</strong> crowd.</em></p>\n<p><em>B: We had a lot of 16 year old girls. For me, playing Bestival this year. We did rather a curious slot, playing midday on the Friday, which is not really the most exciting slot in the festival, and we were thinking there’d be a thousand people at most and we can concentrate on doing the other gigs. And we were doing our soundchecks and we saw this queue building up outside the venue and when they opened it, it was like sales day at Harrods when all these rowdy girls ran in, and we played to a full house, which was very, very unexpected. And at the end of a long festival season, just what we needed.</em></p>\n<p><em>C: Looking back at it, it’s probably because there wasn’t anything else on.</em></p>\n<p><em>B: Well exactly, 10,000 people came because there was shit all else to do.</em></p>\n<p> </p>\n<p>Check out <strong>The Correspondents’ </strong>first single, ‘Cheating With You’, <a href=\"https://www.youtube.com/watch?v=m67rRZUO1do\" target=\"_blank\">here.</a> </p>\n","slug":"13070-interview-the-correspondents","category":"interviews","date":1323713284000,"wpid":13070,"isSticky":false,"featured_image":{"width":950,"height":960,"src":"2011/12/correspondents-950x960.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAABAb/xAAfEAACAQQDAQEAAAAAAAAAAAABAgMEBREhABITMUH/xAAUAQEAAAAAAAAAAAAAAAAAAAAA/8QAFBEBAAAAAAAAAAAAAAAAAAAAAP/aAAwDAQACEQMRAD8AgbdW3elt1Ua8PAa12iQF1JHp1Vjr6cA64x4pw7dfLrnWUGccfa4Yp7rGs0aSKsRZQ6ggHWxn9411HdtD7wP/2Q=="},"createdAt":1587293278063,"updatedAt":1588443776852,"author":"5e9b68b27a1236eccfeb1d16","old_image":"2011/12/correspondents-950x960.jpg","categories":["interviews","music"]}