{"id":"5e9c2c559b6559241525d62f","artists":["5e9b68d47a1236eccfeb1e63","5e9b68e07a1236eccfeb1eeb","5e9b68f27a1236eccfeb2018","5e9b68f27a1236eccfeb2028","5e9b69047a1236eccfeb2191","5e9b69317a1236eccfeb2432","5e9b69377a1236eccfeb2465","5e9b69447a1236eccfeb255c","5e9b69517a1236eccfeb2631","5e9b69517a1236eccfeb2636"],"title":"Sound of 2012 (Part I – Josh)","content":"<p>When I saw the <a href=\"https://www.</p><p>bbc.co.uk/news/entertainment-arts-16003723\" target=\"_blank\">BBC Sound of 2012</a> list, my heart sank ever so slightly. Don’t get me wrong, I see the commercial potential in almost all of the acts shortlisted, it’s more that the entirety of the list is shockingly predictable, and in some cases, bizarrely misguided. Take<strong> Frank Ocean</strong>, one of the most highly sought after acts in world hip-hop, having featured on tracks with<strong> Jay-Z</strong>, <strong>Kanye West</strong> and <strong>Tyler the Creator</strong>, as well as writing hits for <strong>Beyonce</strong>, the 24 year old is hardly a rising star. Elsewhere, <strong>Azealia Banks</strong> is another strange choice, having been kicking about for almost three years now, and little needs to be said about the inclusion of dubstep parody act <strong>Skrillex</strong>.</p>\n<p>However, all that said, I love the debate these articles bring about, and in this case, the <strong>BBC Sound of…</strong> has spawned a host of ‘alternative’ lists. Again, I’m yet to be completely enamored with any of the selections I’ve seen, with most websites choosing to pick artists they’ve spent the last twelve months salivating over, rather than attempting to predict whom they will be falling head over heels for in 2012. My selections aren’t as such acts whom I believe will break into the mainstream consciousness, more artists that I perceive may well look back upon 2012 as a vitally important year in their musical development. So without further ado, in no particular order, here’s a selection of acts I’ll be watching out for 2012.</p>\n<p><strong>Jamie Isaac</strong></p>\n<p>How <strong>Jamie Isaac</strong> hasn’t had A&R scouts hounding his every move is completely beyond me. This seventeen year old kid is one of the most talented songwriters I’ve heard in years, composing his ballads with an elegance far more mature than his age would suggest. His debut track <em>Intro / Drowning Roots</em> may well be the most emotionally open composition you’ll hear this year. Comparisons will undoubtedly be drawn to <strong>James Blake</strong>, yet <strong>Isaac</strong> conjures up more organic surroundings, with hints of <strong>Perfume Genius</strong> in the minimal piano sections and fragile vocals. Having played a few shows in London over the past couple of months, <strong>Isaac</strong> is sure to stamp his name on the local scene in 2012.<br />\n<iframe style=\"position: relative; display: block; width: 400px; height: 100px;\" src=\"https://bandcamp.com/EmbeddedPlayer/v=2/track=3844534497/size=venti/bgcol=FFFFFF/linkcol=4285BB/\" frameborder=\"0\" width=\"400\" height=\"100\"></iframe></p>\n<p><strong>Blaenavon</strong></p>\n<p>Imagine the songwriting ability of <strong>WU LYF</strong> combined with the angelic vocals of<strong> Wild Beasts</strong> with a lurking post-rock inspiration, and you begin to understand <strong>Blaenavon’s</strong> sound. It’s hard to believe that these kids are still at school, and the trio even found time to drop a host of demos a month or so back, with the seven minute epic <em>Swans</em> and the vulnerable <em>Denim Patches</em> being particular highlights. Their sound is raw yet realistic, embodying a youthful spirit so undeniable that allows each track to demand repeated listens. Having been given a glimpse of future tracks, I can safely say that<strong> Blaenavon</strong> are pretty special.<br />\n<iframe style=\"position: relative; display: block; width: 400px; height: 100px;\" src=\"https://bandcamp.com/EmbeddedPlayer/v=2/track=4270186667/size=venti/bgcol=FFFFFF/linkcol=4285BB/\" frameborder=\"0\" width=\"400\" height=\"100\"></iframe></p>\n<p><strong>Ethos Wolviis</strong></p>\n<p>These guys only have one track available so far, but wait, stay with me; it just so happens to be one of the finest tracks of this year. Also, the singularity of their musical output thus far isn’t due to lack of effort, the duo have been courageously taking part in Occupy Wall Street since September 17th, and therefore unable to have regular access to a recording studio. Anyway, their debut track <em><a href=\"https://api.crackintheroad.com/music/12188-new-ethos-wolviis-mtv/\" target=\"_blank\">MTV</a></em> completely blew me away earlier in the year, mixing the tender lo-fi aesthetics of <strong>Youth Lagoon</strong> and the songwriting capabilities akin to the likes of <strong>Wavves</strong> or <strong>Washed Out</strong>. With more material expected early in 2012, I’m extremely excited to hear what Ethos Wolviis have to offer over the coming months.</p>\n<p><iframe style=\"position: relative; display: block; width: 400px; height: 100px;\" src=\"https://bandcamp.com/EmbeddedPlayer/v=2/track=1228312602/size=venti/bgcol=FFFFFF/linkcol=4285BB/\" frameborder=\"0\" width=\"400\" height=\"100\"></iframe></p>\n<p><strong>Explicits</strong></p>\n<p>The side project of <strong>800Beloved</strong> frontman <strong>Sean Lynch</strong>, <strong>Explicits</strong> embody a majestic atmosphere so scarcely found in contemporary music. With a host of tracks available ranging from the entirely instrumental, brooding <em>RAM</em>, to the harrowingly regretful <em>US</em>, alongside a plethora of teaser videos, the hype surrounding <strong>Explicits</strong> is sure to grow. <strong>Lynch’s</strong> remorse filled vocals are lightly comparable to <strong>Matt Berninger</strong>, whilst the simplistic yet effective percussion sections are entirely unique. With full length release <em><strong>The Uncanny Valley</strong></em> out in 2012, I’m expecting great things from <strong>Explicits</strong>.</p>\n<p><iframe style=\"position: relative; display: block; width: 400px; height: 100px;\" src=\"https://bandcamp.com/EmbeddedPlayer/v=2/track=996118619/size=venti/bgcol=FFFFFF/linkcol=4285BB/\" frameborder=\"0\" width=\"400\" height=\"100\"></iframe></p>\n<p><strong>PHOSPHOR</strong></p>\n<p>Electro-gaze outfit <strong>PHOSPHOR</strong> have all the making of a hype band already; hailing from London, with a handful of starry-eyed, trance inspired tracks under their belts and (from what I’ve heard is) a stunning live show, it’s seems only a matter of time before their music is exposed to larger audiences. From only a couple of listens, <strong>The XX</strong> influence is strikingly prominent but not overpowering, with tinges of <strong>My Bloody Valentine</strong> shining through on the shoegaze driven <em>Blossom</em>. With new track <em>Numb</em> released at the tail end of last week, <strong>PHOSPHOR</strong> are highly unlikely to stay under the radar much longer.</p>\n<p><iframe style=\"position: relative; display: block; width: 400px; height: 100px;\" src=\"https://bandcamp.com/EmbeddedPlayer/v=2/track=2648905849/size=venti/bgcol=FFFFFF/linkcol=4285BB/\" frameborder=\"0\" width=\"400\" height=\"100\"></iframe></p>\n<p><strong>The Sayitaints</strong></p>\n<p>Another act with only one song available so far, Baltimore duo <strong>The Sayitaints</strong> debut track <em>Flutter</em> is one of the most majestic compositions you’ll hear this year. Grounded by indie-pop influences such as <strong>The Antlers</strong>, <em>Flutter</em> exposes it’s soulful tendencies ever-so gracefully, before the track culminates with the strained vocals yearning ‘<em>I’ll kiss your salt lips </em><br />\n<em> and stomach. it will grow.</em>‘ Again, I know little about <strong>The Sayitaints</strong>, but hopefully in 2012 more will be revealed.</p>\n<p><iframe style=\"position: relative; display: block; width: 400px; height: 100px;\" src=\"https://bandcamp.com/EmbeddedPlayer/v=2/track=293221556/size=venti/bgcol=FFFFFF/linkcol=4285BB/\" frameborder=\"0\" width=\"400\" height=\"100\"></iframe></p>\n<p><strong>The Soft</strong></p>\n<p>It came as no surprise when Suffolk trio The Soft ran out of free downloads of their debut EP Hot Summer. Receiving rave reviews from numerous blogs, their intriguing Baths meets Balam Acab sound, aided by comforting, smooth vocals, the likes of Venus Breath and Orphius displayed a songwriting maturity far beyond their modest years.</p>\n<p><iframe style=\"position: relative; display: block; width: 400px; height: 100px;\" src=\"https://bandcamp.com/EmbeddedPlayer/v=2/track=3966780600/size=venti/bgcol=FFFFFF/linkcol=4285BB/\" frameborder=\"0\" width=\"400\" height=\"100\"></iframe></p>\n<p><strong>Pushing Hands</strong></p>\n<p>With their debut track and video <em>He’s Still Here</em>, London’s <strong>Pushing Hands</strong> clearly spent a colossal amount of time ensuring that everything was exactly how they wanted it to be. Brooding, melancholic yet still relatable, they followed up said track with <em>Frames</em>, a folk inspired number, that again deserves far more coverage than it’s garnered so far. Having built a solid foundation in 2011, I’m sure that the next twelve months will see the five piece growing their fanbase and expanding their sound.</p>\n<p><iframe src=\"https://player.vimeo.com/video/23765288?title=0&byline=0&portrait=0\" frameborder=\"0\" width=\"400\" height=\"225\"></iframe></p>\n<p><a href=\"https://vimeo.com/23765288\">Pushing Hands – He’s Still Here</a> from <a href=\"https://vimeo.com/mritson\">Matt Ritson</a> on <a href=\"https://vimeo.com\">Vimeo</a>.</p>\n<p><strong>Chelsea Burgin</strong></p>\n<p>In a year when <strong>Lana Del Rey</strong> and her surgically enhanced lips have taken the internet by storm, you’d be forgiven for starting to lose faith in au naturel female songwriters. Well fear not, as <strong>Chelsea Burgin</strong> is set to rebuke any concerns brought about by <strong>Lizzy Grant</strong>, with her unique brand of tantalizing, sensual electro-folk, aided by her stunning voice. Having been tracking her progress for a few months now, her newest track <em>Fall Weather</em> summarizes all that’s great about Miss <strong>Burgin</strong>, with it’s true-to-it’s-roots Feist-esque nature and darling lyricism. And not that it should make any difference, but <strong>Chelsea</strong> is pretty adorable as well.</p>\n<p><object width=\"100%\" height=\"81\" classid=\"clsid:d27cdb6e-ae6d-11cf-96b8-444553540000\" codebase=\"https://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=6,0,40,0\"><param name=\"allowscriptaccess\" value=\"always\" /><param name=\"src\" value=\"https://player.soundcloud.com/player.swf?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F26567514\" /><embed width=\"100%\" height=\"81\" type=\"application/x-shockwave-flash\" src=\"https://player.soundcloud.com/player.swf?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F26567514\" allowscriptaccess=\"always\" /></object> <span><a href=\"https://soundcloud.com/chelseaburgin/fall-weather\">Fall Weather</a> by <a href=\"https://soundcloud.com/chelseaburgin\">chelsea burgin</a></span></p>\n<p><strong>South Of France</strong></p>\n<p>Colardo duo <strong>South of France</strong> create the most lively, danceable indie-pop around, and their debut three track release showcased exactly that. Comprised of <strong>Jeff Cormack</strong> and <strong>Emily Ashley, </strong>there’s a wonderful chemistry within their music that so few bands manage to translate to their records. Of the tracks from their EP, <em>Kings</em> stands out, with it’s infectious chorus and fantastic male/female split vocals. With a debut LP in the works, and expected out at the beginning of next year; <strong>South Of France</strong> deserve to be heard.</p>\n<p><iframe style=\"position: relative; display: block; width: 400px; height: 100px;\" src=\"https://bandcamp.com/EmbeddedPlayer/v=2/track=1903417148/size=venti/bgcol=FFFFFF/linkcol=4285BB/\" frameborder=\"0\" width=\"400\" height=\"100\"></iframe></p>\n","slug":"13083-sound-of-2012-part-i-josh","category":"music","date":1323806926000,"wpid":13083,"isSticky":false,"featured_image":null,"createdAt":1587293269268,"updatedAt":1588441785081,"author":"5e9b68b27a1236eccfeb1d27","old_image":"generated/66e317991af05d278632bba17be2ecba78738c85.jpg","categories":["music"]}