{"id":"5e9c33df9b6559241525e120","title":"Review: The National – High Violet","content":"<img class=\"alignnone\" title=\"The National\" src=\"https://www.</p><p>shoegaze.pl/uploads/2009/07/national.jpg\" alt=\"\" width=\"500\" height=\"333\" />\n<p>Several million album sales worldwide, appearances on <strong>Letterman</strong>, <strong>Jools Holland </strong>and <strong>Jimmy Fallon</strong>,numerous nominations for the defining album of the decade, and still<strong> The National</strong> are overlooked by many. Now, it seems that with their fifth album <em>High Viole</em>t they are finally being considered a force to be reckoned with, and it’s about time. So for them to be able to emulate the critical success of 2007<em>s Boxer</em> seemed nigh on impossible, let alone to create a record which wasn’t just a self indulgent carbon copy.</p>\n<p>For a band so eager to impress,<em> High Violet</em> begins slowly, <strong>Terrible Love</strong>, the track they debuted on <strong>Jimmy Fallon</strong> way back in early March, is a rusty and unaccomplished start, far from showing the vast potential emanated when they performed it live. The song plods along, and leaves the listener caught between urging the track to finish or wishing for an injection of pace and excitement, hugely underwhelming especially when paralleled <em>Fake Empire</em><strong>, </strong>the brilliant opener from <em>Boxer</em>. It’s not until <em>Afraid Of Everyone</em> that <strong>The National</strong> pick up the metaphorical baton and run with it, showcasing some of the all encompassing emotion portrayed on their previous albums, intricate moanful lyrics and an anthemic chorus summarise many of the qualities which had garnered so much positive interest.<strong> Matt Berninger</strong> wallows in a depreciating self pity, almost weeping, “<em>I don’t have the drugs to sort it out</em>“, whilst swirling guitars implode and cascade around him.</p>\n<p>Next up is lead single<strong> Bloodbuzz Ohio</strong>, released as a free download back in March, and they return to the winning formula which made them such a thrilling prospect back in 2005 on career highlight third album <em>Alligator</em>. “<em>Lean my head on the foot of your car, I take it too far</em>” drawls <strong>Berninger</strong>, as he laments the current financial situation, admitting “<em>I still owe money, to the money I owe</em>“, a fittingly stark and telling lyric for these dark and constricting times. Thankfully, from here, <em>High Viole</em>t rarely lets up, keeping the listener trapped in an emotional vice, squeezing every ounce of pity from the well-formed and expertly constructed songs.</p>\n<p>Whilst at times there are hints of imitating fellow American counterparts <strong>Interpol</strong>, there is a superior melodic value sustained throughout the record, finely displayed on the piano led<em> England</em>, a heart wrenching ballad, echoing the beauty of the more refined tracks from <em>Boxer</em>. However be warned, this is not an album for the lighthearted, <em>Berninger</em> spends a vast majority of time mourning his emotional pitfalls and putting across his frank and often bleak esoteric views on the world.</p>\n<p>There will undoubtably be sectors of <strong>The National’s </strong>fan base who feel somewhat let down by <em>High Violet</em>, which to be quite honest, offers nothing which hasn’t already been experienced on previous musical travels with the band. What this album will do however is rejuvenate the interest in the Brooklyn band, gaining them numerous new fans, who had ignored or passed over their two excellent earlier albums. Albeit,<em> High Violet</em> is as good a starting point as any for newcomers to <strong>The National</strong>, but bar a few hidden gems, doesn’t really instil anything not already encountered on their earlier records.</p>\n<p style=\"text-align: center;\"><a href=\"https://www.myspace.com/thenational\">Check Out Their Myspace</a></p>\n<p style=\"text-align: center;\"><a href=\"https://www.americanmary.com/\">Check Out Their Official Site</a></p>\n","slug":"1322-review-the-national-high-violet","category":"music","date":1276420555000,"wpid":1322,"isSticky":false,"featured_image":{"width":500,"height":333,"src":"2011/06/national.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAUG/8QAIRAAAQMEAQUAAAAAAAAAAAAAAgEDEQAEBhJBBRMiMUL/xAAVAQEBAAAAAAAAAAAAAAAAAAACA//EABsRAAEEAwAAAAAAAAAAAAAAAAEAAgMEESEx/9oADAMBAAIRAxEAPwDKPZijFw2loJOWe4NE/rAhssp4rBKusccL7qseRY+BkD3WXu6KwcW5RPPzSlFsbeYVzYkGwV//2Q=="},"createdAt":1587295199774,"updatedAt":1588403566704,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/06/national.jpg","categories":["music","reviews"]}