{"id":"5e9c33df9b6559241525e11d","title":"Rave In a Cave","content":"<p style=\"text-align: center\">\n<p>It would take a feat of lexical wizardry to concise the implications that <strong>‘Rave in a Cave’</strong> had on youth culture in Newcastle on the 5th of June.</p><p> This event did nothing if not demolish the media’s hackneyed perspective of all teenagers being lager loving, knife flicking, sexual tyrants.</p>\n<p>Five hundred teenagers and young adults at an illegal rave in the middle of a park in Newcastle at midnight; sharpen those pencils ye Daily Mail scribes. The events that unfolded were refreshing, and more vitally, vindicating for our peppered generation. It started with an enormous trek into the belly of this particular beast, the Jesmond Deane’s cave. Upon arrival there was a scene to assault the senses. Ironically, a tranquil tunnel littered with tiny candles, which looked as if it paved the way toward a Hindu shrine, serenely mapped the route toward the thumping sound system. The crowd was varied with (and before you suggest as much, this is not an obsession) ‘Rah’s’, ‘Scene kids’, general music lovers and the occasional ‘Charv’. Oddly enough, a great deal of the people making up this broad-based crowd were suspiciously sober, (us included).</p>\n<p>The DJ’s were of a high pedigree; with a personal favourite being a house remix of <strong>Gabriella Cilmi’s</strong> pop hit <em>‘Sweet about me’</em>. The music played was generally house beats with a modicum of Dub-step thrown in for good measure. Everybody danced long in to the night trying to stifle the beaming grins breaking onto their tee-total faces. No honestly. There was not an iota of trouble or even a glance of malice.</p>\n<p>Broken Britain? I beg to differ Mr Blair. It’s the music, and events such as these that are putting Blighty back together again.</p>\n","slug":"1324-rave-in-a-cave","category":"life","date":1276437803000,"wpid":1324,"isSticky":false,"featured_image":{"width":620,"height":348,"src":"2010/06/raveinacave.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAGAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAUH/8QAHxAAAQMEAwEAAAAAAAAAAAAAAQMEEQAFEiECBjFx/8QAFQEBAQAAAAAAAAAAAAAAAAAAAQP/xAAWEQEBAQAAAAAAAAAAAAAAAAABACH/2gAMAwEAAhEDEQA/AMN6Fcrbb3Ky7i1l7gmQE1FY4kxG9THyKguVEy5VxatwMzAA83SlSDWVv//Z"},"createdAt":1587295199149,"updatedAt":1588403566678,"author":"5e9b68b27a1236eccfeb1d42","old_image":"2010/06/raveinacave.jpg","categories":["life"]}