{"id":"5e9c2bfb9b6559241525d5e8","artists":["5e9b693e7a1236eccfeb24f6"],"title":"EP Review: Seams – Colours and Maps","content":"<p><a href=\"https://admin.</p><p>crackintheroad.com/music/13389-ep-review-seams-colours-and-maps/attachment/401335_296095430431723_141176365923631_809169_1922512981_n/\" rel=\"attachment wp-att-13390\"><img class=\"alignnone size-full wp-image-13390\" title=\"401335_296095430431723_141176365923631_809169_1922512981_n\" src=\"https://api.crackintheroad.com/uploads/2011/12/401335_296095430431723_141176365923631_809169_1922512981_n.jpg\" alt=\"\" width=\"453\" height=\"640\" srcset=\"https://api.crackintheroad.com/images/2011/12/401335_296095430431723_141176365923631_809169_1922512981_n.jpg 453w, https://api.crackintheroad.com/images/2011/12/401335_296095430431723_141176365923631_809169_1922512981_n-260x367.jpg 260w, https://api.crackintheroad.com/images/2011/12/401335_296095430431723_141176365923631_809169_1922512981_n-165x233.jpg 165w\" sizes=\"(max-width: 453px) 100vw, 453px\" /></a></p>\n<p>You should probably get familiar with <strong>Seams</strong> now, as if there’s any justice, these kids will be a household name in the indie scene within twelve months. The band are a 5-piece consisting of vocals, primarily from Katie Lynch, backing vocals and guitar from Michael Fitzpatrick, guitar from Mark Johnston, bass from Liam Thompson and finally drums from Davi De Paula. Most of the band are still in school which emphasises how talented these individuals are and humbles people like myself who had not tried anything long enough to become good at it. When I see this band perform I instantly regret not picking up a guitar, drumsticks or a keyboard during my younger years.</p>\n<p>They hail from the same area in Scotland as I reside which means I get to see this band at every possible opportunity and their live performances are spectacular, and I’ve been lucky enough to watch this band grow and thrive for over a year now so it is shame their EP launch is on the 27<sup>th</sup> December when I am in Orkney. Luckily however, I have been given a copy of the EP early and couldn’t wait until its release to write an article about it.</p>\n<p>The first song on the EP is called <em>The Colour Purple </em>and it opens quite mysteriously; a patter of guitar and not much else, providing an excellent platform for the vocals that kick in. Then more layers are added throughout the song, providing depth through both guitars, bass and drums which then take centre stage alongside the vocals until the end of the track.</p>\n<p> </p>\n<p>The stand-out track on the EP however is the second, named <em>Watch Me Out</em>, and this is primarily because it uses all of the elements that make this band great: upbeat and jumpy guitar riffs, tight and subtle bass and using drums to complement everything that is going on around instead of overpowering it. However, the band know that perhaps one of their best selling points is the impeccable vocals of Katie, who sounds as though she has been singing for decades, whilst actually being only in her teens.</p>\n<p>The third track is beautifully simple, showing a more sensitive and pure side to their music. An acoustic song named <em>Fall Over </em>which nestles very well in between the more deep and complicated second and final songs.</p>\n<p>The final song on the EP, <em>Maps</em>, opens very simply and delicately, and follows the same pattern as the opening track by adding in more detail as the song progresses, but goes one further by including the vocals of Michael which I believe is a good touch. The track then descends into an instrumental which is crafted magnificently and taps into the talent of all the musicians to create something I would expect to see headlining shows around the UK.</p>\n<p>Of course to really appreciate what I am trying to put across you should go to the band’s facebook page linked below, take a listen to the tracks they have up and judge for yourself.</p>\n<p><a href=\"https://www.facebook.com/seamsdundee\" target=\"_blank\">Facebook.</a>Poster Artist: TBC. </p>\n","slug":"13389-ep-review-seams-colours-and-maps","category":"album-reviews","date":1324930347000,"wpid":13389,"isSticky":false,"featured_image":{"width":453,"height":640,"src":"2011/12/401335_296095430431723_141176365923631_809169_1922512981_n.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAOAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAAAwb/xAAjEAACAQMDBAMAAAAAAAAAAAABAgMEBREABiESIjFBUWFx/8QAFQEBAQAAAAAAAAAAAAAAAAAAAgT/xAAZEQADAAMAAAAAAAAAAAAAAAAAAQIDESH/2gAMAwEAAhEDEQA/ALXaMdoO0JDXJRMrKTUCZOpuT28+RxjGPeoI2mpyemBAvoMMkD709sv70u2rvTLJIomWPtCKQcnDZJORx8DRJPXsoZK+QKRkAoCQP3UmOalt7HTXD//Z"},"createdAt":1587293179952,"updatedAt":1588403543578,"author":"5e9b68b27a1236eccfeb1d07","old_image":"2011/12/401335_296095430431723_141176365923631_809169_1922512981_n.jpg","categories":["album-reviews","introducing","music","reviews"]}