{"id":"5e9c2bde9b6559241525d5ca","artists":["5e9b691e7a1236eccfeb2318"],"title":"News: Michael Kiwanuka winner of the BBC Sound of 2012","content":"<p><strong>The winner of the BBC sound of 2012 poll of music critics, broadcasters & bloggers has been announced as British soul musician Michael Kiwanuka.</p><p><br />\n</strong></p>\n<p>Compared to Bill Withers, Van Morrison and the Temptations, Kiwanuka’s brand of retro soul, RnB & folk was inspired from a most unlikely discovery. A rare recording of Otis Redding’s <a title=\"Otis Redding - Sitting On The Dock of the Bay [YOUTUBE]\" href=\"https://www.youtube.com/watch?v=UCmUhYSr-e4\" target=\"_blank\">Sitting On The Dock of the Bay</a> stuck to the front of a magazine tribute to Bob Dylan.</p>\n<p>“I love that sound,” Kiwanuka told the <a title=\"Michael Kiwanuka BBC Interview - 6th Jan\" href=\"https://www.bbc.co.uk/news/entertainment-arts-16266507\">BBC</a> earlier today “The singers I listen to are quite old-school and I think that era is really cool. The way the chords sounded, and the feeling of the playing is very loose. There’s a jazz feel compared to a lot of modern music, which is very straight.”</p>\n<p>The 24 year old North Londoner came out tops in the <a title=\"BBC Sound of 2012 award\" href=\"https://www.bbc.co.uk/music/soundof/2012/\">BBC Sound of 2012</a> poll ahead of Singer-songwriter Frank Ocean, Rapper Azealia Banks, producer DJ Skrillex and Swedish electro-duo Niki and The Dove.</p>\n<p>Michael Kiwanuka will be playing a number of intimate gigs across the UK & Ireland over the next few months.His new EP ‘Home Again’ is officially released on <a title=\"Polydor Records\" href=\"https://www.polydor.co.uk/\" target=\"_blank\">Polydor Records</a> on the 26th March 2012 following his debut ‘I’m Getting Ready’ released last year on <a title=\"I'm Getting Ready Michael Kiwanuka\" href=\"https://www.interscope.com/\">Interscope</a>. For tour dates and to check out his new single visit Michael’s official site: <a href=\"https://michaelkiwanuka.com/\">https://michaelkiwanuka.com/</a></p>\n","slug":"13552-winner-bbc-sound-2012-michael-kiwanuka","category":"news","date":1325836439000,"wpid":13552,"isSticky":false,"featured_image":null,"createdAt":1587293150411,"updatedAt":1588441784567,"author":"5e9b68b27a1236eccfeb1d40","old_image":"generated/66174fb1c85e46cb754cca858620c5a62a822332.jpg","categories":["news"]}