{"id":"5e9c33da9b6559241525e114","title":"Review: Parklife Festival (+ James Yuill Interview)","content":"<p>Celebrating 100 years of Platt Fields Park, and the fantastic culmination of Manchester’s many dance promoters and producers, <strong>Parklife Festival </strong>provided the perfect start for the summer festival season.</p><p> The festival benefited from the good fortune of glorious weather, making the seemingly never-ending queues bearable, which also provided the odd bit of amusement when drunk lads attempted to vault several metal barriers.</p>\n<p>The festival itself was set out in a typical fashion, with a main stage centre piece surrounded by several other music tents. However the mood created by thousands of fans made this festival something special, with everyone concentrated simply on enjoying a summers day bursting with fantastic electronic and dance artists. This mutual aim could be felt in strength in the <strong>Now Wave </strong>Tent when <strong>The Errors </strong>took to the stage and performed a fantastic, if somewhat subdued, set. <strong>Simian Mobile Disco </strong>and <strong>Booka Shade</strong> also impressed and were rightfully received well by fans, who like myself had many difficult decisions to make on a day full of set time clashes! However it came down to <strong>Vitalic </strong>and <strong>Fake Blood</strong> to shift <strong>Parklife </strong>from an enjoyable festival to a fantastic festival. <strong>Vitalic </strong>performed an astounding set, including the mesmerizing light show that was his ‘V-Mirror’, which excited a crowd already buzzed from the pulsating drops <strong>Vitalic </strong>mixed expertly. Hot and exhausted, my spirit was only lifted by the emergence of <strong>Fake Blood </strong>who produced one of the finest and most energetic dance sets I have ever been lucky enough to witness. With the crowd demanding for more once 11pm sadly came around, there was a tense stand off between audience, <strong>Fake Blood</strong>, and festival staff, the former two eagerly wanting ‘one more tune’, however this was not to be and thousands of fans went their separate ways into the vibrant scenes of Manchester.</p>\n<p><strong>Crack in the Road </strong>were also lucky enough to catch up with <strong>James Yuill</strong>. Having already interviewed James, we here at <strong>Crack in the Road </strong>were interested in finding out what James had been up to in the run up to the release of his sophomore album, ‘<strong>Movement in a Storm’</strong>. Meeting him backstage, James immediately began to comb over his set and pick out problems with sound that he would’ve liked to have done differently. However this perfectionism would have been wasted on most of the crowd who enjoyed a thoroughly enthused and exuberant set, with James’ new single ‘<strong>On Your Own</strong>‘ receiving a particularly warm response from the crowd. Discussing the production of his new album, James discussed how he ‘considered and developed melodies first’ and ‘fitted lyrics around them’. However despite James’ obvious preference of producing heavier, more electronic tracks, he told me that the tracks chosen for the new album were lighter and focused on lyrics. While this seems somewhat of a contradiction, I could not help but feel this was James’ perfectionism shining through again and he was simply trying to understate his album. From what has been released from the album so far, it appears James has managed to strike a fine balance between his electronic and singer/songwriter influences, creating an album that will certainly be well received by fans and critics alike.</p>\n<p><a href=\"https://www.myspace.com/jamesyuill\" target=\"_blank\">James Yuill Myspace</a></p>\n<p><a href=\"https://api.crackintheroad.com/uncategorized/541-5-minutes-with-james-yuill-2\" target=\"_blank\">James Yuill Interview</a></p>\n<p><iframe src=\"https://www.facebook.com/plugins/likebox.php?id=114090381951328&width=292&connections=10&stream=false&header=false&height=255\" scrolling=\"no\" frameborder=\"0\" style=\"border:none; overflow:hidden; width:292px; height:255px;\" allowTransparency=\"true\"></iframe></p>\n","slug":"1361-review-parklife-festival-james-yuill-interview","category":"festivals","date":1276461254000,"wpid":1361,"isSticky":false,"featured_image":{"width":596,"height":883,"src":"2010/06/parklife-festival.png","placeholder":"data:image/jpeg;base64, iVBORw0KGgoAAAANSUhEUgAAAAoAAAAPCAYAAADd/14OAAAACXBIWXMAAAsTAAALEwEAmpwYAAABsklEQVR4nCWSX2/aMBTF/aXX123fYttb1VG2x4pBp9JJlEmlLIG2SaaEhhDyP8QQEiCQQeBMvvjFsn39O+cem2VZBs91EQYBVqsV0kWK5TLFZrOB7/uIoghFUYAZuo6xacLzPNRrNbTv7uBMp7htNmn+1b5Ht/MA9tDp4L7dxsvLM758+oyry0sEQYCP7z9gNpvhe/0baldfwQRa0ARVEDjnCIIQF+8uEIYh+k89PPV6Z2l7MqFNUZhwTuvbZguGbqB+fY0fjQbY83AIXddxPB4xtW0MBwPEUUQXGzc3sMZjiMGU11f0Hh+xynO4rgtZkuA6DuI4pv1lmuKw34PJsgzDMLAtthiNRrBtG6fTCYvFAoqioCxL7EWhQMdxRIdJkpDk4XCgQ845tkVxljbf3ihsUSg8/my1oKkqRSSiG8gy2WCqosKyLPAkofl3twtxWdA0VcO/siR5JkkSTNMkvCAKn9kyQ5qmlECe56iq6tx14Ps4VhUcxyEpZ+pgPp/jr6bR+1MztjVBGIREnFgW/vT78D2fPKqqijnnWK/XYKJANCLGOUeZZIUv8XuyPMdut8N/XCIbApzr6JUAAAAASUVORK5CYII="},"createdAt":1587295194246,"updatedAt":1588403566599,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2010/06/parklife-festival.png","categories":["festivals","interviews","music"]}