{"id":"5e9c33cd9b6559241525e0fc","title":"Film Review: Toy Story 3","content":"<p>So its 15 years since John Lasseter’s classic hit the silver screen and changed everything.</p><p> Animated pictures became an art form in their own right, the power of computer generated images shocked the world and the very idea of a ‘kid’s film’ was torn apart and rewritten. The true modern family film was reborn; a film that excited and enthralled every age bracket to an equal extent. So with <strong>Toy Story 3</strong> only just around the corner for UK film fans the stakes are high, will the film fail to live up to the first two’s brilliance or elevate itself beyond its predecessors; thankfully the answer is the latter.</p>\n<p>The film picks up 5 years from where the second one left off; Andy (John Morris) is off to collage, Molly is slowly but surely growing up and most importantly the toys that inhabit Andy’s bedroom are coming close to becoming obsolete. When the toys are accidentally donated to the Sunnyside Daycare centre they’re at first overjoyed by their new surroundings, complete with new toys and the chance to be played with everyday. The joy however becomes short lived at the toys discover the true nature of their new home and the perverse regime that controls it, established by the devilishly wonderful “Lotso” Bear (Ned Beatty). So of course the toys must unite for one last struggle to return home to their beloved Andy.</p>\n<p>The first thing of notice is the film’s tone; notably melancholic throughout,  it still manages never gets in the way of the fun; Lee Unkrich daring notion to add a serious element to the film is striking in its implementation. The picture explores the ideas of friendship, loneliness, growth and being forgotten in remarkably mature ways. Woody’s sorrow is expressed through subtle uses of animation, Rex’s (Wallace Shawn) hilarious lines “should we be hysterical?” are given a degree of seriousness and the very fact that we’re shown the toy’s moment of purgatory is a daring move from Pixar. Lotso’s back story is perhaps the best example of the series new direction, it’s both heart breaking and scary; Pixar have a created a perfect villain.</p>\n<p>Despite the film’s awareness that this is their final curtain call, at its element <strong>Toy Story 3</strong> is still a fun family film. The ‘bromance’ between Buzz (Tim Allen) and Woody (Tom Hanks) is developed perfectly and the introduction of Ken and Barbie is comedy perfection, his repeated insistence that he’s “not just a girl’s toy” is a particular highlight. The film’s opening is also worthy of note, the overblown and action-packed first 5 minutes reminds us of the very point of a toy, to unlock ones imagination. Despite this, as the final film in the trilogy, the picture always has one eye on the tear; as soon as the opening sequence finishes we cut to Andy as a small child and Randy Newman’s goofy tones, reminding us gently that these days are gone. Again though, the balance between the laugh and the tear is controlled perfectly, for every heartbreaking moment Mr. Potato will loose his body forcing him to use a floppy pancake, to balance the tone.</p>\n<p>In short <strong>Toy Story 3</strong> is family perfection; it manages to balance the serious and more comedic elements of the film perfectly, and without going into too much detail the final moments of <strong>Toy Story 3</strong> are quite wonderful; you will cry. But perhaps the most charming and indeed admirable idea the film presents is the importance of the very toys them selves, as Andy poignantly puts it “thanks guys”.</p>\n","slug":"1379-review-toy-story-3","category":"arts","date":1277048680000,"wpid":1379,"isSticky":false,"featured_image":{"width":680,"height":381,"src":"2010/06/toy_story_3_cast.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAGAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAAAAb/xAAfEAACAAYDAQAAAAAAAAAAAAABAgADBAURIQYSE/D/xAAUAQEAAAAAAAAAAAAAAAAAAAAG/8QAGhEAAgMBAQAAAAAAAAAAAAAAAQIAAxESIf/aAAwDAQACEQMRAD8AjOPPT0VTTktUe0kdFZNdc61v7Ji/S9WFkUzLGzORlj7nZhCD94HW5EdChl9n/9k="},"createdAt":1587295181747,"updatedAt":1588403566391,"author":"5e9b68b27a1236eccfeb1d24","old_image":"2010/06/toy_story_3_cast.jpg","categories":["arts"]}