{"id":"5e9c2ba39b6559241525d599","artists":["5e9b692b7a1236eccfeb23c3"],"title":"Review: of Montreal – Paralytic Stalks","content":"<p>Sparkling, feather-clad all-out geniuses of Montreal have returned to our ears and hearts with their eleventh full-length album, <em>Paralytic Stalks</em>.</p><p> After the band’s two previous offerings, which marked something of a departure from the accessible pop sound of <em>Hissing Fauna, Are You the Destroyer?</em>, this new record brings together the old and the new, and fuses together of Montreal’s earlier sounds with their forays into more experimental realms.</p>\n<p>Opener <em>Gelid Ascent</em> is dark and thrashing, laden with effects and heavier than the band’s usual sound.  Unlike earlier of Montreal albums which have often revolved around one set concept or story, Paralytic Stalks is varied and touches on a wide range of themes and musical styles, thus rendering it accessible to both new and existing fans.</p>\n<p>One of the albums strongest, most infectious songs is ‘Spiteful Intervention’, which utilises the band’s tried and tested technique of setting heartbreaking lyrics to an upbeat, verging-on jaunty melody. The results are consistently stunning, and Barnes’ intricate lyrics are made all the more powerful by equally intricate arrangements.</p>\n<p>The songs touch on many themes which will be familiar to fans of Barnes’ songwriting, such as strange and unhealthy relationships, love, hatred, emotional illness and wellness. ‘Wintered Debts’, the first teaser song from the album to be released for download by the band is a seven-minute epic poem, weaving a sad tale of heartbreak, spite and mental turmoil. “Tried to call you from a bathroom in Sao Paulo / But I was too drunk to formulate any  sort of earthly language / So much bitterness“.</p>\n<p><object height=\"81\" width=\"100%\"><param name=\"movie\" value=\"https://player.soundcloud.com/player.swf?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F28000691\"></param><param name=\"allowscriptaccess\" value=\"always\"></param><embed allowscriptaccess=\"always\" height=\"81\" src=\"https://player.soundcloud.com/player.swf?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F28000691\" type=\"application/x-shockwave-flash\" width=\"100%\"></embed></object>  <span><a href=\"https://soundcloud.com/of-montreal/of-montreal-wintered-debts\">Wintered Debts</a> by <a href=\"https://soundcloud.com/of-montreal\">of Montreal</a></span> </p>\n<p><em>Paralytic Stalks</em> extends its colourful tentacles into more experimental territory during ‘Exorcismic Breeding Knife’, which consists of seven minutes of psychedelic noise and effects, woven together with orchestral samples, and is both brilliant and unsettling. This track is reminiscent of Barnes’ link to the secretive Major Organ and the Adding Machine project in 2001, a group made up of members of the Elephant 6 collective (and rumoured to also include Jeff Mangum of Neutral Milk Hotel.)</p>\n<p>The lead single to be taken from the album is ‘Dour Percentage’, a catchy, uplifting ballad and crowd-pleaser which features, among other things, a jazz flute solo.</p>\n<p>If anyone were to suggest that of Montreal’s form has taken a dip since the days of <em>Hissing Fauna</em>, then the brilliant <em>Paralytic Stalks</em> will soon prove them to be very, very wrong.</p>\n","slug":"13863-review-of-montreal-paralytic-stalks","category":"album-reviews","date":1326630597000,"wpid":13863,"isSticky":false,"featured_image":null,"createdAt":1587293091409,"updatedAt":1588441783876,"author":"5e9b68b27a1236eccfeb1d30","old_image":"generated/97a9515a0c78b16c75bd62e4028cc6400811fb82.jpg","categories":["album-reviews","music"]}