{"id":"5e9c2b929b6559241525d584","title":"Feature: The Rebirth of the Recycled Space","content":"<p><strong>An exploration into the world of recycled spaces, that seem to have spawned from the past eras of squatting, Hamish Wirgman finds the places and the past.</p><p></strong></p>\n<p>One brisk mid December evening I find myself in an odd but pleasantly surprising venue. The low hum of chitchat reverberates round the rough brown walls, a small group of tables huddles by the front door, full to the brim with people, sits close to a black sticky bar near a back door close enough to hear the drone of distant music. We chat over hot cups of whisky and lemon, the steam enveloping my eyes from time to time. We make our way out of the back door with its makeshift weighted pulley system to keep it shut, past gutters filled with grass and a sprig of holly. We walk onto a dry wood paneled floor and the smell of pines greets my senses as we enter a decked area surrounded by trees, and a large glowing sign tells me I am in the new creations of Frank Boxers Peckham Hotel.</p>\n<p>It seems that after the ban on squatting, there is a response to this in the emergence of recycled spaces that appear to keep popping up all over the place. Peckham Hotel is one of the most recent, created by Frank Boxer, the man behind the infamous summer pop-up roof top café bar Franks, which makes its home on top of a disused car park opposite Peckham Rye station. Peckham Hotel will be open for approximately 3 months and is situated in an old disused hotel on Copeland Road, which the owner has let him use for the pop-up before it is knocked down. The bar is surrounded by a couple of galleries, one of which houses Lucky Pdfs, Yuri Pattison’s recent works. While in a conversation at the venue, my friends said, “ It feels like a squat, but its legal.” Later we asked how Frank managed it and he replied, “I have an inspector coming round tomorrow.”</p>\n<p><a href=\"https://api.crackintheroad.com/life/13930-feature-the-rebirth-of-the-recycled-space/attachment/squat-cafe/\" rel=\"attachment wp-att-13932\"><img class=\"alignnone size-homepage wp-image-13932\" title=\"Squat-cafe\" src=\"https://admin.crackintheroad.com/uploads/2012/01/Squat-cafe-660x495.jpg\" alt=\"\" width=\"568\" height=\"439\" /></a></p>\n<p><strong><em>The Deptford Project</em></strong></p>\n<p>Frank Boxer isn’t the only one who has taken the aesthetic to heart. A project called the Deptford Project, in Deptford of course, uses an old tube train as a café. Inside, the décor is made up from chairs covered with witty, sitting related sayings, chandeliers made from electrical tubing, a glass fronted display showing salads, sandwich fillers and the open kitchen beyond. The food is all sourced locally, and the whole place is decked out by local artists, so it’s very responsibly sourced.  As well as being a great destination to go and eat and relax, the Deptford project is as the name suggests: a project which is focused on building on the community, running workshops and supporting local projects. In the past they have had pieces of live art made in their garden, such as the Silent Cinema and an outdoor pop-up cinema where you wear head phones to watch the movies. Most recently they held a Christmas market, which again sold local produce.</p>\n<p>Outside of South London there are similar, if not more secretive projects. One of these is in Bethnal Green, on the fifth floor of an old office block, in an underground club-like set up. The friend who informed me of it said it has no name, she has asked for the dj and herself to remain anonymous and the address of the place anonymous aswell, which admittedly adds to the venue in a secretive way. To enter the venue you take a lift to the floor: “ Going up in the lift built so much suspense”, one girl said. As you arrive you’re greeted with a room decked out with odd chintz armchairs in a bare brick room and a sort of bar with no pumps. Just two Portuguese men who only accept tokens you bought from a stall and only serve spirits or Redstripe.  My friend was on the door for a night of Minimal House, which she’s found out about through a DJ friend of hers. She described the venue as having a whole wall of fairy lights, with only strobes for alternative lighting and a low ceiling reverberating the house feel. The toilets seemed to even be an experience in itself, “To get the toilets you had to step into a wardrobe on one of the walls into a toilet only lit by a singular red bulb in the center, with a basin large enough to sit in,”. A truly underground DIY feel to the place again taking on the squat feel in its own way. What makes it seem even more underground is its lack of nights, having only one every month, as well as its only promotion being word of mouth and banning any sort of promotion in articles such as this.</p>\n<p>It is not just London that has been bitten by the bug of recycled spaces. Oxford has recently had several recycled pop-up spaces, one of which is the Plebs’ College. Plebs’ College is a free education centre based in a squat on 55 Randolph Street, Oxford. The space includes a library, a café and classrooms. Although there is minimal access, as you have to climb up a ladder to enter the space and therefore limiting some members of the public, it offers those who can reach it a free school. This trying to keep ‘true equality’ as they put it.  The school does a number of workshops and events through out the year in their makeshift environment. Eviction has been sprung on them a couple of time as the space was abandoned for a year or so, but now that locals actually use the space, it is having a positive effect on the community and it seems that is how they have dodged eviction for now.</p>\n<p><a href=\"https://admin.crackintheroad.com/life/13930-feature-the-rebirth-of-the-recycled-space/attachment/peckham-hotel-exteria/\" rel=\"attachment wp-att-13935\"><img class=\"alignnone size-homepage wp-image-13935\" title=\"Peckham hotel exteria\" src=\"https://api.crackintheroad.com/images/2012/01/Peckham-hotel-exteria-660x499.png\" alt=\"\" width=\"660\" height=\"499\" /></a></p>\n<p><strong><em>Peckham Hotel </em></strong></p>\n<p>Squatting has long been part of British tradition. In the 17<sup>th</sup> century we had the ‘diggers’, a group of protestant oddities who took unused common land and cultivated it to their own advantage. After the Second World War it was almost a given for people to squat, as vast numbers of people found themselves without a home after the war. In more recent times squatting has been popularised with the extortionate fees students found themselves facing. In 2011 the government announced there were over 20,000 squatters in the UK and 650,000 empty properties for them to make their homes in. For those who pay rent, this can be a hard bullet to bite. “It’s my property, so what if I’m not using it at the moment, why are you allowed to take it?”, was something said to me the other day when the subject of squatters was brought up, and sure enough, last year attempts to criminalise those who squatted began. In the end, Kenneth Clarke, Secretary of Justice, passed the law of  ‘Legal Aid, Sentencing and Punishment of Offenders Bill’ and thousands of squatters had to relinquish the hold on their temporary homes. </p>\n","slug":"13930-feature-the-rebirth-of-the-recycled-space","category":"editorials","date":1326756636000,"wpid":13930,"isSticky":false,"featured_image":null,"createdAt":1587293074161,"updatedAt":1587825905940,"author":"5e9b68b27a1236eccfeb1d1e","categories":["editorials","life"]}