{"id":"5e9c33d59b6559241525e10b","title":"Review and Interview: Hockey and Vinyl Jacket","content":"<p>The 14th of June saw <strong>Hockey </strong>bring their musical stylings to Newcastle’s <strong>o2 Academy 2, </strong>supported by local favourites <strong>Vinyl Jacket</strong>.</p><p> Arriving just as <strong>Vinyl Jacket </strong>took to the stage to perform their first track, there was a small yet enthusiastic crowd filling the intimate setting of the <strong>Academy 2</strong>. Unfortunately due to a poor, or sadly uncaring, sound engineer, <strong>Vinyl Jacket</strong>‘s set suffered from mismanaged sound, with the band’s percussionist having practically no channels to work with as Hockey demanded 35! However this was more than compensated for by the exuberance and enthusiasm shown by <strong>Vinyl Jacket </strong>in a set buoyed by a raw energy. As I had heard in their debut EP, their live performance included the same keystone percussion element that adds a great dose of character and eliminates any risk of <strong>Vinyl Jacket </strong>being labeled simply yet another indie guitar band. This upbeat and crafted percussion element was mixed fantastically with the vocal unity of the band, which is a staple in creating a sufficient level of ‘listenability’ key in any indie pop band. Talking to lead vocalist <strong>Ben Dancer </strong>after his set confirmed to me the genuine passion for creating music that I feel comes across in <strong>Vinyl Jacket</strong>‘s sound, but more importantly he expressed a great deal of realism and perfectionism, which will only serve the band well. Make sure to check out <strong>Vinyl Jacket </strong>and download their new EP!</p>\n<p>Disappointingly the crowd remained small even when <strong>Hockey </strong>took the stage, perhaps due to the gig being poorly advertised or even that the initial wave of excitement about <strong>Hockey </strong>had expired. Luckily this lack of attendance did not stop <strong>Hockey </strong>producing a fantastic set, with lead vocalist <strong>Benjamin Grubin </strong>flinging himself across stage to the beat of every track. This energy and musical integrity of the band could be seen especially when they played classic tracks such as ‘Song Away’ and ‘Too Fake’. However more promisingly, their new tracks appear to be smooth evolution from past tracks, which many <strong>Hockey </strong>fans will be glad to hear as many critics have speculated a poor sophomore effort from <strong>Hockey</strong>. There is a definite grittier and more urban feel to some of the new tracks, however <strong>Hockey </strong>have still managed to preserve their integral feel of indie pop that was key in gaining the attention of the great <strong>Zane Lowe</strong>.</p>\n<p><strong>Crack in the Road </strong>were lucky enough to talk to <strong>Hockey </strong>after their set, despite a stand off with less than helpful security. For many <strong>Hockey </strong>was the buzz word last summer, playing countless festivals and ‘Song Away’ being a mainstay on <strong>BBC Radio 1</strong>‘s A List. However after this they appeared to disappear off the map, seemingly lost in the wilderness of indie pop bands past. However when I asked <strong>Jeremy Reynolds</strong>, the band’s bassist, about this, he talked about a rushed nature of their second single ‘Learn to Lose’. He discussed ‘Learn to Lose’ ‘<strong>not being as well received on the radio as ‘Too Fake was</strong>‘, and speculated that this could have been that ‘Song Away’ and ‘Too Fake’ were tracks originally recorded in their house, and that ‘Learn to Lose’ perhaps could have suffered from too much hype, both from fans and their label. However he revealed <strong>Hockey </strong>had spent the winter touring across the world, and had done five full UK tours on their sole album. Therefore when he revealed <strong><span style=\"font-weight: normal;\">Hockey </span></strong>were planning to get into the studio this autumn to record their new material, it made me wonder whether this sophomore effort would suffer from the sad fate of studio glamorization that was devoid in their first album. <strong>Jeremy </strong>considered this but but wasn’t worried by it, stating that <strong>Hockey </strong>would be still able to create an authentic and intimate album regardless of their production settings. What struck me as the most significant part of the plans for the new album was <strong>Jeremy</strong>‘s inspiration to achieve that <strong>‘three and a half minute pop gem’</strong>, in the same vain that ‘Too Fake’ was such a gem on their first album. While many would say this aim is simply an ambition to find one track that will sell, talking to <strong>Jeremy </strong>convinced me that this wasn’t the case. Originating as a two-piece with <strong>Benjamin Grubin</strong>, <strong>Hockey </strong>as we know it was born out of a want to expand a synth pop duo to a fully fledged indie pop band, and indie pop bands are measured by their success in creating that one song that has a ‘listenability’ that attracts the greatest amount of fans. Not only one of the most friendly and genuine bands I have ever interviewed, <strong>Hockey </strong>have a depth and integrity in sound that is sure to produce a fantastic sophomore album. In the meanwhile make sure to revisit the Hockey buzz of last summer and I guarantee you a <strong>Hockey </strong>gig is well worth the money!</p>\n<p><a href=\"www.myspace.com/vinyljacketuk\" target=\"_blank\">Vinyl Jacket Myspace</a></p>\n<p><a href=\"www.myspace.com/hockey\" target=\"_blank\">Hockey Myspace</a></p>\n<p><iframe src=\"https://www.facebook.com/plugins/likebox.php?id=114090381951328&width=292&connections=10&stream=false&header=false&height=255\" scrolling=\"no\" frameborder=\"0\" style=\"border:none; overflow:hidden; width:292px; height:255px;\" allowTransparency=\"true\"></iframe></p>\n","slug":"1422-review-and-interview-hockey-and-vinyl-jacket","category":"interviews","date":1276691894000,"wpid":1422,"isSticky":false,"featured_image":{"width":600,"height":417,"src":"2010/06/hockey.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAQF/8QAIBAAAQMEAgMAAAAAAAAAAAAAAQIDBAAREjEFEyFC0f/EABUBAQEAAAAAAAAAAAAAAAAAAAID/8QAGBEAAwEBAAAAAAAAAAAAAAAAAAIhAQP/2gAMAwEAAhEDEQA/AI4L3Oreaw46M1FUQFLDoJaGsgPbd7eNVvLmIzVeK0DfXYflKUeawo+0/9k="},"createdAt":1587295189057,"updatedAt":1588403566520,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2010/06/hockey.jpg","categories":["interviews","music","reviews"]}