{"id":"5e9c2b6b9b6559241525d567","artists":["5e9b69517a1236eccfeb263f"],"title":"Review: The Twilight Sad – No One Can Ever Know","content":"<p>Few bands embody half as much passion as <strong>The Twilight Sad</strong>.</p><p> From their stirring, edge of the seat records to their heart-in-mouth live performances, the Scottish three piece know exactly how to strike a chord with an attentive listener. Not only that, but they also showcase some of the finest song and album titles around, be it quotes from the 1986 classic <strong>Stand By Me</strong> or the name of their new record, the semi-sinister <em><strong>No One Can Ever Know</strong></em>.</p>\n<p>Whilst their two previous LP’s found the group experimenting and perfecting their indie-rock meets shoegaze style, <em><strong>No One Can Ever Know</strong></em> retraces their steps ever so slightly, taking the songs back to their bare bones. Gone are the imposing, sheer walls of sound, replaced by vintage synths and lead vocalist <strong>James Graham’s</strong> vocals find themselves dominating each and every track in a menacing manner. It’s a grittier, far less elegant sound, seemingly taking much from the late 70’s post-punk movements and ditching the shoegaze inspirations.</p>\n<p>Unfortunately, whilst the musicianship may be of the highest order, at times the songwriting is verging on stale, failing to truly convince the listener of it’s own merits. Album opener <em>Alphabet</em> plods along nonchalantly before collapsing into a rather ungraceful, spluttering heap; far from the beauty experienced on their previous two records. It’s not until third track <em>Sick</em> that <strong>The Twilight Sad</strong> really reach top gear, a track that’s as much of a waltz as it is a rock-anthem, potentially the groups most emotionally driven moment to date.</p>\n<p><object width=\"100%\" height=\"81\" classid=\"clsid:d27cdb6e-ae6d-11cf-96b8-444553540000\" codebase=\"https://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=6,0,40,0\"><param name=\"allowscriptaccess\" value=\"always\" /><param name=\"src\" value=\"https://player.soundcloud.com/player.swf?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F23780812\" /><embed width=\"100%\" height=\"81\" type=\"application/x-shockwave-flash\" src=\"https://player.soundcloud.com/player.swf?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F23780812\" allowscriptaccess=\"always\" /></object> <span><a href=\"https://soundcloud.com/fatcatrecords/the-twilight-sad-kill-it-in\">The Twilight Sad – Kill It In The Morning</a> by <a href=\"https://soundcloud.com/fatcatrecords\">Fat Cat Records</a></span></p>\n<p>As a complete listen, it’s sadly rather underwhelming, mainly down to the general disjointed, schizophrenic feel of the record, swinging between raw, industrial inspired arrangements (Dead City) and far more effective, tender, post-rock influenced ballads, such as the beautiful <em>Not Sleeping</em>. It pains me to say it, but his is far from the record I expected, overly relying on the strength of <strong>Graham’s</strong> exquisite vocals and leaving most of their songwriting ability behind them.</p>\n<p><em><strong>No One Can Ever Know</strong></em> is released 6 February via <a href=\"https://www.fat-cat.co.uk/\" target=\"_blank\">Fat Cat</a>.</p>\n","slug":"14298-review-the-twilight-sad-no-one-can-ever-know","category":"album-reviews","date":1327079146000,"wpid":14298,"isSticky":false,"featured_image":null,"createdAt":1587293035516,"updatedAt":1588441783366,"author":"5e9b68b27a1236eccfeb1d27","old_image":"generated/f9014f479ac61b8e2b1878a43e96f8493675d769.jpg","categories":["album-reviews","music"]}