{"id":"5e9c2b6e9b6559241525d569","title":"News: Megaupload shutdown for international piracy, hackers retaliate","content":"<p>One of the world’s largest file sharing sites Megaupload has been shut down by federal prosecutors in a move that the U.</p><p>S Justice Department has described as “among the largest criminal copyright cases ever brought by the United States.”</p>\n<p>Megaupload’s webite has been shut down whilst the claims of copyright infringement are investigated. Seven individuals & two corporations have been indicted, costing copyright holders over £322 million ($500m) in lost revenue. The Hong-Kong based company have yet to comment.</p>\n<p>The news comes just a day after a string of online protests against the Stop Online Piracy Act (SOPA) swept the web. This included <a href=\"https://en.wikipedia.org/wiki/English_Wikipedia_blackout\">Wikipedia’s 24hour ‘black out’,</a> Google covering up their logo & Tumblr distributing information on how U.S citizens could contact their local congressman.</p>\n<p>The Justice Department have issued a statement claiming that megaupload founder Kim Dotcom, formerly known as Kim Schmitz, and three other executives were arrested Thursday in New Zealand at the request of U.S. officials. Two other defendants are still at large. It is unknown as to whether Swizz Beatz, CEO of the firm, has been charged.</p>\n<p>Online hacking collective Anonymous took swift revenge for the shutdown of Megaupload by attacking a number of sites including <a title=\"Universal music hacked\" href=\"https://www.universalmusic.com\">Universal Music’s official site</a>, <a title=\"Anonymous shutdown copyright.gov in Megaupload retaliation\" href=\"https://www.Copyright.gov\">Copyright.gov</a> the <a href=\"https://www.mpaa.org/\">Motion Picture Association of America’s site</a>, <a title=\"anonymous attack FBI site\" href=\"https://www.FBI.gov\">FBI.gov</a> & <a title=\"BMI hacked\" href=\"https://www.BMI.com\">BMI.com</a> by firing thousands of requests a second at their server in what is known as a denial-of-service attack (DDoS). Russian news service RT claims this is the largest coordinated attack in Anonymous’ history with over 5,600 users firing their lasers at once.</p>\n<p>In one of the IRC chatrooms used to co-ordinate these attacks one anonymous member BRUTALASSMASTER said “The ping is OVER 9000.” A twist on a meme that not only expresses the anger & power of  these combined internet users but also a meme that could never have been born in a world supporting SOPA.</p>\n<p>Megaupload was once the 13th largest webpage in the world and had recently received support from musicians and others in the entertainment industry despite the fact a lot of content produced by these individuals has been distributed on Megaupload. The whole situation raises questions about internet regulation and whether piracy really damages an artist or purely the record label bosses who profiteer from their creativity.</p>\n<p>The seven individuals indicted face a maximum penalty of 20 years in prison on racketeering charges, 20 years on money laundering charges and 10 years on other related charges.</p>\n<p><strong>R.I.P MEGAUPLOAD</strong></p>\n","slug":"14304-news-megaupload-shutdown-for-international-piracy","category":"news","date":1327010094000,"wpid":14304,"isSticky":false,"featured_image":null,"createdAt":1587293038316,"updatedAt":1587825905359,"author":"5e9b68b27a1236eccfeb1d40","categories":["news"]}