{"id":"5e9c2b409b6559241525d53c","artists":["5e9b68cd7a1236eccfeb1e04","5e9b68e07a1236eccfeb1ee7","5e9b68f87a1236eccfeb20be","5e9b694b7a1236eccfeb25ae"],"title":"Live Review: Remember Media #001 Feat. B>E>A>K / Chased By Wolves (27/01/12)","content":"<p>Anyone who has found themselves (spiritual and physically) in Byker, Newcastle, will testify to the fact that it’s truly where dreams are made… or something like that.</p><p> Last night amongst the homely confines of <strong>The Cluny</strong> I witnessed an undeniably glorious ceremony; celebrating the marriage of two of the North East’s finest independent publications, collaborating under the <a href=\"https://remembermedia.wordpress.com/\" target=\"_blank\"><strong>Remember Media</strong></a> banner. <a href=\"www.kyeo.tv\" target=\"_blank\">KYEO.tv </a>and <a href=\"https://twitter.com/#!/narc_magazine\" target=\"_blank\">NARC</a> have long been integral parts of the cultural scene in this part of the country and what better way to honor their new partnership than to bring together family, friends and wannabe-hipsters, alongside some of the North East’s finest up and coming acts to throw one bloody big reception?</p>\n<p>When it comes to North East music, I’m the first to admit that I’m far from knowledgeable, although that’s not to say I don’t enjoy it. Arriving slightly later than I’d hoped (thanks Nexus) I managed to catch the end of<strong> Ghosts of Old Berlin’s</strong> set. The four piece conjured up a brooding, sultry atmosphere, perfectly fitting for their epic, highly structured tracks, and extremely well suited as a warm up act. Next to take to the stage were <strong>Symphonic Pictures</strong>, dressed entirely in white, accompanied by what seemed like a studios worth of equipment. Their psych-pop inspired tracks weren’t really to my taste, especially having expected a more diverse sound judging by the numerous varieties of instruments on show, however there was no faulting the passion behind the performance.</p>\n<p>Then came my favourite act of the night; the post-rock influenced <strong>Chased By Wolves</strong>, who lurched between fantastical walls of sound and tender, vocal refrains, making for a memorable show. Minutes before the elusive <strong>B>E>A>K</strong> took to the stage, I was informed by a friend that I’d thoroughly enjoy the slightly bizarre six piece and true to his word, they played their hearts out. Almost entirely instrumental, the mask wearing critters were relentless throughout, rarely stopping for breath during their electrifying fast-paced set. How <strong>B>E>A>K</strong> sound on record, I’m yet to discover, but their raw energy was meant for the live circuit. So with the night drawing to a close, and several looking the worse for wear, I headed home, with the newest issue of NARC in my back pocket serving as a true testament to the sparkling future that lies ahead of <strong>Remember Media</strong>.</p>\n","slug":"14434-live-review-remember-media-001-feat-beak-chased-by-wolves-270112","category":"live-reviews","date":1327697855000,"wpid":14434,"isSticky":false,"featured_image":{"width":165,"height":118,"src":"2012/01/402886_529461480653_286200555_817058_1236092352_n-165x118.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAYH/8QAIBAAAgICAgIDAAAAAAAAAAAAAQIDBQARBCEGMRJBYf/EABUBAQEAAAAAAAAAAAAAAAAAAAEC/8QAFxEAAwEAAAAAAAAAAAAAAAAAABEhEv/aAAwDAQACEQMRAD8A1m7o7tK+blVPlV0ZTMAEaSP4Dbnrtd6+vfrWU1W1zHW8RORWzSzrCgkkflIS7BRsn9JxjBUrUSP/2Q=="},"createdAt":1587292992469,"updatedAt":1588443776071,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2012/01/402886_529461480653_286200555_817058_1236092352_n-165x118.jpg","categories":["live-reviews","music"]}