{"id":"5e9c2b279b6559241525d516","artists":["5e9b695d7a1236eccfeb26c1"],"title":"Review: Veils – Clarity","content":"<p>Never judge a book by its cover.</p><p> It’s an idiom whose lesson is hammered into us as children, a symbolic rendering of liberal values. You don’t base things on surface judgment because it’s not accurate, it’s not fair, and it’s not a very nice thing to do. Sometimes, though, it’s not like this at all. The platitude ceases to embody equality of potential, and takes on an air of caution. You don’t base your judgment on surface qualities because, well, you might get it wrong, and one day your presupposition could come back to bite you in the arse.</p>\n<p>The notion can become particularly galling with the benefit of hindsight. Most of us, I think, are guilty of feeling a little put out after taking in a ‘book’ (literal or figurative), only to discover that in fact, its cover sums it up rather well. I only mention all of this, because the amount of ‘literature’ that I’ve dredged up regarding <strong><em>Clarity</em></strong>, the first release proper from Cornish hardcore quartet <strong>Veils,</strong> which references the record’s front cover, is quite substantial. It’s seemingly an astoundingly clever connection to make, linking that monochrome stag and wintry landscape to the band’s music, rather than damned obvious, and even a little reductive. Often, the writing that follows these comparisons comes across as little more than regurgitated PR, positive, but again reductive.</p>\n<p>This (by which I mean the combination of holier-than-thou ire at shitty writing with something purporting to be a record review) is rather unfair to Veils, because the five songs that comprise <strong><em>Clarity </em></strong>are each possessed of their own worth, as is the EP as a whole. Opener <em>Standing Alone (Isolation)</em>, seemingly widely agreed to be the embodiment of that front cover in sound, welds lonely atmospherics onto bursting heart hardcore of the highest order. It’s lean, it’s powerful, and it’s followed by the breakneck charge of <em>Caves (Anxiety)</em>, which, whilst by and large an exemplary exercise within its chosen boundaries, highlights one of the traps that Veils occasionally fall into, again typical within those boundaries. Chlo Edwards’ frankly terrifying voice has a tendency to drop from a roar to a defeated yelp at the end of pivotal lines – it’s a powerful trope when used sparingly, but here it seems characteristic rather than a device. Similarly, <em>Stallions (Adrenaline) </em>recalls Italian screamo merchants Raein at their best, and even Refused in its opening beats, and comparisons like these can rarely be a bad thing. But it does fall into some of the pitfalls of its genre, Edwards yelling the stock-posi ‘every change leads to a leap of faith’, followed (briefly, granted) by the kind of chug that could bore your average discerning hardcore fan at a hundred paces.</p>\n<p><iframe width=\"400\" height=\"100\" style=\"position: relative; display: block; width: 400px; height: 100px;\" src=\"https://bandcamp.com/EmbeddedPlayer/v=2/album=2396033412/size=venti/bgcol=FFFFFF/linkcol=4285BB/\" allowtransparency=\"true\" frameborder=\"0\"><a href=\"https://veilshc.bandcamp.com/album/clarity\">Clarity by V E I L S</a></iframe></p>\n<p>I’m just saying that we shouldn’t lose sight of the ground here. It’s very easy to invest too much in homegrown talent when it’s at this early, exciting stage, especially when the band release on a label like Tangled Talk, and when they run with the eminent scene heavyweights that they have – Crocus, Pariso, and so on. Luckily, <strong><em>Clarity</em></strong><em>’s</em> content falls squarely beyond merely solid, and yes, it <em>is </em>exciting to wonder where Veils might go next. Should they continue to push forward, as the skyward-looking, slow-mo screamo of <em>Surrender (Clarity)</em> suggests that they might, with <strong><em>Clarity</em></strong>’s merits as a springboard, it’s anyone’s guess as to where Veils might end up.</p>\n","slug":"14468-review-veils-clarity","category":"music","date":1328044128000,"wpid":14468,"isSticky":false,"featured_image":{"width":500,"height":500,"src":"2012/01/veils.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFwAAAwEAAAAAAAAAAAAAAAAAAgQGB//EACAQAAMAAQMFAQAAAAAAAAAAAAECAwQAETEFBhIhQXH/xAAUAQEAAAAAAAAAAAAAAAAAAAAC/8QAFxEBAQEBAAAAAAAAAAAAAAAAAQACEf/aAAwDAQACEQMRAD8A0bP68MZ8VPGZrlOEihsoLb/dudvzU3Y97PajSvjibMSoFF9Df1801SEX6lgVeU2rPFHg5UErxwfmjLHfk6JkIdb/2Q=="},"createdAt":1587292967647,"updatedAt":1588403542406,"author":"5e9b68b27a1236eccfeb1d3c","old_image":"2012/01/veils.jpg","categories":["music","reviews"]}