{"id":"5e9c2b299b6559241525d519","artists":["5e9b69447a1236eccfeb254a"],"title":"Interview & Premiere: Soft Lighting","content":"<p>With his debut track <em>Far Away</em> gracing the internet little over two weeks ago, Kansas City’s <strong>Soft Lighting</strong>, the side-project of <strong>Bryan Cox</strong> (also of <strong><a href=\"https://newsavages.</p><p>bandcamp.com/\" target=\"_blank\">New Savages</a></strong>) is beginning to forge a name for himself. Having been <a href=\"https://api.crackintheroad.com/music/13822-introducing-soft-lighting/\" target=\"_blank\">Introduced</a> by myself a fortnight ago, <em>Far Away</em> also appeared on acclaimed music blog<strong> <a href=\"https://www.lostlostlost.com/2012/01/soft-lighting-far-away.html\" target=\"_blank\">Lost Lost Lost</a> </strong>on Saturday<strong>, </strong>as well as featuring on several other prominent music websites.</p>\n<p>Whilst his music may have created a stir, there’s little information available on <strong>Bryan Cox</strong>, so we jumped at the opportunity to get a few questions answered. Bryan also gave us the exclusive first play of the new <strong>Soft Lighting</strong> track; the gloriously upbeat <em>Forever</em>. Reverb-heavy vocals and languid synths transform this track into a brilliantly vibrant, chillwave inspired number, perfectly fitted to the trippy, cartoon filled video. Check out our short interview below, as well as the premiere of <em>Forever</em>.</p>\n<p><em>Crack in the Road: How did Soft Lighting come about, and is it a solo venture, or are there others involved?</em></p>\n<p><strong>It’s my solo work. It kinda came about in between other projects. I was busy with the band I’m in, New Savages and helping produce local music etc. Every once in a while I would have a break and work on a song that was kinda just for myself. After a while I realized I had about an album worth of material so I figured I ought to give it a name and put it out there.</strong></p>\n<p><em>CitR: The influences on your debut track Far Away seem quite prominent, with ‘chillwave’ being a word used quite a bit. What would you describe as the main influences behind Soft Lighting, musically and otherwise?</em></p>\n<p><strong>Since the songs were recorded over the course of a few years, there is actually a pretty diverse range of influences. Everything from Italo Disco and 80s film soundtracks to newer stuff like Teeel, Casa del Mirto and Washed Out. Anything with a groove really. I also really like all the <a href=\"https://www.beerontherug.com/\" target=\"_blank\">Beer On The Rug</a> releases because they’re this funny 80s/90s kitsch thing but really experimental and strung out at the same time.</strong></p>\n<p><em>CitR: What are your plans for Soft Lighting over the coming months?</em></p>\n<p><strong>I’m super excited because it looks like <a href=\"https://synthemesc-recordings.com/\" target=\"_blank\">Synthemesc Recordings</a> is going to release the album. The entire album will be available digitally soon. I’m also collaborating with an awesome artist, <a href=\"https://anna-spence.com/\" target=\"_blank\">Anna Spence</a> on a series of videos for each song. So we will put those out as we finish them.</strong></p>\n<p><iframe src=\"https://player.vimeo.com/video/35969230?title=0&byline=0&portrait=0\" frameborder=\"0\" width=\"600\" height=\"450\"></iframe></p>\n<p><a href=\"https://vimeo.com/35969230\">Soft Lighting – Forever</a> from <a href=\"https://vimeo.com/user10187316\">Soft Lighting</a> on <a href=\"https://vimeo.com\">Vimeo</a>.</p>\n<p><em>CitR: Were you surprised at the hugely positive reaction to your debut track?</em></p>\n<p><strong>Yes definitely. It’s funny because I actually had initially only put up the demo version of Far Away just to be able to create the bandcamp and start playing around with the design and stuff. I didn’t even intend to “release” it or anything yet, but somehow someone found it and because of word of mouth and awesome blogs like Crack In The Road, its caught on.</strong></p>\n<p><iframe style=\"position: relative; display: block; width: 400px; height: 100px;\" src=\"https://bandcamp.com/EmbeddedPlayer/v=2/track=2935237702/size=venti/bgcol=FFFFFF/linkcol=4285BB/\" frameborder=\"0\" width=\"400\" height=\"100\"></iframe></p>\n<p><em>CitR: How much do you think your surroundings have affected your sound?</em></p>\n<p><strong>There’s not much of an electronic scene in Kansas City. Or maybe there is and I’m just not cool enough to know about it haha. I guess I just surround myself with a few really good friends that are either artists or art lovers. They are my inspiration.</strong></p>\n<p><em>CitR: And finally… if you could have any super power, what would it be?</em></p>\n<p><strong>Super sonic hearing</strong>.</p>\n","slug":"14512-interview-premiere-soft-lighting","category":"music","date":1328041627000,"wpid":14512,"isSticky":false,"featured_image":{"width":864,"height":864,"src":"2012/01/425733_238329266246224_238329042912913_544984_796442714_n.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFwAAAwEAAAAAAAAAAAAAAAAAAgUGB//EACAQAAICAgICAwAAAAAAAAAAAAEDAhEAIQQFEiJBgfD/xAAUAQEAAAAAAAAAAAAAAAAAAAAC/8QAGhEAAgMBAQAAAAAAAAAAAAAAAQIAAxEEBf/aAAwDAQACEQMRAD8A3xKZzeuK6b7X4F8dkbINfF3r7xgvr3xXCJSqwAP28DhoUvsePKCoRJkbIiBejlBiToZxsF3n10tgJM//2Q=="},"createdAt":1587292969133,"updatedAt":1588403542433,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2012/01/425733_238329266246224_238329042912913_544984_796442714_n.jpg","categories":["music","new","videos"]}