{"id":"5e9c2b129b6559241525d508","artists":["5e9b69117a1236eccfeb2245"],"title":"Feature: How Lana Del Rey Saved Pop Music","content":"<p>It’s been eight months since our ears were first graced with the sublime, audacious beauty of <em>Video Games</em>.</p><p> Eight short months in which we’ve loved, hated, <a href=\"https://lanadelwho.tumblr.com/\" target=\"_blank\">mocked</a>, obsessed over and idolized <strong>Lana Del Rey</strong> to the point of literary exhaustion. Despite a mixed critical consensus (<em>‘For all it’s coos about love and devotion, it’s the album equivalent of a faked orgasm’</em> – <strong>Pitchfork</strong>), her debut album <em>Born To Die</em> is racing to the top of the UK charts; appearing that, like her or not, <strong>Elizabeth Grant</strong> has well and truly arrived.</p>\n<p>It’s been far from smooth sailing for the New York songstress, whom initially rose to fame after the phenomenal viral success of what seemed at first glance, to be a cutesy, homemade music video, undisturbed by the interring hand of the mainstream media. Clocking up an astonishing two millions views within a week of being online, <em>Video Games</em> had esteemed bloggers frothing at the lips, scouring internet dictionaries for adjectives to hoard upon the angelic <strong>Lizzy Grant</strong>. Through the guileless eye it was to be assumed that <strong>Lana Del Rey</strong> had strolled onto the scene as a perfectly assembled, unblemished popstar, with a raft of original, ingenious songs under her slender belt. Simply in the right place at the right time.</p>\n<p>As so often is the case, not all was as innocent as it seemed. Blog-extraordinaire <a href=\"https://www.hipsterrunoff.com/altreport/2011/09/lana-del-rey-exposed-b4-she-was-alt-she-was-failed-mnstrm-artist-without-fake-lips.html\" target=\"_blank\">Hipster Runoff</a> took it upon themselves to pick up the shovel and delve into <strong>Grant’s</strong> past and present, revealing her history as a relatively exhausted club-circuit performer and daughter of a domain-shark tycoon. Photos of her previous incarnation showed her sporting more regularly sized lips and an au naturale image, whilst hanging with socialites at top Brooklyn haunts. Musically she was drastically different, with her ‘debut’ album released through a local independent label named 5 Points proving barely distinguishable from her newer, overly dramatic, self-proclaimed ‘sadcore’. For many there was only one logical explanation – <strong>Grant</strong> had kicked her chances of ‘making it’ through hardwork, impeccable songwriting and good fortune, instead choosing to enlist the support of a world-renowned PR firm and climb into the disheveled bed of a major label.</p>\n<p>The blogosphere was shaken by these revelations, and reacted in the only way that socially-awkward people know – with an unprecedented level of disgust. Articles began cropping up declaring their repugnance at what they perceived to be an abuse of trust, “but you told us she was independent” bawled the relevant bloggers, whilst <strong>Hipster Runoff</strong> practically transformed itself into the hub for all <strong>Lana Del Rey</strong> related news. The blogosphere helped create a monster then sacrificed it’s pride by fleeing at the first sight of commercial and critical success. Yet amidst all the negative press, suspect <a href=\"https://www.youtube.com/watch?v=9zrvD-o8cII\" target=\"_blank\">SNL performances</a> and <a href=\"https://www.youtube.com/watch?v=kg5gon5r50c&feature=related\" target=\"_blank\">utterly bizarre interviews</a>, few asked the all important question – “what about the music?”.</p>\n<p>Sure, <strong>Lizzy Grant</strong> might not be the defectless pop princess that we’d all envisioned her to be, however her faultless, exquisitely alluring alter-ego <strong>Lana Del Rey</strong> is a part that she plays to exemplary effect. It’s common knowledge that <strong>LDR</strong> is far from a true extension of her own personality, and what we should remember is that each TV appearance, interview or even record release, is a performance, in the most forthright sense of the word. Her persona is entirely adopted and, if you believe the vicious rumours, industry refined, yet since when has that been such a heinous crime?</p>\n<p><strong>Bowie</strong>, one of the greatest popstars and songwriters ever to have lived, juggled numerous personalities throughout his career, some successful (<strong>Aladdin Sane</strong>), others not so much (<strong>Arnold Corns</strong>), yet all incredulously engaging. To lambast him for not being true to himself or emanating a misleading image is practically unheard of, so why should anyone else hiding behind a veil of split personalities be the victim of such animosity? Taking a more recent example, <strong>Stefani Joanne Angelina Germanotta </strong>isn’t a name that all would instantaneously recognize, yet under the guise of her pseudonym <strong>Lady Gaga</strong>, she’s widely regarded as one of the world’s finest popstars. Show me someone who sincerely believes that <strong>Gaga’s</strong> quirky concept is entirely the brainchild of <strong>Germanotta</strong> and I’ll show you a liar.</p>\n<p>Accusing <strong>Grant</strong> of depending almost solely on her image to promote her music (and consequently sales) is a rather naive and blinkered stance to take. Since the invention of the camera, visually motivated works, most notably sexually orientated, have been used to propagandize and sell music. As humans we feel comforted and reassured with being able to put a face to a composition, so manipulating instinct by capitalizing on an attractive and seductive appearance is hardly exploiting an unfamiliar hypothesis.</p>\n<p>As it just so happens, I <a href=\"https://api.crackintheroad.com/music/14416-review-lana-del-rey-born-to-die/\" target=\"_blank\">rather like</a> <strong>Lana Del Rey’s</strong> debut album for what it is; a disjointed collection of overly dramatic, Americana-obsessed pop gems. There’s moments of beauty (<em>Without You</em>, <em>Video Games</em>), unstifled arrogance (<em>Off To The Races</em>, <em>Blues Jeans</em>), and even the odd glistening diamond (<em>Dark Paradise</em>, <em>Radio</em>). Whilst it may be far from coherent as a listening experience and thoroughly embracing the iTunes driven generation which we live amongst, it’s a dam sight better than the majority of ‘music’ polluting the charts nowadays. Give me <strong>Lana’s</strong> sumptuous vocals and knack for writing a killer chorus over the karaoke warble of<strong> Adele</strong> or <strong>Florence’s</strong> dire songwriting capabilities any day of the week.</p>\n<p>In recent years, a vast percentage of respected critics appearing to be endorsing the opinion that a sizable proportion of popular music is horrendously bad, with a miniscule slither being overwhelmingly good, and that this is simply an inevitability. Having the charts dominated by uninspired dross a la <strong>Katy Perry</strong>, <strong>Bruno Mars</strong>, <strong>Ke$ha</strong> etc is a sorry state of affairs, yet by no means does it automatically compromise the reputability of all chart music. The standard album format we’ve come to expect from major label artists of ten tracks, containing three or four singles and the rest filler, shouldn’t be accepted as the norm, so artists like<strong> Lana Del Rey</strong> deserve recognition for attempting to prove herself as an exception.</p>\n<p>It would have been all to easy for <strong>Lana Del Rey</strong> to rope in a couple of high profile rappers for <em><strong>Born To Die</strong></em>, alongside casting a handful of celebrities in her music videos; a popular tactic at the moment amongst shameless, talent-devoid popstars. Take<strong> Madonna</strong>, whom earlier this week announced her comeback with new video <a href=\"https://www.youtube.com/watch?v=cItHOl5LRWg\" target=\"_blank\"><em>Give Me All Your Luvin’</em></a>, an abhorrent piece of music, therefore no surprise that she felt it necessary to call in the help of <strong>M.I.A.</strong> and <strong>Nicki Minaj</strong> to raise the ‘relevancy’ of the track. For all <strong>Lana’s</strong> flaws, you have to admire her self-confidence and belief in her own artistic merit. The charts have become bogged down by dishwater dull artists, lacking in originality and diversity, hence the colossal increase in forced, almost incestuous collaborations over the past couple of years. If ever pop music needed a fresh faced figurehead it’s now, and <strong>Lana</strong> fills those slippers perfectly.</p>\n<p>Amongst the depressing number of band reformations involving washed up, overrated, money-hungry individuals, it’s energizing to find an artist experimenting with her trade by combining tried and tested methods with modern, digitally inclined suppositions. Nobody is denying the commercial backing and intentions that bolster <strong>Lana Del Rey’s</strong> success, however to dismiss her every aspect on those grounds alone is a misinformed and ignorant demeanor to embrace. When the dreaded day comes that all money has been drained from the music industry (and it will), consequently removing financial incentives, then we can judge artists upon an even keel. Although until that day arrives, I’m more than content with having to filter through the industry-processed popstars to discover the truly artistically valuable gems; and <strong>Lana</strong> <strong>Del Rey</strong> is a sparkling diamond.</p>\n","slug":"14528-feature-how-lana-del-rey-saved-pop-music","category":"editorials","date":1328367324000,"wpid":14528,"isSticky":false,"featured_image":null,"createdAt":1587292946429,"updatedAt":1588441782831,"author":"5e9b68b27a1236eccfeb1d27","old_image":"generated/6e8dc460cfb6b89d7970302259febd0aa73b38c6.jpg","categories":["editorials","music"]}