{"id":"5e9c2b099b6559241525d500","artists":["5e9b68cd7a1236eccfeb1e10"],"title":"Live Review: Bags of Rock","content":"<p><a href=\"https://admin.</p><p>crackintheroad.com/music/14630-live-review-bags-of-rock/attachment/borpic/\" rel=\"attachment wp-att-14631\"><img class=\"alignnone size-full wp-image-14631\" title=\"BORpic\" src=\"https://api.crackintheroad.com/uploads/2012/02/BORpic.jpg\" alt=\"\" width=\"720\" height=\"478\" srcset=\"https://api.crackintheroad.com/images/2012/02/BORpic.jpg 720w, https://api.crackintheroad.com/images/2012/02/BORpic-300x199.jpg 300w\" sizes=\"(max-width: 720px) 100vw, 720px\" /></a></p>\n<p>Okay, so this isn’t the sort of stuff we generally cover at <em><strong>Crack in the Road</strong></em> but if we like it, we write about it, and I like <strong>Bags of Rock</strong>. Chances are I may be the only writer for the site that would enjoy their style of music, but it’s well worth discussing. Yeah their sets may feature covers of classical rock songs such as <em>Black Betty</em>, alongside their own material but don’t let that put anyone off; they’re a talented bunch and certainly show that live. The set up is a typical two guitars, bass and drums but capped off with a separate snare drum player and two bagpipers (hence the ‘bag’ in the title), elevating the group above being a bog-standard indie outfit.</p>\n<p>All clad in kilts they typify what it means to be Scottish, and they managed to get the crowd going quicker than most bands I’ve witnessed on the live stage. I’m not sure if they’d get the same sort of reception south of the border, yet during these revolutionary times when Scottish independence is a hot topic, there’s a feeling they could almost convert the most ardent unionist. They excel when performing their own tracks, with an obvious heavy rock core that permeates through, whilst still allowing the bagpipes to be a dominant, positive feature within it. All diverse elements combined, and the outcome is like a hazy amalgamation of <strong>Pantera </strong>and your stereo-typical typical pipe band. Overall, <strong>Bags of Rock </strong>are a good fun band that don’t take themselves too seriously and when watching them perform, one can’t help but smile.</p>\n<p>Check them out on Facebook <a href=\"https://www.facebook.com/pages/Bags-Of-Rock/208966499149332\">here</a></p>\n<p>Photographer: TBC</p>\n<p><iframe src=\"https://w.soundcloud.com/player/?url=http%3A%2F%2Fapi.soundcloud.com%2Fplaylists%2F1360150&auto_play=false&show_artwork=true&color=e10066\" frameborder=\"0\" scrolling=\"no\" width=\"100%\" height=\"450\"></iframe> </p>\n","slug":"14630-live-review-bags-of-rock","category":"live-reviews","date":1328549210000,"wpid":14630,"isSticky":false,"featured_image":null,"createdAt":1587292937512,"updatedAt":1588441782727,"author":"5e9b68b27a1236eccfeb1d07","old_image":"generated/ab67616d0000b273b4d26e906c160cb102fc08e3.jpg","categories":["live-reviews","music"]}