{"id":"5e9c2afe9b6559241525d4f5","title":"Guest Feature: Andrew Backhouse’s ‘Ones to Watch’ in 2012","content":"<p>Hello there.</p><p> My name is Andrew Backhouse, and the lovely folks at Crack in the Road have handed me the keys. Allow me to take you on a tour through the music that will soundtrack the year ahead.</p>\n<p>Popologists and hen nights weep alike at the continued unlikelihood of an Abba reunion, but some compensation comes from Newcastle’s <strong>Mammal Club</strong>. Their debut single ‘Painting’ is due out this April and we can clarify it’s a bit of a monster. We’re talking shinier-than-a-banker’s brogue, funkasaurus art-rock.</p>\n<p><iframe src=\"https://www.youtube.com/embed/W_RljqdZ8r8\" frameborder=\"0\" width=\"560\" height=\"315\"></iframe></p>\n<p>Metronomy’s Joseph Mount has predicted that 2012 will herald the rise of the individual male. Someone to rival Florence and Adele for chart domination. I’m placing my bets on <strong>Star Slinger. </strong>He shot into our lives with a flurry of remixes for all the buzziest new bands, but debut single proper ‘Dumbin’ shoots him to new heights. A future-pop classic.</p>\n<p><iframe src=\"https://w.soundcloud.com/player/?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F24927029&show_artwork=true\" frameborder=\"no\" scrolling=\"no\" width=\"100%\" height=\"166\"></iframe></p>\n<p><strong>Friends</strong> are the epitome of cool. In the last whirlwind of a year, they find time between having dinner at Elton John’s house to peddle the sort of sass-talking, big-city pop sounds ESG and the Tom Tom Club made popular. Like fellow New Yorkers Darwin Deez, it feels like the hype has built on UK soil and is rippling back, but Friends are taking it all in their stride.</p>\n<p><iframe src=\"https://w.soundcloud.com/player/?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F23253035&show_artwork=true\" frameborder=\"no\" scrolling=\"no\" width=\"100%\" height=\"166\"></iframe></p>\n<p><strong>Clock Opera</strong> (pictured) have given us another Steve Reich-esque banger in the shape of new single ‘Once and For All’. It’s not the first time they’ve put it out (it was released via uber-cool French label Kitsune back in 2010), but it’s the first time they’ve plonked it in the middle of dancefloors nationwide, sat back and watched the fireworks unfold. Things are running like clockwork for their debut album ‘Ways to Forget’ out soon on Moshi Moshi.</p>\n<p><iframe src=\"https://w.soundcloud.com/player/?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F32343623&show_artwork=true\" frameborder=\"no\" scrolling=\"no\" width=\"100%\" height=\"166\"></iframe></p>\n<p>Like your bands to feature string quartets and mash up electronica, hip-hop and classical? If the answer to that question is no… well, you’re lying. If the answer’s yes, say hello to <strong>Clean Bandit</strong>. After stumbling across their video for ‘Mozart’s House’ last year, I played it on my podcast and it’s had a great reaction. With all my excitement, I might have accidently compared them to the Spice Girls – luckily they didn’t seem to mind!</p>\n<p><iframe src=\"https://www.youtube.com/embed/rd0cT7Dnpt8\" frameborder=\"0\" width=\"560\" height=\"315\"></iframe></p>\n<p>There’s rumblings art-rock schoolboys <strong>Citizens</strong> are going to explode in a Franz Ferdinand sort of fashion, which in no small part is aided by the presence of one archduke Alex Kapranos sitting at the desk for their debut LP. Whether or not it will trigger a guitar renaissance on the charts – well, you’ll just have to wait and see.</p>\n<p><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/uTBDB1Iairs\" frameborder=\"0\" allowfullscreen></iframe></p>\n<p>I’m going to crash Crack in the Road’s integrity now. Everybody’s talking about the return of Top of the Pops and I’d love to see the likes of <strong>Niki & the Dove</strong> and <strong>Spector </strong>on the show.</p>\n<p><iframe src=\"https://www.youtube.com/embed/l2f6UbMnlq4\" frameborder=\"0\" width=\"560\" height=\"315\"></iframe></p>\n<p><strong>Theme Park</strong> too would be perfect for the job, what with their live show of crispy, romantic-flecked pop known to render audiences mentally ill with delight. Piped through iPod headphones, ‘Wax’ made atleast one Crack in the Road writer break into dance on public transport and not even care that it probably almost got them clobbered. We need more bands like this in the world.</p>\n<p><iframe src=\"https://w.soundcloud.com/player/?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F26355935&show_artwork=true\" frameborder=\"no\" scrolling=\"no\" width=\"100%\" height=\"166\"></iframe></p>\n<p>Here’s to many more near clobberings for our musical futures.</p>\n<p> </p>\n","slug":"14672-guest-feature-andrew-backhouses-ones-to-watch-in-2012","category":"introducing","date":1328634639000,"wpid":14672,"isSticky":false,"featured_image":null,"createdAt":1587292926428,"updatedAt":1588441782593,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2012/02/clock-opera-165x116.jpg","categories":["introducing","music"]}