{"id":"5e9c348b9b6559241525e246","title":"Hilarity Bites Comedy Club","content":"<p style=\"text-align: center\">\n<p>Hilarity Bites returns again this month with another fantastic and varied line up of comedy.</p><p> From the fantastically eccentric Seymour Mace to the bloke-ish humour of Carl Hutchinson there really is something for every comic palette this month. So, on the 15th April get yourselves down to Blake’s Coffee House in Newcastle for this chemically engineered concoction of hilarity.</p>\n<p><strong>Seymour Mace</strong></p>\n<p>Seymour Mace’s surreal free form stand up takes the audience on a slightly off-beat flight of fancy, with his childlike and often childish explorations into relationships and naive investigations into why things are. Follow the hilarity into his charmed mind to see through his eyes… life, the universe and bears!</p>\n<p>A multi-award winning comedian, Seymour has featured in every series of “Ideal” on BBC Three, and is now unable to walk down the street without being recognised by the nation’s stoners. Seymour’s world is a unique one, but enter it and you’ll leave all the better for the experience…</p>\n<p>“Breathtaking… a surreal performance, he had the audience in the palm of his hand from start to finish.” – Evening Chronicle</p>\n<p><strong>Carl Hutchinson</strong></p>\n<p>Carl was Magners Pub Comedian of the Year in 2008 and won the Beat The Frog World Series in 2007. Carl was also a finalist in the esteemed So You Think You’re Funny competition in 2007 and was a nominee for the Leicester Mercury comedian of the Year in 2009 – not bad going at all for this young man from Newcastle.</p>\n<p>“The phrase ‘One to watch’ gets bandied around a lot on the comedy circuit, but Carl is one of a few new comedians where it actually applies. An up and coming talent, Carl takes the mundane and makes it down right hilarious.” – Evening Gazette</p>\n<p><strong>MC Chris Ramsey</strong></p>\n<p>Chris Ramsey strides onto the stage and you immediately know you are in safe hands; his high-energy delivery, hugely engaging manner and off-the-cuff style have made him one of the most exciting new acts to hit the circuit in recent years. Upbeat and lightning fast, he commands the stage with the tenacity of a comic with twice his experience.</p>\n<p>A finalist in the 2008 Chortle Student Comedian of the Year Awards, and Nominated for the Leicester Mercury Comedian of the Year Award 2009, Chris is a regular compere at some of the biggest comedy clubs in the UK and has supported Lee Mack, Russell Kane and Stephen K Amos on national tours. He has been a guest on QRadio and Kerrang Radio and provided live warm-up for Channel 4’s The Gok Wan Road Show, performed for BBC Comedy Presents and had a number of appearances on The Credit Crunch Cabaret, hosted by Frank Skinner.</p>\n<p>“Effervescent as potassium, and brighter.” – The Northern Echo</p>\n<p>Tickets for this show are £8 each and can be bought in advance from either <a href=\"https://shop.hilaritybites.co.uk\">https://shop.hilaritybites.co.uk</a> or in person from Blake’s. It all kicks off at 8pm for some top comedy and great food and drink.</p>\n","slug":"148-hilarity-bites-comedy-club-april-15th-at-blakes-coffee-house","category":"life","date":1270972735000,"wpid":148,"isSticky":false,"featured_image":null,"createdAt":1587295371421,"updatedAt":1587825939575,"author":"5e9b68b27a1236eccfeb1d24","categories":["life"]}