{"id":"5e9c33d19b6559241525e105","title":"Review: Mystery Jets – Serotonin","content":"<p><a href=\"https://admin.</p><p>crackintheroad.com/uploads/2010/06/IMG_1829.jpg\"><img class=\"alignnone size-large wp-image-1486\" title=\"IMG_1829\" src=\"https://api.crackintheroad.com/wp-content/uploads/2010/06/IMG_1829-1024x682.jpg\" alt=\"\" width=\"800\" height=\"532\" srcset=\"https://api.crackintheroad.com/images/2010/06/IMG_1829-1024x682.jpg 1024w, https://api.crackintheroad.com/images/2010/06/IMG_1829-300x200.jpg 300w, https://api.crackintheroad.com/images/2010/06/IMG_1829-165x110.jpg 165w, https://api.crackintheroad.com/images/2010/06/IMG_1829-950x633.jpg 950w\" sizes=\"(max-width: 800px) 100vw, 800px\" /></a></p>\n<p>Sellouts! Impostors! Fakes! Scream the crowd of baying independent critics, drooling at the thought of another indie pop carcass to gorge upon, in this case London based pop outfit <strong>Mystery Jets</strong>. Following on from a phenomenally successful second album, they were on the receiving end of abuse from much of the obtuse, pompous and opinionated music hierarchy, claiming they had given up on all their morals and ambitions in return for record sales and incentives of increased incomes. However, few asked themselves, since when had <strong>Mystery Jets</strong> been anything else but a  crafted pop band, creating uplifting choruses and melodic vocal harmonies? By no means a case of selling out, more in my mind an example of quality prevailing, which in this instance was in the form of 2008’s album <em>21</em>, as well as hit singles <em>Young Love </em>and <em>Two Doors Down</em>, which quickly embedded themselves in the hearts of numerous festival goers.</p>\n<p>Albeit, the album itself was far from perfect, and was far more filler than killer unfortunately, bar a few standout singles, much of it passed by with a mere whiff of excitement and energy, which faded on repeat listens. So, with this to take into account, <strong>Mystery Jets</strong> return with their third full length offering, Serotonin, released in the UK on July 5 via Rough Trade. Before even hearing a single track from the album, I have a telling inkling of the sort of songs that will feature on the record, as I managed to catch Blaine and Co. headlining at <strong>Dot to Dot Festival </strong>in Manchester. Asides from running through the big singles from sophomore effort 21, they also try out a reasonable amount of new material, including <em>Flash a Hungry Smile</em>, which was recently made available as a free download from the bands site. It would be fair to say I was able to suspect there would be no drastic change from their previous album, no hair raising guitar solos or ten minute slow burning epics, then again, as many indie pop bands try, there is a fading art in perfecting pop songs, and<strong> Mystery Jets</strong> were very much still working on it back in 2008.</p>\n<p>Opener <em>Alice Springs </em>is very much in the vein of <em>21</em>, centred around a catchy chorus, even if the lyrics aren’t of the highest standard, but their ability to construct such a well crafted pop song means they are more than forgiven for any lyrical blunders. <em>Freedom is an illusion, generated by your brain</em>, croons Blaine, not the most intellectual or thought provoking of lines, and the entire album is coated in a layer of sugar so sticky that Robert Green wishes he could have some for his gloves.</p>\n<p>Elsewhere, title track<em> Serotonin</em> is an 80’s disco classic re-incarnated, combining part <strong>A-Ha</strong>, part <strong>Blondie </strong>to effective measures. It’s nothing that hasn’t been done before, but rarely has it been done better, and in more consistent lengths. Light hearted, joyful pop music, perfect to soundtrack the current gorgeous spell of weather we are receiving, whilst most recent single<strong> Dreaming of Another World </strong>is sure to soundtrack World Cup highlights somewhere along the road. Simplistic guitars, and a Disney-esque chorus, assert this song as a sure summer hit. There are few disappointments on the album, as many of the songs contain a formulaic method that leaves a fair few of the songs blending into each other, not a record for those looking for deeply emotionally stirring music. However, if you’re feeling down after a listen of the slightly depressing self titled debut from <strong>The Drums</strong>, then<em> Serotonin </em>may well be the antidote to cure your blues.</p>\n<p style=\"text-align: center;\"><a href=\"https://www.myspace.com/mysteryjets\">Check Out Their Myspace</a></p>\n<p style=\"text-align: center;\"><a href=\"https://www.mysteryjets.com/\">Check Out Mystery Jets Official Site</a></p>\n","slug":"1482-review-mystery-jets-serotonin","category":"music","date":1276869831000,"wpid":1482,"isSticky":false,"featured_image":{"width":3888,"height":2592,"src":"2010/06/img_1829.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAUH/8QAHRAAAgEFAQEAAAAAAAAAAAAAAQIAAwQGERJRcf/EABUBAQEAAAAAAAAAAAAAAAAAAAEE/8QAGREAAgMBAAAAAAAAAAAAAAAAAAIBERID/9oADAMBAAIRAxEAPwDP8Zxipf4zcXIHLq6Ck3WgwJIYEfZHrKqVnV9BlYg69iIZiytezZo//9k="},"createdAt":1587295185631,"updatedAt":1588403566470,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2010/06/img_1829.jpg","categories":["music","reviews"]}