{"id":"5e9c33d09b6559241525e102","title":"Interview: Dog is Dead","content":"<p>Firstly, I must apologise for the tardiness of these posts.</p><p> <strong>Crack in the Road </strong>conducted a series of interviews with artists across the <strong>Dot to Dot Festival</strong>, and it is only now after hours of sifting through material that I have been able to post them. Our interview with <strong>Dog is Dead </strong>marks the first of several interviews from a fantastic festival, including <strong>The Chapman Family </strong>and <strong>Zane Lowe! </strong>Be sure to check out our <a href=\"https://api.crackintheroad.com/music/1220-review-dot-to-dot-festival-manchester\" target=\"_blank\">review of the festival</a> first to get an idea about some of the fantastic new bands we were lucky enough to chat to!</p>\n<p><strong><span style=\"font-weight: normal\">We caught </span>Dog is Dead </strong>just after their set in the <strong>Council Chambers, </strong>and despite an energetic set they did mention that they had<strong> ‘partied a bit too hard’ </strong>over the past few nights! Originating from Nottingham, the band unsurprisingly gained a hugely positive reception at their <strong>Dot to Dot </strong>appearance there. However their support extended past their home grown fans, with venues both at Bristol and Manchester being<strong> ‘rammed’</strong>. Considering that the band began only <strong>‘two years ago as a group of friends’</strong>, <strong>Dog is Dead </strong>have released their debut single <strong>‘Glockenspiel Song’ </strong>and if the Manchester audience’s response was anything to go by, <strong>Dog is Dead </strong>have great successes ahead of them. However this potential is still thankfully grounded, which I couldn’t help but notice as I talked to the band about their past gigging experiences. Telling me that they had <strong>‘done some great shows in London, and some appalling shows’</strong>, and that they’d rather <strong>‘play to the bar staff rather than two stuck up bitches’</strong>. This honest and genuine ethos is obvious in all aspects of the band, from the raw energy of their live performance to their modest yet spirited personalities. While citing<strong> ‘Dire Straits, Paul Simon, and Bowie’ </strong>as influences, <strong>Dog is Dead </strong>summed their music up as <strong>‘</strong><strong>complicated pop-music for jazz junkies and choir folk‘. </strong>Looking past the tongue-in-cheek nature of this description and you can hear it in their music, simply creating a sound that is natural and honest to a group of friends who decided to make music two years ago.</p>\n<p><a href=\"https://www.myspace.com/dogisdeadband\" target=\"_blank\">Dog is Dead Myspace</a></p>\n<p><a href=\"https://admin.crackintheroad.com/music/1257-review-dog-is-dead-glockenspiel-song\" target=\"_blank\">Dog is Dead Review</a></p>\n<p><iframe src=\"https://www.facebook.com/plugins/likebox.php?id=114090381951328&width=292&connections=10&stream=false&header=false&height=255\" scrolling=\"no\" frameborder=\"0\" style=\"border:none; overflow:hidden; width:292px; height:255px;\" allowTransparency=\"true\"></iframe></p>\n","slug":"1490-interview-dog-is-dead","category":"interviews","date":1276908261000,"wpid":1490,"isSticky":false,"featured_image":{"width":3888,"height":2592,"src":"2010/06/dog-is-dead.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAQH/8QAIhAAAQMDAwUAAAAAAAAAAAAAAQIDBAAFEQYSIiEjMUFh/8QAFQEBAQAAAAAAAAAAAAAAAAAAAwT/xAAYEQEAAwEAAAAAAAAAAAAAAAABAAIRIf/aAAwDAQACEQMRAD8Ay/QFgsMu6rjSEOuzlsZjtqdwhe5pRUVcCOOAB46kH1UD2kbeHVhD0IJ3HAVLkZx97NKUdtJTUHiT/9k="},"createdAt":1587295184100,"updatedAt":1588403566444,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2010/06/dog-is-dead.jpg","categories":["interviews","music"]}