{"id":"5e9c2aba9b6559241525d4bd","artists":["5e9b68ec7a1236eccfeb1fad","5e9b69317a1236eccfeb2446"],"title":"News: Pierre Sarkozy, the most expensive DJ in the world","content":"<p>£35,000 for a single flight on a private jet & £150,000 a year on armed bodyguards.</p><p> This DJ has had both paid for by the French government. If you’re anything like me you’re probably wondering how the hell this happened.</p>\n<p>The strange truth is that Pierre Sarkozy isn’t this DJ’s subversive stage name. He really is the eldest son of the current president of France, Nicolas Sarkozy. What’s even stranger is Pierre aka <strong>DJ Mosey</strong> has produced tracks for some of his father’s most vocal critics while the French taxpayer funds his armed bodyguards & ’emergency’ flights.</p>\n<p>Dubbed ‘the most expensive DJ in the world’  Pierre produces hip hop and plays DJ sets at some of  the world’s most exclusive clubs. A <a title=\"Mediapart\" href=\"https://www.mediapart.fr/\">French investigative news website</a> recently revealed that the French president uses taxpayers money to employ armed bodyguards on salaries of £75k a year to protect the 26 year old DJ. He also allowed a presidential jet to be used to collect his son from the Ukraine after he fell ill there. The news comes at a time when Nicolas Sarkozy is already under fire for his alleged abuse of public money.</p>\n<p>In 2003 when Nicolas was still France’s interior minister he criticised rappers for their racist language and initiated legal cases against some for defaming the police. But despite his father’s unpopularity with the underpriveledged french youth, Pierre has collaborated with a number of french rappers including <strong>Posion</strong> a strong critic of Nicolas Sarkozy’s policies. A song he released with a number of other french rappers in 2007 included the lyrics “Anti-Sarko, anti-right, Nicolas you don’t hear.”</p>\n<p>When a French radio station asked Poison about his link to Sarkozy’s son he told them he didn’t know when they started working together. “When I found out, I blew a fuse and phoned him [Pierre Sarkozy]. He said, ‘yeah, but Poison, I didn’t want to tell you because you wouldn’t want to hang out with me anymore.’ I told him, Hey no problem. You’ve never done me wrong. We’ll just do good stuff.”</p>\n<p><iframe src=\"https://www.youtube.com/embed/ergAYm6YMIE\" height=\"315\" width=\"420\" frameborder=\"0\"></iframe></p>\n<p><em>(Some information in this article was translated from the French investigative news site <a href=\"https://www.mediapart.fr/\">MediaPart</a>. The quote from the French rapper Poison was taken from Public Radio International in 2008.)</em></p>\n","slug":"14913-news-pierre-sarkozy-the-most-expensive-dj-in-the-world","category":"music","date":1329136038000,"wpid":14913,"isSticky":false,"featured_image":null,"createdAt":1587292858986,"updatedAt":1588441781898,"author":"5e9b68b27a1236eccfeb1d40","old_image":"generated/ab67616d0000b273a9a8285276ede1a7b998418b.jpg","categories":["music","news"]}