{"id":"5e9c33ca9b6559241525e0f6","title":"Review: AJ Unity – Sweet Roses","content":"<img title=\"AJ Unity\" src=\"https://c4.</p><p>ac-images.myspacecdn.com/images02/137/l_9024dd400d9f4c44a0891da3f2c13c5b.jpg\" alt=\"\" width=\"600\" height=\"599\" />\n<p><strong>Naomi Suzuki</strong> and <strong>Philipp M. Moll </strong>are <strong>AJ Unity,</strong> a duo based around being able to “freely express important parts of being human such as finding inner strength and kindness towards other people”. If that isn’t enough to entice you, then throw into the mix their influences of <strong>Massive Attack</strong> and<strong> Faithless </strong>and you begin to realise they are not your everyday middle of the road group. Soothing vocals harmonies overlaying atmospheric electronic beats work to fantastic effect, creating a brilliant sense of ambience.</p>\n<p><strong>Suzuki’s </strong>vocals are easily comparable to those of Icelandic superstar <strong>Bjork</strong>, carefully constructed and expertly delivered wavering with an optimistic and angelic quality. The <strong>Massive Attack </strong>influences are many and well carried, mainly in the soaring melodies, which float effortlessly alongside <strong>Suzuki’s</strong> vocals. On second track <em>Morning</em> she is accompanied by <strong>Moll’s</strong> spoken word phrases, which are almost to identical to the platonic and recognisable lyrics of <strong>Faithless</strong>. In a short interview I read with the guys, they described <em>Everyday Memories </em>as the track they would ideally play at the moon based launch of the album! The production throughout is slick and professional, nothing ground breaking, but nonetheless a pleasant experience.</p>\n<p>My favourite and most memorable track from the album is the epic, emotional<strong> </strong><em>Jupiter</em>, a thrilling remix of the classic choir track <em>Jerusalem</em>. Providing an entirely fresh and new approach to the song, which I had never heard before, it certainly caught me slightly off guard. Coming in at just over forty minutes, the album is the perfect length, and has enough scope to interest anyone, regardless of your previous musical upbringing and backgrounds. Album closer <em>Adagio</em> is a piano led ballad, which ties together the numerous laces of sounds which weave so ravishingly throughout the record. Over exuberant and wonderfully resplendent, allow this mellow, atmospheric album to charm you into it’s magical lair, and you will reap the rewards.</p>\n<p style=\"text-align: center;\"><a href=\"https://www.ajunity.com/\">Check Out AJ Unity’s Official Site</a></p>\n<p style=\"text-align: center;\"><a href=\"https://www.myspace.com/ajunity\">Check Out AJ Unity’s Myspace</a></p>\n","slug":"1501-review-aj-unity-sweet-roses","category":"music","date":1277206171000,"wpid":1501,"isSticky":false,"featured_image":{"width":600,"height":599,"src":"2011/06/l_9024dd400d9f4c44a0891da3f2c13c5b.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFwAAAwEAAAAAAAAAAAAAAAAAAwUGB//EACYQAAEDAwIFBQAAAAAAAAAAAAECAxEEBQYAIQcSIkGRFBUjUYH/xAAUAQEAAAAAAAAAAAAAAAAAAAAA/8QAFBEBAAAAAAAAAAAAAAAAAAAAAP/aAAwDAQACEQMRAD8AoMyrLbjq/Z7DaqWubaFO3WLIJ9MtZBBV1byOmI2JBntrOTxgxxJ5XsIbLg2Vy1gie8SifOj2T5c64hPO9byQ2kOK3UAFp2B/B4GldvpmDQUxLDRJaTJKB9DQf//Z"},"createdAt":1587295178261,"updatedAt":1588403566341,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/06/l_9024dd400d9f4c44a0891da3f2c13c5b.jpg","categories":["music","reviews"]}