{"id":"5e9c33b99b6559241525e0e4","title":"Interview: Goldheart Assembly","content":"<p>They were the first band in ‘many years’ to record a live session for <strong>BBC Radio 1</strong>‘s <strong>Steve Lamacq </strong>whilst still being unsigned, and recorded a majority of their first album at an Industrial Steam Museum.</p><p><strong> </strong>Therefore when <strong>Crack in the Road </strong>got the opportunity to interview <strong>Goldheart Assembly</strong>, we found a band that was as original and engaging in their music as they were in their topical banter.</p>\n<p>Greeted by their audacious Tour Manager threatening to wee into lead vocalist <strong>John Herbert</strong>‘s shoe, I immediately realised this would not, thankfully, be a straight forward Q and A. After this initial weak bladder induced threat passed, <strong>Goldheart Assembly </strong>rather modestly admitted they were surprised that <strong>Academy 2 ‘was packed’ </strong>during their set, but highlighted that<strong> Dot-To-Dot </strong>allowed fans to move from venue to venue with ease to make the most of the bands on show. However the band said this was entirely different from their recent <strong>Camden Crawl </strong>experience, where <strong>‘fans were too scared to leave a venue’ </strong>incase they were stuck in inevitable and never ending queues. This enjoyment of the free spirited nature within <strong>Dot-To-Dot </strong>was echoed in the band’s origins, who <strong>‘started singing together for a laugh’</strong> and by <strong>‘doing gigs in central London, and as a result we grew out of  a collective of bands’</strong>. Such honest and casual beginnings remain distinct in a band that is now constantly being tipped as the ‘next big thing’; a claim that is validated by the fact that <strong>Goldheart Assembly </strong>are opening the <strong>BBC Radio 1/NME Stage </strong>on the Saturday (Leeds) and Sunday (Reading). However while we can all get excited about the potential of lofty successes, <strong>Goldheart Assembly </strong>also revealed that their worst gigging experience came in the form of <strong>‘driving seven hours to Aberdeen to play to two people ‘. </strong>They made us aware that this sort of event was by no means a one off, and perhaps it is this organic and slow formation that has moulded <strong>Goldheart Assembly </strong>into the eclectic and genuine musical collective that it is. <strong>John Herbert </strong>revealed that his personal major influence was American dream pop trio <strong>Galaxie 500</strong>, and while you can hear some of that come through in <strong>Goldheart Assembly</strong>‘s music, it also demonstrates how many other influences have infused the unique sound they have managed to create.</p>\n<p>The fortunate positioning of a <strong>Pieminister </strong>outlet allowed me to ask the character acid test:</p>\n<p>What do you think of <strong>Greggs</strong>?</p>\n<p>To my relief there was a resounding positive response, with shouts of ‘<strong>Sausage and Bean Melts are the bollocks’ </strong>and <strong>‘Eatable pastry clothes, designed by Greggs!’ </strong>There was even an expression of interest in headlining a<strong> Greggs</strong> sponsored music festival, so watch this space!</p>\n<p>An absolute joy to interview and a thoroughly engaging band to listen to, make sure to catch <strong>Goldheart Assembly </strong>at one of their many festival dates across the summer!</p>\n<p><a href=\"https://www.myspace.com/goldheartassembly\" target=\"_blank\">Goldheart Assembly Myspace</a></p>\n<p><a href=\"https://api.crackintheroad.com/music/1220-review-dot-to-dot-festival-manchester\" target=\"_blank\">Dot-To-Dot Festival Review</a></p>\n<p><iframe src=\"https://www.facebook.com/plugins/likebox.php?id=114090381951328&width=292&connections=10&stream=false&header=false&height=255\" scrolling=\"no\" frameborder=\"0\" style=\"border:none; overflow:hidden; width:292px; height:255px;\" allowTransparency=\"true\"></iframe></p>\n","slug":"1503-interview-goldheart-assembly","category":"interviews","date":1277424048000,"wpid":1503,"isSticky":false,"featured_image":{"width":3888,"height":2592,"src":"2010/06/goldheart-assembly.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAIF/8QAHxAAAwABAwUAAAAAAAAAAAAAAQIDABEhUQQFBhIi/8QAFQEBAQAAAAAAAAAAAAAAAAAAAwX/xAAZEQEAAwEBAAAAAAAAAAAAAAABAAIDESH/2gAMAwEAAhEDEQA/AMunkPUrOqlWVlqFCqq+tEG2vIP0cmnctKMAtBueMYyNfR4ARTe9fBn/2Q=="},"createdAt":1587295161723,"updatedAt":1588403566182,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2010/06/goldheart-assembly.jpg","categories":["interviews","music"]}