{"id":"5e9c2a909b6559241525d4a2","artists":["5e9b691e7a1236eccfeb230d"],"title":"Introducing: Mentalease","content":"<p>There’s been much made of the so called ‘shoegaze revival’ in recent years, with the likes of <strong>The Twilight Sad</strong>, <strong>The Horrors</strong> and <strong>The Pains Of Being Pure At Heart</strong> attempting to write a modern translation of the echo laden vocals and reverb doused guitars that stereotyped the late 80’s.</p><p> Whilst there were some valiant efforts (see<em> <strong>Primary Colours</strong></em>), there was still an underlying feeling that they lacked a true understanding of the creative ethos that made shoegaze such an emotionally inspiring genre.</p>\n<p>Take one listen to the riff on<strong> Mentalease’s</strong> <em>Thoughts Seize</em> and you’ll soon realize that <strong>Spencer Harris</strong> doesn’t just sympathize with the groundings of the genre; it’s practically a second language to him. It’s a riff that I’m sure <strong>My Bloody Valentine</strong> would be proud of, and that is truly the highest accolade anyone can offer a shoegaze fanatic. <strong><em>Entropy Rising</em></strong>, the debut five track release from <strong>Mentalease</strong>, the solo project of the aforementioned <strong>Spencer Harris</strong> is a glorious collection of tracks, and one of the finest EP’s I’ve heard in several years.</p>\n<p>Elsewhere on the release there’s the sultry drone of <em>Sleep Paralysis</em>, the soundtrack to a dream you never had, and the vicious drive of opener <em>Levitate</em>, a track that’s both expansive yet wonderfully intimate. Backing female vocals lapse in and out across the course of the five tracks, adding a stunning level of inner conflict. It’s clear that these are extremely personal songs, yet by fashioning them in such a splendid way, <strong>Mentalease</strong> has allowed everyone a peak inside his world.</p>\n<p>Check out my personal favourites below, <em>Thoughts Seize</em> and <em>Sleep Paralysis</em>, then head over to the <strong>Mentalease</strong> bandcamp to grab the whole EP for free.</p>\n<p><iframe style=\"position: relative; display: block; width: 400px; height: 100px;\" src=\"https://bandcamp.com/EmbeddedPlayer/v=2/track=1446132279/size=venti/bgcol=FFFFFF/linkcol=4285BB/\" frameborder=\"0\" width=\"400\" height=\"100\"></iframe></p>\n<p><iframe style=\"position: relative; display: block; width: 400px; height: 100px;\" src=\"https://bandcamp.com/EmbeddedPlayer/v=2/track=422960261/size=venti/bgcol=FFFFFF/linkcol=4285BB/\" frameborder=\"0\" width=\"400\" height=\"100\"></iframe></p>\n","slug":"15093-introducing-mentalease","category":"introducing","date":1329354280000,"wpid":15093,"isSticky":false,"featured_image":null,"createdAt":1587292816431,"updatedAt":1588441781446,"author":"5e9b68b27a1236eccfeb1d27","old_image":"generated/c99d32314769152c408c665545ef162447276121.jpg","categories":["introducing","mpfree","new","music"]}