{"id":"5e9c33cc9b6559241525e0f9","title":"Review: Eminem – Recovery","content":"<p>Tortured often comes before genius, especially in the case of <strong>Marshall Bruce Mathers III</strong>.</p><p></p>\n<p>His meticulous lyrical selection and inimitable rap character ‘<strong>Eminem</strong>’, has indisputably carved his name alongside the <strong>Tupac’s </strong>and <strong>Biggie’s</strong> of his chosen genre. Unfortunately given the nature of human greed, fans and critics alike, always want <strong>Marshall </strong>to achieve the impossible.</p>\n<p>Given the seismic shift of rap away from the raw and rugged project beats of its godfathers, to a more techno sounding vibe, <strong>Eminem </strong>has eschewed away from the mainstream culture and continued to imprint his originality onto an ever altering scene.</p>\n<p>‘<em>Recovery</em>’ is the second album following <strong>Shady’s</strong> self inflicted asceticism from his ambivalent career. The sampling is as single minded and revolutionary as ever, with <strong>Haddaway’s</strong> ‘What Is Love’ Euro-dance ballad, flawlessly incorporated into the track ‘<em>No Love</em>’ with an audacity only achievable if you happen to be <strong>Eminem</strong>, or evidently ‘<strong>Lil Wayne</strong>’.</p>\n<p>His persona has always suggested he strives to remember who aided him on his ascent to the top. The collaboration with <strong>Dr Dre</strong> on ‘<em>So Bad</em>’ is a nostalgic attempt, as master and scholar painstakingly pursue the now elusive zenith of previous<strong> Shady</strong> albums. A vignette each from <strong>Pink</strong> (‘<em>Won’t Back Down</em>’) and<strong> Rihanna</strong> (‘<em>Love the Way You Lie</em>’) supplement my personal judgment that Slim has not been completely proficient in evoking the wit and <strong>Biggie</strong>-esque dexterity to tell a story, that was a radiating feature in the superhuman compilations of ‘<em>Encore</em>’ and the ‘<em>Eminem Show</em>’.</p>\n<p>Up to this point this review is objective; however I deem it necessary to award the track ‘<em>Not Afraid</em>’ its own paragraph.</p>\n<p>It is a rarity for an artist to dissect their soul, re-constitute the former and construct from this an anthemic yet shrewd track which will sit eternally pretty in the chasms of time. ‘<em>Not Afraid</em>’ is a triumph. A triumph of human endeavour, a triumph of articulation and above all else a vital triumph of one man facing and seemingly beginning to conquer his demons. We as fanatics, probably assisted <strong>Eminem </strong>into the bottomless pit of depression and the vicious cycles of various addictions (I hasten to add he’s bright enough to accept this as an occupational hazard) yet this track acts as a vindication, as <strong>Eminem</strong> melodically and poetically portrays his rebirth through his timeless medium of the vernacular of the Motor City.</p>\n<p>This album threatens to take its place amongst the greats yet infuriatingly never truly delivers. His pinnacle is a distant wonder. However, tracks such as ‘<em>Not Afraid</em>’ and the rage induced ‘<em>Cold Wind Blows</em>’ gives the world a tantalising glimpse into the illusory talents of the crowned King of Rap. There is most certainly a maturity there, it’s better than ‘<em>Relapse</em>’, as I said, we expect <strong>Marshall</strong> to achieve the impossible. One of the best albums of its genre this year, unquestionably. Nevertheless it just doesn’t live up to previous exploits; but how on earth can we ask that of this mercurial icon?</p>\n<p>8/10.</p>\n","slug":"1516-recovery-review","category":"music","date":1277148262000,"wpid":1516,"isSticky":false,"featured_image":{"width":500,"height":500,"src":"2010/06/em.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAABgEH/8QAIRAAAgIBBAIDAAAAAAAAAAAAAQIDBBEABhMhBRIiI1H/xAAVAQEBAAAAAAAAAAAAAAAAAAACA//EABkRAQACAwAAAAAAAAAAAAAAAAEAAhEhMf/aAAwDAQACEQMRAD8AHba8Tt2xtilUt0Zl541kjtrXQsoA+xic/IFv09AAayu9S8THdsJFcR41kYK3HjIz0dWnbspt6tGliZU5JB6hyBjA6xo0dQrVbO41Mcn/2Q=="},"createdAt":1587295180168,"updatedAt":1588403566366,"author":"5e9b68b27a1236eccfeb1d42","old_image":"2010/06/em.jpg","categories":["music","reviews"]}