{"id":"5e9c2a799b6559241525d490","artists":["5e9b69047a1236eccfeb213e","5e9b694b7a1236eccfeb25d4"],"title":"Introducing: HOWL / Teen Suicide Cult","content":"<p>It appears that the rather tongue-in-cheek Lucifer Youth cult that<strong> WU LYF</strong> have been pioneering for the past couple of years is beginning to spawn a host of startlingly similar imitators.</p><p> Overuse of the morphed crucifix, attempted veiling of basic information and the excruciatingly repetitive nature surrounding a mysterious, ‘quirky’ image does in fact become tiresome very quickly, and hugely detracts from the quality of the music, as we found out with <a href=\"https://api.crackintheroad.com/music/12660-introducing-coasts/\" target=\"_blank\">Coasts</a>. To be frank, it’s getting dull. London’s <strong>Teen Suicide Cult</strong> could be accused of trying slightly too hard; describing themselves as “a movement… the past… the future …. a collection of artists, directors and musicians who see things differently.” is a fairly idealized and introvert form of self-description, when realistically, all they will be judged upon is the quality of the art that they produce, not all the bullshit surrounding it.</p>\n<p>At this stage, it appears that as a collective, <strong>Teen Suicide Cult</strong> haven’t yet got the material under their belts to back up this rather arrogant approach to promotion, although you can forgive them for that, given their tender ages, with none of them yet to break the 18 mark. Thankfully however, one of their ‘members’, <strong>HOWL</strong> displays genuine talent, and should they mature and move on from the exhausted <strong>WU LYF</strong>-inspired persona, then I have no doubt that the duo have the potential to be extremely successful. Most recent release <em>Bad Milk / Believe</em> is by far their finest, with the R&B influenced beat of <em>Believe</em> proving particularly intriguing. On the flip side <em>Bad Milk</em> is a more refined affair, focusing on the vocal strengths of <strong>HOWL</strong>, sampling their own singing to fantastic effect. So, despite the initial tone of this article seeming rather condescending or even negative, I’m truly excited by <strong>HOWL</strong>; if only they’d drop the act.</p>\n<p>Check out both tracks below.</p>\n<p><iframe width=\"100%\" height=\"450\" scrolling=\"no\" frameborder=\"no\" src=\"https://w.soundcloud.com/player/?url=http%3A%2F%2Fapi.soundcloud.com%2Fplaylists%2F1417271&show_artwork=true\"></iframe></p>\n","slug":"15185-introducing-howl-teen-suicide-cult","category":"introducing","date":1329693590000,"wpid":15185,"isSticky":false,"featured_image":{"width":165,"height":165,"src":"2012/02/325314_260529210675359_176104145784533_760495_836895985_o-165x165.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAABgUH/8QAIhAAAQQBAgcAAAAAAAAAAAAAAQACAxEEBRIHIjEzQXHR/8QAFAEBAAAAAAAAAAAAAAAAAAAABP/EABoRAAIDAQEAAAAAAAAAAAAAAAECAAMREjH/2gAMAwEAAhEDEQA/AMp0rXsnHJMwl3A3bqNpO3iNmNaAIhQFdT9QiJodiN3AHk8hS5O472UQ1q3ojnrQ50Nn/9k="},"createdAt":1587292793234,"updatedAt":1588443775704,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2012/02/325314_260529210675359_176104145784533_760495_836895985_o-165x165.jpg","categories":["introducing","mpfree","new","music"]}