{"id":"5e9c33c59b6559241525e0ed","title":"Bloodstock Festival","content":"<p>When considering the British summertime, we often think ill-equipped, home grown tennis players, strawberries and cream, embarrassment courtesy of the Australians and endless moaning at our geographical situation.</p><p> A common theme of summer in the<br />\nmajority of this nation’s eyes is categorically not Heavy Metal.</p>\n<p>The Bloodstock Open Air Festival transforms the picturesque setting of Catton Hall in Walton-Upon-Trent into a 3 day pilgrimage of all that is grungy, satanic and sadistic (musically) for those who relish the merits of this dark head- banging art.</p>\n<p>This festival is only in its infancy, begun by Paul Gregory and Vince Brotheridge in 2005 (its predecessor was actually founded in 2001 and played indoors), and is the complete antithesis of the titanic efforts of Glastonbury and Reading. Although given its niche appeal and robustly passionate nucleus of Metal Heads , you get the feeling the Bloodstock patrons would like to keep their corner of Catton Hall forever sacred.</p>\n<p>One of ‘Death Metal’s’ more sinister lyricist’s ‘Cannibal Corpse’ will be high up in the billing on the Sunday. For those who aren’t familiar with this Buffalo 5 pieces’ distinctive use of vocabulary, here is a snippet from their 1991 album ‘Butchered at Birth’ and their tour de force ‘Meat Hook Sodomy’; ‘Deterioration of grated genitals, dangling from the hooks, obscene feelings deep inside me, dislocating, separating a blood drenched body’. ‘Niche’ perhaps doesn’t do it justice. It would be unwarranted and likewise, a disservice, to categorize the entire occasion by one band, although any budding Lothario is well-advised to deter from such explicit lines.</p>\n<p>Bands such as the ‘Black Spiders’, out of the ‘Motorhead’ mould of Hard Rock, with a weighty beat and axe grinding guitars give this festival its slightly more conventional edge, potentially attracting festivalistas who would have been previously sceptical about attending such an acquired taste of a gig. Furthermore, bands akin to ‘Amorphis’ offer the versatility. What began as a Finnish death metal outfit in 1990, now have a repertoire also touching on progressive and folk metal. These unusual bands are nothing if not captivating from their stories of life in the metallic abyss.</p>\n<p>Festival’s such as Bloodstock offer a totally diverse experience to that of Leeds or V. Admittedly the music is poles apart and the Bloodstock audience thrives on their divergance from run of the mill festivals. Dare to be different this summer; the 13th 14th and 15th of August amongst the greenery of Catton Hall, is a prime spot to be.</p>\n","slug":"1520-bloodstock-festival","category":"music","date":1277237888000,"wpid":1520,"isSticky":false,"featured_image":{"width":435,"height":435,"src":"2010/06/bloodstock-2010.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAABgAH/8QAIBAAAwABBAIDAAAAAAAAAAAAAQIDEQAEBSEGEjFBcf/EABUBAQEAAAAAAAAAAAAAAAAAAAID/8QAGhEBAQADAQEAAAAAAAAAAAAAAgEAAxFBUf/aAAwDAQACEQMRAD8AzPj9tw8K7JUltSomoYj1y2QPvvGq/A+Oteje0VyxOAOh3+6KcXaqcRBko6sJnBDEHRG9Ha1GZ2JLEkk/PepgUpK3vcezZGCYZOe/c//Z"},"createdAt":1587295173370,"updatedAt":1588403566259,"author":"5e9b68b27a1236eccfeb1d42","old_image":"2010/06/bloodstock-2010.jpg","categories":["music"]}