{"id":"5e9c2a639b6559241525d47e","artists":["5e9b69637a1236eccfeb2729"],"title":"Review: Wyatt Overman – Fires","content":"<p>Since the release of <strong>Kim Janssen’s</strong> seminal 2009 album <strong><em>The Truth Is, I Am Always Responsible</em></strong>, I’ve dismissed a vast proportion of folk music.</p><p> Whether that’s down to the unfortunate success of faux-folk outfit <strong>Mumford & Sons</strong> thus tarring the genre with an almighty depressing brush, or sheer ignorance on my part; I’d wager it’s probably a combination of the two. Either way, I apologise, and I hope that this insight into <strong>Wyatt Overman’s</strong> <em>Fires</em> will prove more than satisfactory in repairing the damage.</p>\n<p>Hailing from Minneapolis, <strong>Overman’s</strong> debut LP seemingly appeared from nowhere and with no prior releases featuring on the record, makes for a completely refreshing listening experience. Having stumbled upon three of his tracks whilst the songwriter was in the middle of uploading them to his bandcamp, I <a href=\"https://api.crackintheroad.com/music/15182-introducing-wyatt-overman/\" target=\"_blank\">chronicled my thoughts</a> in an attempt to demonstrate the beauty that the trio of songs possessed, however upon refreshing the page several hours later, I discovered that during that time, the other four pieces had successfully been uploaded. On <strong><em>Fires</em></strong>, <strong>Overman</strong> bares all, revealing intimate secrets and crystal clear memories.</p>\n<p>It’s a record of immense character and such tender personality, that in writing about it, I almost feel like I’m betraying the deepest confidence that <strong>Overman</strong> intrusts the listener with. Opener <em>Loom</em> finds <strong>Wyatt’s</strong> songwriting at it’s most expansive, encompassing layered vocals and a wistful piano section, whilst showcasing the diversity of <strong>Overman’s</strong> music. <em><strong>Fires</strong></em> is a record that excels upon exhibiting as much of the artists inner demons as possible, most prominently through the touching and brutally honest lyrics. It burns passionately throughout, yet flickering with it’s at times desirably nervous nature. There’s the desperate plea of <em>Grace</em>, coupled with the sentimental cry of Islands, all serving to build an unbreakable connection between the songs and the listener.</p>\n<p><iframe style=\"position: relative; display: block; width: 400px; height: 100px;\" src=\"https://bandcamp.com/EmbeddedPlayer/v=2/track=2342759344/size=venti/bgcol=FFFFFF/linkcol=4285BB/\" frameborder=\"0\" width=\"400\" height=\"100\"></iframe></p>\n<p><em>‘When I was younger all I feared was the rising sun, trade it for the city fall in love with a woman’</em> weeps <strong>Overman</strong> on the scintillating build, a track that a sixteen year old version of myself yearns to have written for a girl I (mistakenly) fell in love with. In truth, there are moments that escape my limited descriptive abilities, the aforementioned Island being a particular highlight, whilst the devastatingly fragile <em>Someday</em> closes <strong><em>Fires</em></strong> in a manner that transcends our fickle, modern visions of beauty.</p>\n<p><iframe style=\"position: relative; display: block; width: 400px; height: 100px;\" src=\"https://bandcamp.com/EmbeddedPlayer/v=2/track=3545181065/size=venti/bgcol=FFFFFF/linkcol=4285BB/\" frameborder=\"0\" width=\"400\" height=\"100\"></iframe></p>\n<p>As a debut record, it’s a sensational offering; unique, highly personal and resoundingly divine. Like I still recall when I first heard <strong>Kim Janssen’s</strong> sublime songwriting, I have a gut feeling that in three years from now, I’ll witness a similar heart-melting feeling upon hearing <strong>Wyatt Overman</strong>, and his immaculate <strong><em>Fires</em></strong>.</p>\n<p><em><strong>Fires</strong></em> is out now via <a href=\"https://wyattoverman.bandcamp.com/\" target=\"_blank\"><strong>Wyatt Overman’s</strong> bandcamp</a>, available on a limited edition CD run</p>\n","slug":"15280-review-wyatt-overman-fires","category":"music","date":1330033797000,"wpid":15280,"isSticky":false,"featured_image":null,"createdAt":1587292771598,"updatedAt":1587825901413,"author":"5e9b68b27a1236eccfeb1d27","categories":["music","reviews"]}