{"id":"5e9c33c89b6559241525e0f3","title":"Review: Tokyo Police Club – Champ","content":"<p><a href=\"https://admin.</p><p>crackintheroad.com/uploads/2010/06/TPC1.jpg\"><img class=\"alignnone size-full wp-image-1540\" title=\"TPC1\" src=\"https://api.crackintheroad.com/wp-content/uploads/2010/06/TPC1.jpg\" alt=\"\" width=\"800\" height=\"533\" srcset=\"https://api.crackintheroad.com/images/2010/06/TPC1.jpg 800w, https://api.crackintheroad.com/images/2010/06/TPC1-300x199.jpg 300w, https://api.crackintheroad.com/images/2010/06/TPC1-494x329.jpg 494w, https://api.crackintheroad.com/images/2010/06/TPC1-165x109.jpg 165w\" sizes=\"(max-width: 800px) 100vw, 800px\" /></a></p>\n<p><strong>Tokyo Police Club’s</strong> new album, <em>Champ,</em> appears on first listening to be a less passionate version of their second EP, <em>A Lesson in Crime</em>, compromising of less screaming the likes of ‘<em>Operator, get me the President of the world. This is an emergency’ </em>followed by sharp guitars and even sharper lyrics. But looking deeper into this new album reveals that the passion and love of music still resides in this band, even after the extensive touring and recording over the past 5 years. Also, despite the lack of youthful exclamations, there is no other proof this band has <em>really </em>grown up with lyrics such as ‘I wanna tell you there’s a really good reason why I came home wasted in the middle of the night’.</p>\n<p>New styles have been adapted too which suggests the progression this band has made over the years, with <strong>Foals</strong>-eske guitar/keyboard combination in the song, <em>Bambi</em>, which bounce around the song like, well…a young deer. Furthermore, the songs in this album appear to be a deliberate attempt to shake of the shackles of being a band that ‘sounds a bit like <strong>The Strokes</strong>‘, giving <strong>Tokyo Police Club </strong>an overdue unique sound that would appeal to a wider audience than perhaps their past songs have failed to achieve. Personally, I love their old stuff despite what they were labelled, and <em>Champ</em>‘s<em> </em>maturity has allowed me to appreciate the band even more as it almost appears their musical style has grown up at the same rate as myself, despite how abstract that sounds. The likes of <em>Hands Reversed </em>is a song that proves my case, due to its slow pace and almost eerie vocals and instrumentals I probably wouldn’t have given it a second listen if it were on <em>A Lesson in Crime </em>or <em>Elephant Shell</em> in 2007 & 2008 respectively, but now in 2010 it is the ideal song, and indeed album as a whole, to show how opinions and taste can change over the years.</p>\n<p>This album is due to be released on 19/7/2010, and has the makings and potential to be a great seller across their reasonably large UK fanbase and I would imagine that it will create many more fans as it will no doubt have extensive air play due to the anticipation of the release. Overall, I would recommend this album wholeheartedly to all <strong>Tokyo Police Club </strong>fans and even more so to anyone who has not heard their stuff before, it will be a great album to while away the summer with.</p>\n<p><a href=\"https://tokyopoliceclub.com/\">Tokyo Police Club Official Site</a></p>\n<p><a href=\"https://www.myspace.com/tokyopoliceclub\">Tokyo Police Club on MySpace</a></p>\n","slug":"1539-review-tokyo-police-club-champ","category":"music","date":1277219813000,"wpid":1539,"isSticky":false,"featured_image":{"width":800,"height":533,"src":"2010/06/tpc1.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAQH/8QAIRAAAgIBAgcAAAAAAAAAAAAAAQIDBAAFQQYRISI0QnL/xAAVAQEBAAAAAAAAAAAAAAAAAAAEBf/EABkRAQEAAwEAAAAAAAAAAAAAAAECAAMxEf/aAAwDAQACEQMRAD8AyPQNSs8RwR1Zr7VJ43DJakLuTGPTt6jc88suaDYitzxmNyUdl8s7H4xjBNMKHMoRrNp7Xc//2Q=="},"createdAt":1587295176443,"updatedAt":1588403566314,"author":"5e9b68b27a1236eccfeb1d07","old_image":"2010/06/tpc1.jpg","categories":["music","reviews"]}