{"id":"5e9c33c39b6559241525e0ea","title":"Review: Islet – Celebrate This Place EP","content":"<p><a href=\"https://admin.</p><p>crackintheroad.com/uploads/2010/06/IMG_1355.jpg\"><img class=\"alignnone size-large wp-image-1572\" title=\"IMG_1355\" src=\"https://api.crackintheroad.com/wp-content/uploads/2010/06/IMG_1355-1024x682.jpg\" alt=\"\" width=\"800\" height=\"532\" srcset=\"https://api.crackintheroad.com/images/2010/06/IMG_1355-1024x682.jpg 1024w, https://api.crackintheroad.com/images/2010/06/IMG_1355-300x200.jpg 300w, https://api.crackintheroad.com/images/2010/06/IMG_1355-165x110.jpg 165w, https://api.crackintheroad.com/images/2010/06/IMG_1355-950x633.jpg 950w\" sizes=\"(max-width: 800px) 100vw, 800px\" /></a>Personally, one of my most highly anticipated releases of the year, <em>Celebrate This Place </em>is the debut EP from Welsh multi-instrumental group<strong> Islet</strong>. After seeing them for the first time supporting <strong>Los Campesinos!</strong> back in February, I have taken up an almost obsessional interest in the band, eagerly awaiting their first release. In my mind, what really sets them apart from other noise punk revivalists is there raw energy and fantastic enthusiasm, especially in their live performances which are electric, albeit unconventional when being witnessed for your primary occasion.</p>\n<p>Whilst it shouldn’t supplement or detach anything from the music, also intriguing is the bands uncanny habit of entirely shunning the internet, which seems almost recklessly foolish in these modern and digitised times. However, there is something remarkably respectable about a band having so much confidence in the quality of their music and performances, that they don’t feel the need to virally force feed it to the masses by the medium of the web. So, in true <strong>Islet </strong>fashion, their first release is a 12″ EP, featuring six songs, all of which make up a majority of their enthusiastic live performances.</p>\n<p>It would be difficult for any band who are so ferocious live, to be able to replicate this on record, however they do an adequate job, really showcasing the potential this fantastic four piece have. Utilising complex vocal sounds and over-exuberant drumming, they have managed to create an EP that is energetic, lively and original. Meeting in a secluded dark alleyway, somewhere between <strong>Friendly Fires</strong> and <strong>Test Icicles</strong>, part screams, part sung words. It is entirely a stop start affair, with songs changing direction just as fast as they echo in their live performances. EP highlight is <em>Jasmine</em>, a bass driven tune, building up with caterwauls and pleasant woo-hoo’s, to an epic climax, again showing off the fine drumming talent at their dispense. <strong>Los Campesinos! </strong>have already asserted themselves as huge fans of<strong> Islet</strong>, and debut release <em>Celebrate This Place </em>is an extremely positive and boisterous nose in the right direction, although it is no substitute for being able to witness their tempestuous and turbulent live sets.</p>\n<p style=\"text-align: center;\"><a href=\"https://www.isletislet.com/listen.html\">Listen To Celebrate This Place</a></p>\n","slug":"1547-review-islet-celebrate-this-place-ep","category":"music","date":1277324441000,"wpid":1547,"isSticky":false,"featured_image":{"width":3888,"height":2592,"src":"2010/06/img_1355.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAUH/8QAIxAAAQMDAgcAAAAAAAAAAAAAAgEFEQADBAYSBxMhIjEy4f/EABQBAQAAAAAAAAAAAAAAAAAAAAP/xAAYEQEAAwEAAAAAAAAAAAAAAAABAAIRMf/aAAwDAQACEQMRAD8AxLSDLj6laHKydzmueDjlex8cpHeC+yoXjsidqxMrFWA4cuJAKo4hCpPQPtKUXNiXXQJ//9k="},"createdAt":1587295171572,"updatedAt":1588403566234,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2010/06/img_1355.jpg","categories":["music","reviews"]}