{"id":"5e9c34899b6559241525e243","title":"The Return of the Gods","content":"<p>Godspeed You! Black Emperor were never ones for talking.</p><p> Staying shy of the media gained them a reputation for being unfriendly, uncooperative, and – possibly most of all – mysterious. Never officially breaking up, the band announced that they were taking an extended break in 2003. Since then, members have gone on to perform under various names, in projects such as Set Fire to Flames, Fly Pan Am and, most notably of all, Thee Silver Mt. Zion Memorial Orchestra. Founded by Godspeed members Efrim Menuck, Sophie Trudeau and Thierry Amar, Thee Silver Mt. Zion Memorial Orchestra went on to release several albums and tour the world extensively, with their latest effort, <em>Kollaps Tradixionales</em>, appearing in February this year. With the band growing more media friendly, and Efrim keen to break away from the post-rock tag the band had been given (even going as far as to associate the band with punk rock), it truly looked like the end of Godspeed You! Black Emperor forever.<br />\nSo, as many stayed up on Thursday night for the announcement of who would curate ATP’s <em>Nightmare Before Christmas</em> this year, there was almost universal shock when the announcement was made: GODSPEED YOU BLACK EMPEROR to curate <em>Nightmare Before Christmas</em>. In an <a href=\"https://www.1119732.net/\" target=\"_blank\">official statement made by the band</a>, they reveal that on top of ATP, they will be playing “a handful of British and European shows, and then 9 American towns” as well as, in true Godspeed style, declaring that they will not be doing any interviews. Whilst there’s no plans for a new album yet, they rule nothing out, and there are still <a href=\"https://www.archive.org/details/gybe2003-05-14.shnf\" target=\"_blank\">old live songs that we are yet to hear recorded</a>. But I’m sure for many fans who thought they would never get an opportunity to witness the triumph of Godspeed You! Black Emperor live, just this one chance to fulfil their dreams will be enough. For now, at least.</p>\n","slug":"155-the-return-of-the-gods","category":"music","date":1270975209000,"wpid":155,"isSticky":false,"featured_image":{"width":670,"height":335,"src":"2010/04/gsbanner.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAFAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAUH/8QAHhAAAgEFAQEBAAAAAAAAAAAAAQIDAAQFERIhMVH/xAAVAQEBAAAAAAAAAAAAAAAAAAAAAf/EABgRAQADAQAAAAAAAAAAAAAAAAEAEiEx/9oADAMBAAIRAxEAPwDCcbkrS7zGP6w1jFAEZJIY3m5lJQ6Zizk7B0fCB5U2K9hSJFezR3AALmRx0f37SlBrpLZ5P//Z"},"createdAt":1587295369959,"updatedAt":1588403569174,"author":"5e9b68b27a1236eccfeb1d14","old_image":"2010/04/gsbanner.jpg","categories":["music"]}