{"id":"5e9c2a1e9b6559241525d420","title":"KONY 2012: Propaganda and Social Networking","content":"<p><a href=\"https://admin.</p><p>crackintheroad.com/life/15532-kony-2012-propaganda-and-social-networking/attachment/img_2941-2/\" rel=\"attachment wp-att-15534\"><img class=\"alignleft size-medium wp-image-15534\" title=\"IMG_2941\" src=\"https://api.crackintheroad.com/uploads/2012/03/IMG_29411-260x173.jpg\" alt=\"\" width=\"260\" height=\"173\" /></a></p>\n<p>It’s probably safe to assume that if you’ve found this article, you’re internet-savvy enough to have already been exposed to the <strong>Kony 2012</strong> campaign. With well over 2 million views on YouTube and 5.2 million views on Vimeo, as well as countless shares around Twitter and Facebook, the campaign has certainly proven true its own claim about the power of social media in changing the world. And why shouldn’t it be successful? Millions of people around the world coming together to stop the crimes of an evil man and make the world a better place – that sounds pretty ideal. And call me cynical, but I think we can assume that to believe things are that simple is staggeringly naïve.</p>\n<p>This morning, I came across <a href=\"https://visiblechildren.tumblr.com/\" target=\"_blank\">this</a> and <a href=\"https://innovateafrica.tumblr.com/post/18897981642/you-dont-have-my-vote\" target=\"_blank\">this</a> –<strong> Visible Children</strong> is a self-professed critique of <strong>Kony 2012</strong> written by <strong>Grant Oyston</strong>, a student at Acadia University, Canada, whilst <strong>You Don’t Have My Vote</strong> is a fantastic article which exposes some major flaws with the campaign. They’re worth a read, certainly, and the issues they bring up are startling. It seems that there are a variety of problems with the campaign that transform it entirely from the shining beacon of light and progress in Uganda that it presents itself as, into an altogether more worrying and (dare I say it?) horrifying affair. From the seemingly harmless (such as the use of donations on ‘staff salaries, travel and transport’) to the more disturbing (such as the group’s support of the highly questionable Ugandan military, the revival of the ‘White Saviour’ and a radical desire for military intervention into the country), these writers really rather effectively pick apart the flaws in the<strong> Invisible Children</strong> group. However, I’ll leave it to you to make your mind up about the group’s ethics and message. What I found far more worrying, upon waking up this morning to a world gripped with Kony-fever, is the sheer power of propaganda on display.</p>\n<p>Take a look at our featured image for this article – those men are the group’s leaders posing with weapons and members of the Sudan Liberation Army. There is no doubt that <strong>Invisible Children</strong> are radical to at least some extent. As I’ve expanded on above, it is also somewhat clear that whilst the group’s overall aim is honourable, their methods are questionable. But what they’ve done, with a half hour video, some posters and some Facebook/Twitter accounts, is create a façade that the entire world has blindly bought into. As I write, ‘#stopkony’, ‘Uganda’ and ‘<strong>Invisible Children</strong>’ are all worldwide trending topics on Twitter. The<strong> Invisible Children</strong> Facebook page’s wall is glittering with support and praise. Millions of people around the world are throwing their money at this organisation on the basis of <em>one</em> video. A single, half an hour video, put out by<strong> Invisible Children</strong>, telling people to donate to<strong> Invisible Children</strong> and spread the message about<strong> Invisible Children</strong>. And people are following, <em>without question.</em> How is this not utterly horrifying? No doubt, what we’re witnessing is a masterpiece of propaganda and the effects that bias can have on the general public. And why shouldn’t people buy into the video? It has everything you can relate to – the naïve child, the terrible villain, and the great hero. It’s so meticulously constructed to make us support the ‘good guys’, and play down any questions or worries we have with what the ‘heroes’ are doing.</p>\n<p>So what can we do about this? Am I saying that we should all stop donating and go back to our lives? No. I’m saying that we should be using social media to its <em>full</em> extent. Networking has allowed this video to take the world by storm. It’s making people’s minds up for them. What we need to do is spread the truth – get these Tumblr pages spread as much as the <strong>Kony 2012</strong> video, and level out the bias – tear down the saintly image that <strong>Invisible Children</strong> has created for itself, and show the world the truth. This campaign is, depending on <em>your </em>viewpoint, either a noble attempt to gain support and stop a major war criminal through justified and necessary means, or an ultimately pointless publicity campaign by a radical group trying to extract vengeance on one tiny part of a major problem. Only when people have both sides of the story, though, and recognise this conflict as being made up of by shades of grey and not good versus evil, will people be able to make an informed decision about whether they want to support this group. At the moment, though, for a world that is being increasingly driven by the exchange of information, most people seem to be remarkably ill-informed.</p>\n<p><script type=\"text/javascript\" src=\"https://video.unrulymedia.com/wildfire_68157331.js\"></script>  </p>\n","slug":"15532-kony-2012-propaganda-and-social-networking","category":"life","date":1331127392000,"wpid":15532,"isSticky":false,"featured_image":{"width":1280,"height":800,"src":"2012/03/img_29411-1280x800.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAGAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAUG/8QAHRAAAgIDAQEBAAAAAAAAAAAAAQIDBAAGEUEhUf/EABUBAQEAAAAAAAAAAAAAAAAAAAEC/8QAGhEAAgIDAAAAAAAAAAAAAAAAAAECAxESIf/aAAwDAQACEQMRAD8AxFXY7EstKzYiha/bsIruqAK6sSCGHvQp89ynFvewyRI4lADKG4sxUDv4AvzGMidUHjgapn//2Q=="},"createdAt":1587292702801,"updatedAt":1588403541223,"author":"5e9b68b27a1236eccfeb1d16","old_image":"2012/03/img_29411-1280x800.jpg","categories":["life","opinion"]}