{"id":"5e9c33b39b6559241525e0db","title":"Review: The Roots – How I Got Over","content":"<p>The Roots are a band instantly recognisable to hip-hop.</p><p> They have perfected the use of a live band with rap, they have also released ten remarkably consistent albums. In their 11th album <strong>How I Got Over</strong> The Roots join unlikely collaborators, Monsters Of Folk, Joanna Newsom, Icelandic singer Patty crash as well as R&B superstar John Legend, rappers Blu, Dice Raw, Phonte, P.O.R.N, Truck North and many more, to produce a fresh and diverse album, driven by the bands uniquely clean and uplifting instrumental production.</p>\n<p>How I Got Over begins ponderously, with the humming and delayed percussion of <em>A Piece Of Light</em>, before launching into <em>Walk Alone</em>, a lyrically impressive track, in which Black Thought, P.O.R.N and Truck North rap about travelling alone, to an uncomfortable sounding piano led instrumental. <em>Dear God 2.0</em> opens in a simular vain to <em>Walk Alone</em>, where stark piano and harsh vocals from Jim James introduce the suitably on form Black Thought to express the details. </p>\n<p>After continuing in it’s philosophical nature with <em>Radio Daze</em>, the album soon opens into a refreshingly positive and uplifting mood, perfectly expressed in the chorus vocals of <em>Now Or Never</em> where Phonte delivers the lyrics “Everything changes around me, and I wanna change too, it’s one thing I know, It aint cool being no fool, I feel different today, I dont know what else to say! “. The record reaches it’s ecstatic high with <em>How I Got Over</em>, a song which directly highlights the troubles and struggle of living in a ghetto, while remaining fantastically hopefull, aggressive and positive. The album then begins to calm down with the super chilled <em>The Day</em> as rapper Blu shines in the company of Icelandic singer Patty Crash, who delivers a whimsical hook in her disparate Icelandic style. </p>\n<p>With the help of Joanna Newsom the album moves into it’s reflective period as Black Thought reminds us of his importance in Right On and Doin’ It Again. How I Got Over’s biggest star collaborator John Legend, appears on the next song <em>The Fire</em>, true to form with the rest of the album it’s a powerful and satisfyingly singable song. The disappointing <em>Web 20/20</em> is followed the albums final track <em>Hustla</em>, which is the most pure hip hop track on the album and features some wonderfully profound lyrics over easily the heaviest and dirtiest beat on the album.</p>\n<p>In How I Got Over, The Roots manage to produce a diverse and artistically forward thinking album without compromising too much of their uniquely raw and refreshing sound. Numerous collaborators roundly compliment Black Thought, who is at his most insightful and uncompromising best. The album successfully delivers some important social and political messages while remaining a fun an enjoyable record to listen, sing and shuffle to.</p>\n","slug":"1559-review-the-roots-how-i-got-over","category":"music","date":1277479765000,"wpid":1559,"isSticky":false,"featured_image":{"width":692,"height":692,"src":"2010/06/how-i-got-over.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAABgf/xAAhEAADAAEEAQUAAAAAAAAAAAABAgMRAAQFIRIGBzKRof/EABUBAQEAAAAAAAAAAAAAAAAAAAME/8QAFxEAAwEAAAAAAAAAAAAAAAAAAAEREv/aAAwDAQACEQMRAD8AQDnfaxeGXY03ezmUlhqRi2QQAceQHZ7+9TPdcPwZ3NTD1dMxLnwJsfjnr81OaO06UVGZVKnIBwDpNGMjFCZoSVGSVGq0sgWn/9k="},"createdAt":1587295155475,"updatedAt":1588403566105,"author":"5e9b68b27a1236eccfeb1d18","old_image":"2010/06/how-i-got-over.jpg","categories":["music","reviews"]}