{"id":"5e9c29f89b6559241525d402","artists":["5e9b68ec7a1236eccfeb1faf"],"title":"Review: Dog is Dead 13/03 (Deaf Institute, Manchester)","content":"<p>If you’ve been an avid follower of<strong> Crack In The Road</strong> over the past few years, then you will have notice that I have something of a penchant for indie-pop outfit <strong>Dog is Dead</strong>.</p><p> I first saw the band play at <strong>Dot to Dot Festival </strong>way back in 2010, and it really has been a staggering experience watching the band go from strength to strength in the development of their sound, and their confidence in themselves. In fact a lot of the core characteristics of the band, which impressed me so greatly during their first gig, still remain, and the past two years have been spent simply galvanizing the inherent level of talent they already possessed and turning it into something truly special.</p>\n<p>Currently concluding their first UK Headline tour, <strong>Dog is Dead </strong>arrived in Manchester after a sizable absence, and set up their wares in the wonderful surroundings of the <strong>Deaf Institute</strong>. Despite initial concerns, the venue was bustling and very respectfully filled, with row after row of wide eyed girls stood staring at their five idols. Entering their set with their normal youthful charm, the band looked entirely comfortable on stage and projected an image of an outfit that knew exactly what their strengths were, and how they were going to play to them. Performing a fine strata of material, ranging as far back as ‘Young’ to their latest offering of their second single ‘Two Devils’, each track was played with an enthused and powerful spirit, with lead vocalist Rob Milton looking endearingly self assured.</p>\n<p>A particular highlight was the band’s new track ‘Ricochet’, which demonstrated a real development in their sound, making it clear that the band’s confidence isn’t simply resting on it’s laurels, and instead vigorously charging a determined forward march in creative development. An expertly conducted show for an audience that will surely only increase over the coming months.</p>\n<p><iframe src=\"https://www.youtube.com/embed/QowXXKaerGc\" frameborder=\"0\" width=\"560\" height=\"315\"></iframe></p>\n","slug":"15630-review-dog-is-dead-1303-deaf-institute-manchester","category":"live-reviews","date":1331900429000,"wpid":15630,"isSticky":false,"featured_image":null,"createdAt":1587292664116,"updatedAt":1588441780100,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2012/03/dog-is-dead1-165x68.jpg","categories":["live-reviews","music"]}