{"id":"5e9c29f59b6559241525d400","artists":["5e9b69637a1236eccfeb2729"],"title":"Interview: Wyatt Overman","content":"<p>Since chancing upon <a href=\"https://www.</p><p>facebook.com/wyattovermanmusic\" target=\"_blank\"><strong>Wyatt Overman’s</strong></a> sensational debut album <a href=\"https://api.crackintheroad.com/music/15280-review-wyatt-overman-fires/\" target=\"_blank\"><em><strong>Fires</strong></em></a> a month or so back, it’s been a regular player, especially whilst sitting on my roof, watching the last of the soon-to-be summer’s light dwindling away. <strong>Overman’s</strong> delicate vocals combine perfectly with his wistful, lovelorn lyricism, producing eight gorgeous, heartfelt tracks. Although <strong>Overman</strong> may be relatively unheard at the moment, <em><strong>Fires</strong></em> is a sublime work that fully deserves your attention, grounded amongst friendship, honesty and tranquility.</p>\n<p><em><strong>CitR</strong></em> caught up with <strong>Wyatt</strong> to get a few questions answered.</p>\n<p><em>CitR: When did you start writing and recording music?</em></p>\n<p>WO:<strong> I started playing and attempting to write when I was thirteen. From there it was many projects/shows before I started singing which was around 2002. It wasn’t until November of 2010 that I purchased a recording program/interface and began to teach myself how to record. This is also when I started the record, although a lot of it had been written for a few years.</strong></p>\n<p><em>What would you describe as your biggest inspirations, both musically and otherwise?</em></p>\n<p><strong>First and foremost, nature and growing up alongside of it. I know it may sound cliche, but I was raised in a town of 230 people, and there was not a town larger within a 15 mile radius. I spent my youth growing up on a lake, and from there moved even deeper into the country as a teenager. I always valued the silence at night paired with the clear sky and air. It is there where I feel most comfortable with life, and most oftentimes find inspiration. Being 45 minutes from the nearest “city” had it’s own inspirations as well. I couldn’t be more grateful honestly for growing up there, and I miss it each day.  Aside from that: youth, growing, people, relationships, illness, health, parties, and everything else that plays into creation & inspiration, the fun and the not so fun, the good and bad etc. Musically, I have always been a fan of everything, but primarily Sigur Ros, Damien Rice, Olafur Arnalds, Ludavico Einaudi, and Clint Mansell. More recently though my talented friends and roommates from Rockford and Minneapolis, as well as Elbow, Frightened Rabbit, Ben Howard, M83, Bon Iver,  and a lot of the great local music that is here in Minneapolis. I could go on for days. </strong></p>\n<p><iframe style=\"position: relative; display: block; width: 400px; height: 100px;\" src=\"https://bandcamp.com/EmbeddedPlayer/v=2/track=2361475168/size=venti/bgcol=FFFFFF/linkcol=4285BB/\" frameborder=\"0\" width=\"400\" height=\"100\"></iframe></p>\n<p><em>Your debut album, Fires, appears to contain many themes of an extremely personal nature, how much would you say that your own personal experiences have impacted on the record?</em></p>\n<p><strong>Honestly, most of the record is non-fiction. I wanted the songs as a collection to be about youth, the seasons, and gratitude for everything I have experienced, whether that was loss, gain, or acceptance of both. A lot of the scenarios/characters are spun in a different light, but they are still coming from a real place. Secretly the record is about my adoration for pop-tarts.</strong></p>\n<p style=\"text-align: center;\"><a href=\"https://admin.crackintheroad.com/uploads/2012/03/301690_300359993310771_229786487034789_1423248_1609768579_n.jpg\"><img class=\"size-large wp-image-15661 aligncenter\" title=\"Wyatt Overman 1\" src=\"https://api.crackintheroad.com/images/2012/03/301690_300359993310771_229786487034789_1423248_1609768579_n-640x400.jpg\" alt=\"\" width=\"640\" height=\"400\" /></a></p>\n<p><em>How much do you think the environment you grew up in has shaped the sound of Fires?</em></p>\n<p><strong>I think it has shaped this record entirely, but in addition has shaped what I want to create in the future and how I envision it from here on out. My home environment will always play a part in the creation process, the organic feeling I hope to always keep present. I know I will always make trips back home to do the majority of my writing, so I’d love to keep that relationship with the north intact.</strong></p>\n<p><em>How did you go about recording Fires, and are they tracks that you’ve had written for a while now?</em></p>\n<p><strong>I think Build, Children, 35, Wealth, and Loom were the oldest songs. Each ranging from 2008-2011. Island, Grace, and Someday were recorded late last fall in my roommates closet here in Minneapolis. The recording process was fairly simple, I used an Apogee One for nearly the entire thing. I would swap in a mic or two here if I could borrow one from someone, but other than that I would use the One’s built in condenser. I experimented a lot though, especially with percussion and piano. I recorded in various closets, and bedrooms, so if you listen close enough you can hear a lot of background, the usual cars, kids, animals haha. I fell in love with the portability of just being able to set up in 10 minutes with levels and record. Thankfully I have some amazing friends who lent me equipment when I needed it, that was the best.</strong></p>\n<p><iframe style=\"position: relative; display: block; width: 400px; height: 100px;\" src=\"https://bandcamp.com/EmbeddedPlayer/v=2/track=3734822513/size=venti/bgcol=FFFFFF/linkcol=4285BB/\" frameborder=\"0\" width=\"400\" height=\"100\"></iframe></p>\n<p><em>Do you have any plans to play live shows?</em></p>\n<p><strong>Absolutely! I have a lot of plans, but we will see how they unfold. I am currently trying to find musicians to play with live, but I am looking forward to it! It is hard to find people who aren’t busy, especially the older you become. I can’t wait though because live is what I wrote these songs for. I want to be as loud as possible, and hopefully have as many string parts live that I wanted to have on the record but couldn’t find the help for. I would love to do a living room tour, those are great.</strong></p>\n<p><em>And finally, a less serious question… if you could be any animal, what would you be?</em></p>\n<p><strong>AH! I always wanted to be a dog, but then I realized I would age too fast. I think I would be a bird. A bird that was wild and had extreme longevity. You would just see so much more than any other organism, plus who hasn’t wanted to fly at will?</strong></p>\n<p><em><strong>Fires</strong></em> is out now, via <strong>Wyatt Overman’s</strong> <a href=\"https://wyattoverman.bandcamp.com/\" target=\"_blank\">bandcamp</a>.</p>\n<p> </p>\n","slug":"15659-interview-wyatt-overman","category":"interviews","date":1331919939000,"wpid":15659,"isSticky":false,"featured_image":null,"createdAt":1587292661046,"updatedAt":1588441780042,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2012/03/dsc_0157-165x165.jpg","categories":["interviews","music"]}