{"id":"5e9c29d09b6559241525d3d9","title":"Art Review: Rambunctious London","content":"<p><a href=\"https://admin.</p><p>crackintheroad.com/arts/15788-art-rambunctious-london/attachment/untitled-3/\" rel=\"attachment wp-att-15793\"><img class=\"alignleft size-medium wp-image-15793\" title=\"Untitled\" src=\"https://api.crackintheroad.com/uploads/2012/03/Untitled-260x189.jpg\" alt=\"\" width=\"260\" height=\"189\" /></a>Unless you’ve been living under either a very heavy rock for the last few years, you’ll be pretty much aware of the fact that London is, this Summer, hosting the 2012 Olympics. A great source of pride for the British nation and a major pain in the arse for those of us who live in the capital, there are at least a few cultural and artistic distractions to keep our minds off the fact that we Londoners are going to be spending a few months in what essentially amounts to a military base filled with tourists.</p>\n<p>Cue <em>Rambunctious London</em>. A collection of artwork by “creator, inventor, philanthropist, explorer, scientist, artist and gentleman” <strong>Joseph Alberstein Goode</strong> (who has previously designed for High Voltage, Wilderness Festival and the Secret Garden Party, this tongue-in-cheek antidote to the city’s ever-worsening chaos provides a comical insight into the city of London through an array of drawings from witty portraits of city stereotypes to a fascinating alternative map of the London Underground.</p>\n<p>At the centre of the collection lies <em>London 2012</em>, a beautifully detailed large-scale art print that brilliantly showcases the eccentricities of <strong>Goode</strong>‘s mind, and contains countless references to various aspects of city life. Elsewhere, one can find <em>Shoreditch Dandy </em>(a caricature of that not-really-loveable Shoreditch hipster that we’ve all met at one point in our lives), <em>London Underground (</em>the aforementioned tube map drawn in <strong>Goode</strong>‘s unique style) and <em>London</em> (another giant print that packs in the most recognisable aspects of the city’s culture) and many more.</p>\n<p>The works (and others) are available online and at certain retail outlets across the city, and are definitely worth a look at least. The collection really, genuinely does capture the city and its quirks beautifully, and at a time when the eyes of the world are on the city, what could be better?</p>\n<p>For more information (and a preview of some of the other works), see <a href=\"https://www.londoncartoons.co.uk/#\" target=\"_blank\">https://www.londoncartoons.co.uk/</a>, or have a look below at our preview of <em>London 2012</em>.</p>\n<p><a href=\"https://admin.crackintheroad.com/arts/15788-art-rambunctious-london/attachment/attachment/\" rel=\"attachment wp-att-15789\"><img class=\"alignleft size-medium wp-image-15789\" title=\"attachment\" src=\"https://api.crackintheroad.com/images/2012/03/attachment-260x618.jpg\" alt=\"\" width=\"260\" height=\"618\" /></a></p>\n","slug":"15788-art-rambunctious-london","category":"arts","date":1332534363000,"wpid":15788,"isSticky":false,"featured_image":{"width":898,"height":654,"src":"2012/03/untitled.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAMG/8QAIBAAAQQBBAMAAAAAAAAAAAAAAQACAxEhBAUSIzFBof/EABQBAQAAAAAAAAAAAAAAAAAAAAX/xAAWEQEBAQAAAAAAAAAAAAAAAAABABH/2gAMAwEAAhEDEQA/ANSNugk1MPJlYAoUA6jnFe1GTaNO57ndbbJNcfHxEQ6GSJt//9k="},"createdAt":1587292624750,"updatedAt":1588403540880,"author":"5e9b68b27a1236eccfeb1d16","old_image":"2012/03/untitled.jpg","categories":["arts"]}