{"id":"5e9c29b69b6559241525d3b3","artists":["5e9b691e7a1236eccfeb22e2"],"title":"Live Review: Manflu (The Workshop – London)","content":"<p><a href=\"https://admin.</p><p>crackintheroad.com/music/15894-live-review-manflu/attachment/manflu/\" rel=\"attachment wp-att-15895\"><img class=\"alignnone size-homepage wp-image-15895\" src=\"https://api.crackintheroad.com/uploads/2012/03/manflu-660x440.jpg\" alt=\"\" width=\"660\" height=\"440\" /></a></p>\n<p>Alternative band,  Manflu, say through Facebook that ‘All we want to do is rock the fuck out and give you tinnitus, STDs, a sense of purpose.’ Their recent gig at East London’s The Workshop did just that (well, almost).</p>\n<p>The Workshop probably isn’t the best venue to play a gig in. There’s nothing to separate the band from the audience, the sound guy usually dozes off mid set and it’s in the basement, leaving people barely any room to sip on their drinks, let alone dance. Yet, this is what Manflu are all about: genuinely great music that  screws over anything else in their way. People look me up and down as I open the door to the basement, judging me from inside their leather jackets and straight fringes. The fact they were here, on a Friday night, meant something important was about to happen. That something was a live set from Manflu.</p>\n<p>First on the set list was ‘Moaning Moaning’. People stand in anticipation, soft cheers surface as lead singer, who goes by the alter ego of Aza Shade, creeps on stage. Her black hair clutches both sides of her face, as she looks down into the microphone and screeches. Her hips move with the coming beat of the tribe like drums, arms up in the air as if she was Jesus. Maybe she was making a statement…or maybe she just couldn’t give a fuck. She’s having fun, and you can see it. People start bopping their heads, casually mimicking her moves as they move from side to side. A tall guy stands next to me with long metal kid hair, who starts bashing himself into me. It didn’t help that he was twice (maybe three times) my size. The crowd weren’t ready to mosh yet.</p>\n<p>As the set went on, people begin to frivolously bash themselves into each other, somehow in unison, creating a great wave of energy, where at ‘Monotone’, Aza joins in. She approaches an audience member, physically shaking him to get involved. He loves it; his laugh rising from beneath a guitar solo that’s pounding at your ears. The track’s pretty lengthy, at 6 minutes, taking you on an acid trip through Tetsuo. You feel disorientated but you love it. You don’t want to leave. By this point, Aza crouches down onto the floor, spilling her beer to only be surrounded by it a few seconds later, creeping up on her till she eventually sits in it. She shoves her hands over her ears.</p>\n<p>The catchy riffs of ‘Wizard’ come in, and Aza switches between Russian and English: “I want some dope because I’m a Wizard, and you are not.”People want more. They get their phones out, creeping towards the front like a cult to catch one last glimpse of her.</p>\n<p>By the point of finishing song, ‘TEK’, people seem high from the music. Either the Illuminati manage them or their songs simply do that to you. I guess, if they knew the Illuminati were involved, they’d dishevel their eyes with a spoon as they have them raped by a room of transvestites. They’d probably have that done to the government if they had the chance too. Good thing they’re translating their rage into music.</p>\n<p>Everyone goes to congratulate Aza as I head outside for a much needed cigarette, contemplating how exactly I was to write all this up. There’s so much to take in, it felt like 100 Azas clawing at my skull simultaneously. Then, I saw her outside, signalling that she wanted a lighter. I had one in my hand, and held it up.</p>\n<p>“Great gig.”</p>\n<p>“Haha… Yeah, the sound guy fucked up though.” Her voice seemed completely unaffected by the copious amount of shouting she just did.</p>\n<p>A ginger girl stood next to me nervously glancing up, and stuttering, “It was a great gig. It really was. It …it….was …great.”</p>\n<p>The metal head (that previously nearly succeeded in breaking my bones) waddled out the front doors and turned to Aza, “Great gig.”</p>\n<p>It was at that point it all became clear. It was a great gig, nothing less and nothing more, destined to screw over any overtly judgmental reviews and Facebook comments by Vice readers.  Although I didn’t get an STD, or Tinnitus, as they claimed…that night, I can admittedly say, I felt a sense of purpose.</p>\n<p>They’re playing a headline gig at The Lexington, on the 3rd May. Maybe you should go. </p>\n","slug":"15894-live-review-manflu","category":"live-reviews","date":1333024053000,"wpid":15894,"isSticky":false,"featured_image":{"width":750,"height":500,"src":"2012/03/manflu.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAQH/8QAHxAAAgIDAAIDAAAAAAAAAAAAAQIDBAARIQUGE0Fx/8QAFAEBAAAAAAAAAAAAAAAAAAAAAP/EABQRAQAAAAAAAAAAAAAAAAAAAAD/2gAMAwEAAhEDEQA/AMJ8jbghsVWtK01qeRbUsoVQWJUMI+jQAJHfsc1zKLl716W3PJNVKys7M6/EG0SejfN/uhjGB//Z"},"createdAt":1587292598386,"updatedAt":1588403540555,"author":"5e9b68b27a1236eccfeb1d2b","old_image":"2012/03/manflu.jpg","categories":["live-reviews","music"]}