{"id":"5e9c33af9b6559241525e0d5","title":"Interview: Los Campesinos!","content":"<p><a rel=\"attachment wp-att-1646\" href=\"https://admin.</p><p>crackintheroad.com/music/1589-interview-los-campesinos/attachment/img_1879\"><img class=\"alignnone size-fullheader wp-image-1646\" title=\"IMG_1879\" src=\"https://api.crackintheroad.com/uploads/2010/06/IMG_1879-300x200.jpg\" alt=\"\" width=\"300\" height=\"200\" srcset=\"https://api.crackintheroad.com/images/2010/06/IMG_1879-300x200.jpg 300w, https://api.crackintheroad.com/images/2010/06/IMG_1879-1024x682.jpg 1024w, https://api.crackintheroad.com/images/2010/06/IMG_1879-165x110.jpg 165w, https://api.crackintheroad.com/images/2010/06/IMG_1879-950x633.jpg 950w\" sizes=\"(max-width: 300px) 100vw, 300px\" /></a></p>\n<p><a rel=\"attachment wp-att-1646\" href=\"https://admin.crackintheroad.com/music/1589-interview-los-campesinos/attachment/img_1879\"></a>Following on from the release of their second album proper, <em>Romance Is Boring</em>, Welsh twee pop outfit <strong>Los Campesinos! </strong>have a healthy and vibrant buzz around them at the moment. Known for being incredibly honest and down to earth guys, as well as the unbreakable bond which joins all the band members, <strong><em>Crack in the Road</em></strong> were lucky enough to catch up with the lead singer Gareth, shortly after their compelling headlining set at <strong>Dot to Dot Festival </strong>in Manchester. Whilst talking to <strong>Gareth</strong>, several starstruck young female fans approached the charismatic but edgy frontman, however he spoke to them in such a reassuring tone that their fidgety but excitable mood was quickly eased, and they were able to have a laid back and informative chat.</p>\n<p><strong><em><span style=\"font-weight: normal;\">CitR:</span> </em></strong>So how was the set tonight?</p>\n<p><strong>It was very fun, genuinely Manchester is one of our favourite places to play, and I’m surprised we’ve not played it since the album came out, so we kind of missed it in February. I think this is maybe the first time that we’ve played the same venue twice in Manchester, ‘cus every time we come back there’s a new venue for us to play! I genuinely just love Manchester.</strong></p>\n<p><em>CitR: </em>You played in Nottingham as well as Bristol (on the Dot to Dot tour), what did you think of Dot to Dot as a festival?</p>\n<p><strong>It’s kind of at the point now where there are so many of these urban festivals, I guess every thing is trying to imitate South by South West in the States, which is just the pinnacle of it, then you’ve got like others. I think Camden Crawl and Great Escape do it well, and now you’ve got Stag and Dagger, Live at Leeds, it’s like every city is trying to do it and I think often they just cram in as many bands as possible at the expense of actually giving people, the crowd and the bands a good experience as well. Sometimes it’s just about getting as many heads through the door, in Bristol on Saturday we were given an hour long set and tonight and last night we were given forty five minutes, but I don’t know, what is the difference? I think there’s a long way to go before Dot to Dot is as efficient and as good as the crowd deserves it to be. Having said that, each set that we played as been really enjoyable, but sort of separating myself from that, and looking at it sensibly I think Dot to Dot has a little way to go before it rivals the things it’s trying to imitate. Especially in Bristol, ‘cus Manchester really works ‘cus all the venues are really close to each together, but Bristol, from the top of Park Street where we played, to the furthest venue from it is about a forty five minute walk. I was talking to the woman who was promoting it tonight, and she said “yeah but there’s a shuttle bus from the top of the hill to the other”, but that’s not what it’s about. At South by South West you can get from one gig to the furthest away gig in the space of ten, fifteen minutes. I think it (Dot to Dot) needs to be a bit more reasonable about what it’s trying to achieve and not rip people off and not rush the bands.</strong></p>\n<p><em>CitR: </em>You mentioned Camden Crawl, what have your experiences of playing there been like?</p>\n<p><strong>We’ve played Camden Crawl, and it was brilliant.</strong></p>\n<p><em>CitR: </em>When we spoke to Goldheart Assembly earlier, they said they preferred here, because in Camden Crawl once you got into one venue, you stayed there, for fear of not getting back in again.</p>\n<p><strong>I think the thing with this today, is that it’s massively undersold, every room got bumped down a room because it hadn’t sold enough tickets, and I think really Camden Crawl knows what level it is at, and it achieves that. Whereas today, part of the problem is it being on a Monday, I didn’t realise it was a bank holiday until we showed up today! I’d imagine that other people who saw the advert for Dot to Dot would have thought “oh this is on a Monday, can’t do that, I’ve got work or I’ve got school”. I think Camden Crawl works because it’s got that atmosphere and I hate to use the word, but that vibe to it, because people know what to expect, whereas Dot to Dot, especially in Manchester it doesn’t have any sort of reputation.</strong></p>\n<p><em>CitR: </em>Have you ever written any songs that you’ve found too personal to perform or record? I know from listening to your music that there’s very much a storytelling feel to your songs.</p>\n<p><strong>Nope! Never! Pretty much everything I’ve ever written has gone into a song and been on a record, I try to be as honest as possible, probably more so than is sensible! But it’s worked for us so far, so far so good.</strong></p>\n<p><em>CitR: </em>Yeah, it’s great, The Sea Is… is one of the best songs of the year so far.</p>\n<p><strong>It’s one of my favourite songs to do live, thanks very much, cheers.</strong></p>\n<p><em>(Excitable Fan Girl):</em> Which is your favourite song to play live?</p>\n<p><strong>I really like doing We Are Beautiful, We Are Doomed. That’s one of my favourites.</strong></p>\n<p><em>EFG</em>: We’ve Got Your Back? I like that one, I like your part “so fucking on!”.</p>\n<p><strong>We’ve never done that live! I think because that was the song on the last record that mostly Alex’s song, and because Alex left the band it didn’t seem appropriate to learn that one to play live.</strong></p>\n<p><em>EFG: </em>That’s my mum’s favourite song!</p>\n<p><em>CitR: </em>Have there been any bands across Dot to Dot that you have discovered, that you like the sound of, any tips?</p>\n<p><strong>Nobody that I’d not heard before, I’ve not got the patience for that! Over the weekend, I’ve seen Liars, they’re great live, I enjoyed Liars more live than I expected to, and I’m a big fan but that’s the first time I’ve seen them. Washed Out I saw today, who I really like, which I think I enjoyed more on record, but still live was really great. Last couple of days, it’s our friends bands but they’re a phenomena live; Islet.</strong></p>\n<p><em>CitR: </em>Yeah, I saw you in Dundee with them supporting!</p>\n<p><strong>Oh, in Dundee, yeah that was a shit gig! I feel I should be honest, most gigs I enjoy, but that was something else… Yeah Islet are incredible live and really nice guys.</strong></p>\n<p><em>CitR: </em>It’s so much of an experience to see them, I love how they can all play so many instruments.</p>\n<p><strong>Yeah, it makes me sick! Other than them I’ve not really seen much else, I guess from touring you get into a comfort zone where you have time off, you just sit and… just exist, and that’s what I’ve been doing today.</strong></p>\n<p style=\"text-align: center;\"><a href=\"https://www.myspace.com/loscampesinos\">Check out Los Campesinos!’s Myspace!</a></p>\n<p style=\"text-align: center;\"><a href=\"https://www.dottodotfestival.co.uk/\">Check out the Dot to Dot website!</a></p>\n","slug":"1589-interview-los-campesinos","category":"interviews","date":1277493473000,"wpid":1589,"isSticky":false,"featured_image":{"width":3888,"height":2592,"src":"2010/06/img_1879.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAUG/8QAIhAAAgEDAgcAAAAAAAAAAAAAAQIDAAQRBhIFByEmMUFR/8QAFAEBAAAAAAAAAAAAAAAAAAAABf/EABwRAQABBAMAAAAAAAAAAAAAAAECAAMEETKx0f/aAAwDAQACEQMRAD8Aw0up9JRvfmPgcpLhHsleQtswRkMfeQPlVX5n6W3t2XYDr4y1KU+ZUocTv2jLmNG9pmqlf//Z"},"createdAt":1587295151625,"updatedAt":1588403566054,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2010/06/img_1879.jpg","categories":["interviews","music"]}