{"id":"5e9c33b59b6559241525e0de","title":"Interview: Zane Lowe","content":"<p>Arguably one of the most powerful and well respected men in music, <strong>Zane Lowe </strong>is much more than the <strong>‘BBC Radio 1 DJ with a funny accent’.</p><p> </strong>Thanks are owed to my own mother for that somewhat naive quote, even if I originally thought she was talking about <strong>Chris Moyles</strong>. However while my mum remains blissfully unaware that this funny speaking DJ is much more than just that, <strong>Crack in the Road </strong>were lucky enough to have a brief interview with the man who has helped kick start the careers of the <strong>Arctic Monkeys, The Wombats, </strong>and <strong>The Kaiser Chiefs, </strong>amongst many others.</p>\n<p>Feeling somewhat nervous, this man had saved lives before (namely <strong>Ryan Jarman</strong>‘s at the <strong>NME 2006 Awards</strong>), I approached in a cautious yet determined manner that must have looked like a baby giraffe walking for the first time, only to discover they were born with only three legs. However such nerves quickly dissipated once the interview began with <strong>Zane </strong>expressing an element of jealousy over the voice recording facility on my iPhone, though something tells me he was taking the piss somewhat .. Authentic jealousy or not, I was talking to a pioneer of new music. We discussed how he had found the <strong>Dot To Dot Festival</strong>, with <strong>Zane </strong>immediately mentioning that <strong>‘seeing Blood Red Shoes was a real highlight for me’. </strong>This answer was somewhat unsurprising, especially as <strong>Blood Red Shoes </strong>were immediately next to us during the interview. Therefore I asked how the festival had varied over its habitation in the different cities, hoping to find some authentic opinions on a young urban festival.</p>\n<p>In response to the festival’s first stopping point, Bristol, <strong>Zane </strong>talked about a lagging in energy when it came to his 1 am set, and while <strong>‘Nottingham was insane from start to finish’, </strong>he hoped that the settings of <strong>FAC251 </strong>would provide a fantastic night. By this point I had realised that while I was listening to honest answers, his levels of professionalism were making it hard for me to gain any real insights into the mind of music impresario. Therefore I asked him about any new bands that the festival may have thrown onto his radar, <strong>Zane </strong>immediately responded with <strong>Doorly</strong>. For those of you not familiar with <strong>Doorly</strong>, he is an electro/dubstep DJ who started his career as a barman and took to the decks one night after a regular DJ failed to turn up. Now one of the hottest DJ’s around, it is no surprise that <strong>Zane Lowe </strong>is a huge fan. <strong>Zane </strong>commented on how<strong> ‘our styles are quite cohesive, we both play similar records in a similar style’</strong>.</p>\n<p>After a few final remarks on his past Manchester gigs, with him describing his <strong>Warehouse Project </strong>gig as <strong>‘absolutely amazing’</strong>, my short time with <strong>Zane </strong>came to a swift end as a steadily growing group of fans began to congregate around us. However in those four minutes I had talked to a man who is one of the  biggest names in promoting and discovering new music, a well respected and hugely popular DJ, and the sole reason why <strong>The Cribs </strong>could continue to release albums. Not too bad for a <strong>‘BBC Radio 1 DJ with a funny accent’</strong>.</p>\n<p><a href=\"https://www.zanelowe.com/\" target=\"_blank\">Zane Lowe New Music Website</a></p>\n<p><iframe src=\"https://www.facebook.com/plugins/likebox.php?id=114090381951328&width=292&connections=10&stream=false&header=false&height=255\" scrolling=\"no\" frameborder=\"0\" style=\"border:none; overflow:hidden; width:292px; height:255px;\" allowTransparency=\"true\"></iframe></p>\n","slug":"1593-interview-zane-lowe","category":"festivals","date":1277456637000,"wpid":1593,"isSticky":false,"featured_image":{"width":422,"height":500,"src":"2010/06/zane-lowe.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAMAAoDASIAAhEBAxEB/8QAFwAAAwEAAAAAAAAAAAAAAAAAAwUGCP/EACMQAAIBBAEDBQAAAAAAAAAAAAECAwQFESEABhMxByNBgcH/xAAVAQEBAAAAAAAAAAAAAAAAAAADBP/EABoRAAICAwAAAAAAAAAAAAAAAAABAhESIVH/2gAMAwEAAhEDEQA/ALT1n6ie1x0gp6ow5kWNZI9mOQnIbW9AHPz4GN8fr1vaJFDrO5VhkHtsM/WOZ961llmu1B3JZGWpAaRSxwfdK/g354W6XmrprnVwQlFiimdEUL4AYgDgK1bLMFLXD//Z"},"createdAt":1587295157995,"updatedAt":1588403566129,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2010/06/zane-lowe.jpg","categories":["festivals","interviews","music"]}