{"id":"5e9c29a89b6559241525d39d","artists":["5e9b695d7a1236eccfeb26cd"],"title":"News: Viva Brother Call It A Day","content":"<p>Whilst yesterday found the majority of us hanging our heads in shame at the plethora of criminally unfunny April Fools jokes, four Salford lads found themselves weeping into their Topshop bought faux-sheepskin coats.</p><p> Although their <strong>John Lennon</strong>-esque glasses hid it, tears were shed as last years pop-rock sensation <strong>(Viva) Brother</strong> announced that the sudden influx of unwanted fame had grown too much for them, and they were indeed, calling it a day. After a string of hit singles, high profile festival appearances and a critically acclaimed album, many initially thought the unexpected news was a twisted April Fools joke, possibly the work of Joseph Kony.</p>\n<p>With one of the most influential, innovative groups of recent years now gone, the question arises, who will be the next victim of the corrupt, talent-disregarding indie machine; <strong>The Vaccines</strong>? <strong>Two Door Cinema Club</strong>? or, god forbid,<strong> Foster The People</strong>? These are dark and daunting days for music.</p>\n<p>So whilst this may spell the untimely end of<strong> Viva Brother</strong>, their music will live on long in the memory. Who could possibly forget that song with the drum in it? Or the one with the chorus? True classics of our generation. Amongst this devastating news, there has been a slight glimmer of light, with lead singer <strong>Lee Newell</strong> confirming his plans to release his hotly anticipated solo dubstep project, under the title <strong>Pillex</strong>. Check out <strong>Viva Brother’s</strong> highest charting single below. Brother are survived by <strong>The Pigeon Detectives</strong>, <strong>Kaiser Chiefs</strong> and <strong>Keane</strong>.</p>\n<p><iframe src=\"https://www.youtube.com/embed/6hzrDeceEKc\" frameborder=\"0\" width=\"420\" height=\"315\"></iframe></p>\n","slug":"15943-news-viva-brother-call-it-a-day","category":"music","date":1333371339000,"wpid":15943,"isSticky":false,"featured_image":{"width":165,"height":165,"src":"2012/04/vbglastosnap-165x165.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAABQII/8QAJBAAAgAFBAEFAAAAAAAAAAAAAQIDBAUGEQAHIUFhExQWIjP/xAAVAQEBAAAAAAAAAAAAAAAAAAABAv/EABcRAAMBAAAAAAAAAAAAAAAAAAABEUH/2gAMAwEAAhEDEQA/ALvq29vLR2zrFCpYp8OuTcDAizUdY05FdSHUALkoCVHSjnnWcPi093Elh49TSN9IsO/6oEVVAnGwAMY501UIae/mfov6N15OmUpJaf/Z"},"createdAt":1587292584815,"updatedAt":1588443774709,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2012/04/vbglastosnap-165x165.jpg","categories":["music","news"]}