{"id":"5e9c33b79b6559241525e0e1","title":"The Funkiest Girl In Metropolis","content":"<p><a href=\"https://admin.</p><p>crackintheroad.com/uploads/2010/06/monae.jpg\"><img class=\"alignnone size-full wp-image-1602\" title=\"Janelle Monáe\" src=\"https://api.crackintheroad.com/wp-content/uploads/2010/06/monae.jpg\" alt=\"Janelle Monáe\" width=\"516\" height=\"503\" srcset=\"https://api.crackintheroad.com/images/2010/06/monae.jpg 516w, https://api.crackintheroad.com/images/2010/06/monae-300x292.jpg 300w, https://api.crackintheroad.com/images/2010/06/monae-494x481.jpg 494w, https://api.crackintheroad.com/images/2010/06/monae-165x160.jpg 165w\" sizes=\"(max-width: 516px) 100vw, 516px\" /></a></p>\n<p>To tie <strong>Janelle Monáe</strong> down to a particular genre would be difficult. In fact, more than that – it would be unjust. The 24 year old performer – artist doesn’t seem to do her justice; just <a href=\"https://www.youtube.com/watch?v=vMyc148Do_Q\" target=\"_blank\">watch her performance on Letterman</a> to see what I mean – has already been making a name for herself over the past few years, with appearances on <strong>OutKast’s</strong> <em>Idlewild</em> and releasing her debut EP before being signed to <strong>Sean “Diddy” Combs’ </strong>label <strong>Bad Boy Records</strong>. That 2007 EP was entitled <em>Metropolis: Suite 1 (The Chase)</em>, and was the first of four “suites”, a conceptual series of releases telling the story of a female android living in the futuristic land of Metropolis. <em>The ArchAndroid</em> continues this theme with Suites II & III. It’s a bold project, but also one that<strong> Monáe </strong>pulls off almost flawlessly.</p>\n<p><strong>Monáe </strong>starts each Suite with an overture. A fully blown, orchestral overture that leaves spines tingling and a thirst for more. And <strong>Monáe </strong>duly delivers, but what comes next is not the obvious continuation from an overture… ‘<em>Dance Or Die</em>‘ is one of many more upbeat songs on the album, which includes some of the catchiest hooks of the year, from that song’s “These dreams are forever” or “I’ve got a terrible fixation/Can’t get it off the mind”, in ‘<em>Make The Bus</em>‘, written and co-performed by none other than of <strong>Montreal’s Kevin Barnes</strong>, who<strong> Monáe</strong> shall be touring with this summer. The inclusion of <em>Make The Bus</em> is an interesting one – many have criticised it for sounding out of place, but surely it just displays another musical dimension of Monáe which makes <em>The ArchAndroid</em> all the more courageous.</p>\n<p>But it’s not all upbeat – <strong>Monáe</strong> takes us through the lows, as well as the highs, with the stirring <em>‘Mushrooms & Roses</em>‘, which makes excellent use again of the motif seen in the two overtures, as well as the acoustic ballad ‘<em>57821</em>‘. For an 18 song album that is not all easy listening from the go, it does exceedingly well not to drag on, possibly thanks to the album’s great diversity. It is only with six minute long ‘<em>Say You’ll Go’</em>, the penultimate track, that the album could be seen to be overstaying its welcome, but this is quickly forgotten with grand, over-eight-and-a-half-minutes-long epic ‘<em>BaBopByeYa</em>‘. This takes <strong>Monáe’s </strong>vision to a whole new level, and is the perfect end to what has been an incredible journey of an album – and it is a journey, one that, for all its complexity and interweaving concepts, can also be broken down into songs that stand strong on their own. And that – apart from leaving us intrigued as to where <strong>Monáe </strong>will venture next – makes for one of the most exciting and, ultimately, best albums of the year so far.</p>\n","slug":"1599-the-funkiest-girl-in-metropolis","category":"music","date":1277455295000,"wpid":1599,"isSticky":false,"featured_image":{"width":516,"height":503,"src":"2010/06/monae.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAABgQF/8QAJhAAAgECBQIHAAAAAAAAAAAAAQIDAAUEBhETMRIiIzVRc4GRsv/EABUBAQEAAAAAAAAAAAAAAAAAAAQF/8QAGhEAAgMBAQAAAAAAAAAAAAAAAQMAAhESUf/aAAwDAQACEQMRAD8AQXDJ8t7zpYLzbNxnjn2JnXFlNpY9CezghutQfilMsRjldHGjKSpGvBFR2SRxmHKujsPDk4Pr1A/daF08zxfvP+jSlb1aS3YV0I8n/9k="},"createdAt":1587295159857,"updatedAt":1588403566155,"author":"5e9b68b27a1236eccfeb1d14","old_image":"2010/06/monae.jpg","categories":["music","reviews"]}