{"id":"5e9c29999b6559241525d390","artists":["5e9b691e7a1236eccfeb22e1","5e9b69517a1236eccfeb2634"],"title":"Live Review and Interview: Manchester Orchestra.","content":"<p><a href=\"https://admin.</p><p>crackintheroad.com/music/16006-live-review-and-interview-manchester-orchestra/attachment/1323907493manchester_img02_hires/\" rel=\"attachment wp-att-16007\"><img class=\"alignnone size-singlepost wp-image-16007\" title=\"1323907493manchester_img02_hires\" src=\"https://api.crackintheroad.com/uploads/2012/04/1323907493manchester_img02_hires-950x633.jpg\" alt=\"\" width=\"950\" height=\"633\" /></a></p>\n<p>Although the gig was late last year my memory of it is still as vivid as ever, not because I was a huge fan prior to the event but instead how it made myself and the others in the audience feel towards the band. <strong>Manchester Orchestra </strong>as some may know are an alternative rock band hailing from Georgia in the United States and despite not achieving much commercial success on this side of the Atlantic the fans they do have appear to be infinitely more passionate than the majority of British artists. I stood with a few of my friends, who themselves were in tears with excitement, and watched how everyone else was acting in the same fashion, which astonished me. Granted the music was beautiful and delivered perfectly with the highlights being <em>Simple Math </em>and <em>Virgin</em>, both from the album they released in 2011 and also <em>Shake it Out </em>from their 2009 album <em><strong>Mean Everything to Nothing</strong></em>.</p>\n<p> </p>\n<p>The night itself was so memorable I managed to get an interview with the lead singer, Andy Hull, and I have become a firm fan since, and I would implore others to check them out.</p>\n<p>CitR: How would you describe your most recent album, <em><strong>Simple Math</strong></em>?</p>\n<p><strong>AH: Simple Math is the most rounded of all of our albums and it took the best of our ability to create it, meaning it is our favourite so far.</strong></p>\n<p>CitR: Is it true that a fan created a video for your song <em>Virgin</em> that you then adopted as the official video?</p>\n<p><strong>AH: Yes this is true, we were on our way back from a radio station in New York and a guy showed up a video and it was great so we used it.</strong></p>\n<p>CitR: Are there any bands or artists that you would recommend as deserving of more credit then they are currently getting?</p>\n<p><strong>AH: Oh Brother, a band from our home town of Atlanta are really good, we engineered their last record and its really cool stuff.</strong></p>\n<p>CitR: What are your favourite band or artist, past or present, from Manchester, England?</p>\n<p><strong>AH: It has to be The Smiths, I don’t have a favourite song by them, everything is great. But my favourite album has to be </strong><em><strong>The Queen is Dead.</strong></em></p>\n<p>CitR: What is your favourite British festival?</p>\n<p><strong>AH: We played Reading and Leeds in 2007 and 2009 and they were both fantastic.</strong></p>\n<p>CitR: What is your favourite American sport?</p>\n<p><strong>AH: The band are involved in an NBA fantasy league so I would have to say Basketball.</strong></p>\n<p>CitR: Being American you must be a big fan of eating steak, how do you prefer yours?</p>\n<p><strong>AH: I am a big fan of steak but my favourite is filet mignon, cooked rare and has some key ingredients to make it perfect which include sweet baby ray BBQ sauce and soy sauce as well as two others, put in a plastic bag and shake.</strong></p>\n<p>Photo by: Ryan Russell</p>\n<p>Official Site can be found<a href=\"https://www.themanchesterorchestra.com/us/home\"> here</a></p>\n<p>Facebook page can be found <a href=\"https://www.facebook.com/ManchesterOrchestra\">here</a></p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>  </p>\n","slug":"16006-live-review-and-interview-manchester-orchestra","category":"interviews","date":1334136054000,"wpid":16006,"isSticky":false,"featured_image":{"width":165,"height":110,"src":"2012/04/1323907493manchester_img02_hires-165x110.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAAAAb/xAAiEAAABQMEAwAAAAAAAAAAAAABAgMGEQAEBQcTIUESMWH/xAAUAQEAAAAAAAAAAAAAAAAAAAAF/8QAGhEBAAIDAQAAAAAAAAAAAAAAAQACAxGBEv/aAAwDAQACEQMRAD8AkrvURx49yq2tplskfDFV2k1DXJhMZMvMxIciWeugquUc6fmaHs7yBIwXeAY+eqUojLV810p2L4rra2weT//Z"},"createdAt":1587292569486,"updatedAt":1588443774679,"author":"5e9b68b27a1236eccfeb1d07","old_image":"2012/04/1323907493manchester_img02_hires-165x110.jpg","categories":["interviews","live-reviews","music"]}