{"id":"5e9c0c88774c2610387e53c9","title":"Feature: A Case For Ad Hoc?","content":"<p>$33,333.</p><p> A hell of a lot of money, if you’ll pardon my French. In layman’s terms, that colossal figure would pay for the hosting of this very website for 1333 years, it would stretch to purchasing 4255 pristine copies of Viva Brothers debut (and only) record, and if you’re really maniacal, it would even be enough to cover the down payment on your first house. So, you’re asking, just why is this figure relevant?</p>\n<p>I’d imagine if you’re reading this article you probably have a vague background knowledge on the origin of <a href=\"https://adhoc.fm/\" target=\"_blank\">Ad Hoc</a>, however for those not in the know, here’s a short, unbiased summary. Rising from the ashes of <a href=\"https://pitchfork.com/\" target=\"_blank\">Pitchfork</a> sister site and ‘blog collective’ <a href=\"https://alteredzones.com/\" target=\"_blank\">Altered Zones</a> (June 2010 – Nov 2011), Ad Hoc is “<strong>a community of music lovers with a shared ethos: that of building the world you want to see using the materials at your disposal</strong>“. Founded by former AZ editors Emilie Friedlander and Ric Leichtung, and including contributions from leading blogsites such as <a href=\"nofearofpop.net\" target=\"_blank\">No Fear Of Pop</a>, <a href=\"https://www.internationaltapes.com/\" target=\"_blank\">International Tapes</a> and <a href=\"https://dummymag.com/\" target=\"_blank\">Dummy Magazine</a>, Ad Hoc also prides itself upon being “<strong>a quarterly zine– available in electronic and paper formats</strong>“. With almost 1,000 backers and $37,626 raised through their <a href=\"https://www.kickstarter.com/projects/ricleichtung/ad-hoc\" target=\"_blank\">Kickstarter</a> which finished at the start of March, it’s undeniably a project grounded amongst good intentions and genuine passion; yet tellingly lacking a healthy dose of realism.</p>\n<p>Having been intensely skeptical for quite some while concerning the logistics surrounding the venture, I thought it best to keep these to myself or at least until the initiative was on it’s feet. With the sadly underwhelming launch of Ad Hoc now several months behind us, I deem now an appropriate time to delve into the issues that had initially roused my cautions about the project. So, whilst the following may not be a commonly aired opinion, nor a particularly popular one, this article is not fueled by jealousy, bitterness or a self-centered need for attention. I write on the same pretense as Ad Hoc; to be heard.</p>\n<p>Almost a year ago I caused (minimal) controversy by openly criticizing an article written by a well-respected and professional music journalist. My criticism was not personally offensive and did not allude to anything other than my own opinion on the style of the writer. However, my comments were met with outrage by several well respected fellow journalists; how dare I admit that I found a certain style particularly unappealing? Now, what amused me the most about the reaction was not only did I not received much in the way of insightful disagreement, but more crucially that I was being ostracised for raising any form of issue with another writers work. The writer in question had in the past openly and directly criticised various musicians for their appearance, songwriting and personality, yet a questioning of their own working abilities was taken as immediate and unforgivable disrespect. With the internet now the epicentre of modern debate, you would think that people would realise that posting anything at all on the web leaves it open to interpretation, criticism and admiration, be it a piece of writing, a song or a work of art. To think otherwise is shockingly naive.</p>\n<p>Just why is this relevant? Well, I feel that with Ad Hoc we’re in a strikingly similar situation, with people afraid to raise concerns about the project for fear of being labelled a murderer of the creative arts and cast from the preferential ‘journalistic’ circle. Had Ad Hoc been started as a business through a bank loan, or built upon personal savings, then I wouldn’t feel it necessary nor worthwhile to raise any issues regarding the usage of capital, however, given that the entire project is financed by backers (i.e. readers), it seems only logical to question the various avenues that money has taken.</p>\n<p>Now what much of this article ultimately boils down to is the yet broader debate of whether it’s legitimate (and moral) to accept donations whilst the project is still entirely in it’s embryonic stage. Kickstarter has been a wildly successful business, and has nurtured the progress of countless projects, that would otherwise have slipped at the financial hurdles, however that’s not to say it’s without it’s flaws.</p>\n<p>An unrelated campaign I stumbled across recently focused around a band seeking to record their debut LP, requesting $80,000 in order to do so. Having perused the Kickstarter page, and discovered the costing breakdown, they admirably yet naively stated that ‘$30,000 would be for the bands efforts’, to be split between the six members of the group. Now don’t get me wrong, I truly believe that creative art forms should be met with financial rewards, especially those which take considerable time, but to expect pre-payment before proof of quality is quite frankly, utterly ridiculous. Not only that, but surely if the group had one hundred percent belief in their own talents and ability, they’d assume that once the album was completed, they would recoup any personal costs through touring and/or record sales. It’s an intensely simplified way of viewing it, but we now live amidst a ‘try before you buy’ generation, whose belts are being pulled tighter than ever before, and Kickstarters based on fancy prophesies, quirky images and lavish ideas, will never realistically convey the potential product.</p>\n<p>As stated previously, I’m not questioning the concept nor the passion that fueled Ad Hoc’s formation, more the method and strategic thought progress that has helped get the project running. I’m of the belief that the promises of the physical zine are yet to be fulfilled, and it pains me to say it, but the Ad Hoc website is simply not $30,000 of material. Featuring guest posts from in the know musicians as well as contributions from their base group of writers, at this moment in time, it is in both essence and form, a music blog. There’s nothing to elevate it beyond it’s contemporaries, and it’s certainly not passed into the realm of being a music website, clearly a long shot from challenging the likes of Pitchfork, <a href=\"https://www.stereogum.com/\" target=\"_blank\">Stereogum</a> and <a href=\"nme.com\" target=\"_blank\">NME</a> for quality or quantity. Maybe I’m greatly mistaken, but I was under the illusion that the community aspect would be entirely unique, however as of now, it’s non-existent.</p>\n<p>In comparison to other blogging collectives it falls short of the mark, with <a href=\"https://www.secretdecoder.net/\" target=\"_blank\">Decoder</a> performing a similar role with their physical format and online content yet at a tenth of the cost. When placed alongside the mightily impressive (and self financed) <a href=\"https://www.portalsmusic.com/\" target=\"_blank\">PORTALS</a>, Ad Hoc seems frail and malnourished, with the unique video content and fantastic traveling showcases of the former setting them dimensions apart. Should PORTALS unexpectedly need financing to the tune of $30,000, I’d be one of the first to empty my wallet, safe in the knowledge that the content would be delivered and in manner I’d find enjoyable.</p>\n<p>Again we’re led back to the foundations and concept that Ad Hoc is grounded upon. The premise of being paid to blog is one that I would fully support, although in my heart of hearts, I completely understand that it’s no more than a pipedream. In the same way that 99% of musicians won’t see a return on their costs, bloggers will not directly be reimbursed for their time and talent. Creatively it only serves to prove rather stifling as well, with the inclusion of money comes corruption, greed and self-importance, three elements that are thankfully scarce in blogging. That’s not to say there’s no value in formulating your thoughts into writing on the internet, and that it may pay dividends in the future, with numerous bloggers going on to work within the music and media industry’s. Should a website wish to pay their writers for their efforts, then I’m firmly of the belief that it should not be the readers who have to cover the costs, especially not in the form of pre-payment. As a respectable and worthwhile initiative, Ad Hoc is up there with the best, unfortunately good ideas and a solid moral grounding don’t pay the bills. Good intentions and steadfast logic are two startlingly different entities.</p>\n<p>Where I think Ad Hoc hinted at an innovative idea was with their Kickstarter rewards, offering exclusive vinyl releases, tracks and entire label back catalogs, thus addressing the three way relationship between ‘blogger’ ‘label’ and ‘consumer’. It’s this approach that I believe could fulfill their promises of revolutionizing and shaping the music industry. It’s a widely held opinion that music blogs do influence listening tastes, yet a very small proportion of labels sell through the blogs and expect the listener to be passionate enough about the music to track down purchasing options of their own accord. Had Ad Hoc pioneered itself as a form of listening club by which a subscription could be paid in return for a regular selection of releases alongside well written reviews and insightful commentary, then I would have found it far easier to support.</p>\n<p>As it is, there’s little about Ad Hoc that truly excites me, and nothing that sets itself apart from hundreds of other music blogs. The writing is average to good, the content is fairly standard and akin to numerous other blogs, and the community aspect doesn’t appear to have to reached fruition. As much as I question the use of finances, I’m also surprised that there have been few others who have raised concerns. Even once you subtract the costs of fulfilling Kickstarter rewards and the printing of the Zine, that still leaves you with an astronomical figure for what is a slightly altered wordpress theme.</p>\n<p>Financially, I’m yet to wrap my head around the situation, with the following quotes taken directly from the Ad Hoc Kickstarter in bold and my comments after:</p>\n<p><strong>After we meet our $33,000 goal, Kickstarter deducts 5%, and another 3-5% of what remains goes to Amazon.</strong> Fair enough – that’s £1,881 to Kickstarter and $1,787.25 (max) to Amazon, leaving a healthy $33,957.75.</p>\n<p><strong>* The cost of producing, packaging, and mailing all of the awesome Kickstarter rewards you so generously pledged for, including all four quarterly issues of the Ad Hoc paper Zine, the Ad Hoc T-shirt, and the Fundraiser cassette box set. </strong>Again, understood, but surely these costs couldn’t amount to more than $15,000 tops (if this figure is grossly incorrect, I will happily alter it).<strong></strong></p>\n<p><strong><strong>* Payment for our web developer, along with continued tech assistance throughout the year. </strong></strong>Given the relatively basic form of the website and minimal tech assistance needed, this cost shouldn’t be touching four figures. By the way, the website was designed by Dev Gupta who has some <a href=\"https://devgupta.com/\" target=\"_blank\">fantastic work</a>.</p>\n<p><strong>* Payment for our web designer</strong>. As above</p>\n<p><strong>* Payment for the three amazing individuals who made our Kickstarter video</strong>. Surely fairly minimal costs… it’s hardly Kony 2012.</p>\n<p><strong>* Costs associated with putting on SXSW, CMJ, and other yearly events that are for promotional purposes only, and do not generate revenue. </strong>Events that maybe 0.1% of backers will be able to go to… Also, by admitting they are for promotional purposes, surely there’s some intent to generate revenue in the future?</p>\n<p><strong><strong>* Hosting for a high-traffic website, and for a premium Soundcloud account (for hosting audio), which alone runs up to about $600+ a year.  </strong></strong>A premium Soundcloud account should probably be considered a luxury… not an essential.</p>\n<p>They then admit this accounts to ‘<strong>as much half of our Kickstarter funds</strong>‘ and <strong><strong><strong>What remains of the money will go directly into our editorial budget– ie, paying various Ad Hoc contributors for all the time, love, and hard work that they put into their writings. </strong></strong></strong>Which returns to my previous point of proof of quality before payment.</p>\n<p>Now please don’t perceive this as me sticking the boot in to Ad Hoc, as if I need to reiterate again, I admire and respect the passion behind the project, I just greatly doubt the logistics, and wonder just how deeply it’s been considered by others. I’m not for a second insinuating that there’s any foul play occurring, it just strikes me as wholly bizarre that such a colossal sum of money was needed for what has, as of yet, been a hugely underwhelming outing. Given the sterling list of contributors, including many blogs that had originally inspired me to start this very website, maybe I set my hopes too high, but to say I’ve thus far been disappointed, would be an understatement of epic proportions.<strong><strong><strong></strong></strong></strong></p>\n<p>The mission aims of Ad Hoc that ‘set <a href=\"https://adhoc.fm/\" target=\"_blank\">Ad Hoc</a> apart from other music publications’ are stated and rebuffed as follows:</p>\n<p><strong>• If you send us your music, we will actually listen to you. </strong>An admirable statement, yet sadly unrealistic. From running a music blog myself, I know that there is simply not enough time in the day to engage with every single submission, be it directly from a band, or their representative PR firm.</p>\n<p><strong>• We won’t reduce your album to a numerical rating. </strong>Again, a trait that all my favourite blogs have long adopted, and by no means innovative.</p>\n<p><strong>• We’ll cover emerging artists and musical movements from ALL OVER THE GLOBE– not just Brooklyn. </strong>In the digital age, this is hardly unique nor revolutionary. We have near enough the entire catalogue of music ever recorded at our fingertips, and there will always be somebody willing to write about it.</p>\n<p>Now all of the above would fade into meaningless, had Ad Hoc been billed from the start as simply a music blog, written purely for enjoyment and to spread quality music. But it wasn’t. Instead it was pitched arrogantly and in a manner that completely detracted from the vital aspect – the music. By asking for such an outrageous sum of money, it portrayed themselves as self-proclaiming superiority over other blogs, making it all the more underwhelming when the final product was unveiled.</p>\n<p>Drowning under hyperbole and complex sounding yet in truth relatively straightforward initiatives, the ‘in crowd’ has a way of forcing people to feel that if they’re not actively supporting an issue/band/website etc, then they’re passively against it, as oppose to sheer indifference. Raising concerns regarding the use of the money (your money if you donated) is not offensive nor out of line, in fact, without assessment, examination and consequential reaction we’d still be holed up in caves, bashing two rocks together.</p>\n<p>So now, if you’ve read all this, first of all, congratulations, secondly, I urge you to consider where, what and how you support projects. If after careful thought you decide that Ad Hoc is worthy of the $37,626 they received, then by all means, keep supporting it and I will continue to respect that. I’m in no manner searching to raise an argument or an altercation, merely attempting to remind people that at the core of this issue is, always has been and always will be, the music, which serves as the inspiration for all music blogging, and I’d hate to lose sight of that. Throughout this article I’ve undoubtedly waffled, repeated myself and been unintentionally vague; yet ultimately, isn’t that embodying the very essence of blogging?</p>\n<p> </p>\n","slug":"16012-feature-a-case-for-ad-hoc","category":"editorials","date":1339092807000,"wpid":16012,"isSticky":false,"featured_image":null,"createdAt":1587285128946,"updatedAt":1587825894387,"author":"5e9b68b27a1236eccfeb1d27","categories":["editorials","music"]}