{"id":"5e9c298c9b6559241525d388","artists":["5e9b695d7a1236eccfeb26fd"],"title":"Introducing: WHATEVER, DAD","content":"<p>Now, this is pretty special.</p><p> With numerous big budget, high profile releases so far this year, it speaks volumes that this debut EP from New York’s <strong>WHATEVER, DAD</strong> blows all of them out of the water. The solo project of 18 year old ‘<strong>E L A I Z A</strong>‘, her recent six track outing is quite possibly the most appealing, immersing new music you’ll hear this year. Forgive me if I’m waffling slightly, but I’m truly that excited.</p>\n<p>From scouring<strong> E L A I Z A’s</strong> <a href=\"https://audioboo.fm/elaizasantoast\" target=\"_blank\">Audioboo</a> account and <a href=\"https://www.thisisnotapoop.blogspot.co.uk/\" target=\"_blank\">various blogs</a>, it’s clear that she has a healthy/unhealthy obsession with many of the greats; <strong>Jeff Mangum</strong>, <strong>Talking Heads</strong> and <strong>Vera Lynn</strong> amongst other, alongside a completely unique (some might read pretentious, not me) vision of the world around her. It’s these quirky characteristics and stellar influences that have shaped her music, chiseling her self-titled release into a deeply personal yet engaging listen. The likes of <em>B U B B L E G U M S H R I N E</em> and <em>W A R S H</em> are entirely acoustic numbers, relying on<strong> E L A I Z A’s</strong> 1960’s styled vocals and and intelligent lyricism.</p>\n<p><iframe src=\"https://w.soundcloud.com/player/?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F43195730&show_artwork=true\" frameborder=\"no\" scrolling=\"no\" width=\"100%\" height=\"166\"></iframe></p>\n<p>Whilst I’m wary of drawing this comparison, there’s an element of <strong>Lana Del Rey</strong> amongst the refined vocals, yet the unpolished instrumentation is a startling contrast, ultimately coming across far more like<strong> Charlotte Gainsbourg</strong> than the pouty lipped popstar. In the latter half of the release, the tracks gain a<strong> Neutral Milk Hotel</strong>-esque confidence, most notably on my personal favourite <em>✩☀♡ séquence de rêve ♡☀✩</em> coupled with sublime lyricism – <em>‘holding her </em><em>pachyderms, memories, bled back to me, books from a previous, dream warned violent’</em>. <em>A P P L E P E E L S</em>, sung entirely in French wouldn’t seem out of place in a 1960’s Parisian romantic thriller and closer <em>R E S T S T O P</em>, coincidentally almost twice the length of any other track is an ode to the real woman, scorning the futile and fickle tendencies of others. I can guarantee now that <strong>WHATEVER, DAD</strong> will not be to everyone’s taste, however that’s not going to stop me falling head over heels.</p>\n<p>Check out a couple of my favourites and grab a free download of the full release from <strong>WHATEVER, DAD’s</strong> <a href=\"https://whateverdad.bandcamp.com/\" target=\"_blank\">bandcamp</a>.</p>\n<p><iframe src=\"https://w.soundcloud.com/player/?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F43195789&show_artwork=true\" frameborder=\"no\" scrolling=\"no\" width=\"100%\" height=\"166\"></iframe></p>\n","slug":"16048-introducing-whatever-dad","category":"introducing","date":1334487769000,"wpid":16048,"isSticky":false,"featured_image":null,"createdAt":1587292556263,"updatedAt":1588441779187,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2012/04/1_b0000055-165x165.jpg","categories":["introducing","mpfree","new","music"]}