{"id":"5e9c220a93301f07e652af0d","artists":["5e9b69577a1236eccfeb269b"],"title":"News: Twin Shadow Announces Sophomore LP, Streams New Track","content":"<p>With the critically acclaimed success of his 2010 debut album Forget, <strong>Twin Shadow</strong> staked his place as a pop pioneer, blending classic influences with more modern production values.</p><p> Now almost eighteen months on and <strong>George Lewis Jr.</strong> has announced his sophomore album <em><strong>Confess</strong></em> with be released 10 July via <a href=\"https://www.4ad.com/\" target=\"_blank\">4AD</a>, with the rocky <em>Five Seconds</em> being the first taster offered from the record. Heavier and less ethereal than previous material, it feels like a natural progression, and one that will suit the live circuit particularly well. Check out <em>Five Seconds</em> below as well as the inspiration behind <em><strong>Confess</strong></em> and the album’s tracklisting.</p>\n<p><iframe style=\"margin: 0pt; padding: 0pt;\" src=\"https://widgets.beggarspromo.com/fiveseconds/widget.php\" frameborder=\"0\" scrolling=\"no\" width=\"290\" height=\"375\" data-audio-widget-jspf=\"https://widgets.beggarspromo.com/fiveseconds/jspf\"></iframe></p>\n<h6 data-ft=\"{\"type\":1}\"><em>One winter I crashed my motorcycle , with a friend on the back. I shouldn’t have been riding that day, but I was young and fearless of the black roads, fast and easy in my ways. As the bike slipped from under us my head filled with words. The slow motion moments of calm just after surprise and just before regret are bliss. I remember in that moment I wanted to say everything to him. How could I say everything in a split second? How could I bury my words in his heart?</em></p>\n<p><em> I got a new bike and went to LA to record what is now called Confess. I took the bike out at 6AM one morning after not having done much riding in the couple years between Forget and Confess. I noticed my head clearing as I came slowly down a hill where the road around a reservoir began. I pulled back slowly on the throttle with my right hand, and felt the bike start to come to life. My head was still crystal clear…nothing. As I kicked the bike into 3rd, I pulled almost all the way back and jumped forward leaning in towards the gas tank, fighting the wind. I got up to 75 and saw that no one was out but the runners and their four legged friends, the sidewalks became a blur of barking dogs and heads all turning. My mind was empty. I put the bike in 4th and hit 90. The engine jack hammered under my legs. My mind was clear. I inched toward 100 on the speedometer and punch the last five. TON UP! My mind is filled with words. My heart is full of love. This is where i want to be. I want to stay here, and I want to tell you everything.</em></h6>\n<p>01 Golden Light<br />\n02 You Call Me On<br />\n03 Five Seconds<br />\n04 Run My Heart<br />\n05 The One<br />\n06 Beg for the Night<br />\n07 Patient<br />\n08 When the Movie’s Over<br />\n09 I Don’t Care<br />\n10 Be Mine Tonight</p>\n<p>Hidden track: Mirror in the Dark</p>\n","slug":"16272-news-twin-shadow-announces-sophomore-lp-streams-new-track","category":"mpfree","date":1335883908000,"wpid":16272,"isSticky":false,"featured_image":{"width":950,"height":946,"src":"2012/05/ced75732-950x946.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAABQf/xAAiEAACAAUEAwEAAAAAAAAAAAABAgADBAUREiExUQYjQYH/xAAVAQEBAAAAAAAAAAAAAAAAAAAEBf/EABgRAQEBAQEAAAAAAAAAAAAAAAIDAAEU/9oADAMBAAIRAxEAPwCT+X3hKa4rSJIE1mAJY59ZJ24+4z+QYzHUdjz1F1sBLVCljk6ZZye4QWbMKgl247ip6kqvqw4wM4nh3//Z"},"createdAt":1587290634312,"updatedAt":1588443774388,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2012/05/ced75732-950x946.jpg","categories":["mpfree","news","new","music"]}