{"id":"5e9c20f293301f07e652aefb","artists":["5e9b69447a1236eccfeb256f"],"title":"Interview: Spring Offensive","content":"<p>On Thursday the 29<sup>th</sup> of March 2012 I wake up with my alarm at six a.</p><p>m. and swing my legs over the side of the bed. I tamp the roof of my mouth with my tongue, a sponge a few minutes off drying. There is the astringent cocktail of blood and medicated mouthwash. I jam my tongue as hard as the muscle will go into the bulging, fleshy, ragged space behind my back top left molar, and feel the new tooth’s shard up there, tasting the gum’s blood fresher now. Sometimes it seems to have grown, sometimes to have retreated; sometimes there seems a complex series of blubbery craters that I cannot get the measure of with the end of my tongue.</p>\n<p style=\"text-align: center;\">***</p>\n<p>“I work for British Gas,” says Joe. So he’s that bastard.</p>\n<p><strong>Spring Offensive</strong> have a selection of day jobs worthy of the tone of their most recent single <em>Worry, Fill My Heart</em>, which plays out like the cold pit of your twentysomething stomach to warm chords and Pelham’s rattling drums. I ask Pelham what he does to pay the bills. “I work for British Gas,” he says. Do they all work in public services? “Yeah, I… I work for British Gas as well,” admits Theo. “I work for a school,” says Matt, but doesn’t volunteer in what capacity he is employed. Still, education’s a public sector. Lucas is the only one to buck the trend, with what sounds like a dream job. “I work in a second-hand bookshop,” he says, “it’s quite fun. And when we need books for various things…” Yeah? “Yeah, like in our videos and photo shoots…” Oh yeah, the video for <em>Worry</em>, and in fact the photo at the head of this article, features the band wantonly destroying precious literature. “And when we need gas and water…” suggests Pelham. “I can bypass your electric meter at home for you,” chips in Joe cheerily. Makin’ connections. My life is sorted as of now.</p>\n<p style=\"text-align: center;\">***</p>\n<p>The sun is coming up earlier everyday, and when I leave the house to a cool ghost town, the bins still charged with the energy of their emptying, there is a gentle light in the pale sky that swells quiet over the disparate roofs of the houses of my street, and the ornate shipshaped weathervane that marks its end. Halfway down, a girl cuts in across me from the alley to my right. She stares ahead in a deadset way that lets me know that she sees me but does not want to undertake the task of eye contact. Somewhere past the first set of traffic lights she is a good distance ahead of me and others have filtered in from sidestreets as she did, on that long and straight stretch down to the junction of the teeming bypass. They place themselves between us, a small and scattered exodus in the early haze.</p>\n<p style=\"text-align: center;\">***</p>\n<p>So far this year, Spring Offensive have released two videos, the first for <a href=\"https://www.youtube.com/watch?v=HFyjSi3Oqms&feature=relmfu\"><em>Carrier</em></a>, a glowing, hypochondriac swell of a song that grows and burns like a fever, and the second for <em>Carrier</em>’s A-side, the nervy call-and-response of the aforementioned <a href=\"https://www.youtube.com/watch?v=bt-zNr538_g\"><em>Worry, Fill My Heart</em></a>. Both videos are markedly different in concept, just as the two songs differ in tone. I ask first about <em>Carrier</em>’s distinct plotline, and the absence of the band. “We worked with some guys called Nicky Davidson and Bob Self,” explains Matt. “We’d seen some of the kind of things they’d done before, which were very story-based, and we wanted a kind of short film for that music video – we knew that for <em>Worry</em> we were going to do something with us in so we didn’t really feel like we needed to be in <em>Carrier</em>.” What was the process like? “We all worked on it with them it just seemed to kind of come from it,” says Matt “We didn’t just want to tell the story in the song, we wanted to have a story that worked alongside it. The actual video was all them. We just made tea. And cooked.”</p>\n<p>“The two songs are about similar things,” explains Lucas, “but they’re sort of opposites, and the videos work as opposites as well.”</p>\n<p>“We wanted something with us in it for <em>Worry</em>,” says Matt, “but one of the problems with music videos is that you don’t want to just make imagery really heavy-handed, and as you have a line about a clock, show a clock. Runaway, Dave Adams is just fantastic, we worked with him on (earlier single) <em>A Stutter and a Start</em>, and he kind of brings ideas to life really.” Lucas and Pelham have an exchange about the green tea in a can that the noodle bar sells. I forget what I was saying and Matt, ever-focused, reroutes my train of thought. “The <em>Worry, Fill My Heart</em> video,” he says, “we’ve had quite a good reaction from people. We spoke to hearing and non-hearing people who knew sign language, and we were on a deaf blog called Limping Chicken…” This brings me back to the point I had intended to make, the debate which sprang up on <a href=\"https://limpingchicken.com/2012/03/26/debate-music-video-by-spring-offensive-featuring-sign-language-arty-or-offensive/\">Limping Chicken</a> regarding the video. “It wasn’t intentional,” explains Matt, “it wasn’t designed for a deaf audience to follow as such. Word order doesn’t necessarily translate well, so we kind of took it and changed it a bit, and it really was about using it because we find it beautiful.” Faultless in motive, then, and to someone not <em>au fait </em>with BSL the band’s intentions are achieved. “I hope that’s not exploitation, and if people see it in an offensive way…” Matt trails off.  I try to reassure him. That Charlie Swinburne seems to be aiming for a put-down in saying ‘as long as the band are comfortable with making the funniest deaf film since <em>Text, Batteries and Earwax</em>, I don’t have a problem’ actually adds an element of pathos. Perhaps the signing in the video is off, making it ‘hilarious’ for Swinburne and some other BSL-savvy viewers, but his reaction highlights the breakdown of communication that’s brought to the fore in <em>Worry, Fill My Heart</em>, the fact that you’re working a dead-end job and your problems are incommunicable to those around you.</p>\n<p style=\"text-align: center;\">***</p>\n<p>On the second connecting train I am alone in the corner of the carriage with my back wedged against the wall when an older man with an appalled, duckish face and a horseshoe of grey wool skirting his bald dome gets on, Brompton ready folded, and sits across from me. I take no more notice until I hear an electric buzz and look over to see that he has produced a battery-powered razor and is making passes up and down his hairless neck’s hanging folds. Another gent in the bay of seats, somewhere in that strange age I cannot place, stares right at me. I cannot read his expression and my eyes jump away as soon as they meet his, the same poles on two magnets pushed together. He wears blue jeans and well-maintained tan brogues. The scant fuzz that crowns his pate has been swept across in an impression of a younger man’s. It is 7.32 a.m. when we pull out, and I am carried through suburbia toward a 16-floor, 53.34m high-rise in the London borough of Merton. I have jacked it all in for a desk and five a day. So far I fucking love it, the sleep and the safety, the vitamins and minerals, the weekends with my girlfriend. So far I fucking love it, the paycheck and the routine, I’ve started going swimming, and I’m close to quitting smoking.</p>\n<p style=\"text-align: center;\">***</p>\n<p>At the time of writing, it’s the first day of a UK tour for Spring Offensive, and judging by the chorus of affirmatives that greet my asking whether they’re looking forward to it, they’re really…ah…looking forward to it. “The last tour we did was in October, and we’ve just done one off gigs since then,” says Matt, “we went to Germany, Switzerland, but we didn’t really do a UK stretch. Last time we did back to back dates in the UK was 2010.” How did the band find touring on the continent? “Europe’s just full of people who seem to be much, well, I wouldn’t say <em>more </em>interested,” grins Theo, “they’re just very willing to come and listen, and pay attention. It’s pretty nice.” The horrible thing about touring in the UK, of course, is that the music scene’s so oversaturated. “A UK indie band touring the UK is not really very exciting,” agrees Lucas, “but in Germany it feels like people really get into it.”</p>\n<p>More than anything, the band seem to relish touring as an opportunity to travel and experience the wider world. “It’s nice,” as Theo says, “to have a reason to go to Sheffield.” Lucas, too, finds extracurricular joy in touring, distinct from the obvious pleasure of playing your music to new audiences. “I’d never heard of Mainz before,” he says, “and I learned that that’s where they had the first printing press (Johannes Gutenberg lived and died there, history fans), and the world’s oldest bible (the imaginatively named Gutenberg bible…yup).” It’s not all educational fun and games though. “We didn’t get to see it, it was really busy”, says Matt. What did you do instead? “We went to buy a steering wheel lock.” You went to buy a steering wheel lock instead of going to see the world’s oldest bible? “On the way to a gig the key broke, and we couldn’t take the steering wheel lock off”, he explains. How did you get it off? “I managed to pick it.” What with?! “My penknife.” Oh.</p>\n<p>Thankfully, Lucas has kept his mind on the subject at hand. “We’ve decided to play in a few people’s houses, mostly, instead of at venues.” Oh yeah, Chris was saying on the phone that you like to fuck around with the gig format… “If we can, we feel we should.” And so they have been. At the time of publishing, the band have spent the last week playing several shows per day in people’s houses. Have they taken this stance because they got sick of playing for promoters the whole time? “Oxford has loads of venues,” says Matt, “but we’ve played most of them, so that’s just kind of old hat. We played the Ashmolean, and modern art Oxford, and every community centre that will have us, we’re going to be playing in a church soon, so living rooms was another way of doing it. We opened it up to anyone who wanted us to play.”</p>\n<p style=\"text-align: center;\">***</p>\n<p>I clock out, and after a tangle of train rides and drinks and a hurried meal I’m sat half-cut on a curb outside The Barley Mow with Stu. I take deep gulps of the cool, copper-coloured beer in my glass and scrawl half-formed questions into my notebook. Stu is talking about something to do with the both of us and I apologise to him for not paying attention. The evening is warm and rose-shaded and full of young Londoners milling around in sunglasses and smiling through their fringes and enjoying the easy, rising Spring. My phone buzzes in my pocket, so Stu and I follow its instructions, heading around the corner to the front of the Electricity Showrooms. Here Chris, Spring Offensive’s endlessly helpful manager, is waiting on the pavement with Lucas, the band’s tall, thatch-headed frontman. More or less one by one, the rest of Spring Offensive (guitarists Matt and Theo, bassist Joe and drummer Pelham) join us on the curb, and introductions are made. I am breathless with gratitude, to whom I’m not sure, that the band are friendly. We notice a military cargo truck or personnel carrier parked on the curb opposite, and Chris goes over to find out whether we can conduct the interview in the back of the vehicle.</p>\n<p style=\"text-align: center;\">***</p>\n<p>“There goes the military cargo truck,” notes Lucas, as the thick-wheeled juggernaut rolls past, rattling the windows of the noodle bar. I wish we were in the back of there so bad, I say.  “Yeah, but they don’t have green tea in cans,” says Pelham. I mumble that they might, but we are talking about bands from Oxford. Spring Offensive’s connection with, and love for, their hometown’s music scene and the bands and individuals that make it up is obvious. “Do you know <a href=\"https://www.facebook.com/gunningfortamar\">Gunning for Tamar</a>? <a href=\"https://theoldgrindingyoung.virb.com/\">The Old Grinding Young</a> are a brilliant new band,” offers Lucas. “<a href=\"https://www.facebook.com/jonquilband\">Jonquil</a>?” asks Matt, and yeah, I know Jonquil, I haven’t listened to them since <em>Lions</em> though. “<a href=\"https://deerchicago.get-ctrl.com/#/\">Deer Chicago</a> are another great band as well,” says Lucas. “And a lovely young man called <a href=\"https://iwaseatenbyabear.tumblr.com/\">Adam Barnes</a>,” adds Theo “who’s run away to America, but I think he might be coming back.”</p>\n<p>While we’re on the subject of Oxford, I ask Spring Offensive what they think of Blessing Force, the Oxford-based musical collective helmed by alumni of Youthmovies and members of Foals, among others. Straight off, the band are expressive of a wholesome (and what’s becoming characteristic) gratitude to their geographical forbears. “They’ve been really kind to us,” says Matt, “Andrew (Mears) has been really kind to us.” So you don’t hold any truck with the elitist image that’s been presented by the press, then? “When the whole thing kicked off it got some bad press,” admits Theo. Lucas offers a considered view on the subject; “People in Oxford can be very protective of their scene,” he says. “It’s not a very healthy way of doing things, and some parties can get quite bitter if other people are getting press and not ‘sharing it out’.” Does this have anything to do with the amount of Oxford bands that have gone supernova in the past? “It’s just great to have people in a town, your town, which is after all quite a small town, who are making interesting music,” says Lucas, destroying all hypothetical accusations of incestuousness or elitism. Matt, too, is keen to dismiss any finger-pointing as unnecessary. “I think people felt threatened by it,” he says. “Because Blessing Force are so creative, whether it’s good or bad is kind of irrelevant really. They were always putting stuff out, and I think there’s quite a lot of envy from people, especially as it kind of came out of nowhere.” He considers his hometown and it’s reactions to Blessing Force, and offers that “Oxford’s…almost like a fusty scholar sometimes. It’s producing really, really good things and it has a great music scene and it’s really vibrant and I think people were a bit taken aback, especially by that article. But, um, it all simmered down afterwards.” What article he’s referring to, I’m not entirely sure, but <a href=\"https://www.nme.com/blog/index.php?blog=10&title=oxford_s_blessing_force_scene_hear_the_b&more=1&c=1&tb=1&pb=1\">I can make my own conclusions</a>.</p>\n<p>“I have just thought of another Oxford band actually,” says Lucas, “but it’s probably too late.” Ooh. “Wild Swim.” They did a remix of <em>Worry, </em>didn’t they? “They’re very good. I think they’re going to be very popular very soon.”</p>\n<p style=\"text-align: center;\">***</p>\n<p>I turn the Voice Memo function on my phone off, hoping that it’s picked us up over the noise of the noodle place. We say our goodbyes and thankyous until later in the evening, and Stu and I depart to spend dead time as we often do. I am gutsore and weaving by the time I find my head between the Electricity Showrooms’ lit-up dancefloor and its mirrored ceiling. Everyone in the room is smiling, and I flashback to <a href=\"https://api.crackintheroad.com/music/9750-live-review-spring-offensive-the-ashmolean-oxford-050811-2/\">the first time I saw this band</a> in the basement of Oxford’s Ashmolean. Halfway through the set the band make a foray into the middle of the crowd, who hush and let a gorgeous, unplugged <em>Carrier </em>fall gentle around us. Spring Offensive return to their drumkit and microphones, and the last song that they play that night is <em>52 Miles</em>. I think about how I will get home and what time I will go to sleep and what time I will be at my desk the next morning.</p>\n<p><em>“I’ve got what I need, but it’s not what I want</em>,” sings Matt, “<em>with these shifts that I work, it’s the best that I’ve got.”</em></p>\n","slug":"16300-interview-spring-offensive-2","category":"interviews","date":1335969785000,"wpid":16300,"isSticky":false,"featured_image":{"width":800,"height":600,"src":"2011/10/springoffensive.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAIAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAUG/8QAHxAAAQQBBQEAAAAAAAAAAAAAAQIDBBEAEhMhMWEG/8QAFAEBAAAAAAAAAAAAAAAAAAAAA//EABYRAQEBAAAAAAAAAAAAAAAAABEAAf/aAAwDAQACEQMRAD8Aws2VInNBmVtstuqKS1a749ro95MPzElZ1AFsK5CN+tPlVxjGC7ko3//Z"},"createdAt":1587290354119,"updatedAt":1588403539607,"author":"5e9b68b27a1236eccfeb1d3c","old_image":"2011/10/springoffensive.jpg","categories":["interviews","music"]}