{"id":"5e9c1f8093301f07e652aee8","artists":["5e9b69177a1236eccfeb22c3","5e9b69517a1236eccfeb2617","5e9b695d7a1236eccfeb26ca"],"title":"Great Escape Tip #1: A North East Invasion","content":"<p style=\"padding-left: 30px;\">Photo: <strong>Hyde & Beast</strong> by <a href=\"www.</p><p>ianwestphoto.com\" target=\"_blank\">Ian West</a></p>\n<p style=\"padding-left: 30px;\">With it’s reputation firmly cemented as the UK’s finest new music festival, The Great Escape in Brighton returns for it’s seventh year, pulling in over 15,000 dedicated music lovers across the course of three days. Famed for it’s welcoming atmosphere and SXSW-style showcases, next weeks trip to Brighton will be my first experience of the event, so these artist tips are as much for myself as they are for potential festival-goers. Playing host to 300 artists in more than 30 different venues, my highlights are only the tip of the proverbial iceberg that is the Great Escape and what will undoubtedly be a fantastic few days.</p>\n<p style=\"padding-left: 30px;\">Being from the North East, I feel like I’ve let myself down slightly in recent years when it comes to emerging talent, with the majority of my new music writing concerning cities further afield. Thankfully, showcases such as <strong>A North East Invasion</strong> allow those who in recent years have overlooked the Northern scene to dip their toe in the water of what is a thriving and ever-growing goldfish bowl of talent.</p>\n<p style=\"padding-left: 30px;\">Off the back of a hugely successful UK tour, CitR favourite’s<strong> Vinyl Jacket</strong> will bring their quirky tribal pop to Brighton for part of the event; with previous singles<em> Red Light</em> and <em>Koala</em> guaranteed to fill the dancefloor.</p>\n<p><iframe src=\"https://www.youtube.com/embed/teuzkc9NRlk\" frameborder=\"0\" width=\"560\" height=\"315\"></iframe></p>\n<p>North East based troubadour <strong>The Lake Poets</strong> will go down a treat at the seaside town, with his heartfelt yet not overly introvert folk-pop sure to prove wonderful afternoon listening.</p>\n<p><iframe width=\"100%\" height=\"450\" scrolling=\"no\" frameborder=\"no\" src=\"https://w.soundcloud.com/player/?url=http%3A%2F%2Fapi.soundcloud.com%2Fplaylists%2F1864589&show_artwork=true\"></iframe></p>\n<p>Fresh off the back of her debut EP release, Geordie-songstress<strong> Lulu James</strong> will also grace the stage at The Haunt, with her soulful<strong> James Blake</strong>-esque R&B certain to prove popular.</p>\n<p><iframe src=\"https://w.soundcloud.com/player/?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F40500547&show_artwork=true\" frameborder=\"no\" scrolling=\"no\" width=\"100%\" height=\"166\"></iframe></p>\n<p>Finally, topping the bill are <strong>Hyde & Beast</strong>, comprised of Dave Hyde (<strong>Futureheads</strong>) and Neil Bassett (<strong>Golden Virgins</strong>), one of last years most hyped new artists and a fitting act to close what will undoubtedly be a fantastically diverse afternoon.</p>\n<p><iframe src=\"https://www.youtube.com/embed/DM2vCE-2hAo\" frameborder=\"0\" width=\"560\" height=\"315\"></iframe></p>\n<p>For more information on <strong>A North East Invasion</strong> which takes place at The Haunt on Saturday 12 May between 12-4pm please follow <a href=\"https://www.generator.org.uk/thegreatescape\" target=\"_blank\">this link</a>. Tickets for <strong>The Great Escape</strong> are on sale now, more information <a href=\"https://escapegreat.com/\" target=\"_blank\">here</a>.</p>\n","slug":"16341-great-escape-tip-1-a-north-east-invasion","category":"festivals","date":1336071669000,"wpid":16341,"isSticky":false,"featured_image":null,"createdAt":1587289984668,"updatedAt":1588441778579,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2012/05/hyde-and-beast.-photo-by-ian-west-www.ianwestphoto.com_-950x671.jpg","categories":["festivals","music"]}