{"id":"5e9c33ad9b6559241525e0d1","title":"John Robinson & Lewis Parker: International Summers","content":"<p>The unusual, but ideal pairing of New Jersey’s <strong>John Robinson</strong> and London’s <strong>Lewis Parker</strong> have come together to create a new summer LP, fittingly titled <strong>International Summers</strong>.</p><p></p>\n<p>Known for his acclaimed ‘Golden Sound’ Lewis Parker’s productions have a distinctly warm and cosmopolitan feel to them, while John Robinson rhymes are always tight if not slightly repetitive as he recites memories of globe-trotting and past summers. The pairing shine in feel good title track <strong>International Summers</strong>, with John Robinson declaring “<em>International summers make international lovers</em>” over a delightfully nostalgic beat. The other stand out track is the lyrically deep and beautifully produced <strong>Harlem River Drive</strong>, where the pairing prove most in sync as they are joined by the excellent <strong>Angelz INC</strong>.</p>\n<p>Too cut short and summarise, <strong>International Summers</strong> is not a particularly ground-braking or innovative record, but<strong>Lewis Parker’s</strong> warm analogue production and <strong>John Robinson’s</strong> interesting and immaculately delivered lyrics make it the perfect album to listen to on a hot summers evening or during a long day travelling.</p>\n<p>8/10</p>\n<p style=\"text-align: center;\"><a href=\"https://www.youtube.com/watch?v=sKpV_NR9BSE&feature=player_embedded\">Album Preview.</a></p>\n<p style=\"text-align: center;\"><a href=\"https://www.hhv.de/item_202343.html\">Pre-order.</a> (Includes free tape with all album instrumentals)</p>\n<p style=\"text-align: center;\"><a href=\"https://www.projectmooncircle.com/releases/67\">More Info. </a><a rel=\"attachment wp-att-1681\" href=\"https://api.crackintheroad.com/music/1662-john-robinson-lewis-parker-international-summers/attachment/image\"></a></p>\n","slug":"1662-john-robinson-lewis-parker-international-summers","category":"music","date":1277839647000,"wpid":1662,"isSticky":false,"featured_image":null,"createdAt":1587295149245,"updatedAt":1587825936199,"author":"5e9b68b27a1236eccfeb1d18","categories":["music","reviews"]}