{"id":"5e9c156193301f07e652ae9c","title":"News: Today’s Google Doodle is a playable Synth","content":"<p>STOP THE PRESS.</p><p> Today <a href=\"https://www.google.com\">Google’s homepage</a> features a playable Moog synthesiser complete with oscillators and pitch control. Oh my fuck this is good.</p>\n<p>This distressingly distracting doodle celebrates the 78th birthday of super badass American, Robert Moog who led the way in the field of electronic music, by designing the first voltage-controlled subtractive synthesizer that used a keyboard as a controller.</p>\n<p>In layman’s terms; Bob Moog invented the synthesiser as we know it today. A whole new kind of musical instrument that gave way to hordes of floppy haired new wave bands, disco dance troupes and brazen electro outfits.</p>\n<p>The first Moog synth was made commercially available in 1965 and it went on to have an intense effect on the music of the 20th century. One of the first Moog synths was bought by Micky Dolenz of The Monkees and in turn The Rolling Stones, The Doors, Pink Floyd and The Beatles all grabbed a slice of synthesised action.</p>\n<p>Today the sound of the synth has found its way into almost every genre of music from prog rock to grime. It remains one of the most flexible instruments of all time and a tech geeks wet dream.</p>\n<p>Although renowned for the invention of the Moog synthesiser, Robert Moog was pioneer of musical electronics, designing his first theremin at age 14 and a range of other synth-struments including the Minimoog Model D, Minimoog Voyager, Little Phatty, Moog Taurus Bass Pedals, Moog Minitaur, and the Moogerfooger line of effects pedals.</p>\n<p>Moog died of a brain tumour at the age of 71 on August 21, 2005. His friends and family founded the <a title=\"Robert Moog\" href=\"https://www.moogfoundation.org/\">Bob Moog Foundation</a> which, according to their site, aims “to carry Bob’s legacy forward by continuing to touch people’s lives through electronic music, just as Bob did.”</p>\n<p> </p>\n","slug":"16640-news-todays-google-doodle-is-a-playable-synthesiser","category":"news","date":1337763641000,"wpid":16640,"isSticky":false,"featured_image":{"width":165,"height":106,"src":"2012/05/moogmem-165x106.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAEG/8QAIRAAAgEDAwUAAAAAAAAAAAAAAQIDABIhBAYRBRQxYXH/xAAVAQEBAAAAAAAAAAAAAAAAAAADBP/EABgRAAMBAQAAAAAAAAAAAAAAAAABAhES/9oADAMBAAIRAxEAPwDDt1DaWnUwwySxKj2so0rMBnwDfn7xVEW0mFxV2Jzd27Dn3xfilKiqFiFVvpn/2Q=="},"createdAt":1587287393301,"updatedAt":1588443773937,"author":"5e9b68b27a1236eccfeb1d40","old_image":"2012/05/moogmem-165x106.jpg","categories":["news"]}