{"id":"5e9c33a89b6559241525e0c8","title":"Review: Rusko-OMG","content":"<p><a rel=\"attachment wp-att-1734\" href=\"https://admin.</p><p>crackintheroad.com/music/1667-review-rusko-omg/attachment/rusko\"><img class=\"aligncenter size-full wp-image-1734\" title=\"rusko\" src=\"https://api.crackintheroad.com/uploads/2010/07/rusko.jpg\" alt=\"\" width=\"600\" height=\"600\" srcset=\"https://api.crackintheroad.com/images/2010/07/rusko.jpg 600w, https://api.crackintheroad.com/images/2010/07/rusko-150x150.jpg 150w, https://api.crackintheroad.com/images/2010/07/rusko-300x300.jpg 300w, https://api.crackintheroad.com/images/2010/07/rusko-494x494.jpg 494w, https://api.crackintheroad.com/images/2010/07/rusko-165x165.jpg 165w\" sizes=\"(max-width: 600px) 100vw, 600px\" /></a></p>\n<p>“It’s (dubstep) not super deep, you don’t listen to it on your iPod in  bed with your eyes closed”, the voice of the pioneer of modern dubstep? Well you’d certainly hope not, but those are indeed the words of modern ‘wobble master’ <strong>Chris Mercer</strong>. But does music always have to be deep? Well simply put no; however <strong>Rusko’s</strong> attempt to embrace the more trashy side of electronic music doesn’t excuse this crude and basic attempt at a ‘party album’. That’s not to say that <strong>OMG</strong> isn’t scattered with little gems, because it is; however ultimately the record’s fatal flaw is it’s brutal and obnoxious attempt to force an underground genre into the mainstream. With collaborations with the likes of <strong>Britney Spears</strong> just around the corner it appears that we’ve yet to see the last of <strong>Rusko.</strong></p>\n<p>As it happens, the album starts with better examples of <strong>Rusko’s</strong> simple throwback dubstep, ‘WOO Boost’ is a screechy, thumping and ultimately satisfying piece of music in its own right. Dubstep purists may scoff, but the tracks ability to get your musically challenged friend on the dance-floor is unparalleled. ‘Hold on’ that follows presents an interesting collaboration with <strong>Amber Coffman</strong>; the harmonies layered perfectly creating a chilled foil to the rest of the album. So far Rusko’s gamble to drive Dubstep into the eyes of the mainstream seems to be paying off, ‘Hold on’ perhaps strays into the wrong side of bland however ultimately the start of the record is a solid slice of Dub-Pop. But then it all goes wrong, with <strong>OMG </strong>descending into a middle of the road, bland, dated and crude example of everything that is wrong with the genre. ‘Dial my number’ is perhaps the worst offender, hugging to the conventions that perhaps <strong>Rusko</strong> himself helped created like a comfort blanket. The throb of the ‘wobble’ may pull some on, however it’s hard to argue that Mercer is showing any sign of progression since the early days. The tunes seem to go nowhere, sitting complacent in the arms of a hook or another one of those standard ‘<strong>Rusko</strong> wobbles’. ‘Kumon Kumon’ is an infuriating example of this, attempting a <strong>Zomby</strong> style rave/garage sound and failing miserably; he simply doesn’t have the ambition or subtlety of his contemporaries. But perhaps I’m missing the point? Surely <strong>Rusko</strong> doesn’t care about the state of dubstep or even my opinion for that matter? I’m sure he doesn’t, and quite frankly if this was a decent example of dub-pop I wouldn’t either.</p>\n<p>‘Feel so real’ is perhaps the worst tune on the LP, the production sounding like pre-set tones found on the likes of ‘Garage band’, the vocals so cheesy and poorly chosen it hurts. It almost feels like <strong>Mercer </strong>was ticking boxes when making the record, all the genres of the moment are present, but by no stretch of the imagination are they correct. And after all of this there are still moments that remind us of why Rusko was once fresh and exciting. ‘Scareware’ shows two fingers to hateful critics that “we ain’t scared of this” and is almost endearing in its attitude. ‘District Line’ the final tune of the LP is perhaps the best, creating a swirling mist of dub-reggae complete with charming synth pops and floating flutes.</p>\n<p>Despite this <strong>OMG</strong> is throwaway dubstep to an extreme, lazily and formulaically put together it attempts at a ‘party album’ by skimming electronic music’s trashier side but ultimately isn’t even a credible example of the genre’s he attempts to mimic. In many ways ‘mimic’ is the best word to describe <strong>OMG</strong>, it always has one eye on another market, another genre, another scene rather than the task in hand; making half decent music.</p>\n","slug":"1667-review-rusko-omg","category":"music","date":1278100841000,"wpid":1667,"isSticky":false,"featured_image":{"width":600,"height":600,"src":"2010/07/rusko.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAABgcI/8QAIRAAAgEDBAMBAAAAAAAAAAAAAQIEAwURAAYSMSEiQZH/xAAUAQEAAAAAAAAAAAAAAAAAAAAE/8QAFxEBAQEBAAAAAAAAAAAAAAAAAQIAEv/aAAwDAQACEQMRAD8AeW+FJqWyRR3VbKUSXcJnFzGuDMRQVvRzkn50o8H6B5Gppddz7bh3SZGa67gdqNZ6ZYGkMkMRnHHx1pjc5kk7WjkyK2XoKWPM+xAPf5rNExVqS67uAztUYliMknPegSdLnWsSO//Z"},"createdAt":1587295144455,"updatedAt":1588403565953,"author":"5e9b68b27a1236eccfeb1d24","old_image":"2010/07/rusko.jpg","categories":["music","reviews"]}