{"id":"5e9c0ca5774c2610387e53d6","artists":["5e9b68c77a1236eccfeb1da4","5e9b68cd7a1236eccfeb1dc7","5e9b68d47a1236eccfeb1e39","5e9b69177a1236eccfeb2274","5e9b69177a1236eccfeb22c3","5e9b695d7a1236eccfeb26f4"],"title":"Festival: Evolution Emerging 2012","content":"<p>With more than twenty five of the North East’s finest musical talents on display across the course of one evening, it’s safe to say that<strong> Evolution Emerging</strong> caters for all, regardless of your musical preferences.</p><p> Pioneered by the fantastic <strong>Generator</strong> as the younger, slightly hipper sibling of Newcastle/Gateshead’s annual <strong>Evolution Festival</strong> (which takes place over the next couple of days), the multi-venue event draws larger crowds each year, with many of the venues reaching capacity during performances. Having spent much of the night dashing around trying to savour the taste of as many local artists as possible, I’ve chronicled just a few of my thoughts below.</p>\n<p><a href=\"https://lulujames.com/\" target=\"_blank\"><strong>Lulu James</strong></a></p>\n<p>Having left a blazing trail of scintillating reviews and industry interest in recent months, <strong>Lulu James’s</strong> set was billed as one of the must see shows of Evo Emerging, despite opening the Cluny at a relatively modest hour. Strutting about the stage in no more than a binbag to protect her modesty, her every impeccable note oozed confidence and sexuality, with her leaning heavily on her recent debut EP <em><strong>Rope Mirage</strong></em>. The only fault to be picked, and it’s not too much of an issue at the moment, however should <strong>James</strong> seek to progress and bring her music to wider audiences then there’s no doubting that the stage show may need bulking out, perhaps with the addition of a live drummer. That aside, she’s certainly developed an astronomical amount as an artist in such a short space of time.</p>\n<p><iframe src=\"https://w.soundcloud.com/player/?url=https%3A%2F%2Fapi.soundcloud.com%2Fplaylists%2F1770086&show_artwork=true\" frameborder=\"no\" scrolling=\"no\" width=\"100%\" height=\"450\"></iframe></p>\n<p><a href=\"https://www.letsawaymusic.wordpress.com/\" target=\"_blank\"><strong>Let’s Away</strong></a></p>\n<p>Heading next door to The Cluny 2, I caught a couple of tracks from the North East’s answer to <strong>The Last Shadow Puppets</strong> – <strong>Let’s Away</strong>, whose brooding, sultry songwriting and awkward yet endearing charisma drew a large crowd. The two piece, joined by members of other local bands were extremely tight, especially taking into account that this show was their first ever live performance. With only a few tracks to their name, the duo are certainly set to kick up a fuss over the coming months.</p>\n<p><iframe src=\"https://w.soundcloud.com/player/?url=https%3A%2F%2Fapi.soundcloud.com%2Fplaylists%2F1415973&show_artwork=true\" frameborder=\"no\" scrolling=\"no\" width=\"100%\" height=\"450\"></iframe></p>\n<p><strong><a href=\"https://www.facebook.com/apollogetsthegirl\" target=\"_blank\">Apollo Gets The Girl</a></strong></p>\n<p>Another act making their live debut, <strong>Apollo Gets The Girl</strong> might not quite have looked the part, with their seemingly ladrock inspired get-up, yet their unique synth-pop more than made up for any image related misgivings. Heavily <strong>Cocteau Twins</strong> and shoegaze influenced, they’re a noticeable deviation from many other acts in the North East, completely disregarding the post-05 scene that appears to have gripped much of the music up here.</p>\n<p><a href=\"https://www.amyholford.tumblr.com/\" target=\"_blank\"><strong>Amy Holford</strong></a></p>\n<p>Having never seen <strong>Amy</strong> perform before, I was eagerly anticipating witnessing what had been reliably described to me as ‘<em>the best voice in Newcastle</em>‘, and on reflection, I’d find it hard to disagree. Rarely have I heard such a powerful and dynamic voice coming from such a petite frame, and it’s fair to say that she knew how to control the audience, proving thoroughly enrapturing throughout. Combining folk and classical inspirations to devastatingly passionate effect, swinging between atmospheric soulful numbers and <strong>Sarah Jaffe</strong>-styled folk-pop tracks, before ending the set on a high with a stunning a Capella cover, there was a real feeling amongst the crowd that <strong>Holford</strong> is something special.</p>\n<p><iframe src=\"https://www.youtube.com/embed/xMmGUHk9W5w\" frameborder=\"0\" width=\"560\" height=\"315\"></iframe></p>\n<p><a href=\"https://www.weirdshapes.co.uk/\" target=\"_blank\"><strong>Weird Shapes</strong></a></p>\n<p>Running back up the hill to The Star & Shadow, I caught the last couple of tracks from Stockton outfit <strong>Weird Shapes</strong>, another group going against the grain slightly in terms of their sound and general demeanor. Fusing ambient breakdowns with <strong>Radiohead</strong> like jagged guitar sections, of all the acts I saw at Evo Emerging, <strong>Weird Shapes</strong> had far and away the best visuals, synced perfectly in to the mood of their music.</p>\n<p>Check back in the next couple of days for an interview with <strong>Weird Shapes</strong>.</p>\n<p><a href=\"facebook.com/bethjeanshoughton\" target=\"_blank\"><strong>Beth Jeans Houghton & The Hooves Of Destiny</strong></a></p>\n<p>Billed as the ‘headline act’ of the event, and given their recent success (sold out tours, Jools Holland etc.) it was inevitable that The Cluny would be packed well in advance of the group taking to the stage. Given my occasional neglect of the North East music scene, I hadn’t quite realised just how popular <strong>BJH & Co</strong> had become, with the crowd belting every word back to the group. Whilst it’s not my cup of tea, their performance was tight and energetic, and clearly went down well with the majority.</p>\n<p><iframe src=\"https://www.youtube.com/embed/nBJkQ55EQMo\" frameborder=\"0\" width=\"560\" height=\"315\"></iframe></p>\n<p>So, having managed to catch more than half a dozen acts in the space of a few hours, I left <strong>Evo Emerging</strong> mightily impressed, not just with the talent on show, but also with the professionalism and organizational skills that Generator and the other various contributors displayed. With urban festivals on the rise, and Newcastle sadly lacking a world renowned showcase of musical talent (Emerging aside of course), the North East is screaming out for an event run with the ingenuity of Emerging, whilst providing a stage for nationally respected artists that the likes of Soundcity (Liverpool) and The Great Escape (Brighton) achieve. In a lively albeit compact music scene, <strong>Evolution Emerging</strong> is going someway to really putting Newcastle on the map.</p>\n","slug":"16783-festival-evolution-emerging-2012","category":"festivals","date":1338679828000,"wpid":16783,"isSticky":false,"featured_image":null,"createdAt":1587285157533,"updatedAt":1587825894718,"author":"5e9b68b27a1236eccfeb1d27","categories":["festivals","music"]}