{"id":"5e9c0c84774c2610387e53c7","artists":["5e9b69047a1236eccfeb2196"],"title":"Review: Japandroids – Celebration Rock","content":"<p>You all already know what <strong>Japandroids</strong> sound like.</p><p> That <strong><em>Celebration Rock </em></strong>looks near identical to 2009’s storming <strong><em>Post-Nothing</em></strong>, hell, that it’s called <strong><em>Celebration Rock</em></strong>, is beyond apt. With the title of their debut proper, Brian King and David Prowse had coined a term by which the songs contained therein could be delineated, rock music blasted out by a duo so close to breaking in two as to be free from the foibles of genre and terminology, but savvy to those foibles all the same. <strong><em> </em></strong>In the end, <strong><em>Post-Nothing </em></strong>marked Japandroids’ making rather than breaking, and so its title took on new weight. <strong><em>Post-Nothing </em></strong>could have been pre-nothing.</p>\n<p><strong><em>Celebration Rock</em></strong>, then, is the logical successor, still manic in its flaring distortion and punk-paced pounding, and twice as vital for having powered through. In naming their second album as they have, King and Prowse have once more caught the figurative bullet for the writer. Rock music this defibrillating, this alive, can leap sparking from the hands of even the most eloquent, but Japandroids have coined the catch-all term for us. <strong><em>Celebration Rock </em></strong>is celebration rock, in all its happy gratitude, its broken joy, its skyward-reaching sadness and its glass-sharp, fuzzy fucking <em>volume</em>.</p>\n<p>It’s characteristic of getting older that we also get slower, get more comfortable, find gentler joy in the subtle and quiet and challenging, while this instant gratification that’s so wondrously accessible in adolescence starts to bore or even grate. We spend our time getting sentimental about when things <em>meant </em>something, when every feeling was amplified to unbearable volume in a deluge of hormones, before we were old enough to afford or maybe even legally buy the booze that’s got us so maudlin. Japandroids do this too. You know what I’m talking about. Remember that night you were already in bed, said ‘fuck it’ and got up to drink with me instead? Japandroids do. <em>Younger Us </em>has been doing the rounds since 2010, but rather than give rise to any accusations of laziness (<strong><em>Celebration Rock </em></strong>is 8 songs and 36 minutes long), King and Prowse’s edge-of-seat paean to the fire of youth is <strong><em>Celebration Rock</em></strong>’s very essence distilled into three and a half boiling minutes. With this startling collection of songs, Japandroids have given us more than music to listen to. They’ve given us eight bombs to blow apart our harder hearts, give us that naked new skin rush. With <strong><em>Celebration Rock</em></strong>, Japandroids have given us ‘younger us’.</p>\n<p>On opener <em>Nights of Wine and Roses</em>, the duo provide (perhaps by way of manifesto) a brotherly reconciliation of our more destructive adolescent habits with our steadily advancing adulthood, and shit me, it’s great to hear someone singing <em>“Long lit up tonight, and still drinking. Don’t we have anything to live for? Well of course we do, but until it comes true, we’re drinking”</em> and then repeating the same sentiment re: smoking.<em> </em>It’s this extrapolating of romance from the ordinary that Japandroids are so adept at. <em>Adrenaline Nightshift </em>is an anthem for every hospital janitor with headphones in, lending their tinny noise to hushed wards, held up by guitars and drums and maybe caffeine but really guitars and drums. <em>The House That Heaven Built</em>, the record’s second (if you count <em>Younger Us</em>) single and penultimate track, is <strong><em>Celebration Rock</em></strong>’s absolute high. We’re all familiar with that chorus refrain by now – <em>“When they love you, and they will,” </em>sings King <em>“tell them all they will love in my shadow, and if they try to slow you down, tell them all to go to hell.” </em>It’s a moment utterly for each individual listener, whichever side of the lines we place ourselves on, just like when we were thirteen and every song we heard was about us. When King’s left-ear guitar harmony comes in at 2.43, my skin is an arcing network of electric pores and there is a wetness at my edges that threatens to spill and engulf every commuter on the platform around me who ever smiled at a distorted guitar turned up way too loud.</p>\n<p>There’s not a whole hell of a lot that could follow this. Like all kinds of ecstasy, <strong><em>Celebration Rock </em></strong>is bound to a mortality that is as much its lifeforce as its inevitable death. The heat and ferocity at which this record burns could leave a scar in any darkness, the memory enough to keep us warm, helping us to know that we don’t always need to take the route that makes the most sense. <em>Continuous Thunder</em>, <strong><em>Celebration Rock</em></strong>’s last and only slowdance, brings us down gently, a softer but insistent beating thrum that tells of love against obstacles – or maybe love because of obstacles – and works as <em>aide memoire </em>for the last half hour. There is a light that never goes out. Stay positive. The cold pissing rain might have flooded that fire, but we will still sing out loud ‘yeah yeah yeah’, like continuous thunder.</p>\n","slug":"16847-review-japandroids-celebration-rock","category":"album-reviews","date":1339171001000,"wpid":16847,"isSticky":false,"featured_image":null,"createdAt":1587285124237,"updatedAt":1588441777098,"author":"5e9b68b27a1236eccfeb1d3c","old_image":"generated/fbe77fc315c9d74a5b6ce8f0bbff2d2bf2b8fd75.jpg","categories":["album-reviews","music"]}