{"id":"5e9c0c68774c2610387e53bb","artists":["5e9b69117a1236eccfeb220d"],"title":"Review: Kitty Pryde – Haha I’m Sorry EP","content":"<p>Whether she’s penning love songs in ode to <strong>Danny Brown</strong>, spitting fire over deliriously skewed <strong>Carly Rae Jepsen</strong> samples or finding herself featured in reputable publications such as <em>TIME</em> and <em>The New York Times</em>, there’s no doubting the immediate and unexpected impact that self-proclaimed bratwave rapper <strong>Kitty Pride</strong> has had.</p><p> Whilst the mid-00’s was marked by the conversion of Myspace musicians into fully fledged, financially viable artists, with the likes of<strong> Lily Allen</strong> and <strong>Kate Nash</strong> at the forefront of the movement, it appears that the post 2010 scene may well be remembered as the ‘Tumblr generation’.</p>\n<p>With her first music video<em> Okay Cupid</em> sitting pretty at a cool <a href=\"https://www.youtube.com/watch?v=3SDYus7iKC8&feature=related\" target=\"_blank\">300,00 views</a> in under a month, the debate surrounding her talent or lack-thereof is set to reach an excruciating high as she unleashes her debut EP<em><strong> Haha I’m Sorry</strong></em>. Now whether you find her music appalling and offensive or bizarrely brilliant, the various issues arisen are a source of intriguing controversy. Tracks that openly discuss sexual obsession in an aggressive and unrelenting manner are not by any means anything new (see <strong>Odd Future</strong>, <strong>Lil B</strong> etc), but for a middle class white teenage girl to be turning the air black and blue is relatively unheard of. All the niche references and quirky ‘I’m not taking this seriously’ styled quotes aside, <strong>Kitty Pryde</strong> has the potential to be the figurehead for the modern unclassifiable world in which we live, where ethnicity, age, background, location and any number of external factors have no relevance whatsoever, and we’re all the better off for it.</p>\n<p>Having now been jetted out to New York and with her name on the lips of A&R’s all round the world, the careless attitude with which<strong> Pryde</strong> desires to be portrayed can grow tiring, and ultimately proves unnecessary. On <strong><em>Haha I’m Sorry</em></strong>, the beats and production are immaculate, with <strong>GRANT</strong>, <strong>SELA</strong> and <strong>Beautiful Lou</strong> churning out instrumentals that any rapper would find it easy to toy with. The cutesy style that the nineteen year old rhymes with is marmite at it’s best, chucking in anecdotes and popular culture references with apparent ease.</p>\n<p>Lyrically it’s what you’d expect from an angsty adolescent, “<em>I’m not really interested in hitting the tip top and I got you mad but you watching, you say this little white girl is running hip hop</em>” (<em>smiledog.jpg</em>) and “<em>blonde hair boys who put the youth in the crew and if you bring me around I’ll put some youth in youth in you too</em>” being the finest examples of the turbulence and inexperienced dexterity of <strong>Kitty</strong>. It’s this attribute that will split the masses, with half finding it despairingly annoying, and the others simply enjoying the whimsical ramblings that could easily have been extracted from the scribbles on a Geography binder of any eleventh grade girl.</p>\n<p>Personally, there’s an element to it that keeps me wanting more, however I’m yet to decide whether it’s Kitty’s unattainable crush that’s proves utterly relatable or the pronounced beats and impeccable production values. Comparison wise, it’s a direct response to the aforementioned early bedroom popstars, such as <strong>Nash</strong> and<strong> Allen</strong>, whilst there’s more than a whiff of<strong> Odd Future</strong> rebellion, mixing obscenities and cutting wit in equal measures. So with the daunting debut EP now out of the way, it’s up to<strong> Kitty Pryde</strong> to prove that she’s more than a mere Youtube sensation, and that not only does her music have the scope for innovation, but also sustainability. Yet with all that said, it’s important not to lose sight of the fact that we are still young, inconsistent and weirder than ever before, so until the day comes that we’re forced to take this thing called life seriously, let’s keep listening to <strong>Justin Bieber</strong> and bitching about pedicures. Stream the full <em><strong>Haha I’m Sorry</strong></em> EP below, and check out an interview conducted with<strong> Kitty Pryde</strong> via our friends at <a href=\"https://www.portalsmusic.com/2012/05/sights/meme-o-lithic-kitty-pryde-video-interview-editorial/\" target=\"_blank\">PORTALS</a>.</p>\n<p><iframe style=\"position: relative; display: block; width: 300px; height: 410px;\" src=\"https://bandcamp.com/EmbeddedPlayer/v=2/album=1976645175/size=grande3/bgcol=FFFFFF/linkcol=4285BB/\" frameborder=\"0\" width=\"300\" height=\"410\"></iframe></p>\n<p><iframe src=\"https://player.vimeo.com/video/43017763\" width=\"400\" height=\"300\" frameborder=\"0\" webkitAllowFullScreen mozallowfullscreen allowFullScreen></iframe></p>\n","slug":"16884-review-kitty-pryde-haha-im-sorry-ep","category":"album-reviews","date":1339511384000,"wpid":16884,"isSticky":false,"featured_image":null,"createdAt":1587285096554,"updatedAt":1588441776884,"author":"5e9b68b27a1236eccfeb1d27","old_image":"generated/pryde-kitty-50ab3c8c9cc82.jpg","categories":["album-reviews","new","music"]}