{"id":"5e9c34989b6559241525e25d","title":"Lollapalooza Line-up Finally Revealed","content":"<div style=\"text-align: center;\"><a rel=\"attachment wp-att-1954\" href=\"https://admin.</p><p>crackintheroad.com/music/17-lollapalooza-line-up-finally-revealed/attachment/lollacrowd\"><br />\n</a></div>\n<div style=\"text-align: center;\">So it’s almost that time of year again, you all know what I’m talking about, the time when you start saving up your pennies and trawling the internet looking for the best deals on festivals. With the majority of the large festival line-ups being released already, Lollapalooza are one of the last festivals to reveal their hand, and it’s a royal flush, playing many of the other festivals straight off the table. Lollapalooza has been running since 1990 and has featured the likes of the Beastie Boys, A Tribe Called Quest, Red Hot Chili Peppers and Radiohead, and this years line-up is no less exciting than previous years. This year will see Arcade Fire, The Strokes, Lady GaGa, Green Day, Soundgarden and Phoenix will all headline this years Lollapalooza hosted in Grant Park in Chicago. Whilst the inclusion of Phoenix as a headliner has already been questioned by many since the announcement, there is no doubting the quality of the rest of the acts as performers, regardless of whether or not you like their music. Other artists to feature over the three day event include Spoon, MGMT, The National, Devo, Wavves and 2manyDJs amongst others. Out of the large festivals this is by far my favourite line-up, and if it wasn’t for the cost of travelling to North America at the moment, I would be doing my utmost to be there. In a year where Leeds and Reading are headlined by three of the most volatile bands on the planet, this line-up shows that there is no harm in opting for undenialable quality.</div>\n<div style=\"text-align: center;\">\n<p>What do you think?</p>\n<p><a href=\"https://www.lollapalooza.com/\">https://www.lollapalooza.com/</a></p>\n</div>\n","slug":"17-lollapalooza-line-up-finally-revealed","category":"festivals","date":1270561800000,"wpid":17,"isSticky":false,"featured_image":{"width":3072,"height":2304,"src":"2010/04/lollacrowd.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAIAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAAAAX/xAAiEAABAwQABwAAAAAAAAAAAAABAAIDBREhMQQGBxITM8H/xAAVAQEBAAAAAAAAAAAAAAAAAAACA//EAB0RAAAFBQAAAAAAAAAAAAAAAAABAgMEERIiMbH/2gAMAwEAAhEDEQA/AIkPNNHbwMndTopWxkP8peWlpG821YjGdhSJOotJZI5ppsVwSPY4/ERVTLe3cCuIyVMej//Z"},"createdAt":1587295384075,"updatedAt":1588403569408,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2010/04/lollacrowd.jpg","categories":["festivals","music"]}