{"id":"5e9c0c2c774c2610387e5397","artists":["5e9b695d7a1236eccfeb26f4"],"title":"Interview: Weird Shapes","content":"<p>Settling down before Newcastle’s annual <strong>Evolution Emerging Festival</strong> with a running order and a cold pint of Grolsch in hand, it struck me just how blessed the North East is with it’s current crop of musical offerings.</p><p> Planning my schedule and being forced to miss the likes of <strong>Knuckledragger</strong>, <strong>Lilliput</strong> and <strong>Natasha Haws</strong> portrayed the phenomenal amount of talent on display. One act that I did manage to witness were Stockton math-pop quintet <strong>Weird Shapes</strong>, who wowed the crowd at the Star & Shadow with their undefinable diversity and intricately considered visuals. With the group just announced to play this years<strong> T in the Park</strong> Festival on the BBC Introducing Stage, I sat down with lead singer and songwriter <strong>Dan Spooner</strong> to find out a little more about their inspirations and aspirations.</p>\n<p><em>CitR: How and when did Weird Shapes come together?</em></p>\n<p><strong>WS: We’d been playing together as musicians for quite a while, with my brother and best friends who we’d known since we were kids. About a year ago we got the opportunity to work with a producer called Graeme Stewart (Radiohead), so we thought we’d change it up a bit and start something fresh that’s perhaps a little bit weirder and more left of centre than what we’d released previous. Weird Shapes was born.</strong></p>\n<p><em> Newcastle has quite a strong music scene at the moment, do you feel part of this scene, or more as outsiders?</em></p>\n<p><strong>I’m not sure, because we’re from Stockton which is 45 minutes down the road, we feel part of the North East scene rather than the Geordie one, but we certainly didn’t used to. However with NARC and Generator getting more involved with Teeside, and the emergence of bands like Chapman Family, Cattle & Cane and Young Rebel Set who are doing well in their own respective fields it certainly feels like Teessiders are more a part of the North East scene than ever before.</strong></p>\n<p><iframe src=\"https://www.youtube.com/embed/NZYAsTlDSgo\" frameborder=\"0\" width=\"560\" height=\"315\"></iframe></p>\n<p><em>Where do you tend to draw inspirations from, both musically and otherwise?</em></p>\n<p><strong>Matt and myself are the main songwriters. I work in chemistry which is boring but pays the mortgage. I work in a lab and do a lot of long nightshifts, we don’t have a radio so I occupy my mind by writing melodies in my own head for 12 hours, I wish I could tell you it was therapeutic but at times it borders on insanity. Inspiration from the mundane.</strong></p>\n<p><strong>Musically, I’m into ambient material and film scores. Tracks that are based around moods and setting scenes rather than just out and out pop songs. Matt’s more into prog, King Crimson and the like, so with the songwriting you find our tracks can have strange time signatures and then suddenly hit a crazy ambient breakdown, so it’s a merging of the two inspirations. It can be quite disjointed, that’s why we call it Prog!</strong></p>\n<p><em>Visuals seem to play a key part to your live shows, do you organise them yourself?</em></p>\n<p><strong>I feel it’s as important as the music we’re playing at times. A good friend of ours (Andy Berryman) is the film making equivalent of our band in Stockton, a little bit weird and a little bit neurotic. We met up just after recording our first single Blue Sky at Night and started kicking some ideas around about visuals. Two weeks later he’d made all these really interesting abstract videos for us to project onto the stage while we played live. It certainly seems to grab peoples’ attention, and takes some of the focus away from our gurning, sweaty faces!</strong></p>\n<p><em>Any plans for future releases?</em></p>\n<p><strong>We’ve got about 20 songs bouncing about in our studio at the minute and we think we’ve found the right one for the next single so we’ll be looking into getting that released in the next couple of months.</strong></p>\n<p>Check out <em>Clouds</em> below and keep up with <strong>Weird Shapes</strong> via <a href=\"https://www.facebook.com/weirdshapes\" target=\"_blank\">Facebook</a>, <a href=\"https://twitter.com/#!/weird_shapes\" target=\"_blank\">Twitter</a> and <a href=\"https://soundcloud.com/weirdshapes\" target=\"_blank\">Soundcloud</a>.</p>\n<p><iframe src=\"https://www.youtube.com/embed/qDcHdZ3101U\" frameborder=\"0\" width=\"560\" height=\"315\"></iframe></p>\n","slug":"17049-interview-weird-shapes","category":"interviews","date":1340314730000,"wpid":17049,"isSticky":false,"featured_image":{"width":165,"height":151,"src":"2012/06/307156_271755509531889_1530457031_n-165x151.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAJAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAABgP/xAAlEAAABAUCBwAAAAAAAAAAAAABAgMEAAUREiEGMRMyNlFxcsL/xAAVAQEBAAAAAAAAAAAAAAAAAAACA//EABoRAQACAwEAAAAAAAAAAAAAAAEAAhESIkH/2gAMAwEAAhEDEQA/ACOlmzeVsFXEzXbvZbMWpBQFnlRAxjCJjGLsW2mA7UrBtdZkVdQtkuPQwhdwhC7O+8Q0b0U/9A+oEm5h8waFVwyzXXo9n//Z"},"createdAt":1587285036876,"updatedAt":1588443773459,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2012/06/307156_271755509531889_1530457031_n-165x151.jpg","categories":["interviews","music"]}