{"id":"5e9c0c26774c2610387e5392","artists":["5e9b69117a1236eccfeb224e"],"title":"Preview: Latitude Festival","content":"<p>Latitude Festival is upon us once again, and it stands as bright as ever as one of the glowing gems in Britain’s crown of world class music festivals.</p><p> This may sound a tad sycophantic, but  this suggestion would be surely eradicated once you realise the sheer range and quality of the line up Latitude has brought together for 2012. Below is a list of acts, in day order, that we at Crack In The Road are looking forward to seeing at the festival this year:</p>\n<p><strong>Friday: </strong></p>\n<p><strong>Bon Iver: </strong></p>\n<p>A much anticipated headline act, Justin Vernon’s Bon Iver have come a long way in their five years of existence. ‘For Emma, Forever Ago’ is a record that still rings clearly in the minds of many, apart from those who responded to Bon Iver’s Grammy Award for Best New Artist with exclamations of ‘Who is Bonny Bear?!’ Ridiculous ignorance aside, readers of Crack In The Road will hardly need to reminded of the many successes Bon Iver has since achieved, along with high profile collaborations, but it is Bon Iver’s output of a beautiful filmed session which has got me personally excited for their performance at Latitude.</p>\n<p><iframe src=\"https://www.youtube.com/embed/A9Tp5fl18Ho\" frameborder=\"0\" width=\"560\" height=\"315\"></iframe></p>\n<p><strong>First Aid Kit:</strong></p>\n<p>I remember interviewing First Aid Kit at Kendal Calling in 2010, relatively early in their blossoming musical career, but even then I was struck by the clarity and purity in their passionate conviction for their craft. Musically they were very precise on the folk inspired tracks they were both playing and recording, and since then they have worked with the likes of Jack White and Bright Eyes, with their sophomore album ‘The Lion’s Roar’ receiving critical acclaim.</p>\n<p><iframe src=\"https://w.soundcloud.com/player/?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F33181561&show_artwork=true\" frameborder=\"no\" scrolling=\"no\" width=\"100%\" height=\"166\"></iframe></p>\n<p><strong>Chairlift:</strong></p>\n<p>Finding first success through their track ‘Bruises’ being used in an iPod advert, Chairlift returned to the furor with their sophomore album ‘Something’ which demonstrated a development of maturity in the band’s sound. Along with the album receiving many plaudits, singles ‘Sidewalk Safari’ and ‘Amanaemonesia’ lodged themselves into the playlists of DJs and bloggers with ease. If the band’s video for ‘Amanaemonesia’ is anything to go by, their performance is set to be pretty special.</p>\n<p><iframe src=\"https://www.youtube.com/embed/98XRKr19jIE\" frameborder=\"0\" width=\"560\" height=\"315\"></iframe></p>\n<p><strong>Saturday:</strong></p>\n<p><strong>SBTRKT:</strong></p>\n<p>Another act on the Young Turks roster, SBTRKT, a.k.a. Aaron Jerome, rise to critical acclaim has been a sudden jolt for both Jerome and the listening audience. Remaining behind a veil of relative anonymity, SBTRKT’s sound has been described as everything from ‘2step to UK Funky to Chicago House’. Whatever you want to call it, we here at Crack In The Road can’t wait for the follow up to Jerome’s self-titled debut 12″.</p>\n<p><iframe src=\"https://w.soundcloud.com/player/?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F39447035&show_artwork=true\" frameborder=\"no\" scrolling=\"no\" width=\"100%\" height=\"166\"></iframe></p>\n<p><strong>Josh T Pearson:</strong></p>\n<p>Josh T Pearson is an artist who’s backstory would struggle to be covered in even the most comprehensive of previews, however the release of his debut solo album ‘Last Of The Country Gentleman’ coincided my first chance to see Pearson perform live in the atmospheric surroundings of Manchester’s Deaf Institute. A striking, bearded figure, Pearson’s music is riddled with stories from his own life, battling with alcohol addiction and the effects it had on his relationships. Totally absorbing, his performance at Latitude is not one to be missed.</p>\n<p><iframe src=\"https://w.soundcloud.com/player/?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F47944341&show_artwork=true\" frameborder=\"no\" scrolling=\"no\" width=\"100%\" height=\"166\"></iframe></p>\n<p><strong>I Break Horses:</strong></p>\n<p>Hailing from Sweden, I Break Horses played their third ever show at Manchester’s Soup Kitchen and it became very obvious very quickly that they were a special act. Performing with an ethereal zeal, I Break Horses’ sound is an invigorating, textured soundscape. With their debut album ‘Hearts’ receiving many positive reviews, their performance at Latitude may give a good indication to what we can expect from the band in months to come.</p>\n<p><iframe src=\"https://w.soundcloud.com/player/?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F14788408&show_artwork=true\" frameborder=\"no\" scrolling=\"no\" width=\"100%\" height=\"166\"></iframe></p>\n<p>Sunday:</p>\n<p><strong>Paul Weller:</strong></p>\n<p>What can I add about Paul Weller that you couldn’t possibly already know? With his place already booked in musical history through ‘The Jam’ and ‘The Style Council’, Paul Weller continues to be a major force in music, continuing to write, record, and release his own solo material, with his latest album ‘Sonik Kicks’ released in March of this year. While many people may not be as well versed on Weller’s latest material, an opportunity to see such a musical legend cannot be missed.</p>\n<p><iframe src=\"https://www.youtube.com/embed/m-H0uIH5HHQ\" frameborder=\"0\" width=\"420\" height=\"315\"></iframe></p>\n<p><strong>St. Vincent:</strong></p>\n<p>Originating as a member of Polyphonic Spree and of Sufjan Stevens’ touring band, St. Vincent existed within the conversations of music journalists and bloggers for several months towards the end of 2011 after the release of her third album, ‘Strange Mercy’. Noted for it’s fantastic use of a wide array of instruments and arrangements, Annie Erin Clark a.k.a. St. Vincent, stated ‘I don’t think it’s the best record I’ll ever make, but I think it’s a good record’. A staggering level of modesty, which can only leave us more excited for album number four.</p>\n<p><iframe src=\"https://www.youtube.com/embed/Itt0rALeHE8\" frameborder=\"0\" width=\"560\" height=\"315\"></iframe></p>\n<p><strong>Perfume Genius:</strong></p>\n<p>Perfume Genius’ performance at this year’s Great Escape Festival still burns brightly in my mind. Set within the confines of an ornately beautiful church, Perfume Genius set about his set with the same quietly shy, but intensively powerful aura that had transcended his show a year earlier at Salford’s King’s Arms. Many readers of Crack In The Road will already be very familiar with the intimate music of Perfume Genius, however it was inspiring to see his performance retain the same fragility while becoming more matured and developed. A must see at Latitude Festival.</p>\n<p><iframe src=\"https://w.soundcloud.com/player/?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F44405671&show_artwork=true\" frameborder=\"no\" scrolling=\"no\" width=\"100%\" height=\"166\"></iframe></p>\n<p>In addition to these specific highlights, there are a plethora of other fantastic artists playing over the course of the weekend we’ll be planning on catching, including the likes of<strong> Los Campesinos!, Alt J, Apparat, Gross Magic, Kwes, Policia, Theme Park, </strong>and<strong> Walls. </strong></p>\n","slug":"17063-preview-latitude-festival","category":"festivals","date":1340585347000,"wpid":17063,"isSticky":false,"featured_image":null,"createdAt":1587285030469,"updatedAt":1588441776337,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2012/06/latitude-165x165.jpg","categories":["festivals","music"]}