{"id":"5e9c33aa9b6559241525e0cb","title":"Vox Population Open Mic Night: Mad Ferrett Review","content":"<p>In Preston it is quite a rarity for the gifted youth within its limits to gain any kind of exposure or recognition.</p><p> The Open Mike Night at the Mad Ferret, hosted by ‘Vox Population’ however, was an energizing platform for some of our fair city’s most fervent bands and acts to display their excellence. All the performances had their good points, ‘though this is who I deem the most worthy of this bountiful line-up.</p>\n<p><strong>Vox Population</strong><br />\nThis young four-piece with a genre frustratingly difficult to define, so I’ll take a stab at a Post-Punk- Strokes meet the Chilli- Peppers, with the odd riff out of the Hendrix school of axe-wielding, launched a stirring 3 song set to head-up the show and didn’t dishearten the core of Preston’s music scene gathering in the ‘Ferrett’. What was initially prominent was the meticulous endeavor put into the instrumental side, as each member excelled on their respective musical medium. Dan Morris conveyed an almost nonchalant demonstration of drumming aptitude coupled with a bassist in David Mettham, offering a near faultless display, and at the same time purveying a Cobain like image – no mean feat for a bassist. Tom Lawton’s riffs were inspiring and something only previously deemed plausible for a lad of his age on Guitar Hero. Whilst the front man Laurence Holt provided a first-rate exhibition of zeal and vocal class to carry off this band’s indie anthems, he also made for an endearing MC. It is unquestionable that they are not the finished article yet, but this was one of the most positive performances of the night.</p>\n<p><strong>One Man and His Beard</strong><br />\nThis man made for the cult-hero of the night. A figure that can only be described as a local take on ‘Seasick-Steve’ shuffled onto the stage and gathered one of the largest followings of the night. He played with a genre that I will term as a perverse rendezvous between rock, pop and spoof in a public toilet, yet it made for a thoroughly entertaining and enjoyable display. A rousing rendition of ‘The Telephone Only Rings When It’s Bad News’ dedicated to Fabio Capello (showing the audience his finger was firmly on the pulse of popular culture), really warmed this most unperturbed of crowds up. This man may not be looking at headlining at Glastonbury anytime soon, yet his seasoned performance gives him commendable recognition amongst the foundations of the Preston music scene.</p>\n<p><strong>MC Rival and Clarky</strong><br />\nNow these boys are something a little bit special. ‘Nervous?’ I asked them moments before they were to take the stage, they turned to one another simultaneously and laughed, keeping just on the right side of arrogance, as this almost telepathic understanding of one another would so effortlessly transfer onto the stage. A beat-boxing and bar-spitting combination, refreshingly alternate from the half-hearted attempts reigning from elsewhere in Preston, which can only be described as grossly negligent to their ‘grime’ genre. The others define ‘Chav’. These two define ‘excellence’. The bass offered from ‘Clarky’s’ larynx would rival (no pun intended) any Bose sound-system as even the most intricate parts of his beat-boxing – down to his imitation of the ‘vinyl scratch’ – are difficult to tell apart from the genuine article. He is beyond a talent in his chosen field and we must expect big things from our phenomenon of orally constructed beats. He was essentially complimented by the lyrically diverse and well selected verse structure of ‘MC Rival’, whose strengths lie in his versatility, at either a slower, more Americanized rap delivery, or the ability to switch, in tandem with ‘Clarky’, to a 16 bar Dubstep beat. This whips the crowd into frenzy, with a rapid discharge of shrewd rhyme sheathed in the raw brogue of the Preston streets. This duo ooze flair, poise and dare I say it ‘star quality’. They are the urban salvation of Preston, offering a refreshing dimension to that of what is already shaping up as a varied and exhilarating nucleus of performance acts. Watch this space.</p>\n<p><strong>Mobius Loop</strong><br />\nExplaining this group’s genre is a whole new ball game. They can be loosely termed as a Reggae/Blues/ Acoustic/ Funk outfit, and even more loosely, as they are utterly incomparable, a northern take on Gogol Bordello? It was worth a try. It’s where to begin with this band? Firstly they look absolutely incongruous on stage together, as if a music teacher has handed out the last instruments in the box and told them to collaborate – and collaborate they have! Easily the most pleasurable live act I have seen since Evolution Festival, as this band manage to intertwine the African sounds of the Congas and Bongos with the brassy harmonies of the Trombone, it somehow works. Front-man Tom Robinson balances his Brass expertise with a soulful voice, thanks to a gargantuan set of lungs, and the rest play around this, although it is evident the band play stood next to one another, perhaps a symbolization of their philosophy of unity. Sean O’Hara offers a rhythmic beat on the bongos with an additional helping of panache from Dave Watkins on acoustic bass. This band is clearly a serious outfit, and given the inventive nature of their music, are a sure fire tip for future success. There was even a point where I swore I heard shades of the Stone Roses; this lot express themselves as more of an experience than a regular gig slot.</p>\n<p>Other notable performances were-<br />\n<strong>The Bear Around Your Neck</strong>, perhaps the only man in Preston ever witnessed to actually pull off retro knitwear and loafers, as this one man band playing Harmonica and Acoustic guitar wouldn’t sound alien on the soundtrack of Skins 5.</p>\n<p>Tom Metcalfe with an absurdly adroit flamenco solo, in terms of instrumental competency was by far and away the highest standard of the night.</p>\n<p>The real victor was the Prestonian talent that had the podium to be showcased. Long may these brilliant events continue.</p>\n","slug":"1714-vox-population-open-mic-night-mad-ferrett-review","category":"music","date":1278011372000,"wpid":1714,"isSticky":false,"featured_image":{"width":550,"height":413,"src":"2010/07/samopenmic.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAIAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAMI/8QAIBAAAQQBBAMAAAAAAAAAAAAAAQACAxEEBRITMSFBUf/EABQBAQAAAAAAAAAAAAAAAAAAAAD/xAAUEQEAAAAAAAAAAAAAAAAAAAAA/9oADAMBAAIRAxEAPwDOWlQadkNe/J5IyxhqJj6Mh2miCegCBf2/CgRiAkGCY175u0RB/9k="},"createdAt":1587295146074,"updatedAt":1588403565977,"author":"5e9b68b27a1236eccfeb1d42","old_image":"2010/07/samopenmic.jpg","categories":["music"]}