{"id":"5e9c0bf6774c2610387e5369","artists":["5e9b69517a1236eccfeb2637"],"title":"Feature: Not The Resurrection We Hoped For","content":"<p><a href=\"https://www.</p><p>google.co.uk/imgres?um=1&hl=en&safe=off&client=firefox-a&sa=X&rls=org.mozilla:en-US:official&biw=1280&bih=634&tbs=isz:m&tbm=isch&tbnid=Q1ciZGKPng6csM:&imgrefurl=https://www.digitalspy.co.uk/music/news/a391185/stone-roses-fan-goes-missing-after-heaton-park-gig.html&docid=lmPLNLDUsyRfpM&imgurl=https://i2.cdnds.net/12/26/618x451/music_stone_roses_3.jpg&w=618&h=451&ei=zr31T5zYIKLC0QW8vYmJBw&zoom=1&iact=hc&vpx=317&vpy=210&dur=3448&hovh=192&hovw=263&tx=125&ty=138&sig=114728317765720683915&page=2&tbnh=138&tbnw=184&start=18&ndsp=22&ved=1t:429,r:1,s:18,i:153\" target=\"_blank\">Photo Source.</a></p>\n<p>Sixty thousand pissed up lads crammed into a muddy field belting out karaoke versions of once great songs; sounds perfect, right? Forgive my foolish stereotypes for a moment, yet I can’t be the only one who simply doesn’t understand the snowball of hype surrounding The Stone Roses ‘reunion’.</p>\n<p>Just as with <a href=\"https://api.crackintheroad.com/music/2671-the-last-of-the-libertines/\" target=\"_blank\">The Libertines in 2010</a>, there appears to be a general consensus that unearthing (and exaggerating the influence of) the past will always be something to look forward to. Fueled by naive music journalists afraid of speaking out for fear of being ostracized by what merely appears to be a healthy majority, we’ve allowed ourselves to slip into a vicious cycle in which having a marginally negative opinion on music is viewed as damning to the art form as a whole.</p>\n<p>I’m not for a moment suggesting that we entirely disregard the past and allow it to fade into meaningless obscurity, because after all, in continuously striving to tread new ground we have to know whereabouts we’ve already walked. However in certain instances perhaps we should respectfully leave the past where it’s fallen and not attempt an unnecessary and half-hearted resuscitation, especially when the memories themselves seem far from keen to be revived.</p>\n<p>Three paragraphs in, and I’m still to mention the gigs themselves; a real indication of how little people seem to care for the music, and more for the concept behind the return of a former great. For me, the entire fiasco bares striking similarities and telling contrasts to the return of another Mancunian legend – a fiery tempered, red haired midfield maestro if you will. Having hung up his boots the previous season, Paul Scholes’ decision to renounce his retirement was met with a colossal level of euphoria, however throughout his absence he’d maintained his fitness levels and unparalleled awareness. With The Stone Roses they’d goofed about for the best part of 15 years, none of them producing music of real significance, and certainly not maintaining a similar level of musical ingenuity. They were clearly far from ‘match fit’, and unlike one of the richest footballers in the UK, it’s fair to say that the tidy £12million pocketed from the three gigs will have been extremely well received. For me, it would have been the equivalent of Eric Cantona returning to Manchester United for the latter part of last season; it simply wouldn’t have worked, no matter how great an impression he left first time around.</p>\n<p>Desperately poor (and slightly tongue in cheek) analogies aside, the reviews I’ve stumbled across from the Heaton Park shows are either disappointingly blinkered by the aforementioned bias, or startlingly mediocre. Poor sound quality, dreadful organisation and Brown barely hitting a single note – not exactly what you expect at £60 per ticket. Many of those who lauded the performances were by their own merit several shandies to the good, or so blinded by their preconceptions of how the show would be, that an honest, realistic opinion escapes them.</p>\n<p>Numerous comments on various Youtube videos attempt to defend the frontman’s abysmal singing, claiming “[The Stone Roses] have never been about Ian’s vocals”, a laughable statement I’m sure you’ll agree. For arguments sake, let’s pretend that Johnny Greenwood was a god-awful guitarist (eg. possessed the guitar playing skills of The Enemy’s Tom Clarke…), even the most dedicated Radiohead fan would struggle to find a case for supporting what would undoubtedly be poor live performances. Nostalgia and cherished memories will sadly never excuse, improve nor make up for a below par performance.</p>\n<p><iframe src=\"https://www.youtube.com/embed/oLZxhnpQQf0\" frameborder=\"0\" width=\"560\" height=\"315\"></iframe></p>\n<p>The idea that it’s all about the atmosphere and that the live music is secondary also doesn’t hold water. By viewing their shoddy performances in such a light, you completely devalue the essence, beauty and talent of the live show. Otherwise it’s essentially expensive, below par karaoke that you could be a victim of in countless pubs across the UK.</p>\n<p>In my mind, all the reunion has served to do is greatly tarnish their legacy (aside from fill the wallets of Brown & Co). A group once renowned for their passion, vibrancy and honour, now appear washed up and lacking the chemistry that elevated them to phenomenal heights in the first place. It’s for these very reasons that The Smiths will never reform, it would be an injustice to the reputation that they rightfully earned.</p>\n<p>So with a T in the Park performance this weekend, and a reported two album deal on the table, it’ll be interesting to witness if the waves of elation remain as buoyant, or whether those forking out the excessive amounts of money, start to demand quality in return. For me, I’m more than happy to let the past sleep, at least until it’s in a fit enough state to awaken.</p>\n<p> </p>\n","slug":"17173-feature-not-the-resurrection-we-hoped-for","category":"editorials","date":1341501714000,"wpid":17173,"isSticky":false,"featured_image":null,"createdAt":1587284982285,"updatedAt":1588441776126,"author":"5e9b68b27a1236eccfeb1d27","old_image":"generated/b402bab4eb25e953eef911e1fde6076e116ce0b2.jpg","categories":["editorials","music"]}