{"id":"5e9c0bd0774c2610387e5357","artists":["5e9b693e7a1236eccfeb24f9"],"title":"Preview: Secret Garden Party","content":"<p><a href=\"https://admin.</p><p>crackintheroad.com/music/17279-preview-secret-garden-party/attachment/img_7641-2/\" rel=\"attachment wp-att-17280\"><img class=\"alignleft size-medium wp-image-17280\" title=\"IMG_7641\" src=\"https://api.crackintheroad.com/uploads/2012/07/IMG_7641-260x172.jpg\" alt=\"\" width=\"260\" height=\"172\" /></a>As we move steadily through the festival season, one can be forgiven for viewing the major festivals this summer with some wariness. A combination of grim weather and uninspired line-ups means that it’s the small and medium-sized festivals that shine this year. From our very own Brainchild to this week’s<a href=\"https://admin.crackintheroad.com/music/17063-preview-latitude-festival/\" target=\"_blank\"> Latitude Festival</a>, the arts festivals are increasingly coming into the spotlight, and Cambridge’s Secret Garden Party is the artiest of the arty and the weirdest of the weird. Although it’s about the experience as much as anything, we know our priorities – and listed below are a list of the acts large and small that we’re looking forward to this year.</p>\n<p><strong>Edward Sharpe & the Magnetic Zeros:</strong></p>\n<p>Headliner #1, and possibly the most upbeat, cheerful band on the line-up. Born out of some ridiculous happenings regarding alter-egos and messiahs and drug addiction, <strong>Edward Sharpe & the Magnetic Zeros </strong>are that sort of huge, do-what-we-want, completely mental American folk band not entirely unlike <strong>Alabama Shakes</strong> or <strong>the Head and the Heart</strong>. Led by intensely charismatic frontman Alex Ebert, they’re the type of band that perfectly encapsulates the Secret Garden vibe.</p>\n<p><iframe src=\"https://www.youtube.com/embed/h0RQnGhxZzg\" frameborder=\"0\" width=\"480\" height=\"315\"></iframe></p>\n<p><strong>Caravan Palace:</strong></p>\n<p>Electro-swing is music for dancing. It’s probably one of the best types of music for dancing, in fact. <strong>Caravan Palace </strong>are the first of two of the really attention-grabbing electro-swing acts of the weekend, in this case appearing on the main stage. If any type of music was made for this festival, or if this festival was made for any type of music, this is it. They’re French too, but don’t let that put you off.</p>\n<p><iframe src=\"https://www.youtube.com/embed/UraJOT2LosQ\" frameborder=\"0\" width=\"480\" height=\"315\"></iframe></p>\n<p><strong>Daughter:</strong></p>\n<p>Moving away from the mental dancin’ music for a moment, <strong>Daughter </strong>add SGP to their impressive array of festival slots this summer – from Latitude to Pukkelpop to Green Man to Bestival, culminating in supporting <strong>Beirut </strong>on their UK tour later this year. Definitely worth checking out their EPs, and definitely worth checking out live.</p>\n<p><iframe src=\"https://www.youtube.com/embed/kuC2sc-1CMU\" frameborder=\"0\" width=\"480\" height=\"315\"></iframe></p>\n<p><strong>Orbital:</strong></p>\n<p>Headliner #2, and one hell of a booking for a 25,000 capacity festival. A pretty strong contrast to <strong>Edward Sharpe</strong>, the dance and techno stylings of <strong>Orbital</strong> are sure to turn that main stage into a really, really big and really awesome party on the Friday night.</p>\n<p><iframe src=\"https://www.youtube.com/embed/ktgznOFpXeY\" frameborder=\"0\" width=\"480\" height=\"315\"></iframe></p>\n<p><strong>Little Dragon:</strong></p>\n<p>Ever the multiculturalists, here’s Sweden’s representation at this year’s festival – and a hell of a representation at that. Collaborations with <strong>SBTRKT</strong> and <strong>Gorillaz</strong> aside, singer Yukimi Nagano is arguably one of the best female vocalists out there.</p>\n<p><iframe src=\"https://www.youtube.com/embed/6QS10B4k_9g\" frameborder=\"0\" width=\"480\" height=\"315\"></iframe></p>\n<p><strong>Electric Swing Circus:</strong></p>\n<p>The second mega-exciting electro-swing act on this year’s line-up. Tragically, the band have only ever released a couple of songs, but they really are showing the genre at its best – and whilst <strong>Caravan Palace</strong> might be giving the main stage the electro-swing treatment, this performance is where the party will really be at. Smaller, funner, and crazier. Oh, and they’re cool. Very cool.<strong><br />\n</strong></p>\n<p><iframe src=\"https://www.youtube.com/embed/hkwLO44IQN8\" frameborder=\"0\" width=\"480\" height=\"315\"></iframe> </p>\n","slug":"17279-preview-secret-garden-party","category":"festivals","date":1341928804000,"wpid":17279,"isSticky":false,"featured_image":null,"createdAt":1587284944564,"updatedAt":1588441775746,"author":"5e9b68b27a1236eccfeb1d16","old_image":"generated/secret-garden-510f1c9e4c8d6.jpg","categories":["festivals","music"]}