{"id":"5e9c33a69b6559241525e0c5","title":"An Evening With The RNCM Symphony Orchestra","content":"<p><a rel=\"attachment wp-att-1747\" href=\"https://admin.</p><p>crackintheroad.com/music/1746-an-evening-with-the-rncm-symphony-orchestra/attachment/arnalds\"><img class=\"alignnone size-full wp-image-1747\" title=\"arnalds\" src=\"https://api.crackintheroad.com/uploads/2010/07/arnalds.jpg\" alt=\"Ólafur Arnalds\" width=\"600\" height=\"600\" srcset=\"https://api.crackintheroad.com/images/2010/07/arnalds.jpg 600w, https://api.crackintheroad.com/images/2010/07/arnalds-150x150.jpg 150w, https://api.crackintheroad.com/images/2010/07/arnalds-300x300.jpg 300w, https://api.crackintheroad.com/images/2010/07/arnalds-494x494.jpg 494w, https://api.crackintheroad.com/images/2010/07/arnalds-165x165.jpg 165w\" sizes=\"(max-width: 600px) 100vw, 600px\" /></a></p>\n<p>When Ólafur Arnalds announced that he was debuting his new album <em>…and they have escaped the weight of darkness</em> with an orchestra in Manchester, it was not an opportunity to be missed. But what the audience got was probably more than they bargained for. As well as Arnalds’ performance, the audience were also treated to the UK premiere of Avner Dorman’s <em>Spices, Perfumes and Toxins</em>, Igor Stravinsky’s <em>The Rite of Spring</em> and, to open the night, Radiohead guitarist Jonny Greenwood’s <em>Popcorn Superhet Receiver</em>, which is based on white noise – just as strange you might expect from the Radiohead guitarist. More Radiohead came in the foyer before the show and during the interval – a string quartet performing songs from <em>Kid A</em> greeted guests upon arrival whilst a big band encouraged guests to guess their adapted versions of Radiohead classics in between songs of their own.<br />\nStravinsky’s <em>The Right of Spring</em> came alive in the Bridgewater Hall in a way that one can never capture on record. But the biggest surprise of the evening came from <em>Spices, Perfumes and Toxins</em>. With two percussionists taking the lead on marimbas, two beaters in each hand, this breathtaking piece in three movements was the highlight of the evening. The percussionists effortlessly led the orchestra with a few nods to each other and the conductor in this awe-inspiring performance.<br />\nAs for Arnalds – his time finally came at the end of the evening, with him at the piano and in charge of electronics positioned next to the conductor and Arnalds’ string quartet, who were in turn surrounded by the orchestra. The new orchestral arrangements worked well in places, crescendos enhanced by the occasional addition of the harp or orchestral drum. But in other places the performance seemed lacking. Arnalds’ electronics sounded out of place in the classical environment, which clearly wasn’t helped by the speakers which were taking the strain of something they weren’t designed for. The lack of a real, rock drum kit could also be felt. In short – the performance didn’t seem to know what it wanted to be – the orchestral arrangements sounded brilliant at times but was brought down by electronics and lack of other instrumentation, which make the album what it is. Although Arnalds has always stated of his dream to combine pop and classical music, he hasn’t achieved it yet – at least not on a live orchestral level.</p>\n","slug":"1746-an-evening-with-the-rncm-symphony-orchestra","category":"music","date":1278437032000,"wpid":1746,"isSticky":false,"featured_image":{"width":600,"height":600,"src":"2010/07/arnalds.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAABQj/xAAjEAACAQIEBwAAAAAAAAAAAAABAgADBQQREnEhMzRBUXLB/8QAFQEBAQAAAAAAAAAAAAAAAAAAAQL/xAAXEQEBAQEAAAAAAAAAAAAAAAABAAIh/9oADAMBAAIRAxEAPwCk7hRVrzga7YiomgMNAchTuO/iLAgjMHhALj1qb/YlS5SeokGust//2Q=="},"createdAt":1587295142642,"updatedAt":1588403565927,"author":"5e9b68b27a1236eccfeb1d14","old_image":"2010/07/arnalds.jpg","categories":["music","reviews"]}