{"id":"5e9c0b82774c2610387e531c","title":"Review: Secret Garden Party 2012","content":"<p><a href=\"https://admin.</p><p>crackintheroad.com/music/17489-review-secret-garden-party-2012/attachment/622147_10150974712963543_465591670_o/\" rel=\"attachment wp-att-17491\"><img class=\"size-medium wp-image-17491 alignleft\" title=\"622147_10150974712963543_465591670_o\" src=\"https://api.crackintheroad.com/uploads/2012/07/622147_10150974712963543_465591670_o-260x173.jpg\" alt=\"Credit: Nadia Beckett\" width=\"260\" height=\"173\" /></a></p>\n<p>It’s a strange feeling to reflect on a festival and find yourself quite unsure of what actually happened for four or five days. It’s certainly not a feeling that you’ll get walking out of Reading Festival or T in the Park or the Isle of Wight. But then, those events are made for the music. Cambridge’s Secret Garden Party may well be one of the few music festivals in the world where the music doesn’t take the spotlight. Equal footing is given to the art, the “action camps”, the random goings-on and the music, all made possible and held up not by corporate brands and mainstream acts, but by the people on the ground. It seems almost too obvious to call it a festival “by the people, for the people”, but that does seem most fitting. Secret Garden is not a commercial event in a field where punters gather to see music, but is a coming together of some of the maddest, most eccentric and most creative artists in the world. What we have here for you is a summary of the best and the brightest of the festival – the music, the art, the stalls, the events and the people who stood out as the absolute pinnacle of what Secret Garden Party has to offer.</p>\n<p>Let’s begin with the music. The sheer eclecticity of the headliners must surely be praised – from the feel-good folk rock of <strong>Edward Sharpe & the Magnetic Zeros</strong>, who proved, as expected, one of the most enjoyable sets of the weekend (though the question of longevity must be raised – at what point did a set of under an hour become acceptable for festival headliners?) to the incredible light show of dance legends <strong>Orbital </strong>and electro-swing stylings of <strong>Caravan Palace</strong>. It takes guts to give a headline slot to a less typical act like that. Elsewhere, <strong>Electric Swing Circus</strong>‘ Friday night 2am show absolutely <a href=\"www.crackintheroad.com/?p=17279&preview=true\" target=\"_blank\">lived up to expectations</a> whilst SGP darlings <strong>The Correspondents </strong>once again proved their dedication to putting on a stunner of a live show during a secret set at the very end of the festival. The weekend wasn’t exactly musical nirvana, as a lacklustre set from <strong>Scroobius Pip </strong>disappointed and it has not yet become clear why the festival’s organisers seem to have such a thing for <strong>Get Cape. Wear Cape. Fly</strong>, but overall the selection of music was not only of strong quality, but also proved impressively apt for the style and ethos of the festival.</p>\n<p><a href=\"https://admin.crackintheroad.com/music/8600-secret-garden-party-2011-art/\" target=\"_blank\">Last year’s art pieces,</a> with the exception of <strong>85a</strong>‘s “Electric Spectacle” and the tragically yet hilariously doomed “Is Land” piece, <em></em>fell a little bit flat. This year, however, they did not. As ever, taking centre stage at the festival was the traditional setpiece in the middle of the festival’s lake, “Figureheads of the Ages” by burning art pioneers <strong>Pirate Technics</strong> (pictured). <a href=\"https://admin.crackintheroad.com/music/17489-review-secret-garden-party-2012/attachment/ayv5e7tcuaasur8/\" rel=\"attachment wp-att-17502\"><img class=\"alignleft size-medium wp-image-17502\" title=\"AyV5E7TCUAAsuR8\" src=\"https://api.crackintheroad.com/images/2012/07/AyV5E7TCUAAsuR8-260x346.jpg\" alt=\"\" width=\"260\" height=\"346\" /></a>As with much of the art at Secret Garden, the piece is, of course, fully interactive – with the man-made island being used as its own small stage complete with music and DJs before being ceremoniously set alight and destroyed halfway through the festival. <strong>Roding Projects’ </strong>“The Great Guilded Retriever”, provided more interactivity, stunningly imposing over the skyline of the festival and complete with inner sanctum and periscope through the eyes of the giant wooden canine. A personal favourite, the piece perfectly represented the madness and the humour that Secret Garden art should be about. <strong>Sarah Cockings</strong>‘ “Lune”, though not as physically imposing or obvious as some of the other installations, was an amusing tribute to the <a href=\"https://www.guardian.co.uk/artanddesign/2011/aug/02/missing-inflatable-island-secret-garden\" target=\"_blank\">premature release</a> of her “Is Land” setpiece last year – this year, however, it was purposefully cut loose, complete with GPS tracking software. <a href=\"https://admin.crackintheroad.com/music/17489-review-secret-garden-party-2012/attachment/65999424-772a-4d9d-a5b7-17f353f3c6c8/\" rel=\"attachment wp-att-17511\"><img class=\"alignright size-medium wp-image-17511\" title=\"65999424-772a-4d9d-a5b7-17f353f3c6c8\" src=\"https://api.crackintheroad.com/images/2012/07/65999424-772a-4d9d-a5b7-17f353f3c6c8-260x173.jpg\" alt=\"\" width=\"260\" height=\"173\" /></a>Finally,<strong> Peter Hudson</strong>‘s world-famous “Charon” – taken straight from Burning Man in the US, is a seemingly perpetually-moving 3D stroboscopic zoetrope, which uses strobe lighting in order to create the illusion of motion. It really is a masterful and fantastically creepy piece of art, and by far the best piece of art on display at this year’s festival.</p>\n<p>On top of all that music and art, there is always a plethora of alternative activities on display at Secret Garden Party. Highlights in particular include <strong>Tax Deductible</strong>‘s “Shitfaced Shakespeare”, a theatrical endeavour in which one of Shakespeare’s plays are acted out with one cast member becoming progressively more plastered as the show goes on (it will, for those attending, be making an appearance at this year’s Edinburgh Fringe). Sunday afternoon’s traditional paint fight on the mainstage (the results of which are pictured at the beginning of this review) turned out exactly how you’d expect a mass paint fight to turn out. Stand-up performances from <strong>Robin Ince </strong>and <strong>David O’Doherty </strong>stood out as particularly strong, as did <strong>Dances With (A Girl From) Wolves</strong>, the dance troupe from the <strong>London Leisure Pirates</strong>, whose own typically eccentric tent was notably the best place onsite for the somewhat atypical combination of late-night partying and interactive pantomime-style viewings of classic Disney films.</p>\n<p>As with most other festivals, there are administrative criticisms to be made. The sheer amount of mud was a serious problem, and was barely dealt with at all – certainly not with the same efficiency as had occured at Latitude Festival the week before – and certain rumblings have started to appear about the ineptitude of on-site security and a string of thefts across the weekend, something which caused particular controversy last year. They’re not gamebreaking flaws, but these are issues that need to be addressed by the festival’s organisers in time for next year’s event.</p>\n<p>Despite those little issues, however, it’s pretty damned hard to pick fault with this year’s festival. The sheer quality of music, art and interactivity on offer and the unbeatable vibes brought along by the punters and performers all came together to create four days of absolute creative and artistic bliss. As a music festival, Secret Garden Party is up there with the best. As a coming together of ingenuity and inspiration, it’s unbeatable. As an experience, it’s absolutely unmissable. </p>\n","slug":"17489-review-secret-garden-party-2012","category":"festivals","date":1343226595000,"wpid":17489,"isSticky":false,"featured_image":{"width":950,"height":633,"src":"2012/07/622147_10150974712963543_465591670_o-950x633.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAAAAb/xAAjEAABAwMCBwAAAAAAAAAAAAACAAEEBRExAyIHEhMhMkGB/8QAFAEBAAAAAAAAAAAAAAAAAAAABv/EAB0RAAEDBQEAAAAAAAAAAAAAABEAAgQBBSEiMcH/2gAMAwEAAhEDEQA/AJurRoUqi9GYRNLM9hCPiOWvnN/X1SR8O6vzFZtB2v23oiXTJT44q3JPfEZt2xbwBf/Z"},"createdAt":1587284866715,"updatedAt":1588443772975,"author":"5e9b68b27a1236eccfeb1d16","old_image":"2012/07/622147_10150974712963543_465591670_o-950x633.jpg","categories":["festivals","music"]}