{"id":"5e9c33a49b6559241525e0bf","title":"Preview: Kendal Calling","content":"<p>Born in 2006<strong> </strong>and boasting <strong>Pendulum </strong>as a headline act in it’s first year, <strong>Kendal Calling </strong>now exists as a well established musical oasis for thousands of revelers in <strong>Cumbria</strong>.</p><p> Several location changes, caused by an ever increasing fan demand for tickets, saw <strong>Kendal Calling </strong>call <strong>Lowther Deer Park </strong>home last year and thankfully this has stayed the same in 2010. Set in some of the most beautiful countryside of the North of England, the deer in the park were originally a gift from <strong>Henry VIII </strong>and still wander around the 2000 year old trees gracing the site. However do not be mistaken in believing that this means that <strong>Kendal Calling </strong>is just a chilled out festival set in the middle of nowhere. While there is the opportunity to relax with locally brewed ales in the (hopefully) sun, there are many activities and events on the site such as the <strong>Cumbrian Olympics </strong>and an arena painstakingly decorated as a <strong>House Party, </strong>which will be true to it’s name and last well into the early hours.</p>\n<p>Now that we’ve established that you’ll have a good view while you’re camping and that there will be things to do during down time, let’s take a look at the really important stuff.</p>\n<p>Headline sets by the  North West musical heavyweights the <strong>Doves </strong>and <strong>The Coral</strong><strong> </strong>will excite many fans, especially as <strong>The Coral </strong>release their new studio album <strong>‘Butterfly House’ </strong>on the 12th July. However it is when you dive below the surface do you find the acts that make <strong>Kendal Calling </strong>a fantastic opportunity to witness quality music in relatively intimate surroundings. Leading up to the festival, <strong>Crack in the Road </strong>will post tips for certain bands to see not only at <strong>Kendal Calling, </strong>but also to listen and discover in their own right!</p>\n<p>These band tips will take a look at certain bands in greater detail, however it is well worth mentioning a few bands now to illustrate the eclectic nature of <strong>Kendal Calling. </strong></p>\n<p><strong>General Fiasco:</strong></p>\n<p>Hailing from Northern Ireland, <strong>General Fiasco </strong>are a guitar driven indie three piece that have already supported the likes of <strong>The Wombats </strong>and <strong>Snow Patrol</strong>. Their debut album <strong>Buildings </strong>was well received by critics and fans alike, with many drawing comparisons to fellow Northern Irish rockers <strong>Ash. </strong>An up and coming band, <strong>General Fiasco </strong>are well worth checking out on the <strong>Calling Out Stage </strong>on Friday.</p>\n<p><strong>First Aid Kit:</strong></p>\n<p>Compromising of Swedish indie duo <strong>Johanna </strong>and <strong>Klara Soderberg, First Aid Kit </strong>first gained mass attention when their YouTube video cover of a song by the <strong>Fleet Foxes </strong>became viral. Their woodsy, folk-influenced song writing is entwined beautifully with their vocal harmonies, with comparisons to <strong>Joanna Newsom </strong>not being too far off the mark. Their debut album ‘<strong>The Big Back & The Blue</strong>‘ was recently at the beginning of this year, with a tour of  the UK and the USA following shortly after. <strong>First Aid Kit </strong>promise to bring quality yet dreamy folk to the heart of the British countryside.</p>\n<p><strong>Doorly:</strong></p>\n<p>First beginning his DJ career while working as a barman (he filled in for a regular DJ who dropped out), <strong>Doorly </strong>is now one of the hottest DJ’s around. Recommended personally by <strong>Zane Lowe</strong> during an exclusive interview with <strong>Crack in the Road</strong>, <strong>Doorly </strong>is most well known for his remix of <strong>Dizzee Rascal</strong>‘s song <strong>Bonkers</strong>. A DJ that can mix a thumping dubstep tune into a dirty electro house track, <strong>Doorly </strong>is guaranteed to get you dancing amongst the deers.</p>\n<p><strong>Goldheart Assembly:</strong></p>\n<p>After <strong>Crack in the Road </strong>first interviewed <strong>Goldheart Assembly, </strong>we knew they were no ordinary band. Discussing how <strong>Greggs </strong>sausage and bean melt pasties were the ‘bollocks’ and that they would happily play at a <strong>Greggs Festival</strong>, <strong>Goldheart Assembly </strong>appeared to have taken their common Alternative tag to heart. A band that was born out of a collective of friends with various musical influences, their sound is an eclectic mix of instruments and ideas. They played to a packed audience at <strong>Camden Crawl </strong>and <strong>Dot to Dot Festival</strong>, and will no doubt receive the same recpection at <strong>Kendal Calling.</strong></p>\n<p><strong>Dananananaykroyd:</strong></p>\n<p>A six-peiece, self dubbed ‘fight pop’ band from Glasgow, <strong>Dananananaykroyd </strong>have created an infectious sound full of distorted guitars and screamed vocals. Known for their energetic sets, band member <strong>John Baillie Junior </strong>jumped off the stage at a Sydney gig and was left with a broken arm that required 4 permanent metal pins. While no further accidents have plagued the band, do not expect them to have calmed down their post-punk attitude when performing live.</p>\n<p><strong>1, 2, 3, 4’s:</strong></p>\n<p>One of the least well known bands to be playing <strong>Kendal Calling</strong>, but the <strong>1, 2, 3, 4’s</strong> are definitely one of the bands with the most potential. If you are like me and cannot stop singing the <strong>Fiest </strong>song when you read their band name, you cannot help but wonder if this is just a coincidence or a fantastic marketing ploy. Another product of the North West, the <strong>1, 2, 3, 4’s </strong>have been labeled as orchestral indie pop, and they do not fail to deliver on such a grandiose tag. Their tracks are full of soul yet retain a likable upbeat quality that inevitably makes them entertaining to listen to. They have released their debut EP ‘<strong>You Do Something</strong>‘ and are my personal tip to make sure you see at the festival and beyond.</p>\n<p><iframe src=\"https://www.facebook.com/plugins/likebox.php?id=114090381951328&width=292&connections=10&stream=false&header=false&height=255\" scrolling=\"no\" frameborder=\"0\" style=\"border:none; overflow:hidden; width:292px; height:255px;\" allowTransparency=\"true\"></iframe></p>\n","slug":"1752-preview-kendal-calling","category":"festivals","date":1278499806000,"wpid":1752,"isSticky":false,"featured_image":{"width":3504,"height":2336,"src":"2010/07/img_5188-kendal-calling.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAUH/8QAIhAAAQIFBAMAAAAAAAAAAAAAAgERAAMEBSEGEhMxFVGh/8QAFAEBAAAAAAAAAAAAAAAAAAAAA//EABcRAAMBAAAAAAAAAAAAAAAAAAABETH/2gAMAwEAAhEDEQA/AMZpLRZKazck+funzsCiAThhM+l76eJJ6ctYmSeXMmVnSmVl+whBVzR1G8P/2Q=="},"createdAt":1587295140197,"updatedAt":1588403565873,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2010/07/img_5188-kendal-calling.jpg","categories":["festivals","music"]}