{"id":"5e9c0b65774c2610387e52fe","artists":["5e9b68c77a1236eccfeb1d52"],"title":"New: /please/ – .2.","content":"<p>From the initial Balearic beats rife opening of <em>boyzone</em> you are cast into one of those heady summer escapes of comforting familiarity as often conjured forth by the dream pop genre.</p><p> The almost lugubriousness quality of the underlying vocals layered into this track are just the start for this debut album hailing from Bristol based <strong>/Please/</strong> (one of the latest signings to  <strong>Sewage Tapes</strong> – a low key, cassette-spewing purveyor of the mewling afterbirths left behind  in the quietening surf of the chillwave scene). The ethereal quality of these earlier tracks is soon juxtaposed with lo-fi guitar rhythms and a clandestine beat as the album comes full swing; a repetitive hubbub of competing sounds softly pushing for your attention. Amidst the fuzz there are yet more snippets of humanity to be discerned, with samples of disembodied voices floating from the void in <em>to deviate from tradition</em>. This escapade into the unknown is but a brief excursion clocking in at under 30 minutes, despite this however, it lingers, muddled in the memory, a half remembered dreamscape waiting for your return.</p>\n<p>Available <a href=\"https://sewagetapes.bandcamp.com/album/2\">here</a> free for download. With analogue cassette release to follow.</p>\n<p><iframe width=\"300\" height=\"355\" style=\"position: relative; display: block; width: 300px; height: 355px;\" src=\"https://bandcamp.com/EmbeddedPlayer/v=2/album=3716187611/size=grande2/bgcol=FFFFFF/linkcol=4285BB/\" allowtransparency=\"true\" frameborder=\"0\"><a href=\"https://sewagetapes.bandcamp.com/album/2\">.2. by /please/</a></iframe></p>\n","slug":"17591-new-please-2","category":"album-reviews","date":1343779803000,"wpid":17591,"isSticky":false,"featured_image":null,"createdAt":1587284837106,"updatedAt":1588441775205,"author":"5e9b68b27a1236eccfeb1d25","old_image":"generated/c3d28814505300f0d640c249bfc480685450214f.jpg","categories":["album-reviews","mpfree","music"]}