{"id":"5e9c0b4e774c2610387e52f1","artists":["5e9b693e7a1236eccfeb2519"],"title":"Introducing: shy kids","content":"<p>There are fewer better sounds than organized chaos.</p><p> As the various sections of the music collide, it all suddenly begins to make sense, and the veil of obscurity drops, leaving a vivid, sparkling picture. Toronto three piece <strong>shy kids</strong> thrive upon this, piecing together their tracks in a manner that perhaps shouldn’t work, yet it’s the uncertainty and unpredictable nature of their three demos that make them so enthralling. Opening with the call to arms of <em>Raise ’em Right</em>, with the premiere line “<em>anyone can have kids, even if you’re stupid</em>.” proving a perfect introduction to a gripping ten minutes of music. If there’s been a more fitting line than <em>“now they’re teens and sayin’:  “where’s our kurt cobain?” “who do we pray to?””</em> penned this year, then I’d love to hear it.</p>\n<p><strong>shy kids</strong> are wonderfully and unashamedly upbeat in sound, dancing in somewhere between <strong>Los Campesinos</strong> and <strong>Vampire Weekend</strong>, however without the chart-success slickness of the former. With a handful of samples thrown in for good measure, <em>In The Puddin’</em> is<strong> shy kids’s</strong> attempt at a ballad, laying their hearts out for all to ravage – <em>“fingers trace your nipples and the freckles on my back. </em><em>a twinkle when you giggle, blinking to take photographs. you humbly embody body that is humbling. i-love-you’s softly said, speak volumes by just whispering. time’s an etch-a-sketch that slowly shakes your memory. the moments it erases, please don’t take this one from me.”</em>.</p>\n<p>The three piece, comprised of Warwick Cedarstar, Mattheo Woodbro and Peter Hornerick appear to have been together since 2010, yet this EP titled <strong><em>Field Trips</em></strong> signals their first proper release. At the risk of sounding disastrously cliched, <strong>shy kids</strong> may well just be my favourite new band of 2012. You simply have to hear this.</p>\n<p><iframe style=\"position: relative; display: block; width: 300px; height: 410px;\" src=\"https://bandcamp.com/EmbeddedPlayer/v=2/album=2115582007/size=grande3/bgcol=FFFFFF/linkcol=4285BB/\" frameborder=\"0\" width=\"300\" height=\"410\"></iframe></p>\n","slug":"17659-introducing-shy-kids","category":"introducing","date":1344207187000,"wpid":17659,"isSticky":false,"featured_image":{"width":165,"height":165,"src":"2012/08/487256_248809115222474_428564588_n-165x165.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFwAAAwEAAAAAAAAAAAAAAAAAAgMFBv/EACIQAAIBAwMFAQAAAAAAAAAAAAECAwAFIQQREhUiI0FCwf/EABUBAQEAAAAAAAAAAAAAAAAAAAEF/8QAGREBAAMBAQAAAAAAAAAAAAAAAQACEQOR/9oADAMBAAIRAxEAPwDa27lqrc+pSNVBdmiZV3JBP7TeozLjYYxmguHhtSCLsHH5xU6KWQxIS7E7D3Re2gZK3LnlrK6L5P/Z"},"createdAt":1587284814290,"updatedAt":1588443772864,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2012/08/487256_248809115222474_428564588_n-165x165.jpg","categories":["introducing","mpfree","new","music"]}