{"id":"5e9c0b3b774c2610387e52db","artists":["5e9b69637a1236eccfeb2720"],"title":"Review: Wooderson – Let the Man Speak","content":"<p>By the time I first heard <strong><em>In On The Kill Taker</em></strong><em> </em>I was fifteen years old, and it had been around for nearly a decade.</p><p> In the eyes of the people who document that sort of thing, D.C.’s buzz had largely burned out, and writing about bands in baseball caps or masks or face paint dominated rock press. It was not, I would venture, that ideal a time to be nursing an always-growing addiction to music with loud guitars in. Maybe I wasn’t looking hard enough in 2002, but things seemed to get better with the passing of years, and today there’s fierce life running up England’s spine. At the most southerly point of my interest we have Derby’s life-affirming (I do not use the term lightly) <a title=\"YOU'RE A FRIEND THAT WE'VE NOT MET YET SON\" href=\"https://www.crashofrhinos.co.uk/\">Crash of Rhinos</a> and guitarist/lungsman Biff’s <a title=\"Who wouldn't?\" href=\"https://timetravelopps.co.uk/\">Time Travel Opportunists</a> imprint. To the north, there’s Leeds’ <a title=\"https://api.crackintheroad.com/music/16466-video-blacklisters-trick-fuck/\" href=\"https://www.brewrecords.net/\">Brew Records</a>, plus Matty Wall and James Lyall bolstering the city’s live scene with their tireless work as <a title=\"Hey man!\" href=\"https://www.dirtyotter.blogspot.co.uk/\">Dirty Otter</a>. And bursting from between the two in a melee of sweat and elbows is <strong><em>Let The Man Speak</em></strong>, debut full-length from Sheffield’s <strong>Wooderson</strong>. That’s what I love about these rock ‘n’ roll bands, man. I keep getting older, they stay the same age.</p>\n<p>I referenced Fugazi in the first line of this review. Perhaps you think that’s unfair, drawing parallels between a comparatively young band’s first full-length and one of the monoliths of the vague sphere of music that the young band’s first full-length occupies. But the influence of the D.C. titans, not to mention a hefty complement of the usual scene suspects, is tough to ignore on <strong><em>Let The Man Speak</em></strong>.  Sam Lenthall’s serpentine rasp in the choruses of <em>Janet Bruce</em> could almost <em>be</em> Guy Picciotto. <em>Mint Condition</em>’s primal rhythmic trickiness and billowing jetstreams of scratchy distortion owe a clear debt to early …Trail of Dead. And the jarring chords at the centre of <em>Sparrow </em>may or may not have been nicked from Sonic Youth’s <em>Sugar Kane</em>. To the same end, when you’re making wild, tattered guitar music that’s all hips and knuckles and you start yelping ‘cut it!’ in a song’s chorus, as Wooderson do for <em>Buffalo Jump</em>, you’re going to back anyone drawing comparisons into a corner that they won’t be able to fight their way out of.</p>\n<p><iframe style=\"position: relative; display: block; width: 400px; height: 100px;\" src=\"https://bandcamp.com/EmbeddedPlayer/v=2/track=1269512262/size=venti/bgcol=FFFFFF/linkcol=4285BB/\" frameborder=\"0\" width=\"400\" height=\"100\"></iframe></p>\n<p>So you’d best have the goods to fend off the gainsayers, and on that front, presenting Wooderson as a band held down and unable to move for the weight of their influences <em>is </em>unfair, even if those influences are inescapably present. So <em>Buffalo Jump</em> might have a touch of the <em>Rolodex Propaganda</em>s about it, but it’s one of <strong><em>Let The Man Speak</em></strong>’s finest moments, its taut, tense rumble exploding into slashes of whitehot guitar that could cut through steel. Where he sounds undeniably similar to his spiritual predecessor when singing on <em>Janet Bruce</em>, Lenthall’s broad, spoken Yorkshire in the song’s verses reveals a band unwilling to compromise their integrity or better, entirely incredulous at the idea that they might sing any differently to how their voices actually sound.  Elsewhere, guitarist Loic’s breathy sneer on the weaving <em>Too Many Questions </em>is more lascivious than music of this kind normally has any business being, a wolf’s keening hunger still unsatisfied by the false release of the song’s chorus, while <em>Sleepwalking</em>’s rickety riffola breaks down into fierce arpeggios by way of a mad-eyed, ranting sermon from other guitarist Ash Morton.</p>\n<p><iframe style=\"position: relative; display: block; width: 400px; height: 100px;\" src=\"https://bandcamp.com/EmbeddedPlayer/v=2/track=416905955/size=venti/bgcol=FFFFFF/linkcol=4285BB/\" frameborder=\"0\" width=\"400\" height=\"100\"></iframe></p>\n<p>Refreshingly, Wooderson are transparent in their reverence for their forebears – our first point of contact was my tweeting ‘Wooderson: sound like Fugazi and named after one of the greatest movie characters of all time. Winner.’ To which the reply came ‘You got our number’. There are no claims to be reinventing guitar music here, meaning that <strong><em>Let The Man Speak</em></strong>’s 33 minutes play out as they should do, nine lean and purposeful shards broken away from something older and bigger, but not always better. Let’s have a forward thinking year. Let’s let the man speak.</p>\n<p><strong><em>Let The Man Speak </em></strong>is out now on <a title=\"You want me to pick you up a couple?\" href=\"https://www.bombedout.com/\">Bombed Out Records</a>. You can stream and buy it via the Wooderson <a title=\"\"Say man, you got a flute?\"\" href=\"https://wooderson.bandcamp.com/\">bandcamp</a>.</p>\n<p> </p>\n","slug":"17700-review-wooderson-let-the-man-speak","category":"album-reviews","date":1345055421000,"wpid":17700,"isSticky":false,"featured_image":{"width":165,"height":165,"src":"2012/08/let-the-man-speak-cover-165x165.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAABwED/8QAIRAAAgEDBAMBAAAAAAAAAAAAAQIDBAUxAAYREhMhUpH/xAAVAQEBAAAAAAAAAAAAAAAAAAABAv/EABYRAQEBAAAAAAAAAAAAAAAAAAARIf/aAAwDAQACEQMRAD8ARd+V28ZdyVjxCqtlstnWWmWiqC5uChuSHUKSMYHvggc6XLfLJPQU006eOWSNXdPliASPetvGmei85xq9F+R+aE7X/9k="},"createdAt":1587284795675,"updatedAt":1588443772683,"author":"5e9b68b27a1236eccfeb1d3c","old_image":"2012/08/let-the-man-speak-cover-165x165.jpg","categories":["album-reviews","music"]}