{"id":"5e9c0b2f774c2610387e52ce","artists":["5e9b69577a1236eccfeb269e"],"title":"Interview: Two Wounded Birds","content":"<p>“All the records I love are analogue recordings.</p><p> Digital sucks the life out of records and you miss out. It’s all sleek and slippery and feels like there’s a sheet of glass between the music.  We make rock ‘n’ roll music. I don’t like to put a tag on it but that’s how I see it. It’s true and honest.”</p>\n<p>I’m speaking to <strong>Two Wounded Birds’</strong> lead singer <strong>Johnny Danger</strong> who is bunged up inside with a sick bug despite it being being wonderfully sunny. It’s been mere months since the release of their self-titled debut which, recalling the hooks of Jerry Lee Lewis and Eddie Cochran, embodies the band’s fascination with all things vintage. The only tracks taken from their EP are the Tarantino-esque ‘Together Forever’ and ‘To Be Young.’ I ask Johnny why these were included on the album as opposed to the more upbeat ‘Keep Dreaming Baby.’ “That song isn’t where the band is right now,” he begins. “’Keep Dreaming Baby’ represented our honeymoon period and it didn’t feel right to include it. People had the wrong idea of what kind of band we were and I wanted to wait and release an album of real quality. It was a conscious decision to just wait and hold the album off until now.”</p>\n<p><iframe src=\"https://w.soundcloud.com/player/?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F41764500\" frameborder=\"no\" scrolling=\"no\" width=\"100%\" height=\"166\"></iframe></p>\n<p>Whereas other record labels might have pushed the band to release an album quickly, their signing with Holiday Friends Recording Co. has given them total freedom. Ran by Drums guitarist Jacob Graham, who signed the band after spotting them on MySpace, the label’s relationship with the group acts as a friendship rather than a business deal: “It’s nice we have someone that’s really happy to get involved with the music,” Johnny explains. “I think it’s important to work with people who are into music and what they’re doing. If you can find someone with a common interest you can bond and enjoy each other’s company. It’s not good to be with someone who’s not interested in what’s going on,” Johnny elaborates.”</p>\n<p>Given that there’s more music available online than ever, I wonder if Two Wounded Birds would be as big as they currently are if they signed a deal today. For Johnny, it’s a question of whether people are actually into the music they make: “There’s so much saturation and everyone’s making music but is everyone in love with it?” he questions. “I don’t think so. Everyone’s doing it for the wrong reasons because it’s a fad or whatever. It doesn’t help that no one’s buying anything anymore. It’s more difficult for newer bands nowadays.”</p>\n<p><iframe src=\"https://w.soundcloud.com/player/?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F41764498\" frameborder=\"no\" scrolling=\"no\" width=\"100%\" height=\"166\"></iframe></p>\n<p>Johnny’s recently been working on new songs which he assures will be pushed out within the next year or so. “I’m working on things I’d love to get out at least April next year,” he tells me. “I don’t like the idea of waiting a long time to get things out.” Does this create more pressure on his songwriting? “It’s not like a chore. It overtakes your life in a good way. You become over obsessed with song writing and everything else fits in around that. I don’t feel any pressure.”</p>\n","slug":"17725-interview-two-wounded-birds","category":"interviews","date":1345558561000,"wpid":17725,"isSticky":false,"featured_image":{"width":720,"height":478,"src":"2012/08/254775_257639877582623_954079_n.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAUG/8QAJRAAAQMDAQkBAAAAAAAAAAAAAQIDBAAFERIGBxQXITFVYZLS/8QAFQEBAQAAAAAAAAAAAAAAAAAAAgT/xAAXEQEBAQEAAAAAAAAAAAAAAAACABEB/9oADAMBAAIRAxEAPwCw5vTv8q53Hh5GmTFXlhgoSGXQFFK89CRpAz7z2rQ8y9sPDQ/sfulKmb6cyZv/2Q=="},"createdAt":1587284783870,"updatedAt":1588403537271,"author":"5e9b68b27a1236eccfeb1d08","old_image":"2012/08/254775_257639877582623_954079_n.jpg","categories":["interviews","music"]}