{"id":"5e9c0b2d774c2610387e52cb","artists":["5e9b69637a1236eccfeb2732"],"title":"Interview: Y LUV","content":"<p><strong>Y LUV</strong> are a funny bunch, as you’ll see reading on, but there’s nothing laughable about their music.</p><p> Merging ‘Hot Fuss’ era Killers with the Edge’s enveloping melodies, this Californian five-piece (Freddy, Sam, Marcello, Evan and Luke) sat atop the Hype Machine chart when producer Gazzo decided to remix their track ‘Never Touch the Ground.’ The band met at university in LA and their forthcoming new EP promises more of what they call their “antidote to sullenness.”</p>\n<p><strong>Crack in the Road: So how did the collaboration with Gazzo come about?</strong></p>\n<p>FJ: He got in touch with us after seeing ‘Keep It Rollin’ on the Hype Machine Chart. We didn’t know him at all and still haven’t met him but he sure can remix the shit out of our songs.</p>\n<p>Evan Newman: Can I get an Amen!</p>\n<p><strong>CitR: How have you been finding all the positive attention you’ve gained recently?</strong></p>\n<p>Sam Nardella: The attention’s great but nothings sealed yet. We’re just trying to put more work out there so we can get to the next level.</p>\n<p>LH: It feels kinda like being emancipated by a tribe of hospitable gnomes from displacement in a magic jungle.</p>\n<p><iframe src=\"https://www.youtube.com/embed/aNWMb0uD2S0\" frameborder=\"0\" width=\"560\" height=\"315\"></iframe></p>\n<p><strong>CitR: You were were still finding your path on your previous EP ‘How Chill Can You Let Go?’ Are you’re firmly on that path with the new EP or is there still a way to go?</strong></p>\n<p>FJ: We’re still finding that path. But I think part of the point is to never really find your way. Keep searching. Keep it wide open.</p>\n<p><strong>CitR: What can people expect from your new EP?</strong><strong></strong></p>\n<p>SN: I would say it’s got some more complex stuff going on. Hopefully everyone likes it. However you never really know what people will think.</p>\n<p>EN: I think it shows versatility on our part. The songs maintain that “Y LUV” feel while branching out in different directions.</p>\n<p><strong>CitR: Will it be like anything you’ve done before?</strong></p>\n<p>SN: I don’t think so. I was able to get more experimental on this one by using some analog delays. I was able to experiment in one session, which I’ve never done before.</p>\n<p>EN: We’ll sound like Y LUV.</p>\n<p><strong>CitR: You just sent it off to be mastered too. How was the recording process? Was it quite easy or were there bumps along the way?</strong></p>\n<p>SN: There were a lot of bumps. However I could really lean on the other guys when I got discouraged or lost with the sounds.</p>\n<p>EN: This is my first EP I have recorded with Y LUV since I joined last summer. It’s been great to work with a group of guys who can have way too much fun sitting down in a tiny room for hours and still get the job done.</p>\n<p><strong>CitR: Finally, what’s next for you all?</strong><strong></strong></p>\n<p>FJ: Release this EP. Release a video for Keep It Rollin. Release a Gazzo remix for Keep It Rollin. Work on new music. Play more shows.</p>\n<p>LH: I’m thinking of getting a chinchilla.</p>\n<p><iframe src=\"https://www.youtube.com/embed/aLBGHE8B258\" frameborder=\"0\" width=\"560\" height=\"315\"></iframe></p>\n","slug":"17729-interview-y-luv","category":"interviews","date":1345559128000,"wpid":17729,"isSticky":false,"featured_image":{"width":720,"height":477,"src":"2012/08/526144_409654732382172_336666341_n.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAAAAX/xAAjEAABAwIFBQAAAAAAAAAAAAACAQMEABEFBgcSExQxUWFx/8QAFQEBAQAAAAAAAAAAAAAAAAAAAgX/xAAcEQACAgIDAAAAAAAAAAAAAAABAgADESEEEkH/2gAMAwEAAhEDEQA/AIOkWoUXKeSJ0iL1BuATYugS3RTW6Dt++fSXqJI1Lxp+Q69sNOQlO3J2ut6Up3cu3uXzsy5RhEAQAaHk/9k="},"createdAt":1587284781742,"updatedAt":1588403537244,"author":"5e9b68b27a1236eccfeb1d08","old_image":"2012/08/526144_409654732382172_336666341_n.jpg","categories":["interviews","music"]}