{"id":"5e9c33a09b6559241525e0b9","title":"Review: Ann Scott – Flo","content":"<img class=\"alignnone\" title=\"Ann Scott\" src=\"https://c2.</p><p>ac-images.myspacecdn.com/images02/152/l_35446f8f7cff4947bbe6568bebe19ccd.jpg\" alt=\"\" width=\"600\" height=\"405\" />\n<p>If I mention Irish music, which artists do you immediately think of? The turgid monotonous stadium rock of<strong> U2</strong>? The overhyped, sickly to the point of being vomit inducing <strong>The Script</strong>? Whilst there will be those who will recall the magnificent pop of <strong>The Corrs</strong>, or even the ever-sprittly <strong>Van Morrison</strong>, most will automatically opt for the latter two. Well think again. Underneath the dull as potatoes, almost comically consistently churned out rubbish, there is a beautiful and enchanting songstress hiding.</p>\n<p>Having lurked in the musical darkness in-between her critically acclaimed second album <em>We’re Smiling</em> and her newest release <em>Flo,</em> <em>Ann Scott</em> has been building up a brooding and rapturous repertoire of songs. Dark and poetic imagery intertwine, allowing a haunting and dreamlike mood to be composed. Almost strictly limited to a gently strummed guitar, an at times chunky but resonating bass and a flourishing mystical piano, this album showcases<strong> Scott</strong> at her utmost emotionally vulnerable.</p>\n<p><strong>Scott </strong>herself described the album as about “being lost and how to get there”, and I am struggling to comprehend words which could more eloquently and delightfully summarise these songs. <em>Return To Die </em>is very much indebted to PJ Harvey, both vocally and instrumentally, however <strong>Scott </strong>allows herself enough scope to breathe her own musical life into each and every composition. Should her music ever receive widespread popular acclaim, there will undoubtably be those who write<strong> Scott </strong>off as an inferior <strong>Laura Marling</strong>, however, after several listens to <em>Flo</em> there is a deep emotional connection and reverberating understanding between <strong>Scott </strong>and her songs which <strong>Marling </strong>has struggled to consistently grasp.</p>\n<p>There is an admirable subtle and distant feeling, the likes of which features predominately in the music of <strong>Nick Drake</strong>, which is by no means a trait I would attach to many singers. In an auto-tuned age when it seems so worthlessly easy to be a inventive songwriter and a profound singer, <strong>Scott </strong>has managed to not only push musical boundaries in her composition and sound, but also form a mutual level of agreement and trust between the various instruments used to perform such fantastic eulogies.</p>\n<p style=\"text-align: center;\"><a href=\"https://www.myspace.com/annscottmusic\">Check Out Her Myspace</a></p>\n<p style=\"text-align: center;\"><a href=\"https://www.annscott.net/\">Check Out Her Official Site</a></p>\n","slug":"1780-review-ann-scott-flo","category":"music","date":1278611405000,"wpid":1780,"isSticky":false,"featured_image":{"width":188,"height":188,"src":"2011/06/l_35446f8f7cff4947bbe6568bebe19ccd-188x188.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAACAf/xAAkEAACAQMDAwUAAAAAAAAAAAABAwIEBQYAESESIlE0QUJTsf/EABUBAQEAAAAAAAAAAAAAAAAAAAQF/8QAGhEAAgIDAAAAAAAAAAAAAAAAAQIAEQMSUf/aAAwDAQACEQMRAD8Ar2ZBDMgx4tpnVdtY5sGTTDrgqc4GAMyeADuYg+dErKaOxUeT3emputaE1jlrhEgiMRMgAc+wGmNau7EO7naCzz53B/dFLMqWnOYX3dCvXv8AgPslqdick32JdBrU/9k="},"createdAt":1587295136725,"updatedAt":1588403565816,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/06/l_35446f8f7cff4947bbe6568bebe19ccd-188x188.jpg","categories":["music","reviews"]}