{"id":"5e9c339c9b6559241525e0b5","title":"Interview: The Chapman Family","content":"<p style=\"text-align: left;\">\n<p style=\"text-align: left;\">Having already done a short interview with Crack in the Road, we were delighted when Stockton group The Chapman Family agreed to meet up for another chat.</p><p> Greeted backstage at the Dot to Dot Festival in Manchester by the band, only ten minutes after their electrifying set, all four members were in an upbeat yet level headed mood. Chatting to such diverse and interesting individuals really sums up what has been so fantastic for me in creating this site, allowing opinions to be aired as well as appreciative and informed discussions to take place, the interview ended up feeling entirely informal, far more an enjoyable and relaxed conversation, infinitely more rewarding.</p>\n<p><em>CitR: What has your experience been of Dot to Dot? I imagine this is your first time playing it, even though Dot to Dot has been around for the last five years, started in Nottingham…</em></p>\n<p><strong>Kingsley: Has it been in Manchester before?</strong></p>\n<p><em>No, this is the first year in Manchester, it was already very much a Southern event.</em></p>\n<p><strong>K: What about Bristol?</strong></p>\n<p><em>Bristol first featured in 2007, and they also did London, which they gave up in 2008, and replaced it with Manchester.</em></p>\n<p><strong>K: Which one do you reckon they’ll give up next time?</strong></p>\n<p><em>I’d imagine it would be here to be honest.</em></p>\n<p><strong>K: Really? I thought this was great! I think it’s more interesting here ‘cus you’ve got almost everything confined in one building and that’s fantastic. I know you’ve got a couple in the Deaf Institute and one a bit further off, but the one in Bristol was a bit different, things were a lot more spread out. The one in Nottingham was nice as well ‘cus a lot of it was confined, Rock City had about three or four stages going on there. I’d think they’ll probably sack off Bristol.</strong></p>\n<p><em>You reckon?</em></p>\n<p><strong>K: Yeah, I mean, what’s the point? (laughs) Have you been? (to Bristol)</strong></p>\n<p><em>I haven’t been to the festival, but I’ve been to the city a few times, and never really liked it.</em></p>\n<p><strong>K: Why not?</strong></p>\n<p><em>My first impression was that it feels like a city which is constantly under construction, there didn’t seem to be a centre.</em></p>\n<p><strong>K: I just think it seems like a city that is constantly pissed, we’ve been there three times and every time we go we see either someone putting his hands in his own sick to get up. Even when we got there yesterday, there was a guy at two in the afternoon who looked like he was going to have a drink of water and then he just threw up on himself. This horrible red bile, and this was just right outside the venue, then the night before there was also someone playing around in his own vomit. So yeah basically it’s a vomitorium.</strong></p>\n<p><em>A vomitorium?!</em> (laughs)</p>\n<p><strong>K: Yeah, I know it was a Roman town, and it’s famous for it’s ship building and iron, but what it’s degraded to now is a vomitorium.</strong></p>\n<p><em>I’d probably agree with you to be honest, I remember when I was down there was a “street poet” who obviously had a few rehearsed poems that he did and he asked for money and he said “yeah I’m just trying to get somewhere to sleep tonight”. Later found him in a bar we went to, spending all of the money on drink that my friends had naively given him, saw him later on outside huddled in the doorway. </em></p>\n<p><strong>K: I don’t know, I’ve got this thing about people asking for money, I mean, what would you do in their situation? If I was living on the streets, I would want to be shit faced. I would definitely spend that money that I could have used for a bed, especially if it’s summer time, just go to a park, buy a bottle of cider, and just get really drunk.</strong></p>\n<p><em>I wasn’t having a critique of the homeless peoples way of life, just sort of emphasising with the vomitorium theme.</em></p>\n<p><strong>K: Yeah, so Manchesters lovely, yeah. (Laughs)</strong></p>\n<p><em>Yeah Manchester is fantastic! So as a collective you come from Middlesborough, is that right?</em></p>\n<p><strong>K: Near enough, Teeside I would probably say. Stockton really.</strong></p>\n<p><em>So how did The Chapman Family come about?</em></p>\n<p><strong>K: Have you ever been to Stockton? There’s a place to Stockton called the Ku Bar, and I used to go there every week, it’s a nightclub, has bands on. Bear in mind this is 2005/2006 where every band…. well see I reckon the North of England has like a five year delay musically, so we were getting the arse end of bands that wanted to be Pete Doherty. Every single band wanted to be Pete Doherty or The Libertines, so you get bands from Scotland, Manchester, Newcastle all with trilby hats, bashing into each other, wearing those French stripy t-shirts. I’d go there, and I’d enjoy it, but I’d be perpetually bored of watching the same shit getting driven at you week in week out. I used to go with Paul as I knew him from sixth form, so we’d go there and get really bored, so we’d go back to our house and sit up all night and fanny about on a keyboard and guitar, and we basically decided we wanted to be in a band that wasn’t like that. That would probably be a bit more exciting, something that was exciting to watch and exciting to play, I think probably more exciting to play. Then after a year Pop joined and it’s a long time, it’s only now that we’ve managed to finally get on our feet and truly find exactly what we wanted to sound like. I mean, there’s all sorts of different elements, Phil’s from a different background, Pop can probably describe what sort of music he likes. Paul was a big fan of 80’s cock metal, like Motley Crew, Paul and me went to see them a couple of times. I used to like my indie, I used to like my goth, we put everything in a melting pot and it’s kind of only now that it’s all fusing. </strong></p>\n<p><em>Have you got any further with your debut album yet?</em></p>\n<p><strong>K: Any further with the album? (laughs)</strong></p>\n<p><strong>Pop: We’ve done seven tracks, we’ve been demoing the album since last September, thinking what we were going to put on it and writing songs and listening to them. We’ve cast of an albums worth of material just to get down to what we’ve got now, we had seven tracks that we knew we wanted to be on the album so we’ve recorded them, and now we’re demoing again to try and get the final three down. Trying to have a lot of quality control, so writing a lot and casting a lot off, recording, see what works, what won’t work, throwing it away.</strong></p>\n<p><em>Did you ever think of doing an extended EP?</em></p>\n<p><strong>P: No way, we want to make the album into the best representation of where we are at musically, and we don’t want it to be a half arsed thing where it just gets released straight away or release an EP, just for the sake of having something out. We want the first thing that we release to be a long player, and the best thing we ever do.</strong></p>\n<p><strong>K: You only get to do your debut album once, so we want to make sure it’s spot on. I think we could have probably released an EP or an album from where we were at last year, but it would have been very schizophrenic. </strong></p>\n<p><strong>P: Where we’ve come from in terms of writing and things like that, our songs have just developed so far and away from what they were before.</strong></p>\n<p><strong>K: As we said, we scrapped stuff quite quickly, we rotate songs a lot and just get rid of them if we get sick of them. We get bored quite quickly. The stuff we would have released last year, and the style it would have been, wouldn’t have been anything like what we played today in Manchester. You might as well have had a different band.</strong></p>\n<p><em>So is that level of quality control just found through playing them and knowing that is not what you want an album to sound like?</em></p>\n<p><strong>P: We’ve massively anal about those things, it takes us ages to get a song finished writing wise and then ages to get it right recording wise even at the demo stage. Constantly trying things out and trying to make things sound the best we can, ‘cus what we really want is this album to be an exact representation of what it is like to come and see us live. Live is what we are used to, it’s what all our songs are written for, everything we do is geared towards playing live, so this album needs to go in your CD player and sound like a live gig. Obviously there are ways to do that in doing live recordings and things like that, but we didn’t want to go down that route and doing something just as simple as recording us playing live. We wanted to create a smoke and mirror effect, where it sounds like it is live, through the fact that the songs have intro’s and outro’s and little interesting bits and bits of feedback coming in and out, but we didn’t want it just to sound like a shambles, just like a load of people just bashing their instruments in a room.</strong></p>\n<p><strong>K: Not that that is what we sound like live! </strong></p>\n<p><em>It’s good to see a band who don’t just act on a bit of coverage, and go straight to the studio and force it out.</em></p>\n<p><strong>K: Yeah, I was saying that to someone the other day, there’s a lot of bands that do that, we got quite a bit of attention and hype last year, and we could have easily went “right ok, someone likes our single, lets do ten versions of the single and get an album at Christmas”. We resisted that ‘cus we knew we wanted to go a bit more long term than that. I listen to a lot of albums when I can and certainly from new bands, and you know that there’s about five tracks of filler on it. It’s a proper bonafide pop album, like a Cheryl Cole or a Pussycat Dolls, there’s three singles on there, and the rest is just there for the sake of it. It’s there to sell your record, “look, I’ve got an album”. We didn’t want to do that, we wanted everything not in a Sum 41 All Killer No Filler sense …</strong></p>\n<p><em>Great album.</em></p>\n<p><strong>K: I thought you were a folk fan?</strong></p>\n<p><em>Not just folk!</em></p>\n<p><strong>K: I’ve tarred you with the folk brush now, just pick up a ukelele.</strong></p>\n<p><em>Yeah just waiting for Mumford & Sons to walk round the corner.</em></p>\n<p><strong>K: Have you heard their debut?</strong></p>\n<p><em>Well, obviously they had a lot of stuff before they signed to Island, they played the Cumberland Arms in a room with about 50 other people and I thought they were really good then, but now they are re-releasing a lot of early stuff, like The Cave, Roll Away Your Stone, and it’s becoming folk-pop.</em></p>\n<p><strong>K: To be honest, now they are a proper Radio One band, they have to do that, I don’t think that’s a bad thing that they are just regurgitating their best songs.</strong></p>\n<p><em>I think it’s the path that they’ve chosen to take.</em></p>\n<p><strong>P: Florence and the Machine is a great example, when I first heard her she was totally free spirited, all her songs were really simple. Then what’s happened is the record company have just taken her along this street where she has been turned into this product now. That Dog Days Are Over single, I’m not a massive fan of FatM, but the first single and first video fitted together really well ‘cus she directed it herself and it was her idea. Now she’s re-released it and it’s been really well produced and it’s been made into this big theatrical production where she’s wearing like a million couture costumes. It doesn’t represent the song at all, what it does represent is this product that Florence and the Machine has become, this big fucking beautiful, well dressed person who has been so built that it’s taken all individuality away from her. The people who I know who were into her when she first started aren’t bothered about her anymore, my girlfriend was a massive fan and saw her supporting Courtney Love in London, she said it was one of the best performers she’d seen live, then she went and saw her recently and it was just like she’d had everything blasted out of her. On stage she was just going through the motions, doing all the moving and dancing, but it just felt like she’d been told “try and look kooky on stage”.</strong></p>\n<p><em>Almost like trying to turn her into a UK version of Lady Gaga.</em></p>\n<p><strong>P: Yeah, definitely. They’ve seen someone who is so quirky that they’ve played it up so much, and she’s no longer individual or quirky, just another product.</strong></p>\n<p><strong>K: They’ve got to that stage where they re-release every single off the album as well. I don’t know how many songs there are on that album that haven’t been released yet.</strong></p>\n<p><strong>P: The fact that La Roux cutting her quiff off has been a news story, in NME and the like…</strong></p>\n<p><strong>K: Has she cut her quiff off?</strong></p>\n<p><strong>P: Yeah, she changed her hair and that’s sparked like all this interest. Is she going to be as famous now she hasn’t got his quiff.</strong></p>\n<p><strong>K: That’s a pretty big story.</strong></p>\n<p><strong>P: I just think it’s sad.</strong></p>\n<p><strong>K: It is very sad.</strong></p>\n<p><em>If we’re talking about how labels modify and control bands, you talk about how you actually preserve the time, what relationship did you have with the label?</em></p>\n<p><strong>K: To be honest, and this is the essence of it, is that we don’t have that pressure, we essentially are still our own thing, we haven’t got massive label pressure. We’ve got people telling us various bits and bobs for what they think we should do, but we argue the point. That’s probably another reason to why it’s taken so long for us to get something out.</strong></p>\n<p><strong>P: Our record company wanted to release something in February, and recorded Kids and Virgins as singles and there was a few more tracks kicking about, and they were just ready to rush release something. We argued the point so much that it ended up not going ahead like that, and there were talks to do an EP and then an album but we decided not to do that either.</strong></p>\n<p><strong>K: I think that’s kind of what Mumford did.</strong></p>\n<p><strong>P: Yeah, you’ve got to keep people interested in the album.</strong></p>\n<p><strong>K: It’s a fair point ‘cus we’ve only had two singles, but you never know.</strong></p>\n<p><strong>P: I think I would never be able to level it with myself if I did something that I didn’t believe in.</strong></p>\n<p><em>In the modern age when everything is so instant, how do you deal with that?</em></p>\n<p><strong>P: I still think it’s possible to succeed, as long as you are head strong and you believe in yourself, you don’t have to do everything that everyone tells you to do.</strong></p>\n<p><strong>K: If you’re going for the instant dollar then you are probably not in the right fucking business. </strong></p>\n<p><strong>P: If you want to be like The Twang and be all over the front of NME and instantly get an album out and get panned by everyone and disappear off the face of the earth because you’ve rushed everything so much. I would never want to be that person. I’d like to see that sort of hype build and think “that’s nice, but let’s keep focused on what we want to do”.</strong></p>\n<p><em>So are you concerned when you do finally do your release, that there will be the inevitable digital repercussions?</em></p>\n<p><strong>P: We really want our album to represent us, we don’t want it to feel like a best of with ten singles, or five singles and five other tracks, each separated out perfectly with three seconds between each track. We want tracks to blend into each other, we want intro’s and outro’s, we want it to feel like a body of work. The CD will be the most important to think about. I have no doubt that when our album comes out, people will download it for free, but there’s nothing we can do about that, what we can do is provide a CD version with the album as we see it, with the artwork as we want it to be. So people actually interested in that body of work can buy the album and it will be something a bit special, people who download it, well… fair enough. You can download it for free and there is nothing we can do about it, but you won’t get the whole experience as we intend it. That’s not a marketing thing, just when I used to buy an album, every part of it was exciting, when I used to go to the shop and buy it and you’d get home and you’d look through the booklet and the artwork and read the lyrics and the thank you’s and put the album on and read the booklet as you went along. It was all part of the process whereas now you can just go on the internet, download it, bomb it onto your phone or your ipod and listen to it in your headphones, you’re never ever going to get that connection.</strong></p>\n<p><strong>K: You don’t really want a fair weather fan type thing, you don’t want to be flavour of the month. </strong></p>\n<p><em>Yeah, it’s more of an experience than anything. With music on peoples ipods it’s more backing music to whatever they are doing.</em></p>\n<p><strong>K: It’s weird on the internet, you can appear to be a fan of a band or artist, pretty much instantaneously. You just press a couple of buttons and there you go. As soon as you “like” something it’s job done. We want to buck that trend a bit.</strong></p>\n<p><strong>P: That’s why we released our singles on vinyl, we wanted it to be something special, so they’re both coloured vinyl, we wanted it to be something that you could touch and hold and have in your hand and get that excitement from owning that piece of music. I’m guilty of it, I’ve downloaded a few tracks and things like that, I never get the same level of excitement, there’s been albums where I’ve wanted them so badly that I couldn’t wait and I’ve managed to find a torrent of an advanced copy and I’ve downloaded it, but I’ve still gone out and bought it ‘cus I’ve still wanted it, still wanted the product, still want the pride of seeing it. I’m hoping that because we’ve put so much into it, and put in passion that the people who are into our band will have the courtesy to do the same back. </strong></p>\n<p><em>Do you think of the cost of music is partly what puts people off buying CDs?</em></p>\n<p><strong>P: I don’t think that at all, you can go out and buy a brand new album for £8, when I used to buy them they were £15 – £16 when they came out. So if anything, that’s a rubbish excuse, ‘cus they are cheaper, loads cheaper, Tesco sell CDs at a loss, ‘cus they don’t need the money. The reasons people download are laziness and because they can’t physically wait for the album to come out. I’m guilty of it as well, you can download all the albums you could ever want with the click of a button. Whereas before you used to have to wait for that release date for it to drop at the shop, now you can just download it and get it before that. It’s ‘cus of the consumer nature of society nowadays. If I wanted to I could sit in my armchair at home, eating nothing but fucking microwavable meals, and download this years entertainment catalogue, I wouldn’t need to go anywhere.</strong></p>\n<p><strong>K: You don’t really want a nation of agoraphobics, but that’s what we’re heading for.</strong></p>\n<p style=\"text-align: center;\"><a href=\"https://www.myspace.com/thechapmanfamily\">Check Out Their Myspace</a></p>\n","slug":"1787-interview-the-chapman-family","category":"interviews","date":1278625598000,"wpid":1787,"isSticky":false,"featured_image":null,"createdAt":1587295132792,"updatedAt":1587825935930,"author":"5e9b68b27a1236eccfeb1d27","categories":["interviews","music"]}