{"id":"5e9c0ad1774c2610387e5266","artists":["5e9b68c77a1236eccfeb1d9c","5e9b68c77a1236eccfeb1d9d","5e9b69117a1236eccfeb222a"],"title":"Festival Review: In The Woods 2012","content":"<p>From the outset in the woods festival makes it very clear, this is a festival for seasoned festival goers.</p><p> I, as it happens, am not, so the demands of a 9am rise to get to the site in time for the first band at 12.30, was a lot to ask. Just a thought, try to plan your route to the festival before the morning of the festival, if only to avoid a stress fuck of a morning. Thankfully, once In the Woods has asked of you the most basic of organizational skills, it allows you to relax. By 3pm I was hurtling down a country lane, as a middle-aged punk who drove us on our merry way informed me, as kindly as she could, that I didn’t sound like I was from Newcastle. I was sorry to disappoint; I suppose she doesn’t get much of ‘my lot’ around her parts.</p>\n<p>Kent’s In the Woods Festival is now onto her 7<sup>th </sup>year, with it’s capacity now at a tidy 1000, it seems as if she’s finally hit her stride. The site looked, to put it bluntly, fucking beautiful. On entering the woods, what was once an ordeal very quickly became the most delectable and serene of experiences. Artwork littered the entrance of the woods, the fairy lights expectantly guiding our route with the punters already comfortable in their new world. Now that we’ve finally jumped on the cunty/abstract train, I actually think that the attitude of those around me was possibly the most impressive aspect of the festival. People who attend In The Woods know exactly how to act at In The Woods, to the point where the whole thing felt like some sort of collective well kept secret. Everyone had been there before, met those around them before, even the path before me felt like it had been trodden by me before, and I was an In The Woods virgin. The result was a 24 hours that demanded you to let go, strap in and allow the whole thing to sink in. Sure, the whole thing lacked danger, this was confirmed when I was asked very politely if I wanted to add a ‘hope’ to the ‘hope tree’, but to be frank by this time I was stoned and was wondering if my ‘hope’ was going to be answered by the ‘hope gods’. They weren’t as it happens, I still work for Crack in the Road.</p>\n<p>In The Woods has always been beacon of the unheard, the just heard and ultimately the exciting. Past guests include the now fucking massive, <strong>Lianna la Havas</strong>, <strong>The Invisible</strong> (sort of) and <strong>Anna Calvi</strong> (probably shouldn’t be). You get the idea, these guys know what’s what, but most importantly don’t want to drum it down your ear holes. You might of heard of them, but you probably haven’t heard of all of them; a mixture of self affirmation and discovery, the basis of any festival. The three main ‘headliners’ for me however were undoubtedly <strong>Kwes</strong>, <strong>Alunageorge</strong> and <strong>Alt-J</strong>; three artists that have haunted the pages of CitR over the last 12 months. All three failed to disappoint, Kwes as disjointed yet adorable as always, Alunageorge empowered and sexy while Alt-J confirmed why they’ve quickly became one of the most impressive bands this country has to offer. Perhaps the most boring description of the three, but i doubt Alt-J care, they’re “the most impressive band this country has to offer”, according to me; they’re pretty set. The real headliner as it happens was the stage itself, the quarry sat commanding in its complete uniqueness, a wooded bowl like structure; no other festival is like this and i doubt anyone there wanted another quite the same. In the Woods is enough.</p>\n<p>But now to my only criticism, In The Woods is a one day festival; one day of music and a night of camping. Now I realise this was a conscious decision, this undoubtedly came up at the festival’s conception, yet i came away from the festival thinking that i had been short changed. As it happens this speaks wonders of the amount on offer, 2 stages, an on going performance piece inspired by Alice in Wonderland, a silent cinema; the list goes on. And that list completely ignores the people, 1000 of them to exact, none of whom i know, or are ever likely to know, at least from In the Woods 2012. Maybe it’s because i arrived there late or maybe it’s because i’m shit at making new friends, whatever the reason, i wish i’d been given a bit more time in the woods.</p>\n","slug":"17942-festival-review-in-the-woods-2012","category":"festivals","date":1347921208000,"wpid":17942,"isSticky":false,"featured_image":{"width":950,"height":541,"src":"2012/09/inthewoods-950x541.gif","placeholder":"data:image/jpeg;base64, R0lGODlhCgAGAIcAAExpcS8nOj+btQgjK4KJqfzjkXUcJDWQnFSGTH/6/JUiJvv99yx1didPmXMtUa4qK/vZ0/KHaKH8/CwUHbl3dUkOFjU8XfGpsvq3mbr+/Nb+/Ic6OxxRS96Eai57l1TY7oSpyNCHlJZQYeGIiQQTQ+s6KqOWs9g1NCYHDnh4ljhVeDxyPFFje+xTYGlDTZS9Z8hVZ+Kkn7Nsd1Y4P6xGXu55TaOpxxYVIRZWctNiSJEsTV7p9stFPEW51xVKZHdEUgYXITunxkWqwR5kejhbNS82SUt2ooxHWn3q+Gb4+1Vmk7JhXVYRHCdXef///+9iNnlXcWw6WpTCbPy5Q/Sqjjyz3tmYpjOXvLQ0U5NEQMgyMdeouI4kRJo2OPzhclApNLwyNpknLvznxxI0K9C4yPOXpVFHZ8TSrHGJrQxEWzut1l3b6w02R6dVVbrt+oe0YmeZUW45QnIdPGksNBcFCk8bJdZsWLZ5jRdERN3H0DYIEC0bMPvRj6aLpyR3nZRid1I6WItPYi9IZvzElFhXevzQUa9whUyCnGWIRypYN763zOG1v8S2XKk0OogeJZZreAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAACH5BAUKAAAALAAAAAAKAAYAAAg2AOkAGcBmgEEgNwQS9HAgjY8BdOjcGDAjhZINgfaMucFxTwADjQxM8JEwIp06dUyqpINCj8qAADs="},"createdAt":1587284689334,"updatedAt":1588443772337,"author":"5e9b68b27a1236eccfeb1d24","old_image":"2012/09/inthewoods-950x541.gif","categories":["festivals","music","reviews"]}