{"id":"5e9c0acf774c2610387e5263","artists":["5e9b69047a1236eccfeb213d"],"title":"Review: How To Dress Well – Total Loss","content":"<p><em>“…the lyrics are blind baggage, and they emerge only in snatches…such a style seems to link up with an older tradition – the tradition of the American artist to put his story in disguise, to tell his tale from the shadows, probably because that is where he usually finds it.</p><p> Those who mean to seduce do not announce their intention through megaphones.”</em> – Greil Marcus (on The Band, <em>Mystery Train</em>)</p>\n<p>Apparently, the record that was to become <strong><em>Total Loss </em></strong>was scrapped, in <a title=\"To Nick Levine, The Guardian, Friday 14th September 2012\" href=\"https://www.guardian.co.uk/music/2012/sep/14/how-to-dress-well-tom-krell\">creator Tom Krell’s words</a>, because it was guilty of ‘drilling down into melancholy’, and over his worries at being deemed ‘a miserable fuck’. <em>When I Was In Trouble</em>’s blasted waste doesn’t do a thing to corroborate his implications, that the <strong><em>Total Loss</em></strong> presented to us on Monday is any less weighed-down by sadness. The song’s death-knell piano over the whispering rush of lonely trains, its layers and layers of gently fuzzing static worrying one ear and then the other, leave it sounding more like Mike Hadreas’ beaten vignettes than any of <strong>How To Dress Well</strong>’s more commonly quoted kindred spirits. And like <strong><em>Put Your Back N 2</em></strong><em> <strong>It</strong> </em>earlier this year, Krell’s sophomore effort will most likely turn off a certain sect of the acolytes inducted by the deafening intimacy of his first, which you can explain away however you like (I’m going with <a title=\"SHOEHORN\" href=\"https://en.wikipedia.org/wiki/The_Work_of_Art_in_the_Age_of_Mechanical_Reproduction\">Benjamin</a>). <strong><em>Total Loss </em></strong>does not sound like a man in his bedroom, for the most part, and without the shock factor inherent in an incredible closeness used to present a musical style that’s most often spoonfed to us as slick and untouchable, maybe an element of ‘charm’, or whatever, gets lost. Fact is, though, that <strong><em>Total Loss </em></strong>destroys its predecessor. Krell opts for complete emotional immersion, though not always in the manner you’d expect from a record called <strong><em>Total Loss</em></strong>.</p>\n<p>You’ve heard the ratchety beats and crystalline keys of <a title=\"Here's the Koreless remix, all freezing stars and limitless black expanse...\" href=\"https://soundcloud.com/koreless/htdw-cold-nites-koreless-remix\"><em>Cold Nites</em></a>. Since <strong><em>Love Remains</em></strong> last year, Krell has proved himself adept at using omission and opacity to heighten effect, and that we can hear hardly a damn word beneath the reverb matters not a bit. That pleading falsetto cuts right through the skin without heed to the restraints of language, and as the song cuts out, the end credits to a story unhappy and unresolved, Krell breathes a single ‘I pray for myself again’. Neither admission nor confession, just a simple statement in the face of loss. It’s devastating. I’m convinced that line could floor a bear in a bulletproof vest at ten paces. On the other hand, <em>Struggle </em>goes for all-out sonic assault, reappropriating <em>When I Was In Trouble</em>’s desolation and whipping it up into a desperate panic. Once more, Krell’s words are often buried, but his voice is a tremulant choir of furies over disjointed, cyclonic 2-step, ‘you were there for me when I was in trouble’ this time a last ditch attempt at explaining the wretched mandala of feelings that swirls at one’s centre with the permanent departure of a loved one.</p>\n<p>But Krell is true to his intentions. He’s not going to be that miserable fuck, and rather than always beating us over the head with just how bottomlessly sad the events that presaged <strong><em>Total Loss </em></strong>were, he seduces, oh yes, like the ‘crooner’ <a href=\"https://www.google.co.uk/search?q=tom+krell+crooner&ie=utf-8&oe=utf-8&aq=t&rls=org.mozilla:en-US:official&client=firefox-a\">he’s so often billed as</a>. <em>Running Back </em>frames an unbearable need for warmth with slinking clicks and gasps, some candlelit cocktail bar acoustics, before <em>& It Was U </em>segues in with the semblance of confidence, Krell’s voice further forward than it’s ever been, but there’s loss here too. ‘Any time you need me I will come back’ could be a simple admission of loyalty and kindness in another context, but here it’s that same inexorable suck into the orbit of another body. Likewise, Krell’s most brutal questioning – ‘how many people did he kill?’ – isn’t backed by the sorts of boiling synth stabs that run through <em>Struggle</em>, but the lambent melancholy of <em>How Many? </em>and its underwater Rhodes.  And if he wants to reimagine <a title=\"Say 'baby, I love you.'\" href=\"https://www.youtube.com/watch?v=sQgd6MccwZc\">R&B’s lyrical tropes</a> over a Reichian piano loop, as on <em>Say My Name Or Say Whatever</em>, well, he can do that too.</p>\n<p>All the sonic repositioning, the disconnect between Krell’s more hospitable sounds and <em><strong>Total</strong><strong> Loss’</strong></em> weighty subject matter, suggests an effort to keep listeners at arm’s length, make them work for emotional payoff, and avoid the problems that can leave music stale or repulsive. Oversharing, ‘look-at-me’, self-importance. Despite best intentions, this too often has an effect quite contrary to the seduction ol’ Marcus recongised, instead bringing about apathy, boredom and an irreconcilable distance. To be unmoved by music is unforgiveable. But the mist here is pink, permeated by the liquor from Krell’s beating heart, and <strong><em>Total Loss </em></strong>hurts and delights in ways I’m still figuring out. Like total loss, <strong><em>Total Loss </em></strong>doesn’t always make sense, but it sees out the grief process in full, and as he testifies on the new bloom of <em>Ocean Floor for Everything</em>, Tom Krell has his future.</p>\n<p> </p>\n<p> </p>\n","slug":"17953-review-how-to-dress-well-total-loss","category":"album-reviews","date":1348074103000,"wpid":17953,"isSticky":false,"featured_image":{"width":900,"height":900,"src":"2012/09/totalloss.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFwAAAwEAAAAAAAAAAAAAAAAAAwUHCP/EACQQAAEDAwEJAAAAAAAAAAAAAAECAxEABAUhBgcSFTEygZGh/8QAFAEBAAAAAAAAAAAAAAAAAAAAAv/EABcRAAMBAAAAAAAAAAAAAAAAAAABAkH/2gAMAwEAAhEDEQA/AKLd7xcYxkEsB9paQNXQ6I8Cdado2lxikhXM7ASJg3KNPtYbQBw9BQylM9o9U3CwSs//2Q=="},"createdAt":1587284687315,"updatedAt":1588403536376,"author":"5e9b68b27a1236eccfeb1d3c","old_image":"2012/09/totalloss.jpg","categories":["album-reviews","music"]}