{"id":"5e9c0ab4774c2610387e5243","artists":["5e9b69257a1236eccfeb233d"],"title":"Video: MONEY – Goodnight London / The Sound Of The Death Of Everything (La Blogotheque)","content":"<p>This was a collaboration just waiting to happen; Manchester pioneer’s <strong>MONEY</strong> hooking up with French website <a href=\"https://www.</p><p>blogotheque.net/2012/10/02/money/\" target=\"_blank\">La Blogotheque</a>. Their ‘takeaway’ shows set in niche setting are now a staple part of independent music, and are a sure sign of when a band is on the edge of greatness, certainly the case with <strong>MONEY</strong>. Filmed during this years The Great Escape festival in Brighton, and including a rendition of the stunning <em>Goodnight London</em>, played out on a well-worn piano in a quirky pub surrounded by locals swigging real ale, it’s the ideal setting for <strong>MONEY’s</strong> all-too-real imagery and emotional desolation.</p>\n<p>Opening with a vocal only rendition of <strong>Bob Dylan’s</strong> <em>Mr. Tambourine Man</em>, it’s an encapsulating seven minutes, drawing the listener in before overwhelming with the sheer beauteous nature of the track. As the final notes of <em>Goodnight London</em> ring out, the ever present squawk of seagulls can be heard overheard, followed by<strong> Jamie’s</strong> child-like laughter; perfectly echoing the innocence and fragility of their music. Check out the video below, as well as an original poem by Jamie, entitled <em>The Sound Of The Death Of Everything</em>.</p>\n<p><iframe src=\"https://player.vimeo.com/video/50516420\" frameborder=\"0\" width=\"400\" height=\"300\"></iframe></p>\n<p><iframe src=\"https://player.vimeo.com/video/50516422\" frameborder=\"0\" width=\"400\" height=\"300\"></iframe></p>\n","slug":"18006-video-money-goodnight-london-the-sound-of-the-death-of-everything-la-blogotheque","category":"music","date":1349169944000,"wpid":18006,"isSticky":false,"featured_image":null,"createdAt":1587284660258,"updatedAt":1587825886880,"author":"5e9b68b27a1236eccfeb1d27","categories":["music","videos"]}