{"id":"5e9c0aab774c2610387e523b","artists":["5e9b695d7a1236eccfeb26c8"],"title":"Interview: Villagers","content":"<p><a href=\"https://admin.</p><p>crackintheroad.com/music/18023-interview-villagers/attachment/villagers-photographed-in-paris-by-mark-nixon/\" rel=\"attachment wp-att-18024\"><img class=\"alignnone size-medium wp-image-18024\" title=\"Villagers, photographed in Paris by Mark nixon\" src=\"https://api.crackintheroad.com/uploads/2012/10/rsz_villagers_full_band_-260x173.jpg\" alt=\"\" width=\"260\" height=\"173\" /></a><strong>Villagers</strong> have been AWOL for a while. After the release of the Mercury nominated <em>Becoming A Jackal</em> in 2010 and a bit of touring on top of that, the Dublin-based project, masterminded by Conor O’Brien, went off the map a bit. Until now, that is. In a flurry of activity, the band have announced the forthcoming release of an album in January 2013, released a new single, ‘The Waves’ (which we’ve added for your pleasure at the end of this article), and announced two London dates this November on top of their imminent tour with <strong>Grizzly Bear</strong>. In the midst of this, we’re happy to bring you a short chat we had with Conor via the power of the internet. Enjoy.</p>\n<p><strong>What have you been up to during 2011 and 2012?</strong></p>\n<p><strong></strong><em>Hi Crack! Nice to meet you. I’ve been touring, writing, recording and making pictures throughout these two years. It’s been fulfilling and frustrating in equal measures.</em></p>\n<p><em></em><strong>‘The Waves’ came as quite a shock to many who were expecting more of the sound heard on <em>Becoming A Jackal</em>. What inspired that slight shift in direction?</strong></p>\n<p><em>The only inspiration for me was the one that I’ve always had since I was very young, which is to use the process of making music in order to learn and to grow as a human being and as an artist.</em></p>\n<p><em></em><strong>How much and what sort of progression, musically and thematically, can we expect to see on <em>{Awayland}</em>?</strong></p>\n<p><em>The new album feels very much like a natural progression. Musically, I learned a huge amount over the last two years in terms of production and electronic instrumentation, although that only really shows itself in a very subtle manner on the album as a whole. It’s also more densely orchestrated, courtesy of my bandmate Cormac (keys), who really put the hours in on this one. Basically, it’s more expansive and diverse on a purely sonic level. Thematically, I guess it moves on from the fiddly minutiae of ‘Jackal’ and deals with things on a more widescreen level. It’s like ‘Jackal’ was my Barry Lyndon, and ‘{Awayland}’ is my Space Odyssey.</em></p>\n<p><strong>Was the writing and recording process particularly different to that of the previous album?</strong></p>\n<p><strong></strong><em>The writing process differed slightly in the sense that I wrote some of this album whilst I was on the road touring. I can kind of hear that in the words when I listen to it now. It definitely takes you on a bit of a trip. The recording process was completely different this time around in that I recorded all of the instruments on the first album, whereas I went into the studio with the full band on this one. We really felt we’d earned the right to be in a studio together, after all the travelling and playing we had done. Also, myself and Tommy (guitarist/co-producer) really had a much stronger idea as to how we wanted the songs to sound this time round. It was amazing. It was more focused from the get-go.</em></p>\n<p><strong>What influences did you utilize most, if any, on the new record?</strong></p>\n<p><strong></strong><em>Mainly ‘Claire De Lune’ by Debussy, but also lots of techno. Impressionist music in general, I suppose.</em></p>\n<p><strong>Did you feel any particular pressure recording this album, as a result of the critical acclaim of the last?</strong></p>\n<p><em><strong></strong>I can truly and honestly say that I only felt the pressure from within myself. I’ve got a very blinkered, focused head on me when I’m making things.</em></p>\n<p><strong>Which albums released this year have you particularly enjoyed? Who would you tip to win the Mercury Prize this year?</strong></p>\n<p><em><strong></strong>I really like ‘>>’ by Beak. It should definitely win a prize of some sort. Even if it’s the prize for ‘best post-krautrock krautrock album’. I’ll make that prize up so they can win it.</em></p>\n<p><strong>You’re touring with Grizzly Bear in the next few weeks. Would you want that sort of publicity to translate into even more commercial success at the expense of being less able to play in more intimate venues?</strong></p>\n<p><em><strong></strong>So you’re asking whether I enjoy playing small venues as opposed to big ones? I like the variety of playing both, which is something we’ve been able to achieve up to this point. I suppose the new album is somewhat geared towards the larger stages in the sense that it is quite energetic and epic for the most part. But some of my favourite most frenetic gigs have been in tiny rooms, so I’m willing to experiment with both.</em></p>\n<p><strong>If you could only play one festival next summer, which would it be?</strong></p>\n<p><strong></strong><em>Maybe Summer Sonic? We haven’t been to Japan yet. I’d like to go to Japan.</em></p>\n<p><em>{Awayland} </em>is scheduled for release in January 2013. Check out ‘The Waves’ below, which may or may not be taken from the LP.</p>\n<p><iframe src=\"https://www.youtube.com/embed/Hoha8iET3us\" frameborder=\"0\" width=\"480\" height=\"315\"></iframe></p>\n<p> </p>\n<p>  </p>\n","slug":"18023-interview-villagers","category":"interviews","date":1349436758000,"wpid":18023,"isSticky":false,"featured_image":{"width":1280,"height":800,"src":"2012/10/rsz_villagers_full_band_-1280x800.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAGAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAME/8QAIRAAAgICAAcBAAAAAAAAAAAAAQIDBAARBQYHEiMxcaH/xAAVAQEBAAAAAAAAAAAAAAAAAAAAAf/EABgRAAIDAAAAAAAAAAAAAAAAAAABAiFB/9oADAMBAAIRAxEAPwDBb6oUanKjxUeFvBIYrBjRdCLx7Udw363+ZGnZq2akE9iPc0qK7lYlALEbOh9xjJNWMP/Z"},"createdAt":1587284651488,"updatedAt":1588403536052,"author":"5e9b68b27a1236eccfeb1d16","old_image":"2012/10/rsz_villagers_full_band_-1280x800.jpg","categories":["interviews","music"]}