{"id":"5e9c0a60774c2610387e51f5","artists":["5e9b68c77a1236eccfeb1d4d"],"title":"Review: …And You Will Know Us by the Trail Of Dead – Lost Songs","content":"<p>OK, let’s experiment then.</p><p> Climb into the Delorean with me on this one. February 7<sup>th</sup>, 2011. We get two point five minutes of pounding skins and bass growl, guitars seethe and crackle like a jet engine heating up. After liftoff the post-rock casing falls away and we’re left with something else, something that swings and jags like <em>Jumpin’ Jack Flash</em> given years alone in its bedroom and forcefed guitar tone, something that keeps building speed like a, haha, like a rolling stone, not just cold rock but limbs and sweat and mains power that keeps threatening to fall over itself and take us with it.</p>\n<p><em>“Need a real album to save my soul/it’s been another dead year for rock ’n’ roll”</em></p>\n<p><em></em>So sang Conrad Keely on <em>Pure Radio Cosplay</em>, first song proper from last year’s sprawling space-odyssey <strong><em>Tao of the Dead</em></strong>, a record comprising eleven songs in D, and one 16-minute F-tuned songtipede, five cuts rammed together and sewn into one. Rock ‘n’ roll Jim, but not as we knew it. <strong>…And You Will Know Us by the Trail Of Dead</strong>, the band Keely heads up with co-pilot Jason Reece, have returned one year, seven months and a couple of weeks later with <strong><em>Lost Songs</em></strong>, a record that clocks in (CD version, minus bonus tracks) at around 46 minutes, longest song 5 minutes 02, constituent parts drums (crashing), guitars (screaming), voices (yelling). All of which begs the question…is 2012 another dead year for rock ‘n’ roll?</p>\n<p>(09/01/12 – <strong>At the Drive-In </strong>reform)</p>\n<p>It feels borderline offensive to suggest that a band as singular and established as Trail of Dead might trade off the treasures of another. But <em>Open Doors</em>, the first track on <strong><em>Lost Songs</em></strong>, sounds like Keely and co. have taken cues from that other Texan post-hardcore band, the one that split itself down the middle in 2001 and sutured itself back together for <a href=\"https://cdn.abovethelaw.com/uploads/2012/01/scrooge-mcduck.jpg\" target=\"_blank\">the fans</a> in January this year. Specifically, cues from <em>Arcarsenal</em>, for <em>Open Doors </em>too begins with cardiac-monitor guitar blips glowing in a chasm of yawning bass, drums that rumble like mecha advancing through distant jungle. But Trail of Dead are the rolling thunder to At the Drive-In’s forked lightning, and the snaking groove that <em>Open Doors </em>slithers in on soon gets smashed to bits by a wall of chords that favours all-out bludgeoning over tricky rhythmic slashes. As opening statements go, it’s loud, it’s blunt, it’s heavy. It’s rock music, but Trail Of Dead can do better.</p>\n<p>(24/01/12 – <strong>Cloud Nothings</strong> release <strong><em>Attack On Memory</em></strong>)</p>\n<p>On January 24<sup>th</sup>, Dylan Baldi, Joe Boyer, Jayson Gerycz and the impeccably-named TJ Duke released an amped-up, hacked-off redux of their nasal bedroom-jangle called <strong><em>Attack On Memory</em></strong>, an album that apparently made emo <a href=\"https://pitchfork.com/reviews/albums/16158-attack-on-memory/\" target=\"_blank\">valid critical currency</a> again, where its <a href=\"https://pitchfork.com/reviews/albums/15010-there-are-rules/\">musical forbears’</a> recent output got thrown to the dogs as <a href=\"https://pitchfork.com/reviews/albums/15697-closer-to-closed/\" target=\"_blank\">irrelevant</a>. <strong><em>Attack On Memory </em></strong>was just about strong and scrappy enough to fight off Can’t-See-What-The-Fuss-Is-About naysaying, and after <em>Open Doors </em>early concession of points, <strong><em>Lost Songs </em></strong>soon starts to throw its weight around. <em>Pinhole Cameras </em>is near-perfect Trail Of Dead, <em>Relative Ways </em>doped to the gills and pushed to breaking point, careening around crazy-eyed somewhere on the edge of mania before dropping out into a kaleidoscopic tunnel of shapeshifting guitars. That Keely’s voice is fractured by fuzz and his words largely indescipherable only heightens the thrill. For <em>Opera Obscura</em>, the lithe elasticity of Jamie Miller’s everywhere-at-once drum assault comes on like Jawbox’s Zach Barocas, octalimbed, pounding out the rhythm to the pissed swarm of bees Keely and Reece wring out of their six-strings.</p>\n<p>Months pass. April sees the release of <strong><em>Electric Picture Palace</em></strong>, debut and swansong of Trail Of Dead acolytes <a href=\"https://brew.bandcamp.com/album/holy-state-electric-picture-palace\" target=\"_blank\">Holy State</a>. In August, <a href=\"https://wooderson.bandcamp.com/\" target=\"_blank\">Wooderson</a> put out <strong><em>Let The Man Speak</em></strong>, which supplemented the Texans’ influence with a steady diet of Fugazi.</p>\n<p>(29/05/12 – <strong>Japandroids </strong>release <strong><em>Celebration Rock</em></strong>)</p>\n<p>You’ll have read that <strong><em>Lost Songs </em></strong>is a rock record. And you’ll have heard it in the two songs we got before its release, <em>Up To Infinity </em>and album highlight <em>Catatonic</em>, which reimagines distortion as a great big hoofing amphetamine rush, racking it out into one of the most howling, fantastic songs to grace 2012. This is what Japandroids did for every cut on <strong><em>Celebration Rock</em></strong>, 2012’s defining loud record, everything aching and brilliant about guitars and drums and friends and youth and booze committed to tape and handed down to us on snow-white 180g vinyl. But Trail Of Dead have swapped out the ecstatic, air-punching joy of King and Prowse for a poke around America’s rotten mouth.<em> Catatonic </em>is named for the nation’s youth, who according to Keely <a href=\"https://www.gigguide.tw/article-117\" target=\"_blank\">“don’t seem to care. They have a very limited outlook on what’s going on, and that concerns me.”</a> It’s ‘fuck you’ over ‘fuck yeah’, but the shivering, prickling self-immolation that the guitars spark around the edges of the heart hits the same, rock ‘n’ roll eclipsing reason. Unfortunately for Trail of Dead (if not the rest of us), their message ends up redacted in delivery.</p>\n<p>(21/02/12 – <strong>Pussy Riot</strong> in the Cathedral of Christ the Saviour)</p>\n<p>Righteous indignation at the state of current affairs is something Trail Of Dead haven’t been shy about expressing with regard to <strong><em>Lost Songs</em></strong>. The band dedicated <em>Up To Infinity </em>to Pussy Riot on its release, with a statement that “the music (on <strong><em>Lost Songs</em></strong>) was inspired by the apathy to real world events that has plagued the independent music scene now for over a decade.” The flimsiness of the statement aside, all the upright anger aligns neatly with <strong><em>Lost Songs</em></strong>’ highly directional sonic blast, but the record’s voices are so distorted that Trail Of Dead are going to have to rely on their public reading the lyric sheet to connect with what they’re trying to say. Does this matter? I’m a champion of distortion, not a political commentator, but Propagandhi launched another tightly-controlled burst of polemical punk-metal ordnance on September 4<sup>th</sup> in the form of <strong><em>Failed States</em></strong>, which concerned itself acerbically, entertainingly and above all effectively with ‘<a href=\"https://www.guardian.co.uk/commentisfree/2012/mar/18/iraq-massacre-emos-killing-gay\" target=\"_blank\">emos in Iraq</a>/<a href=\"https://www.thejakartaglobe.com/home/aceh-punks-arrested-for-re-education/484549\" target=\"_blank\">punks in Aceh</a>’, celebrity escape to space, <a href=\"https://en.wikipedia.org/wiki/Caster_Semenya#Gender_test\" target=\"_blank\">Caster Simenya</a>, and the evil, sweaty cycles of the sex trade. <strong><em>Failed States </em></strong>demands that its listeners do their best to effect a change, and it does this by presenting the horrific and the unbearably close side by side, always with brutal clarity. <strong><em>Lost Songs </em></strong>works as a rock record, and <em>Up To Infinity </em>works as a supercharged, overdriven blast into musical hyperspace, but I’m not sure they work as a call to arms.</p>\n<p>(20/08/12<strong><em> </em>Bloc Party</strong> release <strong><em>Four</em></strong>)</p>\n<p>It hasn’t all been wine and roses. In August, Bloc Party went rockist on us with the dull, clumsy <strong><em>Four</em></strong>, which<strong><em> </em></strong>tried to convince the world of the band’s validity and togetherness with the old ‘instruments + earnestness = unsinkable’ formula. It’s often tough to hear and engage with what Keely and Reece are yelling about on <strong><em>Lost Songs</em></strong>, but shit, better that than  soundtracking (badly) one of my generation’s more wanton flare-ups with some <a href=\"https://www.songmeanings.net/songs/view/3530822107859438502/?specific_com=73016163250\" target=\"_blank\">fuckwit sloganeering</a> and a riff that P.O.D. threw out in 2001 for being too gauche. On the same day that Pussy Riot did their best to stick it to Putin, Omaha’s Cursive put out a <a href=\"https://drownedinsound.com/releases/16819/reviews/4144502\" target=\"_blank\">generally</a> <a href=\"https://www.pastemagazine.com/articles/2012/02/cursive-i-am-gemini.html\" target=\"_blank\">lauded</a> slice of ham-fisted, schlocky bollocks that seemed to do well on the basis that it was heavier and more ‘complex’ than its predecessor, not to mention that it didn’t bother us with all those girly feelings that Tim Kasher let bleed out on previous records. For all the fierce noise, <strong><em>Lost Songs </em></strong>is careful not to degrade into chest-beating or masturbation. <em>Flower Card Games</em> reeks of patchouli and Nag Champas and still seethes with discontent, and I long to be supine on my bedroom floor, getting boxed and watching smoke curl up to the horrible plastic chandelier instead of sandwiched between a train wall and a man in a pink shirt with Union Jack cufflinks who’s wearing far too much cologne and reading the sports pages of The Metro. <em>Awestruck </em>refracts the record’s guitars through a glassy post-rock prism, and they come out the other side flickering like Chinese lanterns, airborne. The real payoff, though, comes at <strong><em>Lost Songs’ </em></strong>close, with <em>Time and Again. </em>To hear Keely come back to earth human after a record’s worth of mighty discontent, on the lines “<em>I know too well the strain of losing something you tried to save”</em>, over a sweet, resigned strum and shuffle is a suckerpunch that’ll knock you sideways before you exhale.  <em> </em> <em>  </em></p>\n<p>(22/10/12 <strong>…And You Will Know Us by the Trail of Dead </strong>release <strong><em>Lost Songs</em></strong>)</p>\n<p>Rock’n’roll hasn’t died, and it won’t in my lifetime, certain as my lifetime will end. If you’re not satisfied with The Stones and Springsteen still doing their thing at however the fuck old they are, read the end of year lists when they start bubbling up like a poisoned rash across the internet. Cloud Nothings, Japandroids, <a href=\"https://thequietus.com/articles/10472-metz-review\" target=\"_blank\">METZ</a> and The Men will be in a helluva lot of them. Smells like Critic-Oriented Rock? Propagandhi and <a href=\"https://open.spotify.com/album/36ISXFaX1E98V1ARHesB6C\" target=\"_blank\">mewithoutYou</a> shone in (and outclassed) the less-trendy Punknews big leagues over the ocean. Dig a little deeper and there’s Wooderson and Holy State, to say nothing of <a href=\"https://easterbanduk.bandcamp.com/\">Easter</a>, <a href=\"https://valesband.bandcamp.com/\">Vales</a> and <a href=\"https://brew.bandcamp.com/album/blacklisters-blklstrs\">Blacklisters</a>, on our own shores. Until there’s not one kid in their bedroom thrashing at a Yamaha Pacifica through a secondhand Boss DS-1 and a Laney LX12, rock’n’roll hasn’t rattled its last. And when it does, we will know it, at least in part, by the Trail of Dead.</p>\n","slug":"18170-review-and-you-will-know-us-by-the-trail-of-dead-lost-songs","category":"album-reviews","date":1351447283000,"wpid":18170,"isSticky":false,"featured_image":null,"createdAt":1587284576484,"updatedAt":1588441774428,"author":"5e9b68b27a1236eccfeb1d3c","old_image":"2012/10/press_cover4-1024x1024-950x950.jpg","categories":["album-reviews","music"]}