{"id":"5e9c0a4f774c2610387e51e9","artists":["5e9b69047a1236eccfeb2196"],"title":"Live Review: Japandroids (Heaven, London, 28/10/12)","content":"<p>“Are you drinking whisky in honour of PAWS?” asks Ruth, a Scottish girl I have just met.</p><p></p>\n<p>“No,” I say, “I just like whiskey.”</p>\n<p>I pass Ben his shot. I know what’s about to happen.</p>\n<p>“What is it?” asks Ruth.</p>\n<p>There’s a second in which I think about lying. I discard this option. Ben would know.</p>\n<p>“It’s Jack Daniel’s.”</p>\n<p>“THAT’S NOT WHISKY!!!”</p>\n<p>I neck the whiskey and shut up.</p>\n<p>My pal and I are actually sinking the burning, amber tots of Tennessee’s sickliest because I had to spend over ten quid to use my card at the bar, and two souring pints at nine pounds whatever didn’t cut the mustard for the uninterested, heavy-lidded boozejockey who poured us the devil’s nectar. Raising a glass to <strong>PAWS</strong> would not have been unfounded ceremony, though. We miss the first three songs from the Scots trio, but pick our way to the front of a half-full Heaven for <em>Homecoming</em>, whose central refrain, <em>“I’ve turned my woes into sing-alongs”</em>, acts as party line for the band’s debut <strong><em>Cokefloat!</em></strong>, a record defiantly sugar and spright despite its grounding in the brutal realities of loss. And sing along the crowd do, especially the tousle-haired man-mountain next to me who <em>really</em> loves PAWS (really), but cares not a whit for deodorant, or where his spit lands, for that matter. Tonight <em>Bainz</em> frees itself from<em> </em>its downcast, dirgey lineage (it<em> </em>sounds a lot like <em>Rooster </em>by Alice In Chains on record) and slathers on the overdrive, while Philip’s roaring the heart-hefting sentiments on <em>Bloodline </em>is as terrifying in person as when augmented by <strong><em>Cokefloat!</em></strong>’s omnipresent fuzz. Set closer <em>Poor Old Christopher Robin</em> is a sad-but-pulling-my-socks-up lament that I can never decide if I like or not. No one’s doubting its authenticity for a nanosecond, but with a lyric sheet that dishes out self-help in dull platitudes, it’s tough to find catharsis in. Watching, though, I clock bassist Matt Scott staring fixedly at his fret hand. He’s grinning like it’s Christmas, and for a moment in my head the whole show is the bassist and the fucking incredible time he’s quietly having playing songs in front of people. The two things together (Taylor’s teenage truisms; Scott’s smile) are PAWS’ essence, cute, grungy pop that makes fun of being sad because to do anything else would be an insult, and to hell with what you think of it.</p>\n<p>Flash-forward to post-bourbon. Ben is happy and incredulous at the amount of people crammed into Heaven to see <strong>Japandroids</strong>, and I start to free associate on their direct line to the zeitgeist, the relevance that has them headlining to a sold-out 600 plus-capacity venue 4700 miles away from their hometown. I start to think that it’s something to do with the chorus-drenched overdrive of Brian King’s guitar, which somehow marries all that inexplicable shoegaze necrophilia to music’s recent reappropriation of grunge and/or “lo-fi”, using the union to rough up the sort of tones abundant in last year’s cultural smash <strong><em>Drive</em></strong>, a revisionist 80s presented as the present. After all, I reason, what’s <em>Wet Hair </em>if not exactly that? <em>Boys of Summer </em>from the other side, the sunshine-drunk titular characters chasing constant highs and etched in plasma-heated distortion, rather than Don Henley’s maudlin douche getting all blurry-eyed over wet synths?</p>\n<p>I don’t really believe any of this rotten jism my mind is spewing out. And if it’s worth believing, worth thinking about, if there’s an iota of truth or benefit in that kind of analysis, I don’t give two crusty white dog turds. Because Japandroids, and especially Japandroids live, aren’t about thinking. They’re about <em>L I V I N G</em>.</p>\n<p>Sometimes, though, we have to pretend to be adults, standing round the edges, observing sensibly, because really, that’s the best way to <em>properly </em>take it all in, isn’t it? And it’s so very<em> unbecoming</em> to fling yourself around like you’re nine years younger than you are. These are my work shoes. I might get them dirty. Still, doesn’t stop Ben and I serenading each other to a frenetic <em>The Boys Are Leaving Town</em>, or Woody beating out David Prowse’s fierce rhythms on my shoulders, or any of us from going WHOA OH OH OH OH OH at the appropriate moment. Ben notes his surprise at King’s onstage presence, having expected a shy and fringey introvert. As it is, we get a stage-straddling thirty-at-a-push Boss acolyte in skinny jeans, a man in his element up there, a man who wrenches thunder from his Telecaster in exactly the way he sings about on the fiendish, addictive <em>Adrenaline Nightshift</em>. By <em>Fire’s Highway </em>there’s kindling beginning to catch at the bottom of my belly, and I feel chained and restive, a kid in the backseat. Something will have to give.</p>\n<p>In <em>To Hell With Good Intentions </em>(a righteous surprise, the second time in 6 months I’ve seen it played by a band that isn’t McLusky) Ben makes a b-line for the bar, and the fizzing and sparkling in my gut increases exponentially with every staccato, jackhammer blast from King’s guitar, every twisted playground jibe that we yell back at him. We are a little back from the agitated mass that’s gathered front and centre, and when the levee breaks against the song’s inexorable battering, King yelling “<em>WE’RE ALL GOING STRAIGHT TO HELL!</em>”, a leash snaps in me also, and seemingly without moving I am dragged into the dripping morass of hot bodies that churns in front of the stage. <em>Heart Sweats </em>is about as close to smooth, louche fuck music as I can allow myself to like, blood beating through me as King moans in pre-coitus and we all roar the letters XOXOX. <em>Younger Us</em> is Japandroids’ absolute core, that naked new skin rush, youth’s last incendiary fuck you in the face of a settled and comfortable and anodyne future. I pitch, I yaw, I am surprised by my own resilience. Sometime around <em>Rockers East Vancouver</em> I slow in the maelstrom, think of pushing back to the edges, think “I’m supposed to be thinking about this and observing and writing it all down”, but then it’s <em>The Nights Of Wine And Roses </em>and I am more glad to be a 25-year-old man in a pit in a club on Villiers Street than I’ve ever been to be anything anywhere, because there is absolutely no fucking excuse for ignoring shivering, ecstatic, glorious <em>L I F E</em> when it’s being handed to you like this, by two friends who know that they have everything to live for but precious little time in which to wait for it.</p>\n<p>I have to stop, because I’m soaking wet and my shoulder’s fucked and I feel like I’m going to blow chunks. Woody and Ben chuckle at me as I stumble towards them, and I rest through <em>Wet Hair</em>, Ben feeding me the beer he has brought through from the bar. At first I don’t want it, but my stomach begins to settle and I get it down. By the time <em>Evil’s Sway </em>is over I am restored, floating easily on prickling swells of that soaking distortion, and about thirty seconds into <em>The House That Heaven Built</em> my near-empty cup is spinning in a high, wide arc through the air behind me and I have plunged myself into the melee again. This time Ben follows, still smothered in his parka and a grin that dares the world to even try and give a fuck about the morning. In true Japandroids style, <em>The House That Heaven Built </em>turns the breakup song on its head, eschewing standard self-doubt and venom for limitless positivity, and we’re launched about in the rough sea of limbs and joints, boys, girls, all losing their shit, all smiling. At intervals Ben and I are thrown back together to scream the song’s vocal call and response in each other’s faces, one of us playing King, the other Prowse, escapism in action. For <em>Continuous Thunder </em>there’s a circle of at least five of us, arm in arm and slowly rotating like a human carousel, singing to each other and no-one in particular, alive in the knowledge that conditional love is beautiful because of its fragility, not in spite of it. There’s some spiel and incident before <em>For the Love of Ivy</em>, the Gun Club cover that I don’t love on record, and all of rock music’s white-hot, elemental fury proceeds to erupt in front of us. The big ol’ Fred Durst-looking motherfucker King got up onstage has jumped off and we’ve caught him, Phillip Taylor has jumped off and we’ve caught him too. King throws his frame around like a ragdoll in a typhoon, strobes smash violent lightning across the scene, Prowse’s drums are the galeforce beating of wind against building. Weird, unrelated vignettes play out at each impossibly bright flash. One flickering moment and the duo might have broken into <em>Thunderstruck</em>. The next, King’s foot is atop Prowse’s bass drum and it’s <em>Today</em>, one of the first riffs I ever learned to play. I fall over, because fuck it, might as well.</p>\n<p>Japandroids are about <em>L I V I N G</em>.</p>\n<p>About Ben looking around at me and smiling when the Phillip harps on about his lungs always wheezing in <em>Poor Old Christopher Robin</em>, because he’s seen the hateful clamp tighten around my own airways enough times to make it a part of me and a part of the two of us.</p>\n<p>About hefting Jonny onto the stage before <em>For the Love of Ivy</em>, only for him to blow it and be sent back down to the crowd by King, but not before finding his missing shoes and playing the lead role in a story he’ll tell on Monday and forever.</p>\n<p>About swinging around like children on a trampoline, in a room heaving with strangers and noise and knowing like you’ve never known before that you’ll stick together forever, stay sick together, be crazy forever.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n","slug":"18211-live-review-japandroids-heaven-london-281012","category":"live-reviews","date":1352202264000,"wpid":18211,"isSticky":false,"featured_image":null,"createdAt":1587284559695,"updatedAt":1588441774323,"author":"5e9b68b27a1236eccfeb1d3c","old_image":"generated/fbe77fc315c9d74a5b6ce8f0bbff2d2bf2b8fd75.jpg","categories":["live-reviews","music"]}