{"id":"5e9c33979b6559241525e0a9","title":"M-Kat: A Student Perspective","content":"<p><a rel=\"attachment wp-att-1851\" href=\"https://admin.</p><p>crackintheroad.com/life/1831-m-kat-a-student-perspective/attachment/meph\"><img class=\"aligncenter size-full wp-image-1851\" title=\"meph\" src=\"https://api.crackintheroad.com/uploads/2010/07/meph.jpg\" alt=\"\" width=\"550\" height=\"413\" srcset=\"https://api.crackintheroad.com/images/2010/07/meph.jpg 550w, https://api.crackintheroad.com/images/2010/07/meph-300x225.jpg 300w, https://api.crackintheroad.com/images/2010/07/meph-494x370.jpg 494w, https://api.crackintheroad.com/images/2010/07/meph-165x123.jpg 165w\" sizes=\"(max-width: 550px) 100vw, 550px\" /></a></p>\n<p>Traditionally, University is a hotbed of drug use and experimentation. From a student’s first spliff, to narcotics of a more extreme nature, the youth that makes up our ‘Chemical Generation’ are not afraid of extending their moral boundaries. However, it was this year that a drug of intelligent chemical manufacture and retail, managed to utterly revolutionise the student experience.</p>\n<p>‘Mephedrone’, or as it is affectionately known by its users as ‘M-Kat’ (it also has a plethora of other nicknames, from ‘Bubble’ to ‘Miaow ‘) changed the landscape of youth culture and drug abuse. As this most powerful of substances was, for an unfathomable period of time, available over the counter.</p>\n<p>An undergraduate friendly amalgamation of legality and cheap mind distortion consequently remoulded nightlife in the North-East. The effects of this drug alter from person to person, though commonly it induces a chatty and friendly state of euphoria. For a time in the Bigg Market area, the bouncers were out of a job. (Insert Raoul Moat joke here)</p>\n<p>‘M-Kat’ fused vast swathes of people, who would have previously never even shown so much as a nod of acknowledgement to one another, into full blown conversations on the Chinese foreign policy or the best method of how to perform cunnilingus, believe me I’ve heard it all. This drug is also highly addictive, whether under the effects, or soberly craving a ‘rail’.</p>\n<p>Closely related to both the dysfunctional ‘Amphetamine’ and ‘Cathinone’ families, users will often ‘fiend’ for more and more powder whilst under the influence to keep the high going, and to stave off the inevitable fall from elation. This is achieved either through snorting, which is fairly self explanatory, or ‘bombing’; a method where the user wraps the drug up in cigarette skins and swallows accordingly.</p>\n<p>Conversely, it has an ugly side to it, crashing comedowns after ‘sessions’ are frequent. This drug has solely de-railed close friends’ lives and left certain acquaintances in very dark places. I do not for a minute condone or glorify the use of this substance, yet this article is written to combat the complete misrepresentation of the ‘Plant-Food powder’ in the mainstream media.</p>\n<p>Firstly, it was only marketed as ‘Plant-Food’ to comply with the medicines legislation, with an ironically Machiavellian label quoting ‘Not for human consumption’ used to round the issue of arrest. It has now been re-classified as a ‘Class-B substance’ and for good reason. Gone are the days of coming home and trooping out with an associate, whom shall remain nameless, to the ‘Kardbar’ for his Friday night sack of contentment. Bagged and wrapped in an informative leaflet on ‘Mephedrone’, and all delivered with the customary beam of a shop-keeper who still couldn’t believe his luck.</p>\n<p>Tabloids such as the ‘The Sun’, with their ever misinformed balderdash, peddled falsities and dubious tales of the ‘Toot’. Yes, a handful of young and ordinary students tragically lost their lives. And that is incontestable. However, the full stories of ‘Mephedrone’ being taken with a cocktail of other recreational drugs, were never fully reported, nor were the medical histories of the deceased. They were instead shunned for the Hollywood headlines, and the crusades against this ‘evil’ drug that appeared to be rotting the future of our nation from the inside out.</p>\n<p>Perhaps the saddest thing about this whole situation is the mere fact that the drug wasn’t proscribed sooner. The tag of legality gave previously ‘Alcohol only’ youngsters, whom wouldn’t touch a drug for fear of regulatory retribution or societal rejection, an exciting dimension. A freedom which would allow research into the effects of something other than the booze, without an inkling of trouble. It’s the sight of this type of person, that carried the ‘Beacon of Hope’ within an otherwise ‘Wired’ generation, trying to re-arrange their jaw structure whilst removing their top lip with the bottom, that just doesn’t sit well. From pretty to Picasso in 10 minutes.</p>\n<p>The long term effects are also worrying. Already proven as a vascular-constrictor, it is not totally out of the equation for this flare up of powdered mayhem, to seriously affect the health of its users in the none too distant future. I pray this is perceptive paranoia. It must be stated; the vast majority of people who enjoy this drug, do so sensibly and restrain themselves from the minority, who indulge in 3 day binges minus sleep. Not to say that this is wrong, though given the lack of professional insight into the drug, it could be described as playing with fire.</p>\n<p>Love it or loathe it, ‘Mephedrone’ has undeniably altered the manner in which drugs are viewed by the average student. It has also created a divide between those who abstain and those who indulge. It has pulled us together and dragged us apart. And for the most part, redefined student night-life across the UK.</p>\n<p>It is probably nothing to be particularly proud of, nonetheless, many of this year’s University and College intake, have played their own little part in shaping drugs culture for the perennial wave of Freshers in years to come.</p>\n","slug":"1831-m-kat-a-student-perspective","category":"life","date":1278782986000,"wpid":1831,"isSticky":false,"featured_image":{"width":550,"height":413,"src":"2010/07/meph.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAIAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAYH/8QAIhAAAQMCBgMAAAAAAAAAAAAAAgEDBAARBQYHEiEiUWGR/8QAFQEBAQAAAAAAAAAAAAAAAAAAAQP/xAAXEQEBAQEAAAAAAAAAAAAAAAABAAMR/9oADAMBAAIRAxEAPwDPtN100TLQM5jdOPjsjepP3OzfPXsibR82VF91ETzw4J0gWMcQ2RcJAJYpXIb8L8pSoGZ1Zv/Z"},"createdAt":1587295127051,"updatedAt":1588403565686,"author":"5e9b68b27a1236eccfeb1d42","old_image":"2010/07/meph.jpg","categories":["life"]}