{"id":"5e9c09ef774c2610387e51ac","artists":["5e9b69637a1236eccfeb2725"],"title":"News: Ellery Roberts Quits WU LYF, Releases Final Song T R I U M P H","content":"<p>In a bizarre and unexpected twist, lead singer Ellery Roberts has called time on his journey with Mancunian rockers <strong>WU LYF.</p><p></strong> Posting a cryptic message on a Youtube Channel, written in the form of a letter to his band mates, lead singer <strong>Ellery Roberts</strong> states:</p>\n<p><em>“Evans/Joe/Tom</em></p>\n<p><em>I am gone. This isn’t the end. This is the begging.</em><br />\n<em>We done business to be as free as we want to be; I’m exercising this freedom. Manchester and the life we maintaining is leaving me empty. It is a beautiful/ incredible/ insane world we live and I’m done walking round in baby step circles in a self involved bubble. WU LYF isn’t that important. So go do what you want to do. If you wanna play together, Play! your talented musicians so don’t waste that. I am bored of the most challenging thing in WU LYF being deluding myself of its relevance. Dirty free, as that show ended it concreted my decision that a change has to come. “Be the change you want to see” said a wise old man.</em><br />\n<em>I’m going to keep on doing what I do; if the time comes in the future where we all truly want to collaborate on something then that door is always going to be open; I have nothing but love for you all.</em></p>\n<p><em>But I want to live life that’s true to me.</em></p>\n<p><em>Stay safe</em><br />\n<em>your Brother from another mother…</em><br />\n<em>X</em></p>\n<p><em>(I’m gonna stay on email so keep in touch.)”</em></p>\n<p>It’s unclear as to whether this is the end for<strong> WU LYF</strong> however at the moment it would appear that the Lucifer Youth Foundation has run out of steam, with the deletion of their Facebook page adding strength to the rumour. Having released their debut album <em><strong>Go Tell Fire To The Mountain</strong></em> last year to phenomenal critical success, the groups career has been controversial and widely publicized. Check out the full message below, as well as a previously unreleased track, <em>T R I U M P H</em>. Here’s hoping this is not the end.</p>\n<p><em>“By the time I wrote this I was all ready gone. You know you aint got nothing but time, but time isn’t an infinite currency I want to see wasted. If this is our last month living, apocalypse looming, I am not going to spend my final hours waiting in purgatory. I am done. There is nothing here that inspires/ interests me beyond the emptiness for dreams. and I don’t want to spend my life asleep; dreaming of a….</em></p>\n<p><em>Wake up! We stay safe/ everything is golden/ in this place.</em></p>\n<p><em>WU LYF is dead to me. The sincerity of “Go tell fire” was lost in the bull shit of maintaining face in the world we live. Clap your hands chimp everybody’s watching. A year spent losing faith; Innocence lost wide eyes see clear the dark. There’s blood running down streets of every city in the world, what’s a song to do, pretend it mean everything/nothing to you. Another distraction from the world we live. I and I struggle for a based positivity; Get free or die trying; J C Hung him self up for the easy way out. so Broken Mama Cita be kind to me.</em></p>\n<p><em>P E O are P L E the world over. Your beautiful and strange, and I love you. But The Great Longings calling and I’m young and free enough to try and answer.</em></p>\n<p><em>Forever</em><br />\n<em> Ellery James Roberts”</em></p>\n<p><iframe src=\"https://www.youtube.com/embed/IYP28s_-1VA\" frameborder=\"0\" width=\"560\" height=\"315\"></iframe></p>\n<p>Update: A tweet from WU LYF bassist Francis Lung suggests that there may still be hope for the band:</p>\n<blockquote class=\"twitter-tweet tw-align-center\">\n<p>not over yet.</p>\n<p>&mdash; FrancisLung (@FrancisLung) <a href=\"https://twitter.com/FrancisLung/status/272343505718870016\" data-datetime=\"2012-11-24T14:18:46+00:00\">November 24, 2012</a></p></blockquote>\n<p><script src=\"//platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></p>\n","slug":"18427-ellery-roberts-wu-lyf-t-r-i-u-m-p-h","category":"music","date":1353718009000,"wpid":18427,"isSticky":false,"featured_image":{"width":1200,"height":800,"src":"2012/11/20110603104326_wuwilliamsburlurredg1-1200x800.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAMG/8QAIhAAAQMDAwUAAAAAAAAAAAAAAQIDEQAFIQQGBxIYIjFh/8QAFQEBAQAAAAAAAAAAAAAAAAAAAwT/xAAYEQEAAwEAAAAAAAAAAAAAAAABAAIxYf/aAAwDAQACEQMRAD8Axr/Nu5HdOhh++a1twNFClBIBzGcezVu5DcqfE2yyuEY61NOSr6YXEmlKAoOyhtyf/9k="},"createdAt":1587284463288,"updatedAt":1588403535258,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2012/11/20110603104326_wuwilliamsburlurredg1-1200x800.jpg","categories":["music","news","new"]}