{"id":"5e9c09e5774c2610387e51a1","artists":["5e9b68c77a1236eccfeb1d9c"],"title":"Interview: Alt-J","content":"<p><a href=\"https://admin.</p><p>crackintheroad.com/music/18466-interview-alt-j/attachment/altj/\" rel=\"attachment wp-att-18472\"><img class=\"alignnone size-medium wp-image-18472\" title=\"altj\" src=\"https://api.crackintheroad.com/uploads/2012/11/altj-260x260.jpg\" alt=\"\" width=\"260\" height=\"260\" /></a></p>\n<p>We’ll spare you the nonsense; you know who <strong>Alt-J</strong> are. In the midst of all that Mercury nonsense, we managed to have a (very) quick chat with the band’s very own Gwil Sainsbury. Enjoy.</p>\n<p><strong>How’s touring coming along?</strong></p>\n<p><em>We are currently in Germany supporting <strong>TDCC</strong> on their European tour. We did a 5 week tour of America in October which was incredible. There were parts of the tour where we just drove for three days solid to get to the next gig. It’s a very surprising, interesting and massive country. We are looking forward to going back there for a week in December.</em></p>\n<p><strong>In what ways has the incredibly positive response to An Awesome Wave affected your lives?</strong></p>\n<p><em>It’s given us a job for one thing which for four arts graduates is fairly good. We had no idea that it would be accepted, and responded to, in the way that it has. So it’s been quite an overwhelming task to understand why people and critics have taken to us so easily. We still don’t know.</em></p>\n<p><strong>Was there any particular moment over the last few months where you realised just how successful the LP had become?</strong></p>\n<p><em>Some of the festival crowds over the summer were quite insane. We turned up at festivals in countries where we had no idea the record was even released yet and were playing to tents at capacity with fans knowing the words. It’s been pretty unbelievable. Playing Jools Holland was a real highlight as was the whole Mercury Award thing.</em></p>\n<p><strong>An Awesome Wave took 5 years to write. Having seen how well received it is, do you find it will be easier to write and release new music more quickly?</strong></p>\n<p><em>Possibly, we just aren’t sure yet. We all certainly feel a lot more comfortable and confident with our instruments but we just haven’t had the time to start writing as a whole band yet as we are still constantly touring with the current album.</em></p>\n<p><strong>When it comes to writing new music, do you think you will look to progress or change your sound at all, or do you think that you’ve found a niche that you’re happy with?</strong></p>\n<p><em>We simply don’t know yet. Ideas of progress seem a little too linear in thinking. We just work on a track until we feel it’s done and we treat each track with its own sympathetic set of terms. It’s just not possible for us to say what our next tracks will sound like.</em></p>\n<p><strong>Why triangles?</strong></p>\n<p><em>Why not?</em></p>\n<p><strong>There’s been a bit of a flurry of activity lately in regards to releasing music videos. How important do you find videos are for complimenting your music?</strong></p>\n<p><em>Finding a music video that actually compliments a track is very hard. We don’t worry about it so much in complementing the track as we do it being an interesting piece of video. We look at it as an opportunity for a director to create something interesting that will enhance the impact of the track not necessarily to complement it.</em></p>\n<p><strong>What have been your best and worst moments onstage?</strong></p>\n<p><em>You tend to erase bad moments from memory as soon as you leave the stage. The most recent embarrassing memory was on Jools Holland where they start the programme with a big jam session with all the bands. Alice Cooper’s band started it off in b flat. Joe and I had no idea what that really meant as the only person in the band with any formal music training is Gus. So he had to show us which frets to play. That was pretty cringe-y moment on TV in a room of professional musicians. The best live moments so far have been playing a very excited gig at the Oxford Academy the day after the Mercury Prize, Reading Festival, Bestival, Pukkelpop and Latitude. </em></p>\n<p><strong>What music have you been listening to on tour?</strong></p>\n<p><strong><em>Princess Chelsea</em></strong><em>, Lil Golden Book</em></p>\n<p><strong><em>Hot Chip</em></strong><em>, In Our Heads</em><strong><em></em></strong></p>\n<p><strong><em>Stealing Sheep</em></strong><em>, Into The Diamond Sun</em></p>\n<p><strong>If you could collaborate with any artist, who would it be?</strong></p>\n<p><em>Dr. Dre.</em> </p>\n","slug":"18466-interview-alt-j","category":"interviews","date":1353941004000,"wpid":18466,"isSticky":false,"featured_image":{"width":50,"height":50,"src":"2012/11/altj-50x50.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAABgQH/8QAJRAAAgAEAwkAAAAAAAAAAAAAAQIAAwQFESExBhITFSMzYZHR/8QAFQEBAQAAAAAAAAAAAAAAAAAAAwT/xAAaEQACAgMAAAAAAAAAAAAAAAAAAQIDBBET/9oADAMBAAIRAxEAPwA9Y73dHmgG4V0wlgQOO5x8awsXn7KCKmtwOffb7EGy1NIVDuyZYzXRRGkCVLwHTT1CxbsIcl89H//Z"},"createdAt":1587284453022,"updatedAt":1588403535175,"author":"5e9b68b27a1236eccfeb1d16","old_image":"2012/11/altj-50x50.jpg","categories":["interviews","music"]}