{"id":"5e9c09ba774c2610387e5177","artists":["5e9b69177a1236eccfeb22a6"],"title":"Introducing: Lorine Chia","content":"<p><span style=\"color: #000000;\">“Someone once asked me why I make music.</p><p> All I can say was “I make music for music” – I love it so much that I wanna be able to create it. I wanna be heard and have something I can put my story into. I don’t do this for the money (I don’t even get paid), I just do it cause I love and cause I can’t live without.”</span></p>\n<p>Via <a href=\"https://disconaivete.com/post/37058513826\">Disco </a><a href=\"https://twitter.com/disco_naivete\" data-send-impression-cookie=\"true\">Naivete</a></p>\n<p><strong><a href=\"https://www.lorinechia.com/\">Lorine Chia</a></strong> describing the making of her debut Mixtape <em>Lorine</em>. Words that don’t exactly give of the impression of an artist, neither do they seem rooted completely in reality, trailing off into moments of naivety. Despite all this, there’s a purity to <strong>Chia</strong>’s words that thankfully is melded equally in her music. This is RnB for 2013 in the truest sense.</p>\n<p>If the emergence of the blog scene has done anything of the last few years, it is its exploitation of modern RnB that is perhaps of most importance. RnB had never been DIY; you went from bedroom to mega-stardom, with nothing much in-between. No other genre has such an inherent sense of rags to riches. All that is over of course. Just take this year as an example, kids like <strong>Solange</strong> and <strong><a title=\"Stream: Frank Ocean – Channel Orange\" href=\"https://api.crackintheroad.com/music/17269-stream-frank-ocean-channel-orange/\">Frank Ocean</a></strong> hogging the mainstream despite making fairly experimental stuff. In the UK we had the Newcastle based <a title=\"New: Lulu James & Mao – Stuck\" href=\"https://admin.crackintheroad.com/music/18279-new-lulu-james-mao-stuck/\"><strong>Lulu James</strong>’</a> slow rise to prominence throughout the country, again with stripped down beats and lyrics with a very real sense of melancholia. The world was finally ready to listen to RnB, about RnB.</p>\n<p><strong>Lorine Chia</strong> in many ways makes RnB and her making RnB, it’s undoubtedly personal and introspective, but also acts as a benchmark to where we’re at. That’s the thing, there’s something about it you’ve heard before; it’s an at times slightly awkward cross between <strong>Lulu Jame</strong>s, <strong>Alunageorge</strong> and the late <strong>Amy Winehouse</strong>. When it works however, it sounds like everything you’ve ever loved.</p>\n<p><iframe src=\"https://w.soundcloud.com/player/?url=http%3A%2F%2Fapi.soundcloud.com%2Fplaylists%2F2831454?\" frameborder=\"no\" scrolling=\"no\" width=\"100%\" height=\"450\"></iframe></p>\n<p><iframe src=\"https://www.youtube.com/embed/OUyr9bz4Acc\" frameborder=\"0\" width=\"560\" height=\"315\"></iframe></p>\n","slug":"18582-introducing-lorine-chia","category":"introducing","date":1354705703000,"wpid":18582,"isSticky":false,"featured_image":null,"createdAt":1587284410564,"updatedAt":1588441773188,"author":"5e9b68b27a1236eccfeb1d24","old_image":"generated/329c5f56e14cdbc36528f00b6d80fba5b1ea33b9.jpg","categories":["introducing","music"]}