{"id":"5e9c096c774c2610387e5143","artists":["5e9b69177a1236eccfeb22a8"],"title":"Interview: Los Campesinos!","content":"<p><a href=\"https://admin.</p><p>crackintheroad.com/music/18754-interview-los-campesinos-2/attachment/img-los-campesinos_164807117265/\" rel=\"attachment wp-att-18755\"><img class=\"alignnone size-medium wp-image-18755\" title=\"img-los-campesinos_164807117265\" src=\"https://api.crackintheroad.com/uploads/2012/12/img-los-campesinos_164807117265-260x167.jpg\" alt=\"\" width=\"260\" height=\"167\" /></a>Coming to the end of the <em>Hello Sadness </em>era, and just before their (utterly stellar) end-of-year set in Islington Assembly Hall, we sit down with Gareth Campesinos! to discuss album five, social networking and the depature of founding member Ellen Campesinos! from the band.</p>\n<p><strong>You’ve hyped up tonight’s show quite a lot.</strong></p>\n<p><strong></strong><em>Have we hyped it up a lot? I don’t think it’s been hyped up. It’s been advertised. We did it without paying for any advertising.</em></p>\n<p><em></em><strong>It’s been advertised as quite a special show, then. Why?</strong></p>\n<p><strong></strong><em>It’s special because it’s drawing a veil over Hello Sadness. It’s going to be the last gig before we go and record the new album so it’s important for us in that respect. It’s exciting because it’s in a smaller venue than we usually play in London. And because we’ve not advertised it properly, we’ve only done so through our Facebook and Twitter – because we haven’t paid for any advertising in publications or any web space or anything means that the people who are going to be at the gig will probably be more close-knit <strong>Los Campesinos! </strong>fans who have seen us on more occasions, which allows us to be self-indulgent, and to indulge the audience, in the setlist. If you’re playing a big gig – we’ve played Shepherd’s Bush in the past – if you’re playing to one and a half thousand people then there’s a good deal of those who need convincing, whereas we feel a gig of this nature, people are already convinced and they’re going to be happy to go along with us and see what happens with it. Also, because it’s Ellen’s last gig as well. Ellen would be happy to go out with no fanfare and just quietly leave, but it’s nice to just have a gig to celebrate that – especially a gig of this nature playing a wide range of songs we’ve done from album to album to album to album. So lots of reasons it’s going to be fun for us and we’ve got some mates down to play – Rob’s playing – and this will be the only gig he’s played this year as <strong>Sparky Deathcap. </strong></em></p>\n<p><strong><em></em>What was the experience of touring <em>Hello Sadness </em>like, and how has it differed at all to previous tours?</strong></p>\n<p><strong></strong><em>I think with each tour and each record we become more accustomed to it. You get better at touring; you get more used to dealing with it. I guess you have to look harder for new experiences because obviously part of the best thing about touring is that you experience new things and see new things, and when you’ve been touring and touring those new things are harder to find. So it’s great that we got to go to Australia for the first time. It had gotten to the point where we hadn’t played anywhere new to us in a long time, so it was amazing to go somewhere and meet people who had been to see us from six years ago. It’s more difficult to choose a setlist than it was on the last record, because we’ve got another record’s worth of songs. But touring is obviously as exciting and I think is the most exciting and the most monotonous thing in the world, because the things which are exciting become things that you are accustomed to, and that’s a really weird thing. It’s amazing, but it’s a really odd thing too – the extent that the things that you start to get excited at are the things you do at home. I think we’re at the point now where we just want to make a record. We’ve got lots of great new ideas, lots of new things we want to experiment with and try, and we’re excited to go and do that now.</em></p>\n<p><em></em><strong>What can you tell us about your fifth record?</strong></p>\n<p><strong></strong><em>From my side of things, it’s very early days. Tom’s written the bulk of the music for it, and it’s got me very, very excited. I feel like I can say that with no bias, because I have no involvement with the writing of the music. I have no musical ability at all. Tom’s ability to record and produce music himself astounds me, and he’s all self-taught. ‘A Doe to a Deer’, which we put out this week was recorded, mixed and mastered by Tom. And I think it sounds fantastic too. These demos that he gives me are pretty much fully formed to that level already. I think it’s more ambitious, still and there are a lot more textures going to be involved. Lyrically, I couldn’t tell you because as ever I like to leave writing lyrics until the latest possible moment, otherwise I dislike what I’ve written by the time I come to record it. But we’re just excited to get into the studio – and I guess this is where I revert to clichés – but we’re just excited to try new things, and we’re very lucky that the record labels have just been happy with us to do what we want, and that’s a really liberating thing to experience.</em></p>\n<p><em> </em><strong>You mentioned that Ellen’s leaving. Has it been particularly difficult to see such a long-time member of the band leave?</strong></p>\n<p><strong></strong><em>Not really, no. Ellen said the same herself: it won’t hit you until later on, because we’re excited about this gig and we’re excited about the evening, and we’re excited for Ellen because she’s going on to do fantastic things. I guess there’s an element of envy for that as well, because she gets to try all these different things. It’s the fourth time somebody’s departed the band. It’s not something that we’re used to, but it’s something that we accept. Being in <strong>Los Campesinos!</strong>, you don’t make very much money. You go along at the same level that we have for the past few years. It’s a great level to be at, but I can totally understand why Ellen would want to try something different, and we’re excited for that because she’s always worked with video and writing and it’s great that she gets to go an experience that when perhaps being in the band wasn’t allowing her to realise her full potential in a lot of those areas. When it comes to the point of playing shows without her, and touring without her, obviously that’s when it’ll be felt, but the main thing is that since  she’s been touring with us for the past six or seven years, and since we’re as close friends as we are, you get excited for somebody and to see how excited they are to go on. I’m sure by the end of tonight she’ll be an absolute mess. It’ll be an emotional show for that reason. But it’s fantastic for her, and it’s very exciting.</em></p>\n<p><em> </em><strong>This show was organised entirely through Facebook and Twitter. How important do you find it is for a band to maintain a presence outside of merely playing shows and releasing music?</strong></p>\n<p><strong></strong><em>In this day and age, it’s really weird to compare the difference between now and even as far back as the 90s. It puts a lot more control in the hands of the band. You don’t have to pay people to do things you could do quite easily yourself. It astounds me, some of the things bands pay other people to do for them that they could easily do themselves. Bands who pay other people to run their merch – it’s waste. It’s completely unnecessary. If they don’t do it themselves, they’re losing out on money. And I think music fans are, more and more, demanding more and for a band to release an album every two years and then tour that album, I don’t think that’s enough to satiate people’s interest and I do think people will be very quick to forget about bands. That’s why doing something like Heat Rash was so great for us, to trickle out these songs every six months or so. That would tide people over from one album to the next. I think it’s been useful in keeping people aware of us and stopping too many people thinking, “oh, what happened to <strong>Los Campesinos!</strong>?” </em></p>\n<p><em> </em><strong>What have you been listening to recently?</strong></p>\n<p><strong></strong><em>This past week, I’ve been listening to this modern composer called <strong>Max Richter</strong>, who’s done some stuff in the past I really loved. But this year, he released this thing called Vivaldi Recomposed. He’s basically taken Vivaldi’s Four Seasons, broken it down and then built it back up again. It resembles the original, but he’s written his own bits into it. It’s absolutely astounding. I’ve been going back over releases this year to decide what my favourite albums of the year have been. Obviously at this point, with lots of publications putting out their Top 100s or Top 50s or whatever, there’s been a lot of new stuff to check out. It’s one of my favourite times. I know a lot of people are sceptical of lists, but I enjoy them, because it does turn me on to a lot of new stuff. The stuff that <strong>Burial</strong>’s released this year has been absolutely incredible.</em></p>\n<p><em></em><strong>The stuff he’s released in the last few days, as well…</strong></p>\n<p><strong></strong><em>Yeah, exactly. I’ve not really fully taken that all in yet, because obviously they’re big pieces. Kindred is one of my absolute favourite pieces this year. I was surprised it was released this year when I checked it, because it hasn’t really appeared in many end of year lists. I know it’s not an album so it doesn’t really fit in, though. I tend not to listen to too much indie or guitar music these days, because it’s what we do. I like to be away from it so I’m not too influenced by it, and don’t try to rip it off. I guess when you hear the same sounds all the time, you want to escape from those sounds when you’re listening for leisure. But it’s been a great year for music and I think most of the best stuff from this year I won’t hear until January or February when I finally have enough time to plough through everything.</em></p>\n<p><em></em><strong>What has your best moment been this year?</strong></p>\n<p><strong></strong><em>Australia</em><em> was fantastic. That was something that we’d looked forward to for a long time and it completely lived up to our expectations. Playing the main stage at Reading and Leeds was great because Reading and Leeds are festivals that we’ve been to as music fans and we played there twice before, but to finally get there and play the main stage was completely overwhelming. Non-musically, a couple of months ago my football team was losing 4-0 at half time and won 5-4 in the end. That puts the musical stuff into perspective. </em> </p>\n","slug":"18754-interview-los-campesinos-2","category":"interviews","date":1355755740000,"wpid":18754,"isSticky":false,"featured_image":{"width":950,"height":610,"src":"2012/12/img-los-campesinos_164807117265-950x610.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAGAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAUH/8QAHxAAAgICAQUAAAAAAAAAAAAAAQIDEQAFBAcTIlFh/8QAFQEBAQAAAAAAAAAAAAAAAAAAAgT/xAAYEQEBAQEBAAAAAAAAAAAAAAABAgAhUf/aAAwDAQACEQMRAD8AzyfaN3E4aB4YyqGGNZGZED0Kon3eVZOnmxjkZG5GtcqSCzRWT9PjjGUHYFzukoDzf//Z"},"createdAt":1587284332439,"updatedAt":1588443771492,"author":"5e9b68b27a1236eccfeb1d16","old_image":"2012/12/img-los-campesinos_164807117265-950x610.jpg","categories":["interviews","music"]}