{"id":"5e9c092d774c2610387e50f7","artists":["5e9b68f27a1236eccfeb201d"],"title":"Introducing: Evening Man","content":"<p>I’m finding it really difficult to pin my finger on exactly what it is that I like so much about Washington’s <strong>Evening Man</strong> aka Paul Erik Lipp.</p><p> His newest release In Space is a myriad of twisted synths, outlandishly auto-tuned vocals and pop songwriting worthy of a diploma. Eccentric and at times slightly abrasive, the nine tracks that comprise the release are each individually tailored to perspire a differing section of Lipp’s personality. Be it the 80’s squelchy tenebrosity of <em>In Movies</em> or the screeched line <em>“But that doesn’t mean I won’t stay here anyway.</em>” unearthed in <em>Glass Beneath The Skin</em>,<strong> Evening Man</strong> is the music of a collection of a vulnerable yet cock-sure musician.</p>\n<p>Sonically, the vocals bring up memories of <strong>Elbow’s</strong> Guy Garvey  whilst the instrumentation is part<strong> Duran Duran</strong>, part <strong>Depeche Mode</strong>, as it swings between menacing and luxuriously upbeat. My personal highlight, the soundtrack worthy I Can’t Be Your Man finds it’s roots amongst folk-pop yet spreads his branches into the far more exciting and emotionally unstable realms. <em>The way you stand there in the light, like I never could have found you. </em><br />\n<em>You could evaporate in night. You know I’m gonna have to… </em>Check out the full release below, and keep up with <strong>Evening Man</strong> via <a href=\"https://www.facebook.com/pages/Evening-Man/196187513741468?ref=ts&fref=ts\" target=\"_blank\">Facebook</a>.</p>\n<p><iframe style=\"position: relative; display: block; width: 300px; height: 410px;\" src=\"https://bandcamp.com/EmbeddedPlayer/v=2/album=1392085906/size=grande3/bgcol=FFFFFF/linkcol=4285BB/\" frameborder=\"0\" width=\"300\" height=\"410\"></iframe></p>\n","slug":"18918-introducing-evening-man","category":"introducing","date":1357175688000,"wpid":18918,"isSticky":false,"featured_image":null,"createdAt":1587284269382,"updatedAt":1588441772256,"author":"5e9b68b27a1236eccfeb1d27","old_image":"generated/ab67616d0000b2735445f0f7e8fe95232047f02b.jpg","categories":["introducing","mpfree","new","music"]}