{"id":"5e9c34889b6559241525e240","title":"Review: LCD Soundsystem-This Is Happening","content":"<div>As head of DFA records, 40 year old James Murphy is pretty well respected within the music industry.</p><p> However it’s LCD Soundsystem that has really been his main success. With 2 critically acclaimed albums and one of my greatest songs of last decade under the name already, Murphy has set his standards pretty high.</div>\n<div>LCD Soundsystem’s third, and (supposedly) final, album is set to drop on May 17th. Teased via video tours of Murphy’s new studio/mansion in LA, the recording seems oddly similar to that of Berlin era Bowie, with song samples to match. The first single ‘Drunk Girls’ is dripping with the brash arrogance heard previously on the likes of ‘North American Scum’ and ‘Losing My Edge’ while other leaked tracks, such as the 9 minute opener ‘Dance Yrself Clean’, is much more reminiscent of something like ‘All My Friends’. Now this is making out that the album is just going to be ‘Sound Of Silver 2’ and it may well be, but from what we have heard so far, I believe Murphy is just continuing to perfect his technique. His production and songwriting seems to be hitting it’s peak, with this album taking everything that made the last 2 so good, but finally perfecting it one flawless album.</div>\n<div style=\"text-align: center;\">A recent NME interview had Murphy discussing the death of the album format. With ‘This Is Happening’ being the last LCD Soundsystem ‘album’, will it be the end of the band or just their final album? Either way, I’m sure James Murphy has a lot more to add to the music industry.</div>\n<div style=\"text-align: center;\"><a href=\"https://rapidshare.com/files/374768586/Dance_Yrself_Clean.mp3\">Dance Yrself Clean by LCD Soundystem</a></div>\n<div style=\"text-align: center;\"><a href=\"https://www.lcdsoundsystem.com/\">https://www.lcdsoundsystem.com/</a></div>\n","slug":"193-this-is-happening","category":"music","date":1271002643000,"wpid":193,"isSticky":false,"featured_image":{"width":1024,"height":566,"src":"2010/04/412445461_1e87a6d2b4_b.jpeg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAFAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAAAAf/xAAfEAACAgIBBQAAAAAAAAAAAAABAwACBREGBAcSQVH/xAAVAQEBAAAAAAAAAAAAAAAAAAAAA//EABoRAAICAwAAAAAAAAAAAAAAAAABA0ECEbH/2gAMAwEAAhEDEQA/AI73i4/jeMDCY7EItWlunLnNbbyYxh0Cd6Gh8r6k2iIpFJVqTJKm+n//2Q=="},"createdAt":1587295368486,"updatedAt":1588403569149,"author":"5e9b68b27a1236eccfeb1d2a","old_image":"2010/04/412445461_1e87a6d2b4_b.jpeg","categories":["music"]}