{"id":"5e9c0873774c2610387e503d","artists":["5e9b68e07a1236eccfeb1ee4"],"title":"Man vs. Video: Charli XCX – You (Ha Ha Ha)","content":"<p><i>A new bit looking at the often overlooked world of music videos, written by a self-styled asshole with a Lit degree.</p><p>  – ed..</i></p>\n<p>httpv://www.youtube.com/watch?v=qtrHH1BDlzk</p>\n<p>Charli XCX has courted a reasonable bit of controversy concerning the video for her Gold Panda-sampling song ‘You (Ha Ha Ha)’, notably over her supposed glorification of firearms. The point that everyone seems to be missing though is the most offensive thing to do with the video, is the quality of the video itself. Ms. XCX recently stated that ‘You (Ha Ha Ha)’ was like “the internet spewing in your headphones” and, to be fair to her, that is probably the best way to describe the piece; web vomit. You don’t need to look further than the opening seconds of the Ryan Andrews directed video for evidence. The first shot is of a cat and the second the tight buttocks of the artist. I can imagine the two of them noting the popularity of cats and porn on the internet and deciding that, in order to make the video as relevant to the online world as possible, that they just HAD to be included. Subtlety has no place in the world of Charli XCX.</p>\n<p>Stylistically, the video continues to follow the approach laid out in the opening seconds. Everything is layered with the sort of instagram filters that a twelve year old would find tasteless and this effect is worsened by the fake analogue static that is liberally showered over the screen every few seconds. I guess these are meant to lend Charli XCX an aesthetic that reflects the current obsession with nostalgia, but instead comes across as someone desperately trying to grasp onto every trend to give themselves a boost up the fame ladder.</p>\n<p>The general theme of ‘You (Ha Ha Ha)’ is also depressingly basic. Working on the age-old contrasting technique, girls in 90s influenced clothing dance around a factory and play with guns. It’s aiming for a response along the lines of “WHAT? Women who look like that aren’t normally armed and hanging around factories, that shit cray! I can feel gender stereotypes slipping away amongst this barrage of provocative imagery”, but, honestly, it remains as hollow as everything else to do with Charli XCX.</p>\n<p>The representation of weapons in the ‘You (Ha Ha Ha)’ video has caused heated arguments, which claim that it reveres violence, but this is just not the case. Simply, if the gun is viewed as a metaphor for masculine domination, which is not a hard (pun intended) leap to make, the use of them in this context is far more about females reclaiming power than any statement about how awesome violence is. End of.</p>\n<p>Where (00:42) I feel further discussion is needed in the video revolves around the segment that involves firing guns, collecting the bullet casings and then turning them into lipstick. Is this Charli XCX comforting the viewer by displaying she has an entrepreneurial streak, so there’s no need to worry about her if the whole music career thing doesn’t’ pan out? Isn’t there an easier or safer way to get lots of bullet casings than firing off weapons haphazardly? As there are no lids on the cosmetic items, wouldn’t they just smear lipstick everywhere? These are the real issues that require addressing.</p>\n<p>Throughout the video, Charli XCX does an admirable job of pouting at anything and everything, but she really comes into her own when demonstrating her karate skills (02:34). Not only does it scream strength and independence, but it works as a pretty perfect representation of the entire video. All that attitude and effortless cool, I could watch that clip on repeat for days.</p>\n","slug":"19336-video-review-charli-xcx-you-ha-ha-ha","category":"newreviews","date":1359486021000,"wpid":19336,"isSticky":false,"featured_image":{"width":1280,"height":800,"src":"2013/01/shot_08_sick-shirt_1392-1280x800.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAGAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAUH/8QAIBAAAgEEAQUAAAAAAAAAAAAAAQIEAAMFETEGEhNBkf/EABQBAQAAAAAAAAAAAAAAAAAAAAD/xAAUEQEAAAAAAAAAAAAAAAAAAAAA/9oADAMBAAIRAxEAPwDNMjjYETo+Vftw7DMHi2BcdNuHbudiDvQGlA4J549yTi4ZO/CvylKD/9k="},"createdAt":1587284083088,"updatedAt":1588403532742,"author":"5e9b68b27a1236eccfeb1d11","old_image":"2013/01/shot_08_sick-shirt_1392-1280x800.jpg","categories":["newreviews","videos"]}