{"id":"5e9c338a9b6559241525e091","title":"5 Minutes With: Pete and the Pirates","content":"<p><a rel=\"attachment wp-att-1944\" href=\"https://admin.</p><p>crackintheroad.com/music/1943-5-minutes-with-pete-and-the-pirates/attachment/pete-2\"><img class=\"alignnone size-totallysizedforever wp-image-1944\" title=\"pete 2\" src=\"https://api.crackintheroad.com/uploads/2010/07/pete-2-740x433.jpg\" alt=\"\" width=\"740\" height=\"433\" /></a></p>\n<p>After the success of their début album, <em>Little </em>Death, <strong>Pete and the Pirates </strong>are on the verge of releasing a highly anticipated second album and, thus, have spent a large portion of their year in a recording studio. There is no doubt all this time and effort will pay dividends in the end if it reaches the same standard as their first, which included singles <em>Come on Feet</em> and <em>Mr. Understanding. </em>In this new album all fans of theirs will hope for equally imaginative and emotive lyrics which suggested perhaps verging on semi-autobiographical with lines such as ‘I keep trying to forget she doesn’t belong to me’.</p>\n<p>The band also have also headlined such venues as Club NME and supported acts including <strong>Maximo Park </strong>and <strong>Vampire Weekend </strong>in the past and they will hope this upcoming album will put themselves in the forefront of indie music in Britain once again after months in the recording studio. They are, however, still playing in several festivals throughout Europe this summer at Camp Bestival in East Lulworth and the Outside Inside Festival at their home town of Reading, which will prove to be a must-see for any Pirates fan. I have personally seen them live at Rockness in 2008 and they were certainly one of my highlights of the weekend and I could only wish to be able to see them play back in their home town. So if you’re going to any of the aforementioned festivals this year then I would implore you to try and see <strong>Pete and the</strong> <strong>Pirates</strong>, they <em>will </em>brighten your day, even if the weather doesn’t.</p>\n<p>CitR were lucky enough to ask the singer, Tommy Sanders, a few questions despite their recent hectic schedule:</p>\n<p>CitR: How did you come up with the name Pete and the Pirates, and do some band members not mind having their names in the bands title?</p>\n<p><strong>There wasn’t a great deal of thought that went into the name, i think the whole point is that a name is very unimportant. No, nobody minds not having their name in the title. It’s only a name.</strong> </p>\n<p>CitR: What is your favourite ever gig or festival you have performed at?</p>\n<p><strong>Reading festival was fun cos it’s our home town and the crowd were amazing. People talk about how good bands were that they saw, but bands also talk about how good the people watching them were too. </strong></p>\n<p>CitR: You’ve even been across to America to perform, what was that like and would you like to do it again?</p>\n<p><strong>I hope we get to do it again, yes. People in America seem very respectful of and enthusiastic about the music we make, and very accommodating and genuine.</strong>  </p>\n<p>CitR: Are you football fans? And if so I bet you bought Euro 2008 which includes Come on Feet?</p>\n<p><strong>Not really football fans, no. David likes football but no one else really understands it. The world cup is a lot of fun though.</strong>  </p>\n<p>CitR: I believe all members of the band are currently working on solo projects, who is that going for each of you and what are we to expect from Pete and the Pirates in the future?</p>\n<p><strong>Yes we all have our own little things inasmuch as we all enjoy recording on our own as little creative oases. Pirates is always out main focus though. You can expect a new Pirates album which will be good. </strong></p>\n<p>CitR:You have described your album, Little Death, as ‘innocent’, could you elaborate on that at all?</p>\n<p><strong>Um…. maybe a bit naive… a bit kind of spontaneous and unedited</strong>.</p>\n<p>CitR: It appears you get to travel quite a bit, with upcoming gigs in Spain, Romania and Holland, what is life like on a tour bus and is there any aspects to the music lifestyle that you are less enthusiastic about now than when you started out as a band?</p>\n<p><strong>Life on a tour bus is suffocating. Sometimes in a claustrophobic sense, and sometimes because it really smells. </strong></p>\n<p>CitR: What is your most embarrassing moment whilst performing on stage?</p>\n<p><strong>I often drop the microphone.</strong> </p>\n<p>CitR: If you could have any superpower, what would it be?</p>\n<p><strong>I want to talk to the animals</strong>. </p>\n<p><a href=\"https://www.myspace.com/peteandthepirates\">Pete and the Pirates Myspace</a></p>\n<p><a href=\"https://www.peteandthepirates.co.uk/index.html\">Pete and the Pirates Official Site </a></p>\n","slug":"1943-5-minutes-with-pete-and-the-pirates","category":"interviews","date":1279485539000,"wpid":1943,"isSticky":false,"featured_image":{"width":1573,"height":922,"src":"2010/07/pete-2.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAGAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAYH/8QAIhAAAQIGAQUAAAAAAAAAAAAAAQIDAAQFERIhMQYHQVGh/8QAFQEBAQAAAAAAAAAAAAAAAAAAAwX/xAAZEQADAAMAAAAAAAAAAAAAAAAAAQIREjH/2gAMAwEAAhEDEQA/AM+p3RzVVcdmXxIpbfKQhsS1y2keAch6txscxco7StrQlRapxyF9KeT8y1CESd6rrEing//Z"},"createdAt":1587295114743,"updatedAt":1588403565476,"author":"5e9b68b27a1236eccfeb1d07","old_image":"2010/07/pete-2.jpg","categories":["interviews","music"]}