{"id":"5e9c085a774c2610387e5023","title":"Man vs. Video: Animal Collective – Applesauce","content":"<p><i>A new bit looking at the often overlooked world of music videos, written by a self-styled asshole with a Lit degree.</p><p>  – ed..</i></p>\n<p>httpv://www.youtube.com/watch?v=ln_Ag7vk5X4</p>\n<p>There are some music videos that just blow you away with their inherent creativity. They move beyond merely an advertisement for a band’s aesthetic and, instead, become transcendent pieces of art. I’ve always assumed that this is what goes through the communal consciousness of Animal Collective whenever it’s time for them to make another video. In reality, AnCo videos tend to reflect what detractors of the group find so irritating about them; artiness simply for the sake of it. I mean, go watch ODDSAC. Hell, if you’ve managed to get through that “film” without seriously empathising with the prisoners who had full-volume Metallica pumped at them for days on end, then you are either more in tune with the subtle machinations of modern art than myself or wrong, and I’m pretty confident it’s the latter.</p>\n<p>This time, Animal Collective have teamed up with Gaspar Noé, the Argentinian director of <i>Enter The Void,</i> for ‘Applesauce’, a cut from their latest album, <i>Centipede Hz. </i>Now, before I wade balls deep into the Byzantine universe of the video, I should say that it supposedly takes inspiration from Paul Sharits’ short film from 1968, entitled “N:O:T:H:I:N:G”, which is cool, I guess. This means that the piece needs to be analysed with the same level of seriousness in order to be fully unravelled.</p>\n<p>The vague premise of the ‘Applesauce’ piece is an extreme close-up of a lady, Lindsey Wixson, a model with a moderate sized wikipedia entry, eating some kind of fruit, which I guess might be a peach, but I’ll leave that investigation to the agriculturists, in front of vibrant, multicoloured lights. For five and a half minutes. A baser critic might state that this is the kind of thing that could be hobbled together in an afternoon by A-Level art students, but would they have a director with a cool-sounding, foreign name or an actual model in their video? Doubt it.</p>\n<p>So, what’s the video trying to say, I hear you all yell. Shhh, chill out guys, I’ll tell you. The impact of those violent flashing lights, an intense and disorientating barrage of colour, give the viewer a sense of unease, as there is no solid foundation behind the main focus of the camera. This discomfort is furthered by the contrast between the aggressive imagery and the more carefree and cheerful music. As the band have also stated that the video should be watched in complete darkness, an isolating effect is also created. If all this is considered alongside the fact that, throughout this bombardment, a peach is consumed and framed in a way that is reminiscent of the tearing of flesh, with bits of skin hanging off and liquid dribbling down the protagonist’s chin, both being direct links to the human epidermis and blood, the meaning becomes crystal clear. Animal Collective hate fruit. I mean, despise it. They’re trying to do that old Clockwork Orange trick, forcing the viewer to feel nauseous whenever they stumble across a greengrocer or that aisle at the front of every supermarket. Shocking stuff.</p>\n<p>I do have to wonder though about the motivations behind making a video like this. Sure, if I was at the numb face stage of a ketamine binge, all those pretty colours would ensure that I had an awesome time, but, at the minute, I’m not and I’d probably bet that most people reading this aren’t either. This asks the question, why? Come on Animal Collective, I’m a (semi) busy man, I can’t take narcotics every time I have to watch one of your videos.</p>\n","slug":"19442-man-vs-video-animal-collective-applesauce","category":"reviews","date":1359975960000,"wpid":19442,"isSticky":false,"featured_image":null,"createdAt":1587284058022,"updatedAt":1588441790710,"author":"5e9b68b27a1236eccfeb1d11","old_image":"generated/94721d9349cc57b01968409bb5e5f86ade1abb91.jpg","categories":["reviews","videos"]}