{"id":"5e9c084f774c2610387e5020","artists":["5e9b68e57a1236eccfeb1f62","5e9b68fe7a1236eccfeb2117"],"title":"News: First UK solo show for HEEMS since Das Racist breakup","content":"<p>Aight, Queens rapper Heems has announced a gig at BIRTHDAYS, London on the 18th of March.</p><p> This will be his first show since Das Racist split back in December last year.</p>\n<p>Tickets will be available for £9 from 9am tomorrow (Wednesday the 6th of February) from <a href=\"https://www.wegottickets.com/event/207851\">WeGotTickets</a>, <a href=\"https://www.seetickets.com/Event/HEEMS/Birthdays/693715\">SeeTickets</a> or <a href=\"https://www.ticketweb.co.uk/event/39101\">TicketWeb.</a></p>\n<p>Known for his often abstract lyrics and alternative rapping style as one part of Das Racist, Indian-American Himanshu Kumar Suri aka Heems was also responsible for founding the independent record label Greedhead Music.</p>\n<p>Greedhead released Das Racists’ original mixtapes and first album, before going on to release solo mixtapes from Heems himself, Kool A.D and a number of other artists including Glasweigan bhangra group <a href=\"https://www.tigerstyleonline.co.uk/\">Tigerstyle</a>.</p>\n<p>Heems’s second mixtape, Wild Water Kingdom, can be downloaded free <a href=\"https://twitter.com/HIMANSHU\"> from the man himself</a>. Released on November 14, 2012, Wild Water Kingdom features production from Harry Fraud, Keyboard Kid, Crookers, Beautiful Lou, Le1f, and Lushlife. Guests on Wild Water Kingdom include Childish Gambino and Lakutis.</p>\n<p>Check out the <a href=\"https://www.facebook.com/events/117195731793603/\">facebook event for more,</a> The gig takes place tickets are £9 and will on sale tomorrow at 9am.</p>\n","slug":"19462-news-first-uk-solo-show-for-heems-since-das-racist-breakup","category":"events","date":1360067631000,"wpid":19462,"isSticky":false,"featured_image":null,"createdAt":1587284047434,"updatedAt":1588441771076,"author":"5e9b68b27a1236eccfeb1d40","old_image":"generated/das-racist-59d3078bedb96.jpg","categories":["events","live-reviews","music"]}