{"id":"5e9c33899b6559241525e08e","title":"Latitude Festival 2010","content":"<p><a rel=\"attachment wp-att-1975\" href=\"https://admin.</p><p>crackintheroad.com/music/1971-latitude-festival-2010/attachment/11\"><img class=\"alignnone size-totallysizedforever wp-image-1975\" title=\"11\" src=\"https://api.crackintheroad.com/uploads/2010/07/11-740x492.jpg\" alt=\"\" width=\"740\" height=\"492\" /></a></p>\n<p>Expanding its capacity by 5,000 and boasting its most commercial line up yet, this year’s Latitude Festival was bigger than ever. But that’s not necessarily a good thing. We’ll come to that later, but first, I feel obliged to congratulate Latitude on the wealth of the line up, from film to cabaret and everything in between. Daniel Kitson, previewing his Edinburgh Fringe show, managed to snap the audience from a stunned silence into bursts of laughter within seconds, and Les Enfants Terrible’s <em>The Vaudevillains </em>was a spectacle to behold in the Theatre Tent. But one of the main attractions is always the music, and that was no different this year.</p>\n<p>Ultimately Thursday night proved to be a bit of a shambles, with Nigel Kennedy being too quiet to hear unless you were fairly close and thousands of people being turned away from Tom Jones’ intimate performance In The Woods. Friday saw the start of the main action, with Taqwacore-punk band The Kominas receiving a positive reaction from the Film & Music tent, stating that this was “the biggest crowd we’ve ever played to” to wild cheers from the energetic audience, who stopped their dancing only to support drummer Imran Malik as he left his kit to fall into the open arms of fans. Elsewhere, Islet impressed at the Lake Stage, the percussive element to their music coming across more than ever live, as they frantically attempted to play on after the plug had been pulled and the DJ recommenced his set. Villagers provided a captivating set, but in the Sunrise Arena Girls could only manage a very lacklustre performance – the entire band looked like they didn’t want to be there and so did half the crowd. Contrast this with our festival tip The National – riding on the success of <em>High Violet</em>, they attracted a large and animated crowd to the packed Word Arena, despite Florence + The Machine attracting what was probably the biggest crowd the festival has ever seen on the Obelisk Arena. After starting the set with the mellow ‘Runaway’, The National continued to grow momentum in their set, finishing with electrifying versions of ‘Mr. November’ and ‘Terrible Love’. Matt Berninger commanded the stage with confidence, despite not venturing into the crowd as was seen several times at Glastonbury.</p>\n<p>Saturday too had its musical moments – Frightened Rabbit played a very confident set and Zun Zun Egui’s Lake Stage slot showed much potential for the young band, who seemed a breathe of fresh air from some of Huw Stephens’ more boring choices (such as the underwhelming Spectrals on Sunday). The evening saw a frantic and frankly dangerous set from Crystal Castles – aside from her usual crowd surfing antics, Alice Glass repeatedly punched and kicked one girl for accidentally touching her breast, before coming back for more later. There was less dancing going on and more outright violence, not quite the enjoyable, danceable set many imagined would come before the main event of the weekend – Belle & Sebastian. Playing with London Contemporary Orchestra and after Latitude supposedly having been after them for several years now, it was always going to be a night to remember. Murdoch’s onstage charisma helped him dance his way through many classics, in a brilliant set which featured fans dancing onstage to ‘The Boy With The Arab Strap’, tears being shed during ‘Fox In The Snow’ and a mass singalong to the encore of ‘Get Me Away From Here, I’m Dying’. Despite having not played live for four years, the band looked like they’d never been away.</p>\n<p>Sunday saw a whole host of Brooklyn-based bands on the music stages (Grizzly Bear later mentioned it was nice to be playing with their friends), from The Antlers (who, although produced a solid performance, failed to translate the emotional resonance of <em>Hospice</em> to the stage) to Dirty Projectors, who put Mumford & Sons who took the stage before them to shame, despite Mumford & Sons drawing one of the biggest crowds of the festival. Ed Droste and Chris Bear of Grizzly Bear watched on as Dirty Projectors innovative unique sound worked surprisingly well on the main stage. Yeasayer were also well received in the Word Arena, with many songs from their début album standing out in particular. In the evening the Word Arena played host to one of only two UK festival performances from Jónsi. Although there was no elaborate stage set up as we have seen from his solo shows with the help of 59 Productions, Jónsi’s set was still colourful and lively, with Jónsi looking like he was enjoying himself more than ever. His band, which included boyfriend Alex Somers, showed their musicianship and skill well throughout the set, which culminated in an explosive and sinister extended version of ‘Grow Till Tall’, which was even reminiscent of earlier Sigur Rós by the end – and it truly was a magnificent ending. However, despite Jónsi’s magic, Grizzly Bear still managed to impress the crowds. A slightly mellower end to the festival than Vampire Weekend on the main stage, they had the Word Arena open mouthed in awe at some spectacular performances of songs from <em>Yellow House</em> and <em>Veckatimest</em>, as well as a rare but brilliant performance of ‘Fix It’, from <em>Horn of Plenty</em>.</p>\n<p>After the music had finished there was still much to do, perhaps the best of this being the Masked Ball hosted by Les Enfants Terrible in the Faraway Forest on Saturday night. Featuring a wide array of music, 1920s DJs and the stunning location of the forest, which had been decorated for the event, this was a stunning – if not slightly trippy – experience; one of the incredible things that makes Latitude so unique. However, with more people than ever being attracted by a slightly more commercial line up, is Latitude losing its way? It’s billed as a music and arts festival for families (typically middle class), yet this year it seemed to attract another demographic – underage teenagers who cared more about drinking alcohol in their campsite than experiencing what Latitude is all about, only straying into the arena to grab some expensive festival food, watch Florence + the Machine and Mumford & Sons and party until late into the night with the DJs In The Woods (who, incidentally, weren’t that great). The festival still was friendly, but many regulars can’t help but feel like the festival is losing its charm. Whilst stumbling upon Lupen Crook in the Sunrise, I saw a young father with a broad smile on his face and his daughter in his arms waltzing around to the music with her. He then put her down and proceeded to dance with her, both of them smiling and laughing, before being led away into the distance by the young girl, hand in hand and skipping as they went. It was a truly beautiful and remarkable event, a kind of magic that didn’t seem real. As they left, I was quite sure I saw, out of the corner of my eye, a middle-aged woman wipe away what could only be a tear from her face, and in that moment, we exchanged a little knowing look that we had just witnessed something extremely special – a kind of experience that is so typical of the Latitude festival many people love so, and the Latitude festival I fear we may have lost forever.</p>\n","slug":"1971-latitude-festival-2010","category":"festivals","date":1279664664000,"wpid":1971,"isSticky":false,"featured_image":{"width":1024,"height":682,"src":"2010/07/11.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAUG/8QAIxAAAQMDAgcAAAAAAAAAAAAAAQACAwQFEQYxFBUXIWKB4f/EABUBAQEAAAAAAAAAAAAAAAAAAAIF/8QAGhEAAgIDAAAAAAAAAAAAAAAAAQIAAwQhMf/aAAwDAQACEQMRAD8Al6hgv2qp5JbrfmUNNIwjh6ON7m52AGSCRgnJJ9LE9PgO3MtvD4iKecmx9tGlKAcn/9k="},"createdAt":1587295113097,"updatedAt":1588403565437,"author":"5e9b68b27a1236eccfeb1d14","old_image":"2010/07/11.jpg","categories":["festivals","music"]}