{"id":"5e9c33859b6559241525e088","title":"Review: Bombay Bicycle Club Gig (Sage, Gateshead) & ‘Flaws’","content":"<p>The recent winners of the NME Best New Band 2010 award, <strong>Bombay Bicycle Club </strong>have stripped away their loud and sometimes erratic indie exterior to reveal their beautiful acoustic underbelly with their new album, ‘<strong>Flaws</strong>‘.</p><p></p>\n<p>‘<strong>I Had The Blues But I Shook Them Loose</strong>‘ saw <strong>Bombay Bicycle Club </strong>thrust the band into the indie furore, receiving many positive reviews and with ‘<strong>Always Like This</strong>‘ achieving a great deal of radio air time. Unlike many other indie bands <strong>Bombay Bicycle Club </strong>were worthy of all their plaudits, however such initial success should not be overstated as their debut album only achieved a peak height of 46 in the UK Album Chart. Relatively limited success could have meant <strong>BBC </strong>coming out with an album that attempted to extend, and ultimately ruin, the fresh yet highly crafted indie sound they had managed to create. Such a disastrous outcome was thankfully not to be the case, and instead <strong>BBC </strong>took the daring decision to create an acoustic second album. To strip back the quirky electric guitars and replace them with the melodic tones of an acoustic guitar was a brave move in many ways, especially by a band that has yet to fully establish their position in the music world.</p>\n<p>The tender and crisp vocals of <strong>Steadman </strong>are very much the central focus point in ‘<strong>Flaws</strong>‘, which are matched by a fantastic collection of instrumentals throughout the album. ‘<strong>Rinse Me Down</strong>‘ begins the album at quite an up tempo pace, perhaps as to make the shift into the pure acoustic not too shocking for <strong>BBC </strong>fans. However what is entirely noticeable from the beginning of this album is the clarity and sureness that the band have achieved in their acoustic sound. I say this as many bands create acoustic tracks and they sound either half hearted or unnatural, as by the nature of acoustic performance  you are much more open to musical scrutiny and observation. Therefore acoustic tracks must be created in a way that is not only musically whole, but they must also include the full belief and soul of the artist or band performing them. In ‘<strong>Flaws</strong>‘ <strong>BBC </strong>have done exactly this, with expertly created acoustic guitar solos, the inclusion of violins and harps which add depth to the sound, and the raw honesty of <strong>Steadman</strong>‘s vocals. ‘<strong>Dust On The Ground</strong>‘ contains the rawness of <strong>Conor Oberst </strong>with a lyrical mastery that echoes <strong>Eddie Vedder</strong>‘s acoustic work, and ultimately is the Listener’s first experience of a truly serene <strong>BBC</strong>. Early single release ‘<strong>Ivy & Gold</strong>‘ swiftly follows, which is perhaps the most comparable tune to <strong>BBC</strong>‘s last single hit ‘<strong>Always Like This</strong>‘ with it’s catchy chorus and repetitive yet fun guitars. Fully established within the album, the Listener is then guided through a dreamy and warming set of tracks that all maintain their own sense of identity without become a wish wash of picked guitars and smooth vocals. ‘<strong>Favourite Lullaby</strong>‘ and ‘<strong>My God</strong>‘ are particular highlights, both of which create a transcendental spirituality which appears to encase the whole album.</p>\n<p>While it is a brave and tricky task to record quality acoustic tracks, the real vulnerability occurs when you have to perform them. Hall 2 at the <strong>Gateshead Sage </strong>gave the band, who had deliberately named their tour an ‘acoustic tour’, a fantastic head start in creating a quiet and intimate atmosphere. Quietly arriving on stage, the band began, without introduction, a set that was to simply be tracks from ‘<strong>Flaws</strong>‘ and an acoustic version of ‘<strong>Always Like This</strong>‘. Their rendition of their tracks was, perhaps somewhat ironically, flawless. Transitions between songs were smooth, and the band appeared to be in a fantastic state of synchronicity with every track that was played. However their set lacked that ever important aspect of crowd interaction. Even when the audience began to clap and holla in time to some of the more up tempo tracks, the band played on as if they were in an empty room to themselves. While you cannot expect much excitement or movement at an advertised acoustic gig, I felt that I could have almost achieved the same experience sitting at home in a quiet room listening to the CD album. However this shouldn’t be taken too much as criticism, as <strong>Steadman </strong>did finish the set with a solo cover of ‘<strong>Motel Blues</strong>‘ which made the hairs on the back of my neck stand up, and I’m sure the neck hairs of many other people around me reacted in kind.</p>\n<p><strong>Bombay Bicycle Club </strong>have produced a sophomore effort that demonstrates they are indeed a band with great musical integrity and ability. Some may miss the upbeat and indie sound <strong>BBC </strong>first provided to the waiting listening world, however ‘<strong>Flaws</strong>‘ has shown us an intimate side to a band that are capable of creating meaningful music in ways that makes everyone want to listen.</p>\n<p><a href=\"https://www.myspace.com/bombaybicycleclub\" target=\"_blank\">Bombay Bicycle Club Myspace</a></p>\n<p><iframe src=\"https://www.facebook.com/plugins/likebox.php?id=114090381951328&width=292&connections=10&stream=false&header=false&height=255\" scrolling=\"no\" frameborder=\"0\" style=\"border:none; overflow:hidden; width:292px; height:255px;\" allowTransparency=\"true\"></iframe></p>\n","slug":"1992-review-bombay-bicycle-club-gig-sage-gateshead-flaws","category":"music","date":1279842680000,"wpid":1992,"isSticky":false,"featured_image":{"width":600,"height":398,"src":"2010/07/bombay1.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAMF/8QAIBAAAQMEAgMAAAAAAAAAAAAAAQIDBAAFERIGMQcTIf/EABQBAQAAAAAAAAAAAAAAAAAAAAT/xAAbEQEAAgIDAAAAAAAAAAAAAAABAAIEEgMxQf/aAAwDAQACEQMRAD8Ai55n9FmiuWGc9LurT74eRI30DIWS2VZGFDKyCAdviR0K0bXfeYv2yI8JMVYcZQvZct8KOUg5OB3SlKxaHJZHyFyr6mwds//Z"},"createdAt":1587295109746,"updatedAt":1588403565385,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2010/07/bombay1.jpg","categories":["music","reviews"]}