{"id":"5e9c33789b6559241525e073","title":"Review: Hove Festival (Norway)","content":"<p>Arriving in Norway, <strong>Crack In The Road </strong>boarded the bus to <strong>Hove Festival </strong>not expecting that we would be beginning the most rewarding and interesting musical week of our lives.</p><p></p>\n<p><strong>Hove Festival </strong>is set in the picturesque surroundings of the island of <strong>Tromoy</strong>, located just a short ferry journey across from <strong>Arendal</strong>. However before we even arrived I got my first experience of Norwegian musical opinion, as on the bus down I somehow got into a conversation with a local, middle-aged Norwegian man heading south for a family holiday. We initially discussed why I was in Norway, where I was from, what did I think of Norway from the my first 6 hours of being there etc. This small talk fortunately developed into more insightful conversation, when I began to ask him about his interests in music and his thoughts on English music and culture. He replied, beaming, that he had been to Liverpool before and absolutely loved the experience. As I sat there in disbelief at this initial statement, he told me of his love of the <strong>Beatles</strong> (no surprise), <strong>Pink Floyd</strong>, <strong>Rolling Stones</strong> and even that he’d seen <strong>Tina Turner</strong> live in Oslo. Such was his passion, and impressive knowledge, of these legendary artists, his pristine English steadily became diluted with the occasional Norwegian expression, which he would only try to explain once he’d finish his speech. However when I asked him about any modern music he listened to, or even Norwegian music, he simply drew a blank. Perhaps this was to do with his age, but as I was to later discover this conversation was to set the tone for Norwegian music knowledge as a whole.</p>\n<p>Departing from the bus, we blindly walked onto another that we had been told would take us the rest of the way to the festival. A short time later we arrived in Arendal, only to be told in Norwegian again the rest of the instructions of how to get to the festival. Stumped and stranded, a young Norwegian lad came over to us and asked, ‘Are you English?’ Pouncing on the first sign of an English speaker, we replied that we were. He followed immediately with, ‘Are you Geordies?’ Taken aback, we again replied that we were and curiously asked how he knew. ‘Oh, it’s just because my Dad is from Newcastle so I could tell from your accents.’ Bliss. We had started our trip and immediately found a Geordie Norwegian. After a few minutes of inane chatter we headed down to the ferry with our new found friends Patrick (the half Geordie) and his friend Michael. The ferry took us across yet again more beautiful scenery (this is the last time I will mention it as it is abundant), and we arrived at the campsite.</p>\n<p>We set up camp with our new friends and began to ask about which bands they were excited to see at the Festival. <strong>Muse</strong> was the first, and obvious, response, and this was followed with other bands such as <strong>Them Crooked Vultures</strong>, <strong>Empire of the Sun</strong> and <strong>Florence + The Machine</strong>. However when we began to mention bands such as <strong>Two Door Cinema Club</strong>, <strong>Beach House</strong>, and <strong>Delphic</strong>, they had no idea who we were talking about. More sadly, they didn’t know any of the Norwegian bands on the festival bill. They knew the current classics, but not the classics-to-be. While this of course is not exclusive of Norwegian people and by no means is representative of them all, it does demonstrate the importance of <strong>Hove Festival</strong> to Norway’s young music fans and more importantly, as a platform for unheard Norwegian bands.</p>\n<p>Our first night was spent integrating with Patrick and his friends, explaining why we were at the festival and what acts we were all looking forward to seeing. Incase I don’t manage to fit this in at any point later, I have to say that Patrick and his friends were fantastically welcoming and funny people, all of whom were a delight to get amazingly drunk with. Waking up with a bit of a sore head, we prepared for our first day of our first European music festival. Glancing at the set list we noticed that the bands had been conveniently spaced over the day without clashes, meaning there would be no extreme stage dodging scenes of <strong>Leeds Festival</strong> or <strong>T in the Park</strong>. While this meant there were less acts, it more than made up by the fact fans were able to witness full sets by bands without fearing they would miss other bands, therefore allowing the lesser known bands a chance for fans to attend their sets.</p>\n<p>Here is the highlights of the two days of festival we were lucky enough to be part of!</p>\n<p>Tuesday 29th June:</p>\n<p><strong>Ellie Goulding (Acoustic Set)</strong>:</p>\n<p>Performing at a small set, acoustic set for fans in the main camping area, <strong>Ellie Goulding</strong> demonstrated to her Norwegian crowd why she topped the <strong>BBC Sound of 2010</strong> list. Immediately coming across as a delightful and honest person in the short, generic interview preceding her performance, these qualities were reflected in her short set. Unsurprisingly the three song set contained ‘<strong>Starry-eyed</strong>‘ and ‘<strong>Under The Sheets</strong>‘, however without the glamourised synths of the studio produced versions, Goulding’s vocals were showcased in a raw and mesmerizing fashion that emphatically won over a very large, new Norwegian fan base.</p>\n<p><strong>Delphic</strong>: Another band to make the <strong>BBC Sound of 2010 </strong>list, <strong>Delphic </strong>played a subdued yet solid set to a disappointing amount of fans. However the hardcore fan group, and even those who only happened to stumble upon the stage, danced enthusiastically to hits such as ‘<strong>Counterpoint’ </strong>and ‘<strong>Doubt</strong>‘. Obviously these alternative dance Manchurians haven’t been able to influence music tastes of many outside of the UK, however considering that their debut album ‘<strong>Acolyte</strong>‘ was only released at the end of June in the US, there is still a great amount of time for the musical blossoming of<strong> Delphic</strong>.</p>\n<p><strong>Muse</strong>:</p>\n<p>The best thing to come out of Devon since <strong>Coleridge, Muse </strong>wowed a huge and expectant audience with a phenomenal visual display and musical genius. <strong>Hove Festival </strong>was a stop of many for <strong>Muse</strong>, all part as a world wide tour supporting and promoting their new album ‘<strong>The Resistance</strong>‘, however this live performance felt anything but a simple stopping point. Tracks ‘<strong>Starlight</strong>‘ and ‘<strong>Supermassive Black Hole</strong>‘ initiated some of the loudest excitement of the festival, however the mastery that <strong>Muse </strong>held over the Main Stage made sure their whole set kept fans baying for more.</p>\n<p><strong>Empire of The Sun</strong>:</p>\n<p>The closing act on the <strong>Amfi Stage</strong>, <strong>Empire of the Sun </strong>produced a marvel of lights and choreographed dancers to a packed audience. Designed in the shape of an amphitheatre and set in the woods,<strong> </strong>the <strong>Amfi Stage </strong>provided the perfect venue for the spectacle that was<strong> Luke Steele </strong>orchestrating the dazzling dancers and dreamy music from his adorned podium. However for all the visual magnificence, musically <strong>Empire of the Sun </strong>were simply above average and failed to really deliver on their major hits.</p>\n<p>Wednesday 30th June:</p>\n<p><strong>Biffy Clyro (Acoustic Set)</strong>:</p>\n<p>On the same stage that was graced by <strong>Ellie Goulding</strong>, <strong>Biffy Clyro </strong>performed an intimate acoustic set in the glorious Norwegian sun. Unlike with <strong>Goulding, </strong>there was an opportunity for fans to take part in a Q & A session prior to the set, with one fan asking if she ‘could have a hug?’ and another asking how much the band ‘benched?’, to which the band responded that <strong>Ben Johnston </strong>benched the band every morning. Hilarity aside, the band quietly began a three track set that was compromised of ‘<strong>Bubbles</strong>‘, ‘<strong>Many of Horror</strong>‘ and ‘<strong>The Captain</strong>‘. While such popular tracks were only to be expected – like <strong>Goulding – </strong>the acoustic edge was not simply a cover of an produced song, rather it provided another dimension and insight into the tracks. <strong>Johnston</strong>‘s vocals were raw yet superbly controlled, which combined with the stripped down nature of limited percussion and acoustic guitars, held the audience in a still yet compelled silence until the end of each track.</p>\n<p><strong>Two Door Cinema Club</strong>:</p>\n<p>The Northern Irish trio produced a professional and crisp performance on the Main Stage, while even attempting to speak a little bit of Norwegian. Another band that is touring extensively to promote their new album, ‘<strong>Tourist History</strong>‘, <strong>Two Door Cinema Club </strong>energetically rattled through the contents of their album while inciting an enjoyable mayhem amongst a relatively large crowd. ‘<strong>Something Good Can Work</strong>‘ and ‘<strong>Come Back Home</strong>‘ were particular highlights, with their upbeat tempo and jangly guitars matching the glorious sun that smothered the Norwegian landscape. A solid and promising performance that suggests we can expect a lot more in the future from <strong>Two Door Cinema Club</strong>.</p>\n<p><strong>Florence And The Machine</strong>:</p>\n<p>An artist that stirred a great deal of excitement amongst the <strong>Hove </strong>festival goers, <strong>Florence And The Machine</strong> performed a sub par set that was still surprisingly well received amongst the crowd. From the beginning of the set one could see that this was no longer <strong>Florence And The Machine, </strong>and would be more adequately called <strong>Florence and a Bland Backing Band</strong>. <strong>Florence </strong>danced across the stage, belting out undeniably strong and harmonious vocals, adding a certain level of spirituality to every song. However the music of each track was average, played by an unenthusiastic backing band that weren’t involved in any of the spectacle. It will be interesting to see <strong>Florence</strong>‘s sophomore effort, and whether she can survive without the magic of her machine.</p>\n<p><strong>Simian Mobile Disco</strong>:</p>\n<p>Our stay at <strong>Hove </strong>couldn’t have ended better, with UK based electro duo <strong>Simian Mobile Disco </strong>proving they are one of the hottest sets of DJ’s currently mixing. Set back on the stage, dry ice clouds blurring flurries of flashing lights, <strong>SMD </strong>flawlessly mixed track after track of electro and house until the early hours. In other words, make sure to see them live as soon as humanly possible.</p>\n<p><strong>Hove Festival </strong>proved to be a laid back and incredibly fun festival, with a fantastic line up and beautiful surroundings. While I can’t imagine there will be a mass exodus of UK music fans to foreign festival (we are spoilt for festivals in the UK), should these fans develop a sense of musical adventure, then they could wish for nothing more than <strong>Hove Festival</strong>.</p>\n<p>Arriving back from SMD’s set, we managed an hour of sleep before we left at 4am to begin our journey to Belfort, France for the <strong>Eurockeennes Festival</strong>. Make sure to check that review out, plus an interview with <strong>Melvin Benn </strong>and hundreds of photos from the festivals, over the next few days!</p>\n<p><iframe src=\"https://www.facebook.com/plugins/likebox.php?id=114090381951328&width=292&connections=10&stream=false&header=false&height=255\" scrolling=\"no\" frameborder=\"0\" style=\"border:none; overflow:hidden; width:292px; height:255px;\" allowTransparency=\"true\"></iframe></p>\n","slug":"2002-review-hove-festival-norway","category":"festivals","date":1280320919000,"wpid":2002,"isSticky":false,"featured_image":{"width":3456,"height":2304,"src":"2010/07/img_9581.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAIH/8QAHhAAAgEFAQEBAAAAAAAAAAAAAQIDAAQFETEiIVH/xAAUAQEAAAAAAAAAAAAAAAAAAAAD/8QAGhEAAgIDAAAAAAAAAAAAAAAAAQIAESFhwf/aAAwDAQACEQMRAD8AyzE2GGvbSC7kZXVAZHjWM7iC82p8nZK/Bsd3UDG46UCSW1hEj+m3GOnv7SlAUAW9nkUNmf/Z"},"createdAt":1587295096851,"updatedAt":1588403565182,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2010/07/img_9581.jpg","categories":["festivals","music"]}