{"id":"5e9c07a6774c2610387e4f96","artists":["5e9b68ec7a1236eccfeb1fef"],"title":"Interview: Eliza & The Bear","content":"<p>It’s been a hectic few months for London five piece <strong>Eliza & The Bear</strong>, having recently confirmed a host of festival appearances, alongside the release of their debut single<em> Upon The North / The Southern Wild</em>.</p><p> Alongside constant touring and a rapidly growing fanbase, largely due to their electric live shows, 2013 is already shaping up to be one hell of a year for the group. CitR caught up with lead singer <strong>James Kellegher</strong> shortly before their slot on the Generator organised North East version of <a href=\"https://www.generator.org.uk/node/57995\" target=\"_blank\">Roundhouse Rising</a>. Check out the interview below, and order the <a href=\"https://elizaandthebear.com/shop/7limitededition/\" target=\"_blank\">single here</a>.</p>\n<p><em>So you just played the London equivalent event yesterday, how did it go?</em></p>\n<p><strong>Yeah it was good, we were first on, but it filled up really nicely as people from the conference headed straight over. It was great of them to have us, and hopefully we impressed a few people.</strong></p>\n<p><em>As a band, you’re still fairly new, how are you finding it?</em></p>\n<p><strong>I think it’s been alright because we’ve all played in bands before, and for us this band is two years old, although for a listener we’ve only had material out there for a year or so. We took the time to build up our sound and get the songs ready, as well as bringing the live performance to a level that we’re happy with. </strong></p>\n<p><iframe src=\"https://w.soundcloud.com/player/?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F70204128\" height=\"166\" width=\"100%\" frameborder=\"no\" scrolling=\"no\"></iframe></p>\n<p><em>How do you find the live performances? I imagine you’re probably playing to fairly uninitiated crowds at the moment.</em></p>\n<p><strong>I’ve certainly noticed a difference between the first show we ever played and yesterday. It’s been a bit strange in that this is essentially a new type of music for us to play together. Callie (Naokes – drummer) and myself were in a grungey-rock band and the other guys were in a heavier almost screamo band, so it took a bit of getting used to, getting the atmosphere right. For instance the interactions on stage are completely different, between ourselves and the crowd. We try as hard as we can to win our crowds that don’t know our songs, and it can work really well to have a blank slate to work with, gives you a platform on which to impress.</strong></p>\n<p><em>In terms of future plans for the band, are you looking much further than beyond your debut release?</em></p>\n<p><strong>Yeah, we’ve got a double A-side coming out on the 25 (February) on vinyl and download, followed by a tour, beginning at the Old Queens Head in London, then Glasgow, Sheffield, Middlesborough then Manchester. Then over the summer we’ll have a bunch of festivals, and maybe a couple of support slots.</strong></p>\n<p><em>Which cities have you found have been the most receptive so far?</em></p>\n<p><strong>London is always great to us, we have plenty of friends down there, and it’s always been really open to our music; it’s essentially our home-town. Manchester was brilliant as well when we played Kraak Gallery and The Trof, which was our first gig outside of London. We still count that as one of our favourite shows.</strong></p>\n<p><em>How much do you value the internet in terms of getting your music our there?</em></p>\n<p><strong>It’s massive, for us we’ve made sure to get our videos, music and our gig listings out there. We’ve had a lot of people come up to us telling us that they’ve checked out our stuff beforehand, and it’s really encouraging. </strong></p>\n<p><em>Finally, what are you aspirations?</em></p>\n<p><strong>We just want to play as many shows as possible, and get our music out to as many ears as we can. We really want to prove ourselves and gain the experience that we can take forward from there.</strong></p>\n<p><iframe src=\"https://w.soundcloud.com/player/?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F75438224\" height=\"166\" width=\"100%\" frameborder=\"no\" scrolling=\"no\"></iframe></p>\n","slug":"20105-interview-eliza-the-bear","category":"interviews","date":1361807118000,"wpid":20105,"isSticky":false,"featured_image":{"width":950,"height":636,"src":"2013/02/309034_222281687837052_1750565481_n-950x636.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAAAAb/xAAfEAACAQQCAwAAAAAAAAAAAAABAgMABAYRBSFRkaH/xAAVAQEBAAAAAAAAAAAAAAAAAAAAA//EABcRAAMBAAAAAAAAAAAAAAAAAAABERP/2gAMAwEAAhEDEQA/AIjmMOyLkuXt5L+2uikSqpaKWHfjQDP2PVUCYnkQRQLRtAdbkjB+PqlKhRo0f//Z"},"createdAt":1587283878207,"updatedAt":1588443769510,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2013/02/309034_222281687837052_1750565481_n-950x636.jpg","categories":["interviews","music"]}