{"id":"5e9c337d9b6559241525e079","title":"Review: Mount Kimbie – Crooks and Lovers","content":"<p><a rel=\"attachment wp-att-2070\" href=\"https://admin.</p><p>crackintheroad.com/music/2015-review-mount-kimbie-crooks-and-lovers/attachment/crooks-lovers\"><img class=\"aligncenter size-full wp-image-2070\" title=\"Crooks & Lovers\" src=\"https://api.crackintheroad.com/uploads/2010/07/Crooks-Lovers.jpg\" alt=\"\" width=\"600\" height=\"600\" srcset=\"https://api.crackintheroad.com/images/2010/07/Crooks-Lovers.jpg 600w, https://api.crackintheroad.com/images/2010/07/Crooks-Lovers-150x150.jpg 150w, https://api.crackintheroad.com/images/2010/07/Crooks-Lovers-300x300.jpg 300w, https://api.crackintheroad.com/images/2010/07/Crooks-Lovers-494x494.jpg 494w, https://api.crackintheroad.com/images/2010/07/Crooks-Lovers-165x165.jpg 165w\" sizes=\"(max-width: 600px) 100vw, 600px\" /></a></p>\n<p><strong>Mount Kimbie’s</strong> first EP ‘<em>Sketch on Glass and Maybes</em>’ was something of a rarity when it was released on Hot Flush recordings last year; a dubstep album that wore the fact it wasn’t a dubstep album proudly on its sleeve. Perhaps that’s why it was so well received, gaining a wealth of critical claim amongst a sea of distain towards a corrupted genre. This month sees the release of the student duos first full LP ‘<em>Crooks and Lovers</em>’, a record that cements yet further the genre-less sound of their previous work. Comparisons with<strong> Kimbie’s</strong> contemporaries are an easy thing to make; associations with <strong>Blake</strong> and <strong>Orbison</strong> are being banded around in most cases purely for comparisons sake. On a second listen however the correlation seems more and more contingent. If anything ‘<em>Crooks and Lovers</em>’ strikes a beautiful balance between the two sounds, it doesn’t have the full, obviously absorbent quality of <strong>Orbison </strong>nor the  completely sparse sound of <strong>Blake</strong>, however what they achieve over their contemporaries is a far more focused sound that aims to infect as well as transport.</p>\n<p>‘<em>Crooks and Lovers</em>’ is undoubtedly headphone music and makes no reservations about this; the beats reverberate and echo through the LP sounding like some metallic form of urban decay, the synths intertwined perfectly. You won’t find any dubstep genre hooks here. Importantly, it’s a record that doesn’t loose its sense of groove, it may be minimal and intimate but the infectious quality of the music is hard to deny. The record avoids over exaggeration on any part, the LPs opener ‘<em>Tunnelvision</em>’ is a wonderful shuffle filled, oddly soulful master class in understatements. Understated is perhaps the best way to describe <strong>Mount Kimbie</strong>, however they never stray on the wrong side of ‘half-measured’, instead they simply manage to achieve a sort of emotional pull from the little they do. ‘<em>Before I Move Off</em>’ is a joyous example of this, the bleeps bubble through the piece, the overarching guitar sample, glorious in its simplicity; this is without a doubt music to cry to. ‘<em>Blind Night Errand</em>’ is perhaps the closest the record comes to ‘actual dubstep’, but even this is laced with irony; when the piece eventually ‘drops’ the sounds that conspire are the ultimate in bass wobble modesty. It’s the throb of a bass that doesn’t want to be heard.</p>\n<p>Although the LP has an incredible amount of depth, perhaps the very idea of over analysing is missing the point; the sense of grace found in the record is best appreciated on face value. ‘<em>Ruby’</em>, ‘<em>Carbonated</em>’ and most dramatically ‘<em>Field’</em> capture the grace and soul of the record most perfectly. ‘<em>Carbonated’</em> has a wonderful dusty soulful quality, with an organ melody sample so pure it could put you to sleep. ‘<em>Field</em>’ is the star though, confident in its pacing and sense of minimalism, it creates the very feelings that the album title suggests; a sense of dread, freedom and joy.</p>\n<p style=\"text-align: center;\"><a href=\"https://www.myspace.com/mountkimbie\">Check Out Mount Kimbie’s Myspace</a></p>\n","slug":"2015-review-mount-kimbie-crooks-and-lovers","category":"music","date":1280260201000,"wpid":2015,"isSticky":false,"featured_image":{"width":600,"height":600,"src":"2010/07/crooks-lovers.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAABgAF/8QAIxAAAgEDBAEFAAAAAAAAAAAAAQIDAAURBAYSIWEHEyIxkf/EABUBAQEAAAAAAAAAAAAAAAAAAAUG/8QAHBEAAgICAwAAAAAAAAAAAAAAAQIAEQMEBRNB/9oADAMBAAIRAxEAPwB56l3+5rtiaOEe3DKUV2A5Hs5/M480aj3TucxqTIZCQDzMQy3n6rWvkjjYurYO3IQZBz2Dkd1WiaVrTomaRyxgQklj38RRe0GDUrVKjj2x9NugJv2f/9k="},"createdAt":1587295101375,"updatedAt":1588403565236,"author":"5e9b68b27a1236eccfeb1d24","old_image":"2010/07/crooks-lovers.jpg","categories":["music","reviews"]}