{"id":"5e9c077c774c2610387e4f75","artists":["5e9b68cd7a1236eccfeb1dbc","5e9b69177a1236eccfeb228e","5e9b691e7a1236eccfeb22c7","5e9b694b7a1236eccfeb25db","5e9b69517a1236eccfeb2616"],"title":"Feature: Predictably good Swedish music","content":"<p>It’s no secret that Sweden produces some mighty fine music.</p><p> In recent years, the country has given us the likes of <b>Lykke Li, Shout Out Louds, Robyn, </b>and <b>The Knife, </b>with<b> </b>the latter also<b> </b>handing a little gift of exposure to Swede/Argentine singer <b>Jose Gonzalez </b>and <a title=\"Sony Bravia advert\" href=\"https://www.youtube.com/watch?v=0_bx8bnCoiU\">consequently helping the bouncing sales of LCD televisions everywhere</a>. With such a solid roster, the country can even be forgiven for fostering those three “young folk” who took it upon themselves to popularize <a title=\"Young Folks\" href=\"https://www.youtube.com/watch?v=0_bx8bnCoiU\">incessant, repetitive whistling</a> for what felt like an endless few years back in 2007.</p>\n<p>For some weird and unflattering reason, I still feel an excited sense of surprise and smug discovery whenever I find out about new acts who hail from non-English speaking shores – no matter that (<a title=\"Glosoli\" href=\"https://www.youtube.com/watch?v=Zr_MJAOyOeU\">time spent brushing up on my Icelandic aside</a>) the songs are almost always sung in English. So when I came across three great Swedish artists, previously unknown to me, in the space of two days this week, I succumbed to a momentary attack of self-delusional amnesia and was briefly convinced that I had stumbled upon an untapped goldmine of Scandinavian indie music.</p>\n<p>Fortunately, my faculties quickly returned, along with embarrassed remembrance of Sweden’s impressive musical pedigree – but I still liked the stuff I had heard. So no doubt I’m only scratching the surface, but for what it’s worth, here are three lots of Swedes I think you should be listening to:</p>\n<p><b>Anna von Hausswolff</b></p>\n<p>From the looks of things <b>Anna Von Hausswolff </b>is far from being an unknown, or even particularly new – according to her website her first E.P came out in February 2010, although she seems to be garnering an increased amount of attention with her latest album, <b><i>Ceremony,</i></b><i> </i>apparently slated for a UK release sometime soon. In any case, lead single <i>Mountains Crave </i>is the first I’d heard of her, and I’m very glad that I did – it’s a massive, organ led platform from which <b>Hausswolff </b>bellows out her superb voice, sounding a bit like Lana Del Ray if she’d pitched up on <i>Game of Thrones.</i></p>\n<p><iframe src=\"https://w.soundcloud.com/player/?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F50915599\" height=\"166\" width=\"100%\" frameborder=\"no\" scrolling=\"no\"></iframe></p>\n<p><b>If They Ask, Tell Them We’re Dead</b></p>\n<p>These guys have also been going for a little while, but after an E.P two years ago they’re now bringing out their debut album, <b><i>Rivulet Moan, </i></b>on German label Stargazer Records. <b>ITATTWD </b>may be possibly the least catchy acronym in the world, but they’ve done good and made a couple of songs from the album available for free download on bandcamp – first single <i>We’re All Friends After All </i>is an excellent cut of indie noise pop that’s nicely complemented by pretty instrumental B-side <i>Any Day Now.</i><br />\n<iframe style=\"position: relative; display: block; width: 400px; height: 100px;\" src=\"https://bandcamp.com/EmbeddedPlayer/v=2/album=1891153349/size=venti/bgcol=FFFFFF/linkcol=4285BB/\" height=\"100\" width=\"400\" frameborder=\"0\"></iframe></p>\n<p><b>Little Children</b></p>\n<p><b></b><b>Little Children </b>is the moniker of one Linus Lutti, a 28 year old who describes himself as making “ornamented and mysterious pop music, dark and tender at the same time.” He seems to be doing pretty well for himself at the moment, supporting <b>Shout Out Louds </b>on their current<b> </b>U.S tour, and the songs up on his soundcloud are apparently taken from upcoming E.P <b><i>In Hau</i></b>. The most recently posted track, <i>No Direction, </i>is a <b>Bon Iver-</b>esque (whom Lutti cites as an influence) display of both Lutti’s versatile voice and his ear for really nice instrument layering, shown here by building up through rolling snares and wood flutes on the way to a climactic and majestic horn section.<br />\n<iframe src=\"https://w.soundcloud.com/player/?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F73347344\" height=\"166\" width=\"100%\" frameborder=\"no\" scrolling=\"no\"></iframe></p>\n","slug":"20200-feature-predictably-good-swedish-music","category":"editorials","date":1362145790000,"wpid":20200,"isSticky":false,"featured_image":null,"createdAt":1587283836592,"updatedAt":1588441769263,"author":"5e9b68b27a1236eccfeb1d1a","old_image":"generated/70b2480a23ec7ad12c8db0604191a95d417bec30.jpg","categories":["editorials","new","music"]}