{"id":"5e9c33829b6559241525e082","title":"Review: Calamateur – Banoffee EP","content":"<p><a rel=\"attachment wp-att-2058\" href=\"https://admin.</p><p>crackintheroad.com/music/2032-review-calamateur-banoffee-ep/attachment/calamateur\"><img class=\"aligncenter size-full wp-image-2058\" title=\"Calamateur\" src=\"https://api.crackintheroad.com/uploads/2010/07/Calamateur.jpg\" alt=\"\" width=\"600\" height=\"349\" srcset=\"https://api.crackintheroad.com/images/2010/07/Calamateur.jpg 600w, https://api.crackintheroad.com/images/2010/07/Calamateur-300x174.jpg 300w, https://api.crackintheroad.com/images/2010/07/Calamateur-494x287.jpg 494w, https://api.crackintheroad.com/images/2010/07/Calamateur-165x95.jpg 165w\" sizes=\"(max-width: 600px) 100vw, 600px\" /></a></p>\n<p>For too long have male singer songwriters cautiously treaded the murky, monotonous waters of mediocricty when it comes to writing, performing and recording. <strong>Paolo Nutini, Daniel Powter, James Blunt</strong>… the list of artists who think directly inside the confined, claustrophobic box is endless. Especially in an age where female songwriters are beginning to excel, with the likes of <strong>Ellie Goulding</strong>, <strong>Laura Marling</strong> and <strong>M.I.A.</strong>, all three performing very different, yet still exciting forms of music. Whereas with the previously mentioned male singers, you could practically interchange their songs and few people would tell the difference as their musical styles and lyrical offerings are so similar. You would think there would be a certain edge of competition between the sexes, alas, there is not.</p>\n<p>Unfortunately in the case of <strong>Andrew Howie,</strong> or<strong> Calamateur</strong> as he is known under his stage name, it is a case of same old. Unintelligent, sickly sweet lyrics are the songs most glaring downfall, as<strong> Howie</strong> proclaims “<em>your love it makes me sing, it lights up everything</em>“; it’s as if he’s competing against <strong>Scouting For Girls </strong>for 2010’s King of Cheesey Pop Songs. The backing guitar is dull and drab, almost as uninspired as the Wayne Rooney in South Africa, the drumming is formulaic to the point of boredom and the lightly tinkling piano is ripped off numerous chart hits from over the years.</p>\n<p>In many ways, it’s a crying shame that<strong> Howie </strong>chose to release <em>Banoffee </em>as the lead song from the EP, as the other three tracks which feature are far stronger and undoubtably more adventurous, albeit all of them are covers. If anything this highlights the pitiful despondence which appears to be growing in the minds of many “up and coming” male songwriters, there is no confidence, no exuberating energy and most of all, no experimentation. In an industry which is feeling the strain almost as much as any in these modern times, there needs to be an injection of creativity and curiosity with which to elevate these individuals up to previously reached heights. All that said, <strong>Calamateur’s </strong>beautifully moving cover of <strong>The Flaming Lips</strong> <em>Feeling Yourself Disintegrate</em> is well worth a listen, even if the EP title track leaves much to be wished for.</p>\n<p style=\"text-align: center;\"><a href=\"https://www.calamateur.com/\">Check Out Calamateur’s Official Site</a></p>\n","slug":"2032-review-calamateur-banoffee-ep","category":"music","date":1280152260000,"wpid":2032,"isSticky":false,"featured_image":{"width":600,"height":349,"src":"2010/07/calamateur.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAGAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAAAAT/xAAgEAABAwQCAwAAAAAAAAAAAAABAgQRAAMFUSEiBgcU/8QAFQEBAQAAAAAAAAAAAAAAAAAAAAL/xAAVEQEBAAAAAAAAAAAAAAAAAAAAAf/aAAwDAQACEQMRAD8Akz3k7O2yxfxNXDYtXsOlhaVm+UiDAI4HbexqJB7VQ3AsJxy1JtdAo3IJA4mKUqYP/9k="},"createdAt":1587295106371,"updatedAt":1588403565310,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2010/07/calamateur.jpg","categories":["music","reviews"]}