{"id":"5e9c074c774c2610387e4f5b","artists":["5e9b68ec7a1236eccfeb1fd9"],"title":"News: Earl Sweatshirt Performs New Songs ‘Burgundy’, ‘Hive’ And ‘Guild’","content":"<p>httpv://www.</p><p>youtube.com/watch?v=HSDcNF9SxTA</p>\n<p>I pretty much lost my shit when I watched this video of Earl Sweatshirt. He performed the new songs, ‘Burgundy’, ‘Hive’ and ‘Guild’, in Los Angeles, at the end of a Flying Lotus concert. His EP, <em>EARL, </em>I rank among the best releases of the last ten years and, while his two year absence from making music sucked some serious ballsack and ‘Home’ was kinda weak, ‘Chum’ was a continuation of where he left off.</p>\n<p>The first track he plays is ‘Burgundy’, a horn-swelling, cymbal-splashing Pharrell produced song. Hearing this, it’s easy to draw further parallels between the careers of both Earl Sweatshirt and Eminem. They each released deliberately provocative, almost cartoonish, yet aggressive albums and, if the lyrical content of ‘Chum’ is a sign of Earl’s direction, both followed that by including more ruminative themes in their music. ‘Burgundy’ fits into this pattern, with the rapper discussing issues like the pressure of success and a troubled relationship with his parents.</p>\n<p>Next up, he plays ‘Hive’, which can only be described as a “banger”. The bassline is classic Odd Future, in the best possible way, and, if I had to go out on a limb, I’d guess that it was produced by Tyler. A recording of him turns up on the chorus, which might mean he’ll have a verse on the recording version. The beat is well put-together, the introduction of the off-beat hi-hat a highlight, and Earl does what’s commonly known as “going in heavy”, spitting like an <a href=\"https://www.youtube.com/watch?v=Dp0Bt2cbcc8\" target=\"_blank\">irritated goat</a> and generally parring it.</p>\n<p>Finally, Earl performs ‘Guild’ with Mac Miller. The track is a bit more subdued than ‘Burgundy’ and ‘Hive’, with the latter doing admirably, even if I’m not his biggest fan, but Earl Sweatshirt continues to rip it up. His ability to vary his flow is staggering and his keen lyrical ability is in full force throughout. The video for another new song, ‘Woah’, is being dropped next week and, if that’s not good enough, it won’t be too long until <em>Doris</em> is out. HYPE.</p>\n","slug":"20341-news-earl-sweatshirt-performs-new-songs-burgundy-hive-and-guild","category":"music","date":1362762984000,"wpid":20341,"isSticky":false,"featured_image":null,"createdAt":1587283788870,"updatedAt":1588441768640,"author":"5e9b68b27a1236eccfeb1d11","old_image":"generated/df0ce0e119e1d5006ea986e27414256d85c08c50.jpg","categories":["music","news","new","newnews","videos"]}