{"id":"5e9c0749774c2610387e4f59","artists":["5e9b68e57a1236eccfeb1f42"],"title":"Introducing: Dad Punchers","content":"<p>When I got back from work I emptied my flatmate’s wastepaper bin, and mixed in half a cup of white vinegar with three litres of warm water.</p><p> Dumped in a tablespoon of baking soda, watched it bubble and subside. I took it through with three new j-cloths, lay down on the floor behind my bed, and started to clean mould off the sodden walls of my £600pcm room. Some paint came off. I thought about the deposit that I still owe my flatmate.</p>\n<p>I didn’t think that there was rock music for this.</p>\n<p><iframe style=\"position: relative; display: block; width: 400px; height: 100px;\" src=\"https://bandcamp.com/EmbeddedPlayer/v=2/track=2024586978/size=venti/bgcol=FFFFFF/linkcol=4285BB/\" height=\"100\" width=\"400\" frameborder=\"0\"></iframe></p>\n<p><a title=\"(: Drums)\" href=\"https://toucheamore.com/\">Elliot Babin</a>, who plays everything except bass on <b>Dad Punchers</b>’ <a title=\"Dadcamp.\" href=\"https://dadpunchers.bandcamp.com/\">self-titled</a>, might once have reached the same conclusion, and similar ones concerning outbreaks of food poisoning that close down local malls, or the weird comfort in taking the same menial job each year for the few weeks you’re home at Christmas. Late last year he brought us a record rammed with these things, a short, sad, occasionally funny record of surging midtempo punk run through with heavy memory, the inexorable nostalgia that stings sweet for a while until it turns to lead in your chest and starts to weigh you down. Opener <i>Tire Swing</i> rocks like its namesake, a crumbling sway that looks at that childhood structure and feels nauseous, because there’s no going back to the first time we felt alive.</p>\n<p><iframe style=\"position: relative; display: block; width: 400px; height: 100px;\" src=\"https://bandcamp.com/EmbeddedPlayer/v=2/track=260101277/size=venti/bgcol=FFFFFF/linkcol=4285BB/\" height=\"100\" width=\"400\" frameborder=\"0\"></iframe></p>\n<p>Of course, it’s <i>Dirty Dishes & The Mold</i> that’s my favourite, not least because it’s an anthem for mould-beset and distanced sons everywhere, but also because of the paintstripping octaves at its centre. <i>Bug Flipper</i> carries the phrase that gets right to the heart of the songs on <b><i>Dad Punchers</i></b>, Babin singing “I’m fucking powerless, but that’s OK” in his throaty, adenoidal honk. It’s a voice that speaks of allergies and disappointment, a voice that makes perfect sense over the clangy fuzz and whip-tight, grumbling basslines from Matt Ebert (of the unstoppable <a title=\"Already there. \" href=\"https://bsmrocks.bandcamp.com/album/of-all-things-i-will-soon-grow-tired\">Joyce Manor</a>), and the whole lot flies like a bastard in the face of the little things that snowball until you’re running and running and can’t stop running, even when there’s nothing behind you any more.</p>\n<p><iframe style=\"position: relative; display: block; width: 400px; height: 100px;\" src=\"https://bandcamp.com/EmbeddedPlayer/v=2/track=141565485/size=venti/bgcol=FFFFFF/linkcol=4285BB/\" height=\"100\" width=\"400\" frameborder=\"0\"></iframe></p>\n<p>If I’d heard <i>Rom Com</i>’s rock-bottom jangle<i> </i>five years ago I might have fallen off my stool, sat in a uni bar licking a fresh set of wounds and formulating a horrible song to a similar end. And so half a decade on and listening to <b><i>Dad Punchers </i></b>I come to believe, in one of those impermanent epiphanies that so afflict the conflicted, that I don’t give a crap how Arnold felt about <i>Empedocles On Etna</i>; that the poem was worthless as art because it only served to embellish melancholy. Listening to <b><i>Dad Punchers, </i></b>this seems to me like a fine manifesto for music. Then I start to think that aren’t I getting a little too old for that, aren’t I getting a little too old for guitars at all, but listening to <b><i>Dad Punchers</i></b> and scrubbing at the wall I think I will always come back around to the same two letter answer.</p>\n<p>(You can watch the video for <em>Tire Swing </em><a title=\"I wish I could skate.  \" href=\"https://www.youtube.com/watch?v=ZOX65Tc4Bhw\">here</a>. Buy <em><strong>Dad Punchers</strong></em><strong> </strong>from <a title=\"Someone put it out over here. Please.\" href=\"https://deathwishinc.com/estore/category/SEALEGS.html\">Sea Legs/Deathwish</a>. Featured artwork by <a title=\"Sleep enthusiast. \" href=\"https://positivnegativ.tumblr.com/\">Anne/Positivnegativ/All Is Spirals</a>.)</p>\n","slug":"20364-introducing-dad-punchers","category":"introducing","date":1362907573000,"wpid":20364,"isSticky":false,"featured_image":null,"createdAt":1587283785585,"updatedAt":1588441768613,"author":"5e9b68b27a1236eccfeb1d3c","old_image":"generated/ab67616d0000b273592774d5dc2d744ba1197b68.jpg","categories":["introducing","music"]}