{"id":"5e9c33809b6559241525e07f","title":"Review: Arcade Fire – The Suburbs","content":"<p><strong></strong>With themes like the monotony of suburbia, youth and disillusionment, Arcade Fire emerge from their three year incubation with an assured sense of distaste for the modern world.</p><p> In fact, words like ‘suburban’ and ‘modern’ are keystones of The Suburbs, an album that questions what these words mean and gives them new meaning.</p>\n<p>Lead singer Win Butler promised an album sounding like ‘a mix of Depeche Mode and Neil Young’ but while the former seems a fairly distant influence, the latter’s sound is a clear part of The Suburbs. There are some truly fantastic moments to be had, <em>Sprawl II (Mountains Beyond Mountains)</em> is an unexpected electro-romp with Régine taking lead vocals and <em>We Used To Wait</em> is an oddly sparse arrangement with staccato keys and a throbbing electronic bass.</p>\n<p>That said there are also some duds, some songs that just fall flat or don’t truly make good on the ideas. <em>City With No Children</em> sinks into insignificance in-between two much better and <em>Modern Man</em> almost ruins the mood altogether by bringing the tempo right down only 3 songs in.</p>\n<p>This album definitely leans on more of a typical band archetype than before with guitars much more prominent and the grandiose styles of <em>My Body Is A Cage</em> and<em> Black Wave/Bad Vibrations</em> have been played down for a more raw, simple sound.</p>\n<p>‘Grab your mother’s keys, we’re leaving’ is a lyric repeated throughout The Suburbs and practically encapsulates the essence of this album. This is an album about growing up and growing out, about escaping and about the place where you grew up.</p>\n<p>As we finally near the end of the album, a reprise of the first song and title track arises to play the album out. It’s an eerie and cold closer featuring almost robotic voices and haunting strings. Arcade Fire are synonymous with big and bold orchestrations about death and love but part of me wonders whether the mixture of light and dark that was so important in their first two releases is growing thin. There are only so many songs about modernity and teenage uprising that can work well on one album and with 16 songs it’s easy to find songs that should have been left on the cutting room floor.</p>\n<p>There is definitely quality here and potential to improve on their new sound on future works but for now I’m slightly drawn as to whether it’s the best move they could have made.</p>\n","slug":"2041-review-the-suburbs","category":"music","date":1280188110000,"wpid":2041,"isSticky":false,"featured_image":{"width":165,"height":92,"src":"2010/07/arcade-fire-165x92.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAGAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAAAAX/xAAiEAABAwMEAwEAAAAAAAAAAAABAgMEAAURBgcSIRNCYXH/xAAUAQEAAAAAAAAAAAAAAAAAAAAD/8QAFxEBAAMAAAAAAAAAAAAAAAAAAQACEf/aAAwDAQACEQMRAD8Ak6q3S1e9PuUKJckwm7ZaWpMoRkcOypsL8Z7JIK0kE49gRg1MfG6ZfcLOskKaKjwUtRSojPRI4HB+ZP7SlDUMjWXZ/9k="},"createdAt":1587295104823,"updatedAt":1588403565285,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2010/07/arcade-fire-165x92.jpg","categories":["music","reviews"]}