{"id":"5e9c34869b6559241525e23f","title":"Review: Young Heretics","content":"<p style=\"text-align: center;\">Take one dash <strong>Arcade Fire</strong>, a pinch Of<strong> Bjork</strong> and a sprinkling of <strong>Metric</strong>, and you will begin to understand the sound that <strong>Young Heretics</strong> are creating.</p><p> Self produced and self funded, they are clearly ambitious, which comes across obviously in their sound. Combining soothing piano melodies, with the beautiful voice of <strong>Kitty Hart</strong> and the more reserved vocals of <strong>Matthew Wright</strong>, their compositions are haunting whilst moving, especially album track <strong>The Dark Prince</strong>, in which Hart speaks of a former partner who has “<em>blood and lust in [their] eyes</em>“. Featuring over 60 different musicians, it must have been no easy feat to record, however the vocals of <strong>Hart</strong> and <strong>Wrigh</strong>t work perfectly together, soaring and swirling over the dark soundscapes they have composed. <strong>Bones Of A Rabbit</strong> created a stir on the blog circuit a while back, and listening to it again, it really shows the fantastic potential this young duo have. The song gradually builds over layered instruments and a vicious drum machine, until the vocals of <strong>Wright</strong> and <strong>Hart </strong>reach an almost transcendent pinnacle, cascading emotionally around each other. The lyrics throughout are mysterious but emotionally driven, showcased in <strong>Bones Of A Rabbit </strong>where Hart howls “<em>you play with the wolves, but you sleep with the bones of the rabbit” </em>an expertly crafted metaphor. Maybe not an album for the glorious summer days we are expecting, but <strong>Young Heretic</strong>s certainly encourage contemplation, and are undeniably one to keep your eye on for the future.</p>\n<p style=\"text-align: center;\">Their debut album <strong>We Are The Lost Loves</strong> is available to download for free from <a href=\"https://www.wearethelostloves.com/\">www.wearethelostloves.com</a> or check out <a href=\"https://youngheretics.blogspot.com/\">their blog</a>.</p>\n<p style=\"text-align: center;\"><a href=\"https://www.mediafire.com/?3jyktzqhtzn\">Dark Prince</a></p>\n<p style=\"text-align: center;\"><a href=\"https://www.mediafire.com/?tyyygtzqyid\">Bones Of A Rabbit</a></p>\n","slug":"205-young-heretics","category":"music","date":1271005543000,"wpid":205,"isSticky":false,"featured_image":null,"createdAt":1587295366886,"updatedAt":1587825939499,"author":"5e9b68b27a1236eccfeb1d27","categories":["music","reviews"]}