{"id":"5e9c0717774c2610387e4f3a","artists":["5e9b691e7a1236eccfeb22d5"],"title":"Interview: MadeScapes ^","content":"<p>Since 2011, this five piece artist collective from Bristol have already built up a portfolio of exhibitions and installations as long as my arm, and are a very prominent part of Bath and Bristol’s progressive art scene.</p><p></p>\n<p>Their installations look like how I imagine the storage room of the internet to look. Those bits and pieces of things that normal folk like you and I see and disregard everyday, only to be brought back to our attention in, what can only be described as these urban phantasmagorical sets that even Poison Ivy would be proud to call her lair.</p>\n<p>We are very eager to see what they’ve been dreaming up for CitR Live.</p>\n<p>Take a ganders at their new website <a href=\"https://www.madescapes.com/\">HERE.</a></p>\n<p>Check out their interview below.</p>\n<p><b>How did you all meet?</b></p>\n<p>WK: wow, just had a deja vu. or was it a glitch in the matrix. I think we might have answered this one before.</p>\n<p>THS: Jury duty</p>\n<p>LW: We went to university together, Trev was a year or two after us.</p>\n<p>THS: MadeScapes had a couple of shows in Bristol in autumn of 2011, <i>System History</i>, and <i>Topographic Translation</i>, which inspired me to write a couple of text pieces. Those two text pieces hit all the right buttons and I was in. So now I write conceptual texts around the work.<b></b></p>\n<p>How do the focuses of Madescapes^ compare to your individual practices?</p>\n<p>THS: MadeScapes is where common strands of our individual practices and interests meet. My own practice as an artist exists purely to answer my curiosities about the world. Included in that is digital culture and all that that implies. In terms of my writing, MadeScapes gives me the freedom to explore ideas that critical texts can’t really get to.</p>\n<p>JA: For me it’s an extension of my individual practice. I get to try things out I would not get to do on my own and realise much bigger ideas.</p>\n<p>WK: there are elements that relate to all of us individually but I think MadeScapes acts as a playground for us to explore the slightly looser or more distant curiosities that we have in our practices.</p>\n<p>TJ: In a way it’s like we all have a kind of bonus practice. I have my own practice with its various lines of enquiry and sort of spectrums of activity, but then there’s this whole bunch of other stuff that I think about and want to engage with or work with in some way. I can’t necessarily slot these things into my own work in a way that works but in the melting pot of the collaborative other practice, elements are all blended and reconfigured into bigger projects or endeavours.<b></b></p>\n<p><b><br />\nAny particular artists that inspire you?</b></p>\n<p>THS: Not really. There are works of art, like John Baldessari’s <i>Pencil Story</i>, or Keith Arnatt’s <i>Notes from Joe</i> and <i>Bed Piece</i> by Felix Gonzales Torres. Inspiration for me comes from everything that isn’t art.</p>\n<p>WK: Tay Zonday</p>\n<p>TJ: More by the day.</p>\n<p> </p>\n<p><b>What’s your stance on ‘art in the digital age’?</b><b></b></p>\n<p>JA: Trial by Fire</p>\n<p>THS: It’s what we’re making.</p>\n<p>WK: It exists. The digital age has given us more things to talk about and more tools to do it with. So I guess it’s our job to try making sense of it all, or not.</p>\n<p>TJ: It pretty much means more of everything. Everyone potentially knows about and sees everything. The futures bright, the futures homogenised.</p>\n<p>LW: Like milk.</p>\n<p>THS: Asterisk, Homogeneous. Actually, I think usage means homogenised works too.</p>\n<p><b><br />\nWith five of you in the collective, are there any consistent methods you adopt when curating your installations?<br />\n</b><br />\nTJ: We have developed quite a variety of different strategies for producing the kind of things we are looking for, the work influences and dictates the practicalities, the real stuff going on often means the work changes during the course of the installation.</p>\n<p>WK: A lot of the basic elements that we select to build a show are pre-planned but I think what we have learned above all else is to be as flexible as possible. The gallery space also acts as a studio during the install. Ideas are tested. Some make it, some don’t.</p>\n<p>JA: We just kind of go for it, we all now have a pretty similar idea of how we want things to look. We like to work with each space to put work into a space.</p>\n<p><b><br />\nThe aesthetics at your installations are in no ways ‘sparse’, with art work made by yourselves displayed alongside countless found objects, how do you strike a balance so your ‘hand made works’ avoid getting lost in the crowd?</b></p>\n<p>JA: We work everything together, to make a whole, so lack of ownership is a given in our shows at present.</p>\n<p>WK: The Installations are meticulously composed and the components have to work together. I don’t think I really see a difference in terms of the whole between a ‘made’ object and a ‘found’ one. They are all equal elements. Some shows and titles naturally bring certain thinks forward where as others might push them back.</p>\n<p>TJ: It varies a lot from project to project but there’s always an underlying agenda for the show which invariably gets discussed and argued out, blending with the various clashing and harmonising parts of our individual taste or intentions.</p>\n<p><b><br />\nWhat are your plans for 2013?</b></p>\n<p>WK: More art, all the time, everywhere, right now!</p>\n<p>LW: Outside of Crack in the Road we have a show in Bath at the minute, a kind of pre-show to our next big one, Trawler, at Motorcade/FlashParade in Bristol, and we’ll be in Stroud as part of Site Festival in May – another installation performance piece is on the cards for that one!</p>\n<p>TJ: Trawling</p>\n<p>THS: And trolling.</p>\n","slug":"20501-interview-madescapes","category":"arts","date":1364230804000,"wpid":20501,"isSticky":false,"featured_image":null,"createdAt":1587283735220,"updatedAt":1587825875558,"author":"5e9b68b27a1236eccfeb1d17","categories":["arts"]}