{"id":"5e9c337b9b6559241525e076","title":"Review: The Ascent of Everest – From This Vantage","content":"<img class=\"alignnone\" title=\"Ascent of Everest\" src=\"https://c1.</p><p>ac-images.myspacecdn.com/images02/52/l_2f4fc8ef802c4239b290e72a50d50c58.jpg\" alt=\"\" width=\"600\" height=\"400\" />\n<p>Everest, the tallest mountain on Planet Earth, imposing and majestic; a perilous path for anyone to tread, yet one of the most rewarding experiences a human being can undertake. So to name your band <strong>The Ascent of Everest</strong>? Well, you’ve already set the bar to an almost unfathomable height, so it was with eager ears and a willing heart that I took a listen to their newest album, <em>From This Vantage</em>.</p>\n<p>Categorising their music as experimental rock, there is no doubting the progressive post-rock influences which the band draw from, so it’s no surprise to hear they have gigged with the likes of<strong> A Silver Mt. Zion</strong> and <strong>This Will Destroy You</strong>. However, don’t let those comparisons cloud your opinion on them, and instead let their elegant and delicate music do the talking. Whilst post-rock is seeing somewhat of a revival at the moment, they almost appear to be hastening to distance themselves from many of their contemporaries. Sure there are the epic noisescapes and the heart breaking, emotionally charged atmospheres created, but they make sure to throw in their own personal blend of brass, violins and cellos, allowing for a sweeping, soaring texture to beautifully emerge. The vocals are subtly included, so as not to distract from the fragility of the composition, yet when they are evident, they a add a new emotional dimension to the music, allowing both the orchestral parts and vocals to run alongside each other in perfect harmony.</p>\n<p>Album opener <em>Trapped Behind Silence </em>is an instrumental introduction, more of an elusive build up to the haunting <em>Return To Us</em>. The male and female vocals intertwine majestically, cumulating in a cataclysmic finale, possibly the most transcendent moment on the album. Violins feature prominently throughout, no more so than on <em>Sword and Shield</em>, a seven and a half minute epic ode to a fallen solider. Each song flows gracefully, whilst still resonating with a certain powerful aurora, like the mountain itself, fragile and elegant yet tumultuous and treacherous. There is an<strong> Explosions in the Sky </strong>quality to <strong>The Ascent of Everests </strong>music, although they are doing their utmost to bring something original and creative to the musical table. Despite the dark, foreboding and chilling elements featured on the album, there are the moments which are truly magnificent, such as trip hop influenced closer <em>From This Vantage,</em> a stunning ostentatious piece, allowing each carefully carved muscle of the band to be vivaciously flexed. I can only begin to imagine the pride and fulfilment gained by conquering the worlds highest peak, however if the journey is as exquisite and stimulating as<strong> The Ascent of Everest</strong>, then I can truly see the thrill behind it.</p>\n<p style=\"text-align: center;\"><a href=\"https://www.myspace.com/theascentofeverest\">Check Out The Ascent of Everest’s Myspace</a></p>\n","slug":"2051-review-the-ascent-of-everest-from-this-vantage","category":"music","date":1280260420000,"wpid":2051,"isSticky":false,"featured_image":{"width":600,"height":400,"src":"2011/06/l_2f4fc8ef802c4239b290e72a50d50c58.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAUH/8QAIBAAAQMEAgMAAAAAAAAAAAAAAQACEQMEBSESQRMUIv/EABUBAQEAAAAAAAAAAAAAAAAAAAQF/8QAGhEAAgIDAAAAAAAAAAAAAAAAAQIAEQME8P/aAAwDAQACEQMRAD8AxLG5C2tcD6NYFr3jyAP+muIEgaE7Op6lTzcCTxrCOoBhERllHcwIrCh1Cf/Z"},"createdAt":1587295099682,"updatedAt":1588403565209,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/06/l_2f4fc8ef802c4239b290e72a50d50c58.jpg","categories":["music","reviews"]}