{"id":"5e9c337f9b6559241525e07c","title":"Review: The Love Language – Libraries","content":"<img class=\"alignnone\" title=\"libraries\" src=\"https://www.</p><p>mbvmusic.com/uploads/2010/04/love-language-libraries.jpg\" alt=\"\" width=\"600\" height=\"600\" />\n<p>By moving away from the hip realm of bedroom lo-fi, Stuart McLamb & co. make one of the most brave and confident records of the year but is it a perfect transition?</p>\n<p>Last year’s self-titled début made the Love Language name synonymous with lo-fi doo-wop and Spector-esque production, this year they move out of the house and into a studio and the result is one of the best transitions of it’s kind of the last 5 years.</p>\n<p>Most often when a band makes a move to a cleaner & more professional sound they are accused of selling out or losing what made them endearing in the first place. What makes Libraries different is that the music it is recalling were recorded in this way in the first place. There is no Burt Bacharach or Phil Spector album recorded in their bedroom.</p>\n<p>Listening to hypnotic dream-like <em>Horophones</em> or heavily layered opener <em>Pedals</em>, it is apparent that those names, particularly Spector’s, are still a clear influence on the sound of Libraries.</p>\n<p><em>Heart To Tell</em> echoes more of the spirit and sound of the début and is a stone-cold pop delight while <em>This Blood Our Own</em> is an album highlight, slowly building up into a crescendo of lush guitars and glacial strings. If you come to any kind of resolution by the time this album is finished, it will be that Libraries is absolutely packed to the brim with hooks, memorable memories and songs that imprint themselves onto your after just a few spins.</p>\n<p>It’s not all plain sailing however, <em>This Room </em>feels more like an embarrassing pastiche and ends the album on a really weak note and Wilmont only adds to the album’s theme of sounding a bit like the first album and then suddenly switching back to their new polished sound. I feel that this is more of a transitional piece for The Love Language, an album to bridge the gap between their early tendencies and their new found discovery that clean does not necessarily equal bad.</p>\n<p>‘Brittany’s back!’ McLamb declares and so is The Love Language, just what 2010 needed.</p>\n","slug":"2054-review-libraries","category":"music","date":1280251924000,"wpid":2054,"isSticky":false,"featured_image":{"width":600,"height":600,"src":"2011/06/love-language-libraries.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAABgUH/8QAJhAAAQIEBAcBAAAAAAAAAAAAAQIDAAQGIRESEzEFBxQXIiNRcf/EABUBAQEAAAAAAAAAAAAAAAAAAAIE/8QAGxEAAgEFAAAAAAAAAAAAAAAAAAEDAgQSIUH/2gAMAwEAAhEDEQA/AJ3J2i11FVz7vHutXIgvKDRcWAVhds19sPyNO7TzTXrYnHgynxQNZVkjbc/IfURLssNTGiy23iq+RIGNz8hRAUj4WzXFeWj/2Q=="},"createdAt":1587295103055,"updatedAt":1588403565260,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/06/love-language-libraries.jpg","categories":["music","reviews"]}