{"id":"5e9c06fa774c2610387e4f1f","artists":["5e9b69447a1236eccfeb2545"],"title":"Feature: Sofar Sounds","content":"<p>We don’t normally run features like this here at CITR, however I’ve been a long term admirer of the Sofar Sounds crew and felt that they may work along the same ethos that we adhere to in our relationships with artists and new music.</p><p> After working my way through the huge range of fantastic gigs and sessions Sofar have amassed, I spoke to Rafe from Sofar to shed a little bit more light in the history of his project and what is in store for the near future.</p>\n<p>However before we get to that, for those of you who are unaware of Sofar Sounds, often referred to as ‘Sofar’ online, it is an organisation based in Bethnal Green which curates secret gigs in volunteers’ living rooms in more than 30 cities across 6 continents.</p>\n<p>In 2009, marketing consultant Rafe Offer and singer-songwriter David J. Alexander met whilst watching St. Albans-based indie band Friendly Fires, soon establishing some common ground in that both were of the opinion that the state of music, in particular the live music scene, was not in a good way. As a result, Offer and Alexander organised a gig of their own – Dave was to play some new songs in front of a select few of his and Offer’s friends, the venue being his own living room, with only the music doing the talking. The night was a grand success, and thus Sofar Sounds was born.</p>\n<p>Another friend – marketing consultant Rocky Start joined the three and hosted the next one in his flat.   Rocky is still involved today, while Dave took a permanent break to work on his music.</p>\n<p><strong>With the scene set, can you tell us the primary focus of why you started Sofar?</strong></p>\n<p>Each gig was all about the musician – there was no talking during the performance – always in a house (which was so intimate and warm) – and the audience being comprised of genuine music lovers.</p>\n<p>It was only a matter of time before the movement went international. New York City was to be the city that made Sofar Sounds truly global – upcoming singer-songwriter (and now Sofar veteran) Marcus Foster was friends with Alexander and the two went about making “The Big Apple” the second city Sofar had a presence in. The evening was a roaring success, thus confirming the Sofar philosophy and concept could be translated across seas. The movement has not looked back since.</p>\n<p><strong>What makes Sofar unique?</strong></p>\n<p>Living room gigs are nothing new but what makes Sofar unique is we don’t announce who is going to play until the night nor where the gig will be until the day before….and we connect our audience – so it’s like one big Global family.   The policy of not announcing the line-up is a bit of fun – but also because we believe all musicians are equal – and that having a headliner for new music gigs encourage people to show up late / not respect the other acts performing.</p>\n<p><strong>How do you curate the bands that play the shows?</strong></p>\n<p>We have a team of 10 reviewers of all ages and nationalities.  Bands have to get ‘three Yes votes’ from the community.  We ask people to be critical – so that only the best new acts get to play Sofar.  We turn down 30 acts for every one we select.</p>\n<p><strong>How did it become an international event?</strong></p>\n<p>I knew people in Paris and New York and asked if we could try the concept in those cities.  It worked the same ‘magic’ so we continued.  Then people started to get in touch with us after seeing the videos we created….asking if they could start Sofar in their cities.  It just kept mushrooming from there – always with passionate music fans, coming to us….</p>\n<p><strong>What does the future hold for Sofar?</strong></p>\n<p>We’d love to be able to break a band from one gig – from our growing Global network, via the videos we produce and other forms of artist support through music synchronization (placing music in ads, games and films).  And to keep growing – moving from the current 30 gigs a month to 50 gigs a month, and beyond.  Ideally we sustain ourselves with funds earned from helping less known but really talented artists – get heard.</p>\n<p><strong>There seems to be a real interest in maintaining and building a community, is this an important element of Sofar?</strong></p>\n<p>Massively.  We are united by love of music and helping new acts succeed.  We connect through social media but also many of us travel and meet each other in living rooms around the world.  We also support acts in touring as much as we can.</p>\n<p>You can subscribe to the Sofar Sounds Channel <a href=\"https://www.youtube.com/user/Sofarsounds\" target=\"_blank\">HERE</a>, and you can stream CITR favourites No for their Sofar Sounds session below.</p>\n<p><iframe src=\"https://www.youtube.com/embed/NKByc_X3gRw\" height=\"315\" width=\"560\" allowfullscreen=\"\" frameborder=\"0\"></iframe></p>\n","slug":"20639-feature-sofar-sounds","category":"neweditorials","date":1364477591000,"wpid":20639,"isSticky":false,"featured_image":{"width":791,"height":473,"src":"2013/03/screen-shot-2013-03-28-at-14.32.31.png","placeholder":"data:image/jpeg;base64, iVBORw0KGgoAAAANSUhEUgAAAAoAAAAGCAIAAAB1kpiRAAAACXBIWXMAAAsTAAALEwEAmpwYAAAAxUlEQVR4nAG6AEX/AB8fH0A9QEZFRzU0OUpDTlteaWJwf4aZsSsyNw0QDQArKzIwLzU0NTMgKS+Aipy3xNi5yN2xwdllc29TYEQAFhYgHiInGB0dGh8kf4yggo+mgo+lnazFZHF1LDYlADMxNQQGCA0PEQ4QFHJ+kq27077M48nZ82VzgQcNBACDfnxQUVU5ODg1NjOAhIenrbOPlJZ5fn5iZV4eHxgAiISF0tDRhH5zbGRafndnj4hycGpWdnJebWlXPT4zM01E2ybv08wAAAAASUVORK5CYII="},"createdAt":1587283706505,"updatedAt":1588403531518,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2013/03/screen-shot-2013-03-28-at-14.32.31.png","categories":["neweditorials","interviews","music"]}