{"id":"5e9c336f9b6559241525e068","title":"Review: T in the Park 2010","content":"<div>\n<p>For many Scots, T in the Park is the highlight of their calendar year.</p><p> Three days of live music, heavy drinking, extreme camping and the ever present Scottish wit and friendliness, so with a line up featuring the likes of <strong>Eminem, Jay-Z</strong> and<strong> Kasabian</strong>, there was never going to be a lack of creative talent or raw energy on display. For my family and myself, T in the Park has been a regular occurrence for the past eight years, my first experience being when I was only eleven years old, so the Balado event has also held a place close to my heart. Over the years I’ve managed to catch some fantastic performances, including <strong>Green Day</strong>, <strong>R.E.M.</strong> and <strong>The Strokes</strong>, so I went into the weekend with high hopes.</p>\n<p>Pre-festival predictions for the weather were rather pessimistic, so it was no surprise when I arrived on Friday to be greeted by gloomy, overcast clouds. Whilst the rain was not as heavy as perhaps expected, it was still sufficient to turn certain areas of the campsite into mudpits, not that many people cared. Over the course of the weekend I managed to catch several fantastic performances, below are a few highlights.</p>\n<p><strong>Eminem</strong> – Despite arriving to the stage almost 50 minutes late, Detroit megastar <strong>Eminem</strong> received a rapturous reception from the Balado crowd. Running through an epic 29song set, featuring the likes of<em> Stan </em>and <em>My Name Is</em> as well as tracks from his new release <em>Recovery</em>, Marshall’s first UK live performance in over five years was a successful and appreciated show, personifying the reinvigorated boisterous spirit found on his most recent album.</p>\n<p><strong>The Drums</strong> – Although the timeslots were massively against them, with their set lining up against that of<strong> Jay-Z’s</strong>, Brooklyn outfit <strong>The Drums</strong> put in a lively and raucous performance. Lead singer Johnny Pierce’s vocals echoing those of Smiths legend Morrissey, whilst multi-instrumentalist Jacob Graham mercilessly flung himself from one side of the stage to the other. As well as playing most recent single <em>Best Friend</em>, The Drums also featured up coming release, and sure to be anthem, <em>Let’s Go Surfing</em>, pleasing the excitable Balado crowd. Drawing largely from their self titled debut, they are a band who embody the down to earth but extravagant ethos of 80s music, and are sure to be back for bigger and better shows at T.</p>\n<p><strong>Vampire Weekend</strong> – Back at T after a two-year absence and boasting an impressive new album to pick from, <strong>Vampire Weekend</strong> played to a large and energetic Main Stage crowd. Racing through a majority of <em>Contra</em> as well as their self-titled debut, their togetherness and understanding of each other was ever present. Filling their set with the likes of 08’s summer hit <em>A-Punk</em> and this years jovial <em>Cousins</em>, describing it affectionately as “a song about very important people”, <strong>Vampire Weekend</strong> put in an extremely accomplished and confident performance, a vast improvement from their previous shambolic live outings.</p>\n<p><strong>Yeasayer </strong>– After the huge success of pop gem single <em>Ambling Alp</em>, <strong>Yeasayer </strong>brought newest album<em> Odd Blood</em> to T in the Park. Playing an evening slot on the Futures Stage they initially found it hard to engage the restless crowd, however several songs into the set and they had everyones attention. Four colour changing glowing instrument stands commanded the stage, whilst each of the four members of the band added their own energy to the performance. Inevitably <em>Ambling Alp</em> roused the largest singalong of the show, however other pop beauties such as <em>ONE </em>and<em> Madder Red</em> also brought the audience to life.</p>\n<p><strong>Kele </strong>– <strong>Kele</strong> appeared far more at home amongst his anthemic dance songs than he had done previously as the frontman of indie pioneers <strong>Bloc Party</strong>. Urging the crowd in epic singalongs and interacting constantly with the bubbling Scottish audience, he ran through a majority of his newly released solo album <em>The Boxer.</em> As well as playing recent single<em> Tenderoni</em>, he also wowed the fans by introducing a <strong>Bloc Party </strong>medley as “a song by a band I used to be in” which was comprised of <em>The Prayer </em>and <em>One More Chance </em>amongst others.</p>\n</div>\n","slug":"2078-review-t-in-the-park-2010","category":"festivals","date":1280433652000,"wpid":2078,"isSticky":false,"featured_image":null,"createdAt":1587295087629,"updatedAt":1587825935214,"author":"5e9b68b27a1236eccfeb1d27","categories":["festivals","music"]}