{"id":"5e9c06c7774c2610387e4efa","title":"Finale: Underachievers Please Try Harder (2008-2013)","content":"<p><em>The end of a melody is not its goal: but nonetheless, had the melody not reached its end it would not have reached its goal either.</p><p> </em></p>\n<p>I remember reading the above quote during a less than inspiring A Level Philosophy class, in which the tiny window of light provided a teasing prospect of an afternoon better spent than pouring through 19th century literature. However this particular quote stuck with me, so much so that I scribbled it down on the same small notebook that I use today, though thankfully it’s use is no longer embedded in cursory A Level anecdotes. While I’m sure Nietzsche meant this as a pragmatic demonstration of a parable, I call upon it here not only for it’s connection to music, but to mark the end of a much loved Manchester institution – Underachievers Please Try Harder.</p>\n<p>For those of you unfamiliar with Underachievers, it is a regular gig and club night based in Manchester that is set to conclude with two much anticipated events, one of which marks the night’s 5th birthday. However Underachievers is much more than a simple listing on Manchester’s monthly events calender, rather over the course of the previous five years it has built itself as an integral pillar in Manchester’s music scene. From the moment I arrived in Manchester and began to work my way into the plethora of gigs and nights on offer, Underachievers appeared to have a cult status. It’s guarantee of quality new and exciting bands transferred to the development of a loyal audience, who would turn up in their numbers and remain for a club night with a huge range of music that created an atmosphere second to none amongst other Manchester club nights.</p>\n<p>With that all said, Underachievers is not disappearing completely. They are still promoting a stage at the evergreen Sounds From The Other City Festival, and we’re assured there will be occasional gigs still to come. Although that provides a welcome consolation, the regular nights will be dearly missed, and Underachievers have made a fantastic playlist to commemorate the countless number of acts that have passed through the doors of Underachievers and plied their trade to an awaiting audience. It will be made available in two halves on CD at the two remaining gigs due to take place this month, both of which will no doubt be very special indeed. Therefore consider this article the beginning of a goodbye, as opposed to the final words of a farewell, and make sure to come down to the nights listed below –</p>\n<p>13th April – Patterns // 5th Birthday Special – Roadhouse, Manchester – https://www.wegottickets.com/event/208178</p>\n<p>26th April – Ghost Outfit // Last Ever Underachievers – Roadhouse, Manchester – https://www.wegottickets.com/event/208179</p>\n<p>A huge thank you to Dave and Kirsty for all their hard work, and to all of those who have ever supported Underachievers in the past five years. To conclude, here are some words from Dave about the Underachievers Playlist –</p>\n<p><em>Underachievers Please Try Harder (2008-2013). This compilation is to be released in two halves on the final two nights. The theme of this mix is championing the underdog. In times where everyone is chasing the next buzz artist, barely digesting an album before rating it in an end of month poll, this should hopefully show why you should always listen with your ears. Great music is always being made, you just have to seek it out. All of these bands played Underachievers clubnight at some point over the last 5 years.</em></p>\n<p><em>It contains everything from the best of new Manchester bands like Patterns, Young British Artists and Ghost Outfit, to further afield with people like younghusband, and US bands Schwervon! and So Many Wizards. All of these bands are what I would call DIY (hence the underdog theme), and not backed by big labels or management.</em></p>\n<p><iframe src=\"https://w.soundcloud.com/player/?url=http%3A%2F%2Fapi.soundcloud.com%2Fplaylists%2F4497642%3Fsecret_token%3Ds-VVyB2\" height=\"450\" width=\"100%\" frameborder=\"no\" scrolling=\"no\"></iframe></p>\n","slug":"20829-finale-underachievers-please-try-harder-2008-2013","category":"neweditorials","date":1365357627000,"wpid":20829,"isSticky":false,"featured_image":{"width":214,"height":300,"src":"2013/04/underachievers-finale-back-web-214x300.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAOAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAABgQH/8QAIhAAAgEDBAIDAAAAAAAAAAAAAQIDBBEhAAUGQRITFCMx/8QAFAEBAAAAAAAAAAAAAAAAAAAABP/EABsRAAIBBQAAAAAAAAAAAAAAAAABAgMREyFR/9oADAMBAAIRAxEAPwBRyLdtxoqekkiqgrUMpcpEWV5h3bGLAno/utIiphPGk3zWHsAexRcXzoVV8cp6uSOeZ5AzeXsIcsXNsXvq1tyWNiiqLKfEfWvWhyrcQnFdaP/Z"},"createdAt":1587283655073,"updatedAt":1588403531386,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2013/04/underachievers-finale-back-web-214x300.jpg","categories":["neweditorials","editorials","new","mixtapes","music","newnews"]}