{"id":"5e9c33729b6559241525e06c","title":"Interview: Melvin Benn","content":"<p><a href=\"https://admin.</p><p>crackintheroad.com/music/2085-interview-melvin-benn/attachment/melvin-benn/\" rel=\"attachment wp-att-2201\"><img class=\"aligncenter size-full wp-image-2201\" title=\"Melvin-Benn\" src=\"https://api.crackintheroad.com/uploads/2010/07/Melvin-Benn.jpg\" alt=\"\" width=\"700\" height=\"467\" srcset=\"https://api.crackintheroad.com/images/2010/07/Melvin-Benn.jpg 700w, https://api.crackintheroad.com/images/2010/07/Melvin-Benn-260x173.jpg 260w, https://api.crackintheroad.com/images/2010/07/Melvin-Benn-640x426.jpg 640w, https://api.crackintheroad.com/images/2010/07/Melvin-Benn-165x110.jpg 165w\" sizes=\"(max-width: 700px) 100vw, 700px\" /></a></p>\n<p>Boasting the likes of <strong>Leeds and Reading Festival, </strong>and even the musical powerhouse that is <strong>Glastonbury </strong>on their roster<strong>, Hove Festival</strong> is <strong>Festival Republic</strong>‘s first venture into the European music festival market. <strong>Crack In The Road </strong>were fortunate enough to talk to the <strong>CEO </strong>of <strong>Festival Republic</strong>, <strong>Melvin Benn, </strong>and gain an insight into his thoughts on Norwegians, urban festivals, <strong>Simon Cowell</strong>, and the digital revolution.</p>\n<p><strong>CITR: </strong>What did you think of <strong>Muse</strong> last night?</p>\n<p><strong>MB: </strong>I thought they were really good, especially visually. From day one they have always had this incredible visual element and big performance style.</p>\n<p><strong>CITR: </strong>Yes, seeing them live at Wembley was something of a phenomena!</p>\n<p><strong>MB: </strong>Yeah! They’re playing Wembley again in September and they even played <strong>Glastonbury</strong> on Saturday.</p>\n<p><strong>CITR: </strong>It must be fantastic to get a band straight off the back of a <strong>Glastonbury</strong> headline slot.</p>\n<p><strong>MB: </strong>Yeah it’s not bad is it! The band stayed through till Sunday because they wanted to see <strong>Stevie Wonder</strong>, as did a lot of people not surprisingly, I guess as he is one of those legends. But obviously the kit came straight off the stage and over to here.</p>\n<p><strong>CITR: </strong>I think in terms of line up at this festival, you have managed to book a real set of performers. Nearly each band will put on a show for the crowd. <strong>Muse, Arcade Fire, Massive Attack</strong> ..</p>\n<p><strong>MB: </strong>Yeah, and even <strong>TCV (Them Crooked Vultures)</strong>. I’m not sure if you’ve seen <strong>TCV</strong>, but it’s just extraordinarily good; straight forwardly good.</p>\n<p><strong>CITR: </strong>In terms of organising a festival like Hove, could you give us an insight into how this all comes to fruitiation?</p>\n<p><strong>MB: </strong>Well stage one is a multi-layered activity. I have an operational team that work away planning the detail of stages, sound, lights, fencing, fence covering, security, etc. Just about everything that exists. Running parallel to that is the talent buying side of it, and running parallel to that is the sponsership side of it, and then running parallel to that is the PR side of it. This could be pretty much applied to all festivals, not just to this one in Norway.</p>\n<p><strong>CITR: </strong>We’ve noticed that <strong>Hove</strong> is a ‘cash-less’ festival. Was this due in part to ease some of the afore mentioned logistical planning?</p>\n<p><strong>MB: </strong>The idea for the cash-less system here is two fold really. The traders are very much more community groups, such as sports clubs and church groups. So there are a lot more of them here than there would be in an UK festival for example. The primary reason for that is that there are less festivals here in Norway. However in the UK if you had a burger store for example, you could take it across to a huge variety of festivals as there’s not too much distance between them all, therefore the cost of diesel is cheaper  so economically it works having that stuff. This is different in Norway as there are a lot less of them, because if you were to go from one festival in Norway to another event, it could take you four days to get there! So it’s just not economic. Thus the presence of community groups.</p>\n<p>These community groups are a lot less familiar to dealing with cash, and then added to that, and it is a big add, is the fact that the Norwegian people use bank cards more than I’ve ever seen. They go into a shop to buy a newspaper and some chewing gum, and they just stick their card in the machine. So the use of cards here, and in the main they’re not credit cards, is as easy and cheap to use and you can literally buy everything here on card! So the concept of using a card to a Norwegian teenager is not an alien concept at all.</p>\n<p><strong>CITR: </strong>Along with that there is the over 18 ID bands, which with the cashless system would surely reduce the chance of you losing your wallet and photographic ID ..</p>\n<p><strong>MB: </strong>Yeah exactly. It’s much easier to not have a great deal of money in it [cash card], and to keep it modestly topped up. It does work.</p>\n<p><strong>CITR: </strong>Could you see the concept being used in British festivals?</p>\n<p><strong>MB: </strong>I’m looking at it for different aspects for British festivals, but in the short term I don’t see it being universally accepted at UK festivals. I think in general, not just festivals, society is becoming a lot more cashless really. And that isn’t just because we’re running out of money! But there is a move to it. Festivals will in some aspects be slightly ahead of it and in other aspects slightly behind it, but I think there is an opportunity for some festivals where the ticket could become a swipe card entry. Then festivals like <strong>Reading and Leeds</strong>, where the audience profile can be quite young, there is the opportunity for a card which comes pre-loaded with money by family and friends.</p>\n<p>I think there is an opportunity, that some people may take advantage of, but I don’t see it as something I’ll likely introduce as a compulsory activity in the near future. Rather it’d be something more voluntary, which then instead of your granny sending you a £10 HMV card, she could put £10 on a Reading card. You could get pissed on your granny!</p>\n<p><strong>CITR: </strong>[General laughter and Granny impersonations of ‘Make sure you spend it on food!] I suppose it would also encourage people to return to festivals, if they have this continuous connection to the festival.</p>\n<p><strong>MB: </strong>Yeah, yeah of course. And I do think it’s likely. It’s compulsory here and the interesting thing is there is zero resistance.</p>\n<p><strong>CITR: </strong>Looking at <strong>Festival Republic</strong>‘s roster, have you never considered creating a <strong>Festival Republic </strong>Urban festival?</p>\n<p><strong>MB: </strong>Urban festivals don’t feel right for me.</p>\n<p><strong>CITR: </strong>Why is that?</p>\n<p><strong>MB: </strong>Because it doesn’t have that total unified community that a camping festival does. Philosophically that’s who I am as a person, I like to create something that represents and develops a sense of community. And every festival that I’ve got, I look to do that, but obviously in different ways. The Leeds community is quite different from the <strong>Reading</strong> community, even though the gigs are exactly the same in all intensive purposes. It’s different again at <strong>Glastonbury</strong>, and then different again at <strong>Latitude</strong>. Their all individually nurtured and thought about, but they all have community at their heart. However urban festivals for me just don’t quite get it. They are almost festivals for the sake of it. It’s just not me.</p>\n<p><strong>CITR: </strong>We spoke to one of the bands at <strong>Dot To Dot Festival </strong>(an urban festival), and they said that within the UK, urban festivals felt like they were just there to cram in as many bands as possible and maintain cheap drink offers ..</p>\n<p><strong>MB: </strong>That is my perception of them! I’ve been to some and the only one that works for me is <strong>South by South West</strong>.</p>\n<p><strong>CITR: </strong>What about <strong>SXSW </strong>makes it a successful urban festival?</p>\n<p><strong>MB: </strong>The town. I don’t think it’s anything over than the town, Austin. Austin isn’t a big town, it’s generally sunny and to say it’s in Texas, which is the most republican place in America, it’s actually wholly democrat. It’s almost like an oasis of decency within Texas! It reminds me a lot of San Francisco does Austin, so it just works. It’s about the town as the town dedicates itself to the event as well, and many years ago Austin as a town decided it would be a music town. It went much further than just the events, they’ve encouraged music studios, rehearsal studios and all the core music activity 52 weeks a year.</p>\n<p><strong>CITR: </strong>We’ve noticed that the community at Hove is fantastic. We got the bus from the airport and met two Norwegian guys and they’ve just been great to us.</p>\n<p><strong> </strong><strong>MB: </strong>The Norwegians are incredibly lovely people, and what’s interesting about them, and I’d be interested on your thoughts about it, is that they’re a group of people so closely aligned with the British and I feel completely at home here. Of course the language is so dramatically different and we’ve all as Brits have spent time abroad and learnt a few words of French, or a few words of Spanish ..</p>\n<p><strong>CITR: </strong>Such as ‘Where is the bar?!’ [general laughter ensues]</p>\n<p><strong>MB: </strong>For as much as I’ve been in Norway, I still can’t speak a word of Norwegian! It’s a bloody difficult language! But as people, I feel as though the Norwegians and British get along very well. I go to America, and I know I’ve just talked about Austin, and I’m talking the same language but I think I’m talking to aliens! I don’t get it at all. Whereas here, I feel at home.</p>\n<p><strong>CITR: </strong>I’ve spoken to a few Brits here, but there aren’t too many. Do you think the festival would expand to entice more Brits to come?</p>\n<p><strong>MB: </strong>It’s a slow burn really on that. I think the Brits fall into two camps, those who want to be surrounded by Brits, which is the bigger camp, and the much smaller camp of those who want to explore. Although some people would argue they’re exploring at <strong>Benicassim</strong>, they’re not as its simply a British festival in Spain! There is a much smaller number of Brits who would want to come to a festival where they are in the minority.</p>\n<p>I just think that’s how it is, and let’s not beat around the bush, the best festivals in the world are in England.<strong> Glastonbury, Reading, Leeds and Latitude</strong>, and while I know those four all fall under my jurisdiction somewhat, I honestly believe they are the best festivals in the world, in their different genres. Obviously <strong>Glastonbury</strong> is the best festival in the world, full stop. <strong>Reading and Leeds</strong> are without a doubt the best music festivals in the world and the best teenage festivals in my opinion  and <strong>Latitude</strong> is a different thing altogether. It’s an arts festival that is without comparison. Then there are all the other festivals which are good, so we are spoilt for choice. It’s like the Spanish, who are spoilt for choice when they want to go on holiday!</p>\n<p><strong>CITR: </strong>What bands will you be checking out for yourself during your stay at <strong>Hove?</strong></p>\n<p><strong>MB:</strong><strong> Florence</strong>, who’s on today, will be fantastic. I’m just amazed with her growth. Well, not amazed but it’s fantastic how a British act has come so strong, so quickly. That’s because she’s good. That’s the interesting thing, its none of this<strong> Simon Cowell</strong> manufactured thing, it’s genuine quality. Then it’s the whole bill, I’m pretty happy with the whole line up. First time I’ve heard <strong>Arcade Fire</strong> for a few years ..</p>\n<p><strong>CITR: </strong>I’ve heard some of their new stuff and I’m not quite convinced ..</p>\n<p><strong>MB: </strong>Well I’ve heard some of them too and its sounding <strong>Arcade Fire</strong>-ish, but its difficult to know until you engross yourself in an album. I mean there’s some slight disappointment as the album was due out in April, so perhaps had it came out then it may have changed things.</p>\n<p>A rather attractive Norwegian woman then comes across during our interview, at which point Melvin is immediately, yet understandably, distracted for a few minutes.</p>\n<p><strong>CITR: </strong>We’ve noticed there are very few line up clashes unlike at <strong>Leeds Festival or Latitude</strong>. Was this a deliberate move by yourself?</p>\n<p><strong>MB: </strong>It’s a historical thing really, it’s how festivals in Europe have developed. It means there’s less bands compared to an English festival, and whether that is a good or a bad thing I don’t know. But if we suddenly started changing <strong>Leeds or Reading</strong> there would be an outcry. People always write in saying there are too many bands, but if I started doing it a different way it wouldnt work. It works here, one way or another.</p>\n<p><strong>CITR: </strong>Going back to when you talked about a <strong>Florence</strong>‘s success not being in the form of a ‘<strong>Simon Cowell</strong>‘ success, what do you make of his music enterprises?</p>\n<p><strong>MB: </strong>Well its just TV isn’t it. I don’t decry it at all, there’s just a huge demand for it. However it’s much more related to the TV industry than to the Music industry. I think people are mistaken when they start saying its about the music industry, because their output is TV based. Of course they sell singles, but their acts are not touring bands. The idea of a <strong>Simon Cowell</strong> creation embarking on a 27 month tour the way that Muse would embark on a tour, it just doesn’t happen. I think people get het up for the sake of it, and I don’t think there is a need to. Fantastic with <strong>Rage </strong>gaining the Christmas Number One, and I just produced their live gig for them. It was just a counter culture moment to popular culture.</p>\n<p><strong>CITR: </strong>I think this counter culture is running alongside the download culture as there is less money in the sale of music, as so many teenagers just download for free. In the next couple of years could show which artists are in it for entirely money, and those who enjoy music.</p>\n<p><strong>MB: </strong>Yeah there’s quite a lot of change going on in the industy. Then again, you have to think the industry is quite a young industry. So there’s no reason for it to assume it’s stable. The music industry versus the film industry for instance. The film industry is 120 years old, whereas the music industry is just 40 years old. There’s a lot of change, it’s not got that length of understanding. The digital age has allowed people’s knowledge of music to be ten fold better than what mine was when I was 18, and I was really into music! The availability is just phenomenal. When I was 18 and I wanted to learn about a band I literally had to go out and by the album, and it was the only way you could learn about it and there was a limited amount of money you could spend on it.</p>\n<p>What amazes me is when my kids talk to me about bands and I just think, how have you heard of them?! They reply that they’ve just got loads of their stuff on their Ipods! I think it’s fantastic, and as I’m in the live music business I think it makes it even better as fans are wanting to see these bands live. In a way, the only unique experience is the live experience. I don’t want to sound too old, but when I was younger the unique experience was only the album. If you were the first person to get the new <strong>Led Zepplin</strong> album for example, you’d be the only person in your class to have it. Whereas now everyone has got it, therefore the only way to stand out now is to see it live. The bands are just better as well. People always ask me, what’s the best ever? And I think the best is yet to come, and I really believe that whole heartedly as bands just keep getting better and better as far as I’m concerned.</p>\n<p><strong>CITR: </strong>Are you looking forward to <strong>Reading and Leeds</strong> this year?</p>\n<p><strong>MB: </strong>Yeah! <strong>Reading</strong> is my favourite festival in the world and always will be. <strong>Leeds</strong> has got a great place in my heart as I’m a Yorkshireman and I started the festival, but <strong>Reading</strong> was the first festival I ever went to and it’s always going to be my favourite because of that.</p>\n<p><strong>CITR: </strong>Getting exclusive performances by <strong>Blink 182</strong> and <strong>The Libertines</strong> is pretty special ..</p>\n<p><strong>MB: </strong>Yeah they were little gems really. That’s what we try to do, just to make sure we’ve got that uniqueness. And <strong>Blink</strong> was hardwork insofar as the travel plan as they don’t want to get on airplanes because of the unfortunate plane crash. Therefore all the discussion was over how we would get them across here, and how long it would take the boat to get across! However it’s all worth it as I believe this year is going to be amazing.</p>\n<p><strong>CITR: </strong>Thank you for your time <strong>Melvin</strong> and we look forward to seeing you at <strong>Leeds</strong>!</p>\n<p><iframe style=\"border: currentColor; width: 292px; height: 255px; overflow: hidden;\" src=\"https://www.facebook.com/plugins/likebox.php?id=114090381951328&width=292&connections=10&stream=false&header=false&height=255\" frameborder=\"0\" scrolling=\"no\" width=\"320\" height=\"240\"></iframe></p>\n","slug":"2085-interview-melvin-benn","category":"festivals","date":1280410750000,"wpid":2085,"isSticky":false,"featured_image":{"width":700,"height":467,"src":"2010/07/melvin-benn.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAAAAf/xAAiEAABAwMDBQAAAAAAAAAAAAABAAIRAwUTBAYSFCEiUpH/xAAVAQEBAAAAAAAAAAAAAAAAAAAEBf/EABsRAAICAwEAAAAAAAAAAAAAAAECABEDBAXx/9oADAMBAAIRAxEAPwCW2yybfqWa+OOWjrOix0A5gcyZ5OeTBIPjHb2UuIpgxk+NKIjaDMQ1kmVOuipnpRXgn//Z"},"createdAt":1587295090696,"updatedAt":1588403565133,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2010/07/melvin-benn.jpg","categories":["festivals","interviews","music"]}