{"id":"5e9c33779b6559241525e070","title":"Review: The Magic Numbers – The Runaway","content":"<p><a rel=\"attachment wp-att-2101\" href=\"https://admin.</p><p>crackintheroad.com/music/2100-review-the-magic-numbers/attachment/magic-numbers\"><img class=\"alignnone size-fullheader wp-image-2101\" title=\"magic numbers\" src=\"https://api.crackintheroad.com/uploads/2010/07/magic-numbers-300x303.jpg\" alt=\"\" width=\"300\" height=\"303\" /></a></p>\n<p><a rel=\"attachment wp-att-2101\" href=\"https://admin.crackintheroad.com/music/2100-review-the-magic-numbers/attachment/magic-numbers\"></a>If there is one subjective observation to be made about <strong>The Magic Numbers</strong>, sibling rivalry is not an issue here. Since the breakthrough album<em> ‘The Magic Numbers’</em> way back in 2005, that coincidentally hit number 7 on the UK album charts, the Ealing four piece have purveyed a concoction of easily definable yet gallingly inconsistent tunes. The 3rd studio album <em>‘The Runaway’</em> is a clear attempt to break out of the pigeon hole the industry has bequeathed upon them.</p>\n<p>Unfortunately it has not had the desired effect. A congruent constellation, and I do not mean in an out of this world sense, of Indie foot tappers and over syrupy jargon (certainly more of the latter) has once again left the sibling guild of the Stoddarts and the Gannons agonisingly short of the mark. Their jovial demeanors are an almost phantasmal memory. Only a handful of tunes, such as the abstractly attractive Folk fired <em>‘Restless River’</em> act as an abject atonement fighting hard to bandage an LP utterly determined to disintegrate. <em>‘A Start With No Ending’</em> is the most melodic of the tracks, coupled with energy akin to the more invigorating days of <em>‘Those The Brokes’</em>.</p>\n<p>Otherwise the Harmonies are heedless, an evident element throughout, and thoroughly palpable in cuts such as <em>‘The Pulse’</em>. It makes for a confused and conflicting cacophony, ironically, a sound none too contrasting from a sibling squabble. No mean feat for a song touted as Indie Pop. The disjointed theme spills over into the hesitantly <strong>‘Eagles-esque’</strong> <em>‘Why Did You Call?’</em> There’s an oxymoronic ideology to this album. <strong>The Magic Numbers</strong> seem comprehensively resolute on maintaining the most timid of themes. The album reaches its colourless crescendo in the form of <em>‘I’m Sorry’</em>. Saxophones and Harmonica’s are trodden into the dour descanting and battered bassline, as all of the prior promise is stomped out by another exasperatingly disorganised track. This band, although never a behemoth of their scene, are now in arduous danger of being catapulted into the already bustling Indie abyss.</p>\n<p><strong>The Magic Numbers</strong> once sang ‘If there’s time for me, there’s time for thee’. Judging by the latest installment of <strong>The Numbers</strong> none so magic miscellany of the morose, Indie Pops perpetual under achievers are fast losing the fanatics patience. Their apparent ability to formulate the ‘homogenous album’ now seems an eternally elusive endeavor.</p>\n","slug":"2100-review-the-magic-numbers","category":"music","date":1280322971000,"wpid":2100,"isSticky":false,"featured_image":{"width":495,"height":500,"src":"2010/07/magic-numbers.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAABgUH/8QAIxAAAgIBAgYDAAAAAAAAAAAAAQIDBAUABgcRFCExQRIiQv/EABUBAQEAAAAAAAAAAAAAAAAAAAID/8QAFxEAAwEAAAAAAAAAAAAAAAAAAAERAv/aAAwDAQACEQMRAD8AUYrixSzOA3NZxtaLG2KEU/Sl1Vndg3xjZlIPYkg9vYI9ayivxQ37LXika3ExdQxY1WJPMeeYXlqdgasD7r3EXgiY9TN5QH9tpzhGZcNQVWIUV4wAD4+o1PWo4NKKn//Z"},"createdAt":1587295095023,"updatedAt":1588403565158,"author":"5e9b68b27a1236eccfeb1d42","old_image":"2010/07/magic-numbers.jpg","categories":["music","reviews"]}