{"id":"5e9c06a0774c2610387e4ed2","artists":["5e9b69047a1236eccfeb218b"],"title":"Feature: How I ‘Found’ ‘Jai Paul’ And What We Know Now","content":"<p>Update: See bottom of page for statement.</p><p></p>\n<p>Shortly before 2.00AM on 14th April 13, I was doing my daily bandcamp trawl, checking out new uploads, new releases etc. Now, I’m used to riffling through a LOT of tripe, and very rarely find anything that I’ll end up writing about, this time however would be very different. Sitting next to Sandy Tweeddale and W3R3W0LF3H was an immediately recognisable picture and name: Jai Paul. After clicking on the Bandcamp link, I was confronted with a fairly ropey looking bandcamp, with 16 untitled tracks. A Bandcamp page registered a mere matter of hours ago, without any previous uploads, or links to, or from.</p>\n<p><img class=\"size-full wp-image-21109 alignnone\" style=\"height: auto;\" alt=\"Screen shot 2013-04-14 at 03.28.04\" src=\"https://api.crackintheroad.com/uploads/2013/04/Screen-shot-2013-04-14-at-03.28.04.png\" srcset=\"https://api.crackintheroad.com/images/2013/04/Screen-shot-2013-04-14-at-03.28.04.png 415w, https://api.crackintheroad.com/images/2013/04/Screen-shot-2013-04-14-at-03.28.04-300x133.png 300w, https://api.crackintheroad.com/images/2013/04/Screen-shot-2013-04-14-at-03.28.04-50x22.png 50w\" sizes=\"(max-width: 415px) 100vw, 415px\" />Realising the significance of this release, I didn’t want to cry wolf, so gave it a full listen through, before I could no longer contain my excitement.</p>\n<p>Anyway, after letting it settle in for twenty minutes or so, I came onto CitR and posted a <a href=\"www.crackintheroad.com/music/21100-news-jai-paul-streams-self-titled-debut-album/\" target=\"_blank\">News story</a>, questioning whether Jai Paul had indeed released his hugely anticipated debut album. It wasn’t long before The Fader, Listen Before You Buy and several other reputable websites picked up on it. What surprised me the most, was a few websites, including Pitchfork, that were seemingly adamant that this was indeed the long-awaited album.</p>\n<p>So, what do we know now? Is it real? Is it the album? Is it a collection of unheard demos? Who uploaded it?</p>\n<p>We’ve known for the best part of two years now that a Jai Paul album is on the way, through XL Records. Only last week Noisey posted an article questioning <a href=\"https://noisey.vice.com/en_uk/blog/is-jai-pauls-debut-album-coming-out-later-this-month\" target=\"_blank\">Is Jai Paul’s Debut Album Coming Out Later This Month?</a>, mentioning an unofficial mixtape released back in February, and the fact that Jasmine had made it’s way back onto Radio 1, as two of the key features.</p>\n<p>With an erratic history of releasing music, making his debut album available during a Daft Punk show at Coachella, on a Sunday morning, would seem like a very ‘Jai Paul thing to do’. Uploading it to an unassuming Bandcamp would also fit his previous release history, in terms of uploading tracks to Soundcloud for a matter of minutes, before removing them. Is it another Death Grips scenario, with Paul uploading music without the labels permission, or has he had (demo) tracks uploaded by a third party? If it’s the latter, then you would imagine XL would be onto them straight away.</p>\n<p>So how about Paul’s relationship with XL? A quote from an interview on NPR with XL founder and owner Richard Russell hints towards Paul’s occasionally difficult nature, “<em>Jai is a wizard…the way he’s going about things is, I think for many, baffling. But…he’s going about things in the most Jai Paul way you could possibly go about things. And who knows where that may lead</em>.”. A tweet from Popjustice Features Editor Michael Cragg suggests that the relationship between Paul and XL is less than simple:</p>\n<blockquote class=\"twitter-tweet\"><p>@<a href=\"https://twitter.com/djembadjembaa\">djembadjembaa</a> @<a href=\"https://twitter.com/timnoakes\">timnoakes</a> WHAAATT? Someone from XL told me about a month ago that he had basically retired. This is some sort of miracle</p>\n<p>— Michael Cragg (@MichaelCragg) <a href=\"https://twitter.com/MichaelCragg/status/323344355509288960\">April 14, 2013</a></p></blockquote>\n<p> </p>\n<p>UPDATE: XL Head Scout Imran has just tweeted:</p>\n<blockquote class=\"twitter-tweet\"><p>Surprise!</p>\n<p>— Imrania (@lllmran) <a href=\"https://twitter.com/lllmran/status/323359048407871488\">April 14, 2013</a></p></blockquote>\n<p> </p>\n<p>To me, it sounds like a collection of demos, the majority unreleased. The record was rumoured to be called Rayners Lane, which wouldn’t fit in with the self-titling of this album. It doesn’t sound like a huge budget XL album release, and would appear to be a mixtape, rather than a fully formed album. Despite Paul’s unusual way of approaching promotion, it would be very unlike XL to allow any artist to put out a record in such a colossally understated manner.The bitrates are hugely variable, particularly on the skits of which many seem to cut short (track 8), which wouldn’t fit with it being a proper album release. However, the production and vocals are very similar to previous Jai Paul tracks, as well as several being recognisable from earlier demos, the most notable:</p>\n<ol>\n<li>Str8 Outta Mumbai</li>\n<li>Genevieve</li>\n<li>Crush (Jennifer Paige Cover)</li>\n<li>Jasmine (a re-recorded version, different from the XL single release last year)</li>\n<li>100, 000</li>\n<li>Baby Beats</li>\n<li>Chix</li>\n<li>BTSTU (Sometimes referred to as BTSU)</li>\n</ol>\n<p>Track 08 is rumoured to be called A Thousand Light-Years From You”. Track 8 features a sample from Harry Potter, and other tracks feature samples from the likes of Jo-Jo, Mad Men, Gossip Girl, Cat Stevens (Track 4), Tomb Raider (Track 15) and a Radio DJ spinning one of Jai’s records, and getting his name wrong. Quite of few of the tracks either feature samples that used to exist on his Myspace page, or are more fully fleshed out versions of older tracks.</p>\n<p>Now here comes the interesting bit. Purchasing the record will get you a receipt from:</p>\n<p><a href=\"mailto:sloaneranger@live.com\"><b>sloaneranger@live.com</b></a></p>\n<p>An account that I’ve been informed is linked to Jai Paul’s own (screenshot from Tom Mike):</p>\n<img class=\"size-full wp-image-21108 alignnone\" alt=\"Screen Shot 2013-04-13 at 8.22.13 PM\" style=\"height: auto;\"  src=\"https://api.crackintheroad.com/images/2013/04/Screen-Shot-2013-04-13-at-8.22.13-PM.png\" srcset=\"https://api.crackintheroad.com/images/2013/04/Screen-Shot-2013-04-13-at-8.22.13-PM.png 409w, https://api.crackintheroad.com/images/2013/04/Screen-Shot-2013-04-13-at-8.22.13-PM-300x98.png 300w, https://api.crackintheroad.com/images/2013/04/Screen-Shot-2013-04-13-at-8.22.13-PM-50x16.png 50w\" sizes=\"(max-width: 409px) 100vw, 409px\" />\n<p>Suggesting, but far from confirming, that Paul himself uploaded these to this bandcamp. The email address jaipaul@hotmail.co.uk links to a <a href=\"https://www.facebook.com/jai.paul.16/about?ref=ts\" target=\"_blank\">Facebook profile</a>, created in 2009, that lists myspace.com/jaipaulmusic in the About section. Can we assume that Paul created another email account to upload the music to bandcamp? Did he intend for so many people to see it? Is it all just an elaborate publicity stunt to promote the record, and might we still have to wait another year to hear the ‘real’ album?</p>\n<img class=\" wp-image-21135 alignnone\"  style=\"height: auto;\" alt=\"Screen shot 2013-04-14 at 06.00.35\" src=\"https://api.crackintheroad.com/images/2013/04/Screen-shot-2013-04-14-at-06.00.35.png\" srcset=\"https://api.crackintheroad.com/images/2013/04/Screen-shot-2013-04-14-at-06.00.35.png 864w, https://api.crackintheroad.com/images/2013/04/Screen-shot-2013-04-14-at-06.00.35-300x180.png 300w, https://api.crackintheroad.com/images/2013/04/Screen-shot-2013-04-14-at-06.00.35-50x30.png 50w\" sizes=\"(max-width: 864px) 100vw, 864px\" />\n<p>Underneath the supposed ‘album’ on Bandcamp is a series of hashtags, here’s my best attempt at explaining them:</p>\n<p>#ANONCD-R – ANON CDR- as in an anonymous CD or A non-CD-R, in other words, not a CD, could mean not an album, and purely a digital release</p>\n<p>#WASTEFIELDMULTISTORE – Wastefield is an area in Bradford, a demolition site that has remained abandoned since 2005</p>\n<p>#SS</p>\n<p>#SW1 – The postcode for South West London</p>\n<p>#SHOOTTHEPIGEON</p>\n<p>#DSLR – Digital single lens reflex camera, also a sample from Track 13</p>\n<p>#HYPATIA – A Greek philosopher in Roman Egypt, who was murdered by a mob after being accused of exacerbating a conflict between two prominent figures in Alexandria. Her murder apparently effectively marked the downfall of Alexandrian intellectual life. AH: There are huge debates over what is actually Hypatia’s work due to age/collaborations. It’d fit with the release style of this.</p>\n<p>#JORDANV – Air Jordan V’s are a style of Nike retro sneakers</p>\n<p>#XXL</p>\n<p>So, with no word from XL, and Jai Paul currently the top trending topic on Twitter, it’s likely that come tomorrow morning, there will be more clarity surrounding the issue. What do you think? Is it Jai Paul? Is it the elusive debut album? Listen to the tracks below.</p>\n<p>UPDATE: Owen Myers, music Journalist has received an email from Jai Paul:</p>\n<blockquote class=\"twitter-tweet\"><p>Jai Paul just emailed me: “I will be releasing a statement later today about the illegal leak. I have not released a new record.”</p>\n<p>— Owen Myers (@Owen_Myers) <a href=\"https://twitter.com/Owen_Myers/status/323763843631284224\">April 15, 2013</a></p></blockquote>\n<p><script charset=\"utf-8\" type=\"text/javascript\" src=\"//platform.twitter.com/widgets.js\" async=\"\"></script>And @FatAmpNadia seems to think that somebody stole Jai Paul’s laptop, and that a statement will be out at around 3pm this afternoon.</p>\n<blockquote class=\"twitter-tweet\"><p>Jai Paul had his laptop stolen, there will be a statement at 3pm according to @<a href=\"https://twitter.com/fatampnadia\">fatampnadia</a> — Owen Myers (@Owen_Myers) <a href=\"https://twitter.com/Owen_Myers/status/323769373439442945\">April 15, 2013</a></p></blockquote>\n<p>With it still being far too early to say anything with certainty, a ‘stolen laptop’ (a report that has yet to be confirmed by anyone, and is simply taken from a Twitter reply by @FatAmpNadia) all seems a little convenient. I assume that Paul’s contract with XL wouldn’t let him use track titles, and that none of the samples used have been given proper clearance. Has it simply been a way to drum up (a lot of) hype, whilst making a little bit of money at the same time? Were XL in on it? The tweets from several XL workers would suggest that they genuinely had no idea about the release of these tracks.</p>\n<p>If it was Jai Paul himself who did upload the tracks, then why? His erratic release schedule would suggest that he prefers to make his own decisions regarding dates, and with his only official two tracks being released on April 13th’s of other years, it would seemingly make sense.</p>\n<p>XL knew of the Bandcamp upload within hours of it becoming available, so if it wasn’t Paul that uploaded it, and the £7 was going to a random uploader, then why wasn’t a statement made sooner, as oppose to leaving the album up for 48 hours and having several thousand downloads of it? It seems slightly suspicious, especially considering that when an unofficial Jai Paul mixtape, entitled Everlasting (which just turned out to be a collection of Myspace demos from 07, none of the mp3s which feature on this release) made its way onto the internet in February, uploads of it were being taken down within an hour or so.</p>\n<p>However, if the stolen laptop story is true, then firstly, my deepest sympathies are with Jai. The idea of Jai Paul having a folder on his laptop with 16 brand new, unheard tracks, in any coherent order, let alone in compressed mp3 formats, is a rather bizarre one. The only fathomable explanation for that would be someone who knows Jai Paul personally, and managed to obtain the collection of tracks, with prior knowledge to their existence. The links to a Facebook account from four years ago and the bandcamp seem to be far too convenient.</p>\n<p>Would someone who stole the laptop, really set up a Bandcamp page AND charge £7 for the album, with full knowledge that it would be traced back to them at some point. I have never heard of a somebody leaking an album via Bandcamp, let alone putting a price tag to it.</p>\n<p>If, as some people are suggesting, this was a very intricate PR ploy, then it’s been hugely effectual. Not only has Jai Paul gained several thousand more fans, but it will also have made XL certain of his ability to sell records. With several people debating over Jai Paul’s status with XL (was he signed for an album, was he ‘on hold’ with the label – I couldn’t say), a stunt like this would be more than enough to cement his position with them.</p>\n<p>UPDATE: Jai Paul has tweeted from his verified Twitter account (impressive first tweet, huh?):</p>\n<blockquote class=\"twitter-tweet\"><p>To confirm: demos on bandcamp were not uploaded by me, this is not my debut album. Please don’t buy. Statement to follow later. Thanks, Jai</p>\n<p>— Jai Paul (@jai_paul) <a href=\"https://twitter.com/jai_paul/status/323775821561090049\">April 15, 2013</a></p>\n<p> </p>\n<p> </p></blockquote>\n<p>This tweet at least tells us that these are definitely Jai Paul tracks, even if they are demos. Also, it’s important to take into account that there’s more than a small chance of this Twitter account being a label controlled account, and now actually controlled by Paul himself, same for the Facebook page.</p>\n<p>If this is an unofficial leak, then in many ways, the lack of information put out by XL and by Jai Paul himself has been their achilles heel. The creation of this mystery has led to a situation where nobody knows what to believe, hence everything is reported, be it a leak or an official release. I’m still very much of the opinion that these tracks (and I won’t call them an album), were most likely put out by Jai Paul himself, or by XL, and that subsequent developments have been reactionary.</p>\n<p>Update: Shortly before 3pm, all the tracks on the Bandcamp (jaipaul.bandcamp.com) were deleted, however the Bandcamp url is still registered.</p>\n<p>A statement is expected at 3pm this afternoon.</p>\n<p>No matter how it turns out, I think we can say two things with certainty:</p>\n<p>1) Jai Paul is ludicrously talented.</p>\n<p>2) The publicity from this has been invaluable.</p>\n<p> </p>\n<p>Update: Wednesday 17 April:</p>\n<p>A statement from <a href=\"https://www.xlrecordings.com/\" target=\"_blank\">XL Recordings</a> has been released, confirming that this collection of tracks is not an official release, and is also not Jai Paul’s debut LP:</p>\n<p><em>As widely reported, on Sunday 14th April, music by XL Recordings artist Jai Paul was illegally made available via a fake Bandcamp account. This music was not uploaded by Jai and it’s not his debut album – it is a collection of various unfinished recordings from Jai’s past.</em></p>\n<p><em>Neither XL or Jai will take any money from the sale of this music. We have been working with Bandcamp and PayPal to resolve this situation and they have told us all purchases will be refunded within the next 7 days</em></p>\n<p>So there you have it. The music IS Jai Paul, however apparently wasn’t uploaded by him, and is certainly not his debut LP. Any purchases will be refunded within the next 7 days. What do you think? Still suspicious?</p>\n<p>Regardless of the whole bizarre nature of the situation, I’d like to thank Jai for the fantastic music, and really hope that this is an indication of what is to come from the debut LP.</p>\n<p><em id=\"__mceDel\"></p>\n<p><iframe style=\"position: relative; display: block; width: 300px; height: 410px;\" src=\"https://bandcamp.com/EmbeddedPlayer/v=2/album=3931211432/size=grande3/bgcol=FFFFFF/linkcol=4285BB/\" height=\"410\" width=\"300\" frameborder=\"0\"></iframe></p>\n<p></em></p>\n","slug":"21107-feature-finding-jai-paul","category":"music","date":1365903984000,"wpid":21107,"isSticky":false,"featured_image":{"width":1250,"height":700,"src":"2013/04/jai-paul-everlasting.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAGAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAUG/8QAIBAAAgEEAgMBAAAAAAAAAAAAAQIDAAQFIRExEhRBUf/EABQBAQAAAAAAAAAAAAAAAAAAAAT/xAAbEQEAAgIDAAAAAAAAAAAAAAABAAIRwRIhQf/aAAwDAQACEQMRAD8Axkl9ZZueZpLV1X1xa28St4LEXdQrcbB2W51+d7qzCmJESCTEwO4UBmJ7P00pQ29qC1cd6I9qPETzbP/Z"},"createdAt":1587283616195,"updatedAt":1588403531148,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2013/04/jai-paul-everlasting.jpg","categories":["music","news"]}