{"id":"5e9c0683774c2610387e4ead","title":"Feature: Beliebe In Yourself","content":"<p>As you’ve undoubtedly heard, <a href=\"https://www.</p><p>guardian.co.uk/music/2013/apr/14/justin-bieber-anne-frank-belieber\" target=\"_blank\">Justin Bieber visited the Anne Frank House in Amsterdam</a> and, in the guestbook, left a message which said that he hoped “she would have been a belieber”. I’ll be honest, when I first came across the story I was taken aback, stunned into disbelief even; Bieber was right! I bet if Anne Frank was born in the late 1990s, she would have thrown away that dumb paper diary (so pre-Y2K lol) and would have her very own Tumblr filled with pictures of Justin Bieber with text like “<3THR0B” and “HAWT STUFF” emblazoned across them.</p>\n<p>This got me thinking, if Anne Frank was born in the last twenty-odd years, we might have not read her diary, which was a MAJOR DRAG btw, and be gifted instead with a sweet-ass twitter feed. So, this caused me to ponder what other historical figures would be fans of musicians today.</p>\n<p>All the images were put-together by the always excellent James Wragg and you can have a look at his boner-inspiring blog <a href=\"https://j-wragg.blogspot.co.uk/\" target=\"_blank\">here</a>.</p>\n<p><strong>Emmeline Pankhurst & Beyoncé</strong></p>\n<p><a href=\"https://api.crackintheroad.com/music/21167-feature-beliebe-in-yourself/attachment/diag1/\" rel=\"attachment wp-att-21287\"><img class=\"size-full wp-image-19823 alignleft\" style=\"margin-left: 0px;\" src=\"https://admin.crackintheroad.com/uploads/2013/04/diag1.jpg\" alt=\"\" width=\"500\" height=\"400\" /></a></p>\n<p>This one goes out to all the feminists worldwide! <a href=\"https://en.wikipedia.org/wiki/Emmeline_Pankhurst\" target=\"_blank\">Emmeline Pankhurst,</a> one of the most influential and pivotal figures in the struggle for women’s rights, rocked it out for all the single ladies in the early 20th Century, while Beyoncé is, well, Beyoncé. Ms. Pankhurst would be wild about the ex-Destiny’s Child diva, infatuated with how she is SMASHING down the walls of injustice.</p>\n<p>I might not be the foremost authority on Pankhurst or the Suffragette movement, but I can guarantee that everything would have gone smoother if she took a leaf out of Beyoncé’s book and hired someone to <a href=\"https://www.gq.com/women/photos/201301/beyonce-cover-story-interview-gq-february-2013\" target=\"_blank\">film her every waking moment</a>. This would have not only meant those pesky police officers couldn’t have roughed up the protestors, but also got to the core of what the Women’s Movement was really about; the opportunity for mindless vanity. Plus, I bet she’d have looked FABULOUS breaking those windows.</p>\n<p>Then, just have a quick think about how much quicker the Suffragettes would have achieved their aims if they combined their rhetoric with an improved public image. It’s like that interview where Beyoncé was all like:</p>\n<p><em>“You know, equality is a myth, and for some reason, everyone accepts the fact that women don’t make as much money as men do. I don’t understand that. Why do we have to take a backseat? I truly believe that women should be financially independent from their men. And let’s face it, money gives men the power to run the show. It gives men the power to define value. They define what’s sexy. And men define what’s feminine. It’s ridiculous.”</em></p>\n<p>And, in the accompanying photos was dressed all like:</p>\n<p><a href=\"https://admin.crackintheroad.com/music/21167-feature-beliebe-in-yourself/attachment/beyonce-gq-cover/\" rel=\"attachment wp-att-21168\"><img class=\"size-full wp-image-19823 alignleft\" style=\"margin-left: 0px;\" src=\"https://api.crackintheroad.com/images/2013/04/beyonce-gq-cover.jpg\" alt=\"\" width=\"409\" height=\"516\" /></a>And, after reading it, I was all like:</p>\n<p>“WOAH, BRAH, I DIDN’T KNO FEMINISM WAS SO SEXXXI”</p>\n<p>I have to say, it kinda upsets me that Emmeline Pankhurst wasn’t around to be influenced by Beyoncé. If she had been, she would’ve quickly realised that the only way to be a strong woman and enact positive change in a patriarchal society is to show a bit of skin for the lads.</p>\n<p><strong>Al Capone & The Strokes</strong></p>\n<p><a href=\"https://admin.crackintheroad.com/music/21167-feature-beliebe-in-yourself/attachment/diag2/\" rel=\"attachment wp-att-21292\"><img class=\"size-full wp-image-19823 alignleft\" style=\"margin-left: 0px;\" src=\"https://api.crackintheroad.com/images/2013/04/diag2.jpg\" alt=\"\" width=\"500\" height=\"400\" /></a></p>\n<p>Al Capone would have LOVED The Strokes. The O.G. bootlegger was born and raised in rough streets of Brooklyn and kicked out of school at 14, while The Strokes were also from New York, albeit via Swiss Boarding & Fancy Art Schools. The humble beginnings of The Strokes would have pleased the self-made-mobster and, as a well-dressed fellow, he would have definitely appreciated how SHARP they looked back in the day.</p>\n<p>I also think that Mr Capone would have truly emphasised with the Strokes’ career arc. The gangster was hugely successful and loved by the public until around the time he was involved in the <a href=\"https://en.wikipedia.org/wiki/Saint_Valentine%27s_Day_Massacre\" target=\"_blank\">Saint Valentine’s Day Massacre</a>. On the other side, The Strokes were hugely successful and loved by the public until around the time of <em>First Impressions Of Earth. </em>Which, to be fair to all parties, was probably worse than the slaughter. See! Uncannily identical lives.</p>\n<p>To further muddle the boundaries between them, Al Capone died in 1947 following a stroke.</p>\n<p><strong>Malcolm X & Vampire Weekend</strong></p>\n<p><a href=\"https://admin.crackintheroad.com/music/21167-feature-beliebe-in-yourself/attachment/diag3/\" rel=\"attachment wp-att-21298\"><img class=\"size-full wp-image-19823 alignleft\" style=\"margin-left: 0px;\" src=\"https://api.crackintheroad.com/images/2013/04/diag3.jpg\" alt=\"\" width=\"500\" height=\"400\" /></a></p>\n<p>If there was one thing that Malcolm X loved, it was white people. And who are the whitest white people around? Vampire Weekend! At the time of writing, and I doubt it’s gonna change any time soon, the two most successful artists to take “heavy influence” from Afro-Pop are Paul Simon and Vampire Weekend. This would have been an endless source of satisfaction for Mr. X; there’s nothing that man loved more than a bunch of crackers appropriating black culture and receiving vast financial rewards for it. Nothing. Well, unless Vampire Weekend got blacked-up in dashikis of course.</p>\n<p><strong>Genghis Khan & Morrissey</strong></p>\n<p><a href=\"https://admin.crackintheroad.com/music/21167-feature-beliebe-in-yourself/attachment/khan1/\" rel=\"attachment wp-att-21338\"><img class=\"size-full wp-image-19823 alignleft\" style=\"margin-left: 0px;\" src=\"https://api.crackintheroad.com/images/2013/04/khan1.jpg\" alt=\"\" width=\"500\" height=\"400\" /></a></p>\n<p>My god, would these two be the best buddies that the whole entire world has ever seen or what? Dinner time? No problem! Genghis Khan was a dedicated vegetarian. The warlord loved his salad and would have never, ever even dreamed of eating an animal. Violence? The Khan-meister couldn’t stand it. I can see the two of them now, hanging out in their pajamas and talking deep into the inky night about their feelings and peace and poetry and love and delicate things.</p>\n<p>Morrissey also famously declared the Chinese a <a href=\".https://www.guardian.co.uk/music/2010/sep/03/morrissey-china-subspecies-racism\" target=\"_blank\">“sub-species”</a> and this comment would have made Genghis punch the air in jubilation; he couldn’t stand those of an Asian descent either. Getting TOPICAL, they’d have both bonded over their dislike of Thatcher. One thing I can say with certainty is that there’s no way the Mongolian would have admired her; he hated fucking people.</p>\n","slug":"21167-feature-beliebe-in-yourself","category":"editorials","date":1366451889000,"wpid":21167,"isSticky":false,"featured_image":{"width":1280,"height":800,"src":"2013/04/callum-bieberxfrank-merged1-1280x800.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAGAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAUH/8QAIRAAAgEEAgIDAAAAAAAAAAAAAQIRAAMEBSExBhITQXH/xAAVAQEBAAAAAAAAAAAAAAAAAAADBP/EABkRAAMAAwAAAAAAAAAAAAAAAAABIQIiMf/aAAwDAQACEQMRAD8AzrQeY3kVU21tH11hh8luxaX2ZiSCeYmQOyZ6qZkbvDfIuuupxyrMSCxaTz9wYn8pSi4oU5bOn//Z"},"createdAt":1587283587910,"updatedAt":1588403530852,"author":"5e9b68b27a1236eccfeb1d11","old_image":"2013/04/callum-bieberxfrank-merged1-1280x800.jpg","categories":["editorials","music","opinion"]}