{"id":"5e9c33759b6559241525e06f","title":"Review: Cats and Cats and Cats – If I’d Had An Atlas","content":"<div>\n<p><strong><br />\n</strong></p>\n<p><strong>Cats and Cats and Cats</strong> is an ingenious band name when you come to think about it.</p><p> Cats have nine lives, therefore three cats would be twenty seven chances, so (or not so) logically speaking, this London based five piece will struggle to run out of attempts to succeed. Unfortunately for them and many of their fellow budding young artists, this is not the case; the majority of bands careers are firmly grounded upon their debut album, a seemingly unfair opinion to form, when you consider this is likely to showcase the group at their least experienced, not to mention with the lowest budget.</p>\n<p>All feline jokes aside, <strong>Cats and Cats and Cats</strong> are one of the most delightfully invigorating bands to emerge from London in recent years. Albeit, they are far from being the only band producing their genre of music at the moment, with the likes of <strong>Los Campesinos!</strong>, <strong>Dananananaykroyd</strong> and <strong>Johnny Foreigner</strong> fore-fronting the twee-core revival, there is still something instantly adorable about their simple yet infectious indie pop tunes. Album opener <em>If I’d Had Antlers </em>is an energetic and optimistic affair, filled with jovially played violins and raucous whilst at the same time somewhat tuneful singing. Sure, it’s been done before, but they aren’t pretending it hasn’t, <em>If I’d Had An Atlas </em>seemingly picks up the baton where<strong> Elle Milano</strong>so abruptly dropped it, and boy do they sprint with it.</p>\n<p>Standout track on the record is the epic <em>The Boy With The Beak</em>, which fantastically showcases all that is exciting and stimulating about the group. Utilising their vast array of instruments, as well as their varying forms of vocal delivery, lead singer <strong>Bongo Gong</strong> proclaims “<em>the boy with the beak stood up!</em>“. The violin solo is reminiscent of Welsh indie group <strong>Los Campesinos!</strong>, whilst the vocal harmonies which carry the latter part of the song are an extremely ambitious attempt to take the song to the next level.</p>\n<p>As with many of the recent twee artists, I still feel slightly disappointed that so few seem to successfully be able to draw from their supposed influences. A genre which apparently pulls so much inspiration from nineties emo bands, seems to lack that cutting emotional edge that was previously conjured up. <em>The Bee Knives</em> washes ineffectually over your head, despite it’s inclusion of some of the LP’s strongest lyrics; such as the magical “<em>through the air came wasps and bears, ants and antelopes and all you’ve ever seen in flight</em>“. There is no doubting the energy which has been forcefully injected into each and every song, however, the teenage angst which forms the basis for parts of the record, cannot be replicated throughout the entire album. Title track and album closer <em>If I’d Had An Atlas </em>starts positively, although again it’s a case of not quite finding the winning formula, and the song peters out into a less than memorable finish. Occasionally you get the feeling they have slipped rather ungracefully over the line between enjoyable jangly indie pop and a chaotic mess, yet where better for them to learn from mistakes than on their debut album.</p>\n<p>For each moment of sheer genius, there are almost as many of utter confusion, which at times makes for an intriguing and rewarding listen, despite making the album slightly less accessible for the first time listener. Far from a paw album, and tracks like <em>The Smallest Song </em>and <em>The Boy With The Beak</em> demonstrate the untapped potential <strong>Cats and Cats and Cats </strong>have, yet they are still several whiskers from indie pop purrfection.</p>\n<p style=\"text-align: center;\"><a href=\"https://www.myspace.com/catsandcatsandcats\">Check Out Cats and Cats and Cats Myspace!</a></p>\n<p style=\"text-align: center;\"><a href=\"https://www.functionrecords.com/shop/r23.html\">Buy If I’d Had An Atlas!</a></p>\n</div>\n","slug":"2126-review-cats-and-cats-and-cats-if-id-had-an-atlas-2","category":"music","date":1280338658000,"wpid":2126,"isSticky":false,"featured_image":null,"createdAt":1587295093495,"updatedAt":1587825935294,"author":"5e9b68b27a1236eccfeb1d27","categories":["music","reviews"]}