{"id":"5e9c0678774c2610387e4e98","title":"Feature: Five Things You Could Waste A Fiver On","content":"<p>This Thursday, also known as 25th April, Crack In The Road is putting on its first ever live show, the imaginatively-titled <a href=\"https://www.</p><p>facebook.com/events/525433147500120/?ref=ts&fref=ts\" target=\"_blank\">CitR Live #001</a>. For a measly £5 you can watch not only some of the buzziest buzz-bands about, but you also get to enjoy them surrounded by some arty stuff courtesy of MadeScapes^.</p>\n<p>Now, you may be thinking: “CitR Live sounds good and everything, but five pounds? I don’t think so”. If that’s indeed your train of thought, my reflex was to track you down and slap you upside-the-head, but, fortunately/unfortunately, lethargy halted this action shortly after inception. Even though physical inaction won the battle, I knew that something had to be done.</p>\n<p>Then, it hit me! If I put together a list of five things that are worse value for money than CitR Live, it would solve everybody’s problems.</p>\n<p>Shout out to Jimmy Wragg, whose blog is <a href=\"https://j-wragg.blogspot.co.uk/\" target=\"_blank\">here</a>, for putting together the cover image for the post. You can follow him on twitter with <a href=\"https://twitter.com/Sui42\" target=\"_blank\">@sui42.</a></p>\n<p> </p>\n<p><strong>A Pint</strong></p>\n<img class=\"alignnone\" alt=\"\" src=\"https://www.tamarachristensen.com/uploads/2012/10/pint.jpg\" width=\"300\" height=\"400\" />\n<p>Yeah, okay, so a pint might only cost a fiver in (reasonably) swanky central London bars, but still, a fiver?! Fuck off. If you’re going to spend your money on alcohol, rather than watching <a href=\"https://jamieisaac.bandcamp.com/\" target=\"_blank\">Jamie Isaac</a> rip it up, then show a little bit of sense and grab yourself a few cans of Special Brew or, at the very least, a bottle of Frosty Jacks. #classy4LYF</p>\n<p> </p>\n<p><strong>Five Packs Of Premier League Football Stickers</strong></p>\n<img class=\"alignnone\" alt=\"\" src=\"https://www.theintoy.co.uk/images/images_big/premfull.jpg\" width=\"500\" height=\"500\" />\n<p>To be fair, five pounds would buy you quite a few stickers. The real problem is that, although you might get close to fifty stickers, you’re really only just scratching the surface of one of those ridiculous-sized annuals you have to stick them all in. Plus, I can guarantee that, of those five packs, over half of them are gonna be doubles. Even if they’re your first stickers of the season.</p>\n<p> </p>\n<p><strong>A Single Peak Ticket From Neasden To Plaistow</strong></p>\n<img class=\"alignnone\" alt=\"\" src=\"https://www.mytrainticket.co.uk/admin/image-resizer.php?w=508&h=260&keepAspect=y&crop=y&img=project/uploaded-media/travelcard.jpg\" width=\"508\" height=\"260\" />\n<p>Firstly, why would anyone want to travel from Neasden to Plaistow in the first place? Secondly, why anyone would shell out almost a fiver for that abortion of a journey? It’s not even like travelling on the tube is a pleasant experience; all you’re gonna get is a sore arse and a strong smell of piss.</p>\n<p> </p>\n<p><strong>Two iPhone Cases That Look Like Cassette Tapes<br />\n</strong></p>\n<img class=\"alignnone\" alt=\"\" src=\"https://technabob.com/blog/wp-content/uploads/2010/06/iphone_cassette_case.jpg\" width=\"600\" height=\"630\" />\n<p>I’m not confident that having two iPhone cases would be all that useful, but I guess you could double-up for extra protection (HA!). Anyway, I never really “got” the whole making your phone look like a tape thing. Do people think that if they get mugged the robber will just leave them alone because they’re confused about why they’re carrying round a tape?</p>\n<p> </p>\n<p><strong>A Three Piece Combo Meal From Your Local Chicken Shop<br />\n</strong></p>\n<img class=\"alignnone\" alt=\"\" src=\"https://www.clevescene.com/binary/24e3/1292358458-fried-chicken.jpg\" width=\"430\" height=\"300\" />\n<p>Okay, you’ve got me, this is actually better than the gig.</p>\n<p> </p>\n<p>There you have it! The shameless plugging is over and, hopefully, I’ve convinced you of the positive impact that coming to CitR Live #001 will have on your life. The Facebook page for the event can be found <a href=\"https://www.facebook.com/events/525433147500120/\" target=\"_blank\">here,</a> while you can grab tickets from <a href=\"https://www.residentadvisor.net/event.aspx?466892\" target=\"_blank\">Resident Adviser</a> or <a href=\"https://www.wegottickets.com/event/216179\" target=\"_blank\">WeGotTickets</a>. Go on, you know you want to.</p>\n","slug":"21385-feature-five-things-you-could-waste-a-fiver-on","category":"editorials","date":1366789941000,"wpid":21385,"isSticky":false,"featured_image":{"width":1280,"height":800,"src":"2013/04/trippy-bank2-1280x800.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAGAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAQF/8QAIBABAAIBAgcAAAAAAAAAAAAAAQIDAAURBAYSIUFhcf/EABUBAQEAAAAAAAAAAAAAAAAAAAED/8QAGBEBAAMBAAAAAAAAAAAAAAAAAQADEUL/2gAMAwEAAhEDEQA/ANvTdTr6LZ10FMAa5NakpRN9vPrIznbiogISTtvKuKv3GMlUaax5J//Z"},"createdAt":1587283576837,"updatedAt":1588403530667,"author":"5e9b68b27a1236eccfeb1d11","old_image":"2013/04/trippy-bank2-1280x800.jpg","categories":["editorials","life","opinion"]}