{"id":"5e9c0680774c2610387e4ea7","title":"Artist Profile: Dante Rendle Traynor","content":"<p>It’s the side splitting humour that initially hooks you in to <strong>Dante Rendle Traynor</strong>’s work, upon browsing the Internet, I see an image of a bald man with a shaving foam beard and I’m sold.</p><p> He has an intriguing voice and has a little art for everyone. Little did I know that this is all a clever ruse in order for me to scrutinise some artwork. I did, repeatedly, just as the bald man said.</p>\n<p>The matter of how we view art has been hanging over our heads for decades, but as we come to what I perceive as the latter half of the conceptual movement, things are beginning to change. As the numbers of artists and galleries continue to grow, I wonder what it is that actually draws our attention amongst his information overload we find ourselves in as the future of art draws near. Several artists and curators are now taking new approaches to show art in countless different lights. I for one am extremely intrigued by these new projects. Though all of these different endeavours beg the question. How do we entice our audience?</p>\n<p>Traynor’s flawless presentation skills seem to be the primary medium of his work. Whether it’s the spangliest looking experimental lounge act I’ve ever seen: <b>The Golden Boys</b>, a half an hour radio show discussing the definition of ‘cheese’ (not the one you’re thinking of!) or an improvised performance on a white cardboard piano. You’ll come out the other side having learnt something you might’ve not considered before. Which is the point of art, right?</p>\n<p>His practice seems to incur the more traditional methods viewing artwork. See it first, think about it later, but using today’s hyper modern imagery that we’re all drawn to like magpies.</p>\n<p>Dante and The Golden Boys will be luring audiences to an evening of performances; <i>Traces of Action/ Creation of Acts</i> at <b>Parasol Unit</b> on the 2<sup>nd</sup> May 2013</p>\n<p>For more information about Traces of Action click <a href=\"https://www.parasol-unit.org/traces-of-action-creation-of-acts\">HERE</a>.</p>\n<p>For more of Dante’s work click <a href=\"https://www.danterendletraynor.com/index.html\">HERE</a>.</p>\n<p>OMG its the bald guy! <em>Something for Everyone, 2011</em></p>\n<p><iframe src=\"https://player.vimeo.com/video/39527952\" width=\"500\" height=\"281\" frameborder=\"0\" title=\"Something For Everyone (extract), Dante Rendle Traynor, 2011\" webkitallowfullscreen mozallowfullscreen allowfullscreen></iframe></p>\n","slug":"21394-artist-profile-dante-rendle-traynor","category":"arts","date":1366651532000,"wpid":21394,"isSticky":false,"featured_image":{"width":685,"height":491,"src":"2013/04/cheese-edited.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAYH/8QAIhAAAwABAwMFAAAAAAAAAAAAAQIDAAQRIQUGBxITFSJR/8QAFQEBAQAAAAAAAAAAAAAAAAAABAX/xAAaEQACAgMAAAAAAAAAAAAAAAACEQABA2GR/9oADAMBAAIRAxEAPwCj1vkefxNGDVh7qtEP6fsjLuONv0g85m8O6eh6eE42vd6zUI7CJ5IGxOMZIDBSTvseRan/2Q=="},"createdAt":1587283584765,"updatedAt":1588403530800,"author":"5e9b68b27a1236eccfeb1d17","old_image":"2013/04/cheese-edited.jpg","categories":["arts"]}