{"id":"5e9c33719b6559241525e069","title":"Review: Everything Everything – Man Alive","content":"<img class=\"alignnone\" title=\"man alive\" src=\"https://sphotos.</p><p>ak.fbcdn.net/hphotos-ak-ash2/hs098.ash2/38237_422404896496_30224406496_5056699_5323659_n.jpg\" alt=\"\" width=\"720\" height=\"720\" />\n<p>If you’re not a fan of erratic time signatures, harmonies in high registers and fast abstract lyrics then maybe this is not for you but if you are and you have time and patience to spare then you may find something special here.</p>\n<p>Man Alive is almost daring you to put it in a box, to define it or to summarise it. It expects you to dismiss it on first listen and it’s fine with that, it was made to reveal itself after repeated plays and perseverance. There are moments here that stick out first time but there’s a lot that seems to fall flat and that’s mainly because there’s a lot going on. There <em>is</em> an overarching theme of the duality between life/death & man/machine but there are also a lot of, on face value, nonsensical visuals portrayed in the lyrics.</p>\n<p>It’s been a while since I’ve seen such a risk taken from a record label, there aren’t really any clear singles on this album and the genre changes almost song to song. From the beautiful piano ballad of <em>NASA Is On Your Side</em> to the Queen-like harmonies of album closer <em>Weights, </em>there’s a lot of variety and invention going on here. It’s a massive risk for the band too as the singles are largely unrepresentative of the album as a whole, they are relegated to being the ‘fast’ songs while the new songs tend to be slower and more restrained.</p>\n<p>That’s not to say they are the only energetic songs on the album, <em>QWERTY Finger</em> and <em>Come Alive Diana </em>both feed off the same frenetic energy as<em>Photoshop Handsome</em> with the latter featuring a fantastic moment when things quieten down just as horns kick in. The slower songs are just as much of a delight if not more, <em>Tin (The Manhole)</em> is where the vocals and the music come together in what sounds like a soundtrack to a lucid dream and it’s the moment Man Alive transcends everything you’ve heard from them beforehand.</p>\n<p>The biggest compliment I could probably lay upon this album is that it sounds like nothing else. They do nothing revolutionary technically or lyrically but the compositions and arrangements of the songs are truly unique and refreshing to hear.</p>\n<p>Everything Everything have collected a melting pot of influences, sounds and styles and have cooked up something terrifically unique and exciting. Man Alive breathes life back into a stolid and boring music scene and challenges it to evolve into something better.</p>\n","slug":"2180-review-man-alive","category":"music","date":1280422740000,"wpid":2180,"isSticky":false,"featured_image":{"width":720,"height":720,"src":"2011/06/38237_422404896496_30224406496_5056699_5323659_n.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAABwUG/8QAJRAAAgEDAwIHAAAAAAAAAAAAAQIDAAUGERIhBCIHI0FTYXKS/8QAFQEBAQAAAAAAAAAAAAAAAAAABAX/xAAdEQACAgEFAAAAAAAAAAAAAAABAgMRAAQFEmHh/9oADAMBAAIRAxEAPwA1xzC4birG9Sz9LGWi3ShVZkTd3bV9eKXY/AjB5Y1kjv122MAy6vGDofgpWUw3us4LcnzOT9hVQzze7J+jSpNNzohiMsybMkTlLuuvc//Z"},"createdAt":1587295089029,"updatedAt":1588403565108,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/06/38237_422404896496_30224406496_5056699_5323659_n.jpg","categories":["music","reviews"]}