{"id":"5e9c063d774c2610387e4e4a","artists":["5e9b68e57a1236eccfeb1f74","5e9b694b7a1236eccfeb25bb"],"title":"New: Tall Ships – Phosphorescence (Deafkid remix)","content":"<p>It’s a tough call.</p><p> But I don’t <em>care </em>if <em>Best</em><i> Ever</i>’s bonkers twiddle-rock<i> </i>still splits my face in half on every listen. Or indeed that <i>Gallop </i>is probably the most exuberant song about aging that I’ve ever had the pleasure of hearing,<i> </i>makes humanity’s debilitating fear of ever-encroaching time sound like something to celebrate. Because the best thing about <b><i>Everything Touching </i></b>is still <a title=\"Like Ronseal.\" href=\"https://www.youtube.com/watch?v=YauB3cPgI_Y\">the way that it ends</a>.</p>\n<p><em>Murmurations, </em>the song that closes <a href=\"https://wearetallships.co.uk/\">Brighton-via-Cornwall bros</a> <strong>Tall Ships</strong>‘ first full-length,<i> </i>is nine and a quarter minutes of slow-building arpeggios and percussive clatters, looped over a four-to-the-floor beat somewhere around 130bpm. A house beat. The whole thing ascends teasingly skyward until the 6-minute mark, whereupon it bursts everywhere in a glorious Technicolor splatter. There’s probably a choir in there. It’s one of the best approximations of actual dance music I’ve ever heard a band with guitars make.</p>\n<p><iframe src=\"https://w.soundcloud.com/player/?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F90600776\" height=\"166\" width=\"100%\" frameborder=\"no\" scrolling=\"no\"></iframe></p>\n<p>So that album track <em>Phosphorescence </em>has been given a groovealicious redux by <strong>Deafkid </strong>–<a href=\"https://www.deafkidband.com/\"> the duo partly responsible</a> for the production on <em><strong>Peanut Butter and Melancholy Jam</strong></em> –<strong> </strong>makes perfect sense to me. The chaply-monikered Christopher Lockington and Florian Sauvaire (for it is they) haven’t opted for the <a title=\"For example, the Field's frankly incomprehensible take on One Armed Scissor\" href=\"https://stereogum.com/1306522/at-the-drive-in-one-armed-scissor-the-field-remix/mp3s/\">total immersion approach</a> – at the outset, they’re content to keep vocal lines front and centre, over a sparkling loop not exactly 12 parsecs from Tall Ships’ usual <em>modus operandi</em>. But from a minute in, <em>Phosphorescence </em>is<em></em> reimagined as something slinking and soulful, driven by warm keys, a techy beat. The once-robust coda of <a title=\"Kind of the aural equivalent of a happy Labrador puppy.\" href=\"https://soundcloud.com/tallships/phosphorescence\">the lolloping, bloopy original</a> goes woozy on the back of some ket-addled synths, voices echoing mournfully through a tunnel of clicks and claps. It’s pretty great.</p>\n<p>Tall Ships are playing at Concord 2 on May 18th (that’s next Saturday), as part of the Rock Sound showcase at <a href=\"https://mamacolive.com/thegreatescape/\">The Great Escape</a>. If anyone wants to buy me a ticket, that’d be swell.</p>\n<p> </p>\n","slug":"21814-new-tall-ships-phosphorescence-deafkid-remix","category":"music","date":1368188465000,"wpid":21814,"isSticky":false,"featured_image":null,"createdAt":1587283517915,"updatedAt":1588441766611,"author":"5e9b68b27a1236eccfeb1d3c","old_image":"generated/5901c6437bbeea72031dff884b89c843817e3aed.jpg","categories":["music","remixes","new"]}