{"id":"5e9c063a774c2610387e4e48","artists":["5e9b68ec7a1236eccfeb2002","5e9b69117a1236eccfeb21fe"],"title":"MPFree: Count Your Lucky Stars Records puts entire discography up for FREE download.","content":"<p>If mentioning the genre ’emo’ conjures up memories of teenage boys squeezed into pairs of their little sisters jeans, sporting neon-coloured fringes and an unhealthy obsession for Gerard Way; then congratulations, you have fell foul of the subversion of the label! Once upon a time, in the late ’90s, Emo was used to address the rising selection of American Mid-Western bands – the indomitable Kinsella brothers and their bands Cap’n Jazz & American Football spearheaded this movement.</p><p> Followed by other angst riddled guitar noodling in the form of Mineral, The Promise Ring, I Hate Myself and many others. Offering up angst filled sonnets reminiscent of the preceding Grunge era and in direct countenance to the then current trend of Nu-Metal and Rap that was prevalent.</p>\n<p>These flashes in the pan were popular on a local scale but eventually drifted into relative obscurity until the rise in prevalence of online music sharing, soon a whole new generation were drawing inspiration from the scene and creating their own lo-fi caterwauling.</p>\n<p>Capitalising on this was Count Your Lucky Stars, a label set up in 2007 to amalgamate this burgeoning resurgence, and they have achieved this with gusto: signing reformed emo pioneers such as <strong>Kind of Like Spitting</strong> as well as arguably one of the best of the current crop <strong>Empire! Empire! (I Was a Lonely Estate)</strong>.</p>\n<p>To thank the fans for their support over the years <a href=\"https://countyourluckystars.bandcamp.com/\">Count Your Lucky Stars have put up their entire digital discography for free/pay-what-you-want download for the next 7 days</a>. Be sure to head on over and redefine your initial forebodings of the genre!</p>\n","slug":"21827-mpfree-count-your-lucky-stars-records-puts-entire-discography-up-for-free-download","category":"mpfree","date":1368468413000,"wpid":21827,"isSticky":false,"featured_image":null,"createdAt":1587283514365,"updatedAt":1588441766555,"author":"5e9b68b27a1236eccfeb1d25","old_image":"generated/67811d8e463ba78f09a03a4251fb57d0e3687881.jpg","categories":["mpfree","news","music"]}