{"id":"5e9c33579b6559241525e049","title":"Review: Eurockeennes Festival","content":"<p>Leaving <strong>Hove Festival </strong>behind us, we began our 16 hour journey to <strong>Eurockeennes Festival </strong>in Belfort, France.</p><p></p>\n<p>After several flights, countless bus journeys and a considerable number of coffees, we found ourselves on a train from Basel train station bound for Belfort. On that train we befriended two seasoned Scottish festival go-ers, <strong>Colin </strong>and <strong>Brian</strong>, who we were to spend the rest of the festival camping with until <strong>Leo</strong>, a Swiss motion designer, also joined the fold. I’d like to take the time to thank <strong>Colin, Brian and Leo </strong>for being fantastically welcoming and funny individuals, who were delightfully interesting to talk to.</p>\n<p>On arrival in Belfort we were slightly taken aback to find a quiet, slightly backwards French village, surely no place for one of Europes largest music festivals? After deciding that Hove has layered us with dirt and sweat, we luckily managed to check into one of the few remaining hotel rooms in Belfort. Post showers, we found a bourgeois paradise within Belfort. There were restaurants lining the river that runs through the city, with dozens of people smoking gauloise and drinking fine wine in the terrace gardens. As we left from our pleasant pizza meal, the waiter told us that ‘one of Bob Marley’s guitarists’ was playing in a jazz cafe nearby. Somewhat bewildered, we let our curiousity get the better of us and before we knew it we were standing in a bar adorned with music memorabilia. Entering conversation with a group of foreign workers, one of which kindly worked as our translator, we met an eccentric old man who would occasionally burst into Chuck Berry impersonations while never leaving the shroud of his own cigarette smoke. Managing a few understood translated sentences and a few laughs later, a sole guitarist wandered onto the stage and broke into an entertaining set of jazz guitar riffs and raw vocals. Never breaking between tracks, and one very eager photographer tracking his every move, the guitarist created an intimate atmopshere in the bar, and even managed to subdue the spontaneous Chuck Berry impersonations. While we never confirmed whether this man had played with, or even met, Bob Marley, I am more than happy to remain in the naive belief that he did.</p>\n<p>The morning after our night in Belfort, we headed down to the festival and set up camp. The campsite itself was fantastically spacious, which made a change from the overcrowded scenes of most British festivals of a similar size to that of Eurockeennes. The festival arena itself benefitted from being situated around a picturesque lake, with one stage located right on the beach and flanked by bars. The main stage was a huge affair, which Jay-Z would make seem even larger – more on that later. For the rest of the site, it was a delightful mix of bars, good food outlets and plenty of space to sit down and enjoy the glorious weather. When we explored the press area, we discovered that <strong>Bench </strong>were sponsoring the festival and we ended up spending many interesting and hilarious nights with <strong>John </strong>from <strong>Bench</strong>, and his two mates <strong>Andy </strong>and <strong>Phil</strong>.  Many thanks are owed to them for their hospitality and their great company! Across the weekend we saw various bands and met lots of friendly faces, however if you’ve read this far then you deserve to know about our highlights from the weekend.</p>\n<p><strong>Jay Z:</strong></p>\n<p>The headline act that kicked off the festival, <strong>Jay Z</strong>‘s performance was nothing short of the most entertaining, engaging and professional performance I have ever seen in my life. Already 10 minutes late, a 10 minute countdown appeared suddenly on the huge screens. Never having been a fan of artists who appear late for their set, I found this clear recognition of tardiness a horrific egotistical display. However when the counter reached zero, I realised how naive I had been; <strong>Jay Z</strong> can afford to be as egotistical as he wants. Immediately he gathered the crowd’s attention and controlled the stage superbly, working through a set full of old classics as well as newer tracks. There were even stunning visuals hand crafted to each particular track. However for all the skill and majesty of <strong>Jay Z</strong>‘s performance, it was noticeable that the hip hop heavyweight isn’t getting any younger.<strong> </strong>Whoever is destined to eventually take over from him, <strong>Jay Z </strong>will be a very hard act to follow.</p>\n<p><strong>Two Door Cinema Club:</strong></p>\n<p>Gracing the beach stage, <strong>Two Door Cinema Club </strong>performed a competent set that was unfortunately plagued with a few problems (more on that in our interview with the band). Having seen the band perform live only a few days previously at <strong>Hove Festival</strong>, the band played an identical set with the same upbeat energy that had gained the band so many fans in Norway. However at <strong>Eurockeennes </strong>the band may have suffered from the fate of an early set on a smaller stage, as there was a great deal less engagement with the crowd and much more of a sense that this was just another set for the band. Despite this, <strong>Two Door Cinema Club </strong>managed to get the French beach dancing and continue to move from strength to strength in their indie pop journey.</p>\n<p><strong>Broken Social Scene:</strong></p>\n<p>Another band that was billed far too early in the day, <strong>Broken Social Scene </strong>still performed a fantastic set in the blazing sun on the Main Stage. For a group that has gone through various line up changes over their history, <strong>Broken Social Scene </strong>still managed to display a great level of synchronicity as they played tracks ranging from the classic to those from ‘Forgiveness Rock Record’.</p>\n<p><strong>LCD Soundsystem:</strong></p>\n<p>After announcing that ‘This is Happening’ could be the final album from <strong>LCD Soundsystem</strong>, I expected a massive performance but was left sadly disappointed. While the band were infused with energy, their performance seemed somewhat static and underwhelming. Perhaps a lack of visuals and the tired looking dancing of frontman James Murphy added to this. However on the whole, especially when the classics were played, <strong>LCD Soundsystem </strong>performed a good set.</p>\n<p><strong>The Drums:</strong></p>\n<p>A reasonably stripped back performance by <strong>The Drums </strong>on the Main Stage was well received by the French crowd, who enjoyed the melodic tracks and eccentric movements of lead singer <strong>Jonathan Pierce</strong>. Very much a band still in development, <strong>The Drums </strong>were competent, and even entertaining, to watch and showed a great deal of promise to become a band with the sound of Morrissey, but far less depressing.</p>\n<p><strong>My Own Private Alaska:</strong></p>\n<p>A French trio who have infused <strong>Chopin </strong>with <strong>Korn</strong>, <strong>My Own Private Alaska </strong>provided by far the most intense set of the festival. The pianist at times appeared to be enduring musical orgasms, while the lead vocalist would be on his knees screaming at paintings positioned around the stage. Most impressively through all of this screaming and ear drum bursting percussion, <strong>MOPA </strong>still managed to sound musically good. After finishing a set that looked more exhausting than <strong>Eddie Izzard</strong>‘s ridiculous marathon challenge, there was a huge roar from the loyal French support; a sign that I’d say recommends you check them out.</p>\n<p>As we reached the end of the festival, we realised how lucky we had been to meet the people we had met and experience the bands that we had. European festivals are a very different experience to British festivals, and while that we are lucky to be spoiled for choice with festivals in the UK, I personally recommend you act on any sense of adventure you may have and go further afield.</p>\n<p>5 countries, 2 Festivals, 1 week. Amazing.</p>\n","slug":"2184-review-eurockeennes-festival","category":"festivals","date":1281455243000,"wpid":2184,"isSticky":false,"featured_image":{"width":3456,"height":2304,"src":"2010/07/img_9807.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAQH/8QAIBAAAgAGAgMAAAAAAAAAAAAAAQIAAwQFBhEHNZPh8P/EABQBAQAAAAAAAAAAAAAAAAAAAAD/xAAYEQEBAAMAAAAAAAAAAAAAAAABAAIRUf/aAAwDAQACEQMRAD8Al41tV6xjNae608pHpZalXRmQMwYDY2B9qNwPIFUD1Uvz+oQgO44cb//Z"},"createdAt":1587295063671,"updatedAt":1588403564902,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2010/07/img_9807.jpg","categories":["festivals","music","reviews"]}