{"id":"5e9c336d9b6559241525e065","title":"Interview: AJ Unity","content":"<img class=\"alignnone\" title=\"AJ Unity\" src=\"https://c1.</p><p>ac-images.myspacecdn.com/images02/121/l_dfd6f4b733a447fa8728e8123e2897f4.jpg\" alt=\"\" width=\"600\" height=\"899\" />\n<p>Naomi Suzuki and Philipp M. Moll aka <strong>AJ Unity</strong> are one of the hottest UK trip hop influenced artists around at the moment. After the releasing their debut album <em>Sweet Roses</em>, at the start of the year, there is a growing buzz building around the duo. Drawing together numerous genres such as pop, electronica and dance, the record is a mystical and phenomenal atmospheric collection of songs. <em><strong>Crack in the Road </strong></em>were lucky enough to catch up with the duo, who generously answered a few questions for us.</p>\n<p><em>Crack in the Road: For those new to AJ Unity’s music, how would you describe your sound to them, and which artists would you say had the largest effect on shaping your sound?</em></p>\n<p><strong>Dreamy, ethereal and ultimately soothing – AJ Unity’s ‘Sweet Roses’ will help chill out your summer when needed, served with an icy bottle of Cava. The duo draw their influences mainly from artists such as Massive Attack, Morcheeba, Air and Ryuichi Sakamoto.</strong></p>\n<p><em>CitR: What has been your favourite gigging experience to date?</em></p>\n<p><em> </em><strong>Royal Albert Hall, supporting Simply Red.</strong></p>\n<p><em>CitR: How has the increasing use of programs such as Spotify, as well as the rise of illegal downloading affected yourselves, both as musicians and as fans?</em></p>\n<p><strong>Spotify offers immediate and global access to music. As studio musicians and live performers, this has been an invaluable device for the purpose of research and reference. For music fans, a dream has come true. Obviously, the platform has also helped decrease the profits made from physical sales, which isn’t helpful for artists trying to establish themselves. Promotional value – when used cleverly – can be good; all in all a give & take situation.</strong></p>\n<p><em>CitR: In another interview you claimed to have broken several world records during the making of your debut, could you possibly elaborate on these?</em></p>\n<p><strong>Philipp didn’t sleep for 5 weeks – this is how long it took us to finish the record from scratch. Naomi is probably the first singer ever to record in English and Japanese whilst doing a handstand</strong></p>\n<p><em>CitR: Do you have any tips for other up and coming UK artists?</em></p>\n<p><strong>Don’t try and copy someone else – be original – be yourself. Get an amazing drummer!</strong></p>\n<p style=\"text-align: center;\"><a href=\"https://www.myspace.com/ajunity\">Check Out AJ Unity’s Myspace!</a></p>\n<p><strong><br />\n</strong></p>\n","slug":"2207-interview-aj-unity","category":"interviews","date":1280484300000,"wpid":2207,"isSticky":false,"featured_image":{"width":600,"height":899,"src":"2011/06/l_dfd6f4b733a447fa8728e8123e2897f4.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAPAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAABQAG/8QAJBAAAQQBAwMFAAAAAAAAAAAAAQIDBAURAAYSFCExB1FhkdH/xAAUAQEAAAAAAAAAAAAAAAAAAAAD/8QAGxEBAAICAwAAAAAAAAAAAAAAAQACAxEhMVH/2gAMAwEAAhEDEQA/AAtvMqvLc1NVEitvOyOnSp1QSUhCOThGexyCMD80DYVEKLPkx5KCl9p1SHEgZAUCQR96vTrckal3xWWE0hLfVOvHspXFSjwwPPkY741rLrcux5lxPkmzeBefccx0KjjKiff50mWtaprwhYVsPHTP/9k="},"createdAt":1587295085954,"updatedAt":1588403565082,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/06/l_dfd6f4b733a447fa8728e8123e2897f4.jpg","categories":["interviews","music"]}