{"id":"5e9c0600774c2610387e4e15","artists":["5e9b69117a1236eccfeb2259"],"title":"Interview: LAW","content":"<p style=\"text-align: center;\"><em>Win Tickets To See LAW At CitR Live #002 <a href=\"https://admin.</p><p>crackintheroad.com/music/22058-win-tickets-to-citr-live-002/\" target=\"_blank\">Here</a>.</em></p>\n<p style=\"text-align: left;\">httpv://www.youtube.com/watch?v=-Rm4ZlFSieA</p>\n<p>LAW is one of the most exciting artists to debut this year. Her songs are little islands of melancholy, held together with smoky vocals and glittering beats, while her videos display a keen aesthetic eye.</p>\n<p>The Edinburgh-based musician is also headlining CitR #002 and we managed to catch-up with her for a chat before she plays at our showcase.</p>\n<p><strong><strong>First off, I’d like to say how excited everyone is at Crack In The Road for you to be headlining our second ever live event.</strong></strong></p>\n<p><strong><strong></strong></strong>Thanks! I’m looking forward to it.</p>\n<p><strong>So, how long have you been playing music for?</strong></p>\n<p>I’ve been singing for quite a long time and been in bands for a couple of years.</p>\n<p><strong>Did you play in anything I’d recognise?</strong></p>\n<p>Not really, it was more local things. It was an opportunity for me to get used to playing live with musicians and learning, not really something to be pushing. Singing covers and things, but I think you need to do that at some point.</p>\n<p><strong>Yeah, I have to agree. So, who would you say your biggest influences are?</strong></p>\n<p>I like the old singers, Bessie Smith especially, a lot of the jazz singers. I’m into new stuff as well, lots of indie bands like Pavement and I’m listening a lot to the new Deerhunter album.</p>\n<p><i>Monomania</i> is a fantastic album. I’ve got to say, I was really impressed with how Deerhunter took a completely different direction than expected.</p>\n<p>I think it takes a lot of balls to do that, too many people say “oh, it’s working, we’ll keep doing that”. Artists should reinvent I think, they should keep moving with what they’re doing.</p>\n<p><strong>Exactly, Bradford Cox could have made <em>Microcastle </em>again and again, but chose to expand his sound.</strong></p>\n<p>I went to see them when their <em>Halycon Digest</em> was out and, at the end, they did a guitar drone for like forty minutes and drove everyone out. There was just me and like 5 other people watching. Finally, everyone just left. And I like my hip hop, like MF Doom, he’s coming to London isn’t he?</p>\n<p><strong>He is! The only thing is you can never be sure it’s actually him. I’ve heard that he just sends random people on stage with the mask on.</strong></p>\n<p>I heard about that, he’s cool, isn’t he? He’s so good he can do what he wants.</p>\n<p><strong>I really liked your video for ‘Hustle’, what were you trying to achieve and did anyone influence it?</strong></p>\n<p>We tried to make it strange as possible! Young Fathers influences it a lot as well, they go for this VHS look that’s really grainy and we used that effect. We tried to give the video a weird and creepy vibe. I think, with a female artist, it’s good to do it a bit blurry and not too “look at my tits”, so it has something about it, rather than just “OH HI!”.</p>\n<p>httpv://www.youtube.com/watch?v=FLzJKZkiEyY</p>\n<p><strong>Do you have anything geared up to release?</strong></p>\n<p><strong></strong>We’re definitely gonna release something, we have an albums worth of material ready, but we need to decide what format it comes out on. There are songs waiting, it just depends on what happens and how things progress. Both an EP and an album are good options, but, as we have enough material, we can be a bit loose with what happens.</p>\n<p><strong>How would you describe your sound in one sentence?</strong></p>\n<p><strong></strong>“What just happened?”</p>\n<p><strong>I was browsing online and saw a comment that you described you as “Billie Holiday & Joe Strummer’s Jamaican daughter”, what do you reckon? </strong></p>\n<p><strong></strong>Ha! That’s nice, those are both great people.</p>\n<p><strong>Yeah, I thought it was a good way of looking at it.</strong></p>\n<p><strong></strong>It’s a great way of looking at it! I’m just gonna take that quote and use it. I’ll find who said it and give them a bit of money!</p>\n<p><strong>What do you think your next move will be?</strong></p>\n<p><strong></strong>I’ve got a few gigs lined up, so I guess the main focus is getting the live show up-and-running and then, I think, get a new music video out. After that, I’m going to release some tracks from the album.</p>\n<p><strong>How does your live set work?</strong></p>\n<p><strong></strong>It’s just me, a laptop, auto-harp and other little bits of equipment.</p>\n<p><strong>A friend wanted me to ask about the auto-harp. It’s not a particularly common instrument and, as she plays one, she wanted to know how you started with it.</strong></p>\n<p><strong></strong>It was just something that I picked up in the studio. I never had the discipline when I was growing up to play the guitar or piano. One day, Tim, my manager, asked me to give it a go to see if I could find something.</p>\n<p>It’s an amazing instrument because you can build things around the chords. It’s a great looking thing to take on stage and, as you say, it’s unusual, so people are intrigued by it. And it makes a beautiful sound. It’s hard though, I broke a string and you can’t get these strings; you have to go to these Irish places to get a replacement.</p>\n<p><em id=\"__mceDel\"></em><strong>Thanks for your time!</strong></p>\n<p> </p>\n<p>CitR Live #002 is on at the Bussey Building in Peckham on the 30th May. The Facebook page is <a href=\"https://www.facebook.com/events/503640323024237/\" target=\"_blank\">here</a> and you can <a href=\"https://www.wegottickets.com/event/222572\" target=\"_blank\">buy tickets online</a> or at the door..</p>\n<p>You can find LAW’s twitter <a href=\"https://twitter.com/LAWHOLT/\" target=\"_blank\">here</a> and her website <a href=\"https://www.lawholt.com/\" target=\"_blank\">here</a>.</p>\n","slug":"22142-interview-law","category":"interviews","date":1369769250000,"wpid":22142,"isSticky":false,"featured_image":{"width":971,"height":767,"src":"2013/05/screen-shot-2013-05-28-at-20.29.17.png","placeholder":"data:image/jpeg;base64, iVBORw0KGgoAAAANSUhEUgAAAAoAAAAICAIAAABPmPnhAAAACXBIWXMAAAsTAAALEwEAmpwYAAABA0lEQVR4nAH4AAf/AGRTP3hkR4VvS494TpR9UZJ/UX1fPm5UN21gPkxELQBpWUSAa0yTe1WehFqiiFeHaj99VzR+YUBzZ0ZTSjIAcV5HjHRSqpyTrJt4uYxQq3A7VDsklm9Bf2lBXVM3AHdhSJB5YZycq6eXccmbV6N7UmVSOKCDUHFVMVREKgB8ZUqRe1qhjGqpjFqueTxuVzt7a0ahkFhxWzJIOSQAZlM7c2BAhG5HrI5PhV0xVkEpbF49V00zUUQtVUwxAEg9K0Y6J0g6LIt2Rl5FJkc1I2xaNVNKM0lBLTUuHQBDOis0KB9BNCtXRC9eQipLNyVFOipSSjJDOygxKx8EQFZSg/w+VQAAAABJRU5ErkJggg=="},"createdAt":1587283456645,"updatedAt":1588403529894,"author":"5e9b68b27a1236eccfeb1d11","old_image":"2013/05/screen-shot-2013-05-28-at-20.29.17.png","categories":["interviews","music"]}