{"id":"5e9c336c9b6559241525e064","title":"Interview: Cats and Cats and Cats","content":"<img class=\"alignnone\" title=\"Cats and candc\" src=\"https://c4.</p><p>ac-images.myspacecdn.com/images02/152/l_7f9854542cda4561b6f9a39b6876f61b.jpg\" alt=\"\" width=\"600\" height=\"400\" />\n<p>Having already received rapturous reviews from the likes of NME, Drowned in Sound and Steve Lamacq, there is no doubting that <strong>Cats and Cats and Cats</strong> are clawing their way to bigger and better things. Having released their debut LP earlier this year, as well as featuring at numerous festivals over the summer, there is something undeniably loveable about the band. Cute, twee lyrics combined with their love of obscure and haphazard times signatures, allows a creative and interesting composition to be produced. Following on from our<a href=\"https://api.crackintheroad.com/music/2126-review-cats-and-cats-and-cats-if-id-had-an-atlas-2\"> review </a>of their debut album <em>If I’d Had An Atlas</em>,<em><strong> Crack in the Road</strong></em><strong> </strong>caught up with the guys to find out about the recording of the LP, their future aspirations, as well as much more to boot.</p>\n<p><em>Crack in the Road: For those readers not already familiar with Cats and Cats and Cats, how would you describe your music?</em></p>\n<p><strong>Imagine the noise of an over zealous author throwing themself off a diving board whilst having a nervous breakdown, only to realise that instead of water at the bottom the pool is filled with liquidised instruments. Or you could just say choppy folk rock. Your choice.</strong></p>\n<p><em>CitR: In terms of recording your debut album, how straight forward was it? Did you know before you went into the studio which songs were going to feature, or was it more of a freeform idea that grew as you went along?</em></p>\n<p><strong>Since we only had a limited time in the studio (I think we had 11 days), we really had to plan exactly what we were going to be doing and which songs were going to make it. In terms of the tracklisting we didn’t really have to think about it a lot, the songs tended to just fall into place on the album. This was the first time we haven’t recorded the main band live (guitars/bass/drums all together) and instead multi tracked everything to iron out any creases. The problem with this method is that it can bring out the perfectionist in you and some of the guitar sessions stretched a little too long into the night! Tom (Woodhead, producer and singer of Forward Russia) kept us in check though and we managed to get everything done that we’d wanted to.</strong></p>\n<p><em>CitR: As a band, where would you like to see yourselves in a years time?</em></p>\n<p><strong>Well we’ve got the next album all written and have just recorded 3 new tracks which we’ll be giving away in October, so with any luck the follow up to Atlas will be out before next summer and we’ll be touring the heck out of that one. Then the Queen will dub us the national band of England and we’ll fly round the world spreading peace through the medium of off-the-whack time signatures. Note: The first part of this answer is true, the second part is only 80% likely.</strong></p>\n<p><em>CitR: How much do you think growing up and living in London has affected the music you have created?</em></p>\n<p><strong>None of us actually grew up in London, a few of us are from Kent and the others are from Staines (which we don’t count as London). It’s hard to say how growing up in these places affected the music we play, I guess where I lived initially in Rochester I was in a lovely green part of the country and a lot of my lyrics seem to be yearning to return to such a place and often mention the more natural ways of life. Someone once noted that we’re from a town surrounded by railway crossings and the stop/start nature of the traffic had somehow inspired our early sound, it’s probably true.</strong></p>\n<p><em>CitR: What has been your most memorable gigging experience to date?</em></p>\n<p><strong>We had a pretty funny end to a gig in Leeds recently. We were on tour with The Siegfried Sassoon (</strong><a href=\"https://www.myspace.com/thesiegfriedsassoon\" target=\"_blank\"><strong>www.myspace.com/thesiegfriedsassoon</strong></a><strong>) at the time and a joke had started where, in the middle of a town, we’d all get our shirts off and swing them round our heads chanting…ahem……”Let’s go fucking mental!” Somehow this started in the middle of our last song and by the end of it every male member of the crowd had their shirts off. The sound guy didn’t miss a trick and immediately put YMCA full blast over the PA and within minutes there was a semi naked conga line all around the venue. They’ve already started using a video of it to promote the place as a gay club.</strong></p>\n<p><em>CitR: If you could have any super power, what would it be?</em></p>\n<p><strong>I’d be able to freeze time, if you ask me Bernard (of Bernard’s Watch fame) really didn’t take advantage of this power. You’d be able to pull some incredible stunts, imagine a gig where halfway through you found yourself, and the rest of the audience, on stage with instruments while the band watched. Admittedly moving that many people would be hard work every night.</strong></p>\n<p style=\"text-align: center;\"><a href=\"https://www.myspace.com/catsandcatsandcats\">Check Out Cats and Cats and Cats Myspace!</a></p>\n<p style=\"text-align: center;\"><a href=\"https://www.functionrecords.com/shop/r23.html\">Buy Their Debut Album!</a></p>\n","slug":"2218-interview-cats-and-cats-and-cats","category":"interviews","date":1280687206000,"wpid":2218,"isSticky":false,"featured_image":null,"createdAt":1587295084359,"updatedAt":1588441791004,"author":"5e9b68b27a1236eccfeb1d27","old_image":"generated/5796a34299948e12c06978cf19a05418191fd068.jpg","categories":["interviews","music"]}