{"id":"5e9c05fa774c2610387e4e0c","artists":["5e9b69317a1236eccfeb2431"],"title":"Interview: Phoria","content":"<p>“Brilliant.</p><p> I want to take a screenshot.”</p>\n<p>Ed Sanderson, who plays keyboards (and some violin) in <b>Phoria</b>, is referring to the frozen visage filling his computer screen, held momentarily inert in the arms of a shoddy broadband connection. I can see a smaller reproduction of the face in the bottom right-hand corner of my own screen. Its owner hasn’t shaved or cut its hair in some time (around five months, at a guess), accentuating the quizzical, crescent-moon leer of its lopsided mouth. The green glass of a cheap French stubby is visible in one blurred hand.</p>\n<p>The face is supposed to be mine, but I’m not going with that. I’m calling this half-cut backwoods freakshow ‘Dean’, after a case of mistaken identity once visited upon me in Fulham, by a man whose own name I have now forgotten. I’ve also decided that I do not like Skype interviews, which feel as much like a conversation with oneself (or indeed, one’s very own Dean) as they do with the interviewee.</p>\n<p>Or –viewees, as the case may be. For aside from Ed, I’m presented with excellently-haired Phoria bassist Tim Douglas, and guitarist Jeb Hardwick, whose tin of Fosters puts me at something approaching ease. Ostensibly, I’m here to talk to this three-fifths of the Brighton-based soundscapeers ahead of their appearance at <a title=\"You're not coming? What does that even mean?\" href=\"https://www.facebook.com/events/503640323024237/512891345432468/?comment_id=512914968763439&notif_t=like\" target=\"_blank\">CitR Live #002</a> in Peckham on Thursday 30<sup>th</sup> May, but Dean doesn’t always want to talk about Phoria. It takes me until halfway through a conversation about San Franciscan beatsmith Tycho (who the three also enjoy, as it happens) to knock the fucker on the head and start talking about what I’m supposed to be talking about.</p>\n<p>Somewhere amongst Dean’s nervy tumble of phonemes, Tim mentions that Phoria are “trying to get some new songs on the go, which hopefully might be ready for Crack in the Road.” Phoria’s <a title=\"STAININ' MY WHOLE TOWN RED\" href=\"https://soundcloud.com/phoriamusic/sets/bloodworks-ep\">sublime EP</a> <b><i>Bloodworks </i></b>only made its way public on April 29<sup>th</sup>, so with new songs already on the way, I ask how long the EP has been in the pipeline. That’s me in bold.</p>\n<p><b>How long has </b><i>Bloodworks</i><b> been in the pipeline, then?</b></p>\n<p><b>Tim:</b> There was a whole other EP ready before <b><i>Bloodworks</i></b>, but we didn’t release anything and just kept working. So we ended up having this release being the most recent songs. So two years? Three years?</p>\n<p><b>Jeb: </b>We had lots of songs, like the actual song <i>Bloodworks</i>, which didn’t make it onto the EP in the end – there was pretty much a completely different collection of songs up until the last six months or so, and then we just wrote a whole batch of new ones and didn’t want to release the old ones anymore.</p>\n<p><b>What’s the writing process like with Phoria?</b></p>\n<p><b>Ed:</b> Trewin, our singer, he’s very much into music production, and he’s got a little studio in his bedroom – basically most of the core ideas come from him on his own jamming, making beats, basically getting the little ball of a song together, then we take it into the rehearsal room, to flesh it out for a five-piece and try and add as much as we can. It works quite well that way, and we all have our specific tasks.</p>\n<p><b>So it kind of goes collaborative after Trewin starting everything?</b></p>\n<p><i>(The three nod, in perfect unison.)</i></p>\n<p><b>J:</b> Yeah, usually, sometimes it’s</p>\n<p>Jeb is not allowed to finish his sentence.  “You guys probably didn’t see that,” interrupts Dean in gleeful, Partridgean tones, “but that was an amazing synchronised nod!”</p>\n<p>Everyone laughs. Oh, how we laugh.</p>\n<p>“We’ve been practicing,” volunteers Ed. Thanks, Ed.</p>\n<p>“You can’t see it,” says Jeb, “but we’ve got little cue cards.”</p>\n<p>I’ve been listening to <b><i>Bloodworks</i></b> a lot over the past few weeks. On headphones, through speakers, skiving at work, sweeping lentils from the kitchen floor, cooking chillies. And on that basis, I still haven’t managed to file Phoria under and sort of overarching heading. On the one hand, you’ve got the campy, synthesised strut of <i>Posture</i>, which opens the record with a sinister bounce, and eventually a full-on, womping Amen break. All well and good, but the song’s immediately followed by <a title=\"I've forgotten which Lovedrug song it sounds like. Answers on a postcard. \" href=\"https://www.youtube.com/watch?v=OdZsAtDuPfQ\" target=\"_blank\"><i>Red</i></a>, a frozen, near-beatless expanse of sound, that sees Trewin channelling lost American heroes Lovedrug over the sorts of reverberant, glacial piano chords that words like ‘aching’ were first coined for. With this kind of rampant genre-hopping in mind, do the band have a shared vision for their sound?</p>\n<p><b>J:</b> There’s a few bands that we’re all passionate about, bands like Mew that most of us share, bands like Sigur Ros. I think we’ve got a lot of time for that kind of thing. But apart from the core few we do have quite different tastes, Trewin’s into a lot of…er…experimental electronica.</p>\n<p><b>E:</b> I like classical music really. I’m kind of like a machine, I get told to run through a bunch of chords, like the number cruncher…</p>\n<p><b>J: “</b>Find the magic chord.”</p>\n<p><b>E</b>:…the bitch.</p>\n<p><b>How about you, Tim?</b></p>\n<p><b>T: </b>I’m sorry, what?</p>\n<p><b>What…ah…what sort of…</b></p>\n<p><b>T:</b> Oh, there’s the big crossover. I like a lot of glitch, electro, then into ‘70s prog. That’s where I come from.</p>\n<p><b>E:</b> That diversity in terms of where we all come from, our individual passions and our shared passions, probably helps the music never stay in the same bracket.</p>\n<p><b>T:</b> There’s something unique that’s shared between all the different genres we like individually. The strangeness, the inability to categorise – people say that we’re quite difficult to categorise, and I think that where we offshoot into different genres of music, that music still shares the same…<i>uncategorisability</i>.</p>\n<p>We’re all pleased with this new word. Dean ventures that Tim is doing my job for me. Ed pokes fun at Tim for having done a Philosophy degree – Ed and Jeb met him at university in Southampton, and I steer talk to the drummer Seryn, who’s over half a decade younger than his bandmates, wanting to know how that dynamic plays out.</p>\n<p><b>J: </b>It’s great. He’s got so much enthusiasm and so much innocence about him and it keeps us going, I think, just having someone like that who’s so up for it all the time. And seeing everything with fresh eyes, almost like you’re seeing it…<i>through him</i>. We get to pretend to be teenagers again.</p>\n<p><b>T: </b>It’s like getting a second wind.</p>\n<p><b>What do you do when you’re not making music? Do you have jobs?</b></p>\n<p><b>J:</b>…not any more.</p>\n<p><b>E: </b>I do. I teach music to kids at Sussex Academy of music. And privately as well. Just to keep myself fed.</p>\n<p><b>I guess when you get to your mid-twenties and you’re in a band it feels quite difficult to sustain yourself.</b></p>\n<p><b>J:</b> It’s getting to the point where we’ve got to start making some money really really soon. Because it’s not fun eating rice every day.</p>\n<p><b>T:</b> I did run a shop for six months. At Brighton University, the SU shop.</p>\n<p><b>Dean: </b>I’ve been there. I’ve bought things from that shop.</p>\n<p><b>T:</b> The bad displays? That was me.</p>\n<p><b>D:</b> You did a fantastic job, seriously. It was like…modern art.</p>\n<p><b>T:</b> I had to leave that, because it was awful. The customers, mainly.</p>\n<p>Desperately trying to claw back my interview from the twisting clutches of my own runaway psyche, I decide that it’s probably a good idea to talk about the band some more. So I ask what’s on the horizon for Phoria, in terms of releases and touring.</p>\n<p>“We’re lucky to have a pretty big back catalogue of material that’s just waiting,” says Ed, “but we’re writing constantly. We’ve always got a load of songs, it’s just finding the time to get back to them.”</p>\n<p>“We’re only planning to get a new collection of songs out by the end of the year,” Tim continues, “hopefully. The way it’s shaping up, it’s quite big and more electronic sounding, but we’re playing around with kind of…I guess, faster tunes? Keeping slow ones in there, mixing a couple in there with, er, bangers. That’s what we’re working on at the minute, and there’s a couple we’re really excited about. We’re just trying to string them all together.”</p>\n<p><b>“</b>We’ve just got a bunch of new equipment as well, so it’s taking a bit of time to make some new sounds with the new stuff,” explains Ed. “I upgraded my Nord, it’s amazing. Tim’s got a new synth which is ridiculous.”</p>\n<p>“That’s about the only description for it,” Tim agrees. “Oh, it’s yellow. That’s another.”</p>\n<p>“That’s kind of more important than the sound, right? The fact that it’s yellow?”</p>\n<p>Guess who.</p>\n<p>“We don’t even turn it on,” Tim smiles. “It just stands there.”</p>\n<p><b>“</b>Really, you needn’t bother playing,” imparts Dean, conspiratorially, “just wheel the synth out into the middle of the stage and walk off. And just let it…just emit vibes. And it can never ask for money off you, because it’s a fuckin’ synth. So…”</p>\n<p>This last syllable is echoey and hollow, hooted down the neck of a beer bottle raised to parched lips. There is a brief conference among the trio, sat on a bed somewhere in Hollingdean.</p>\n<p>“Can we go on tour?” Ed asks.</p>\n<p>“You’re in,” deadpans Jeb, pointing Kitchener-style at the screen.</p>\n<p>“Hooray!” crows Dean.</p>\n<p>“You were asking about touring,” says Ed, righting our course for the second time in ten minutes. “We’re sort of trying to get a European tour going. We’ve got this Croatian gig at Soundwave. So that’s in the pipeline, possibly, and beyond that we’ve got gigs –“</p>\n<p>“Don’t talk about that one yet,” reminds Tim, gently. “We’re working on UK dates as well. There might be a couple of other things in the pipeline but we don’t want to say just yet.”</p>\n<p>That’s fair enough. And here’s where I’d leave things on a nice cliffhanger, with links to Phoria’s <a title=\"Eu-\" href=\"https://www.phoriamusic.com/p_about.html\" target=\"_blank\">website</a>, their <a title=\"Dys-\" href=\"https://www.facebook.com/phoriamusic?ref=ts&fref=ts\" target=\"_blank\">Facebook</a>, their <a title=\"https://twitter.com/phoria\" href=\"Ana-\" target=\"_blank\">Twitter</a>, their <a title=\"https://soundcloud.com/phoriamusic\" href=\"Exo-\" target=\"_blank\">Soundcloud</a>, so that you, dear reader, can keep thoroughly abreast of what they’re planning next. Unfortunately, though, my dear sweet Dean has the last word.</p>\n<p>“I respect your confidentiality,” he says. “To a degree.”</p>\n<p><em>Phoria are playing CitR Live #002 at the Bussey Building in Peckham at 22.15 TONIGHT. </em></p>\n","slug":"22192-interview-phoria","category":"newinterviews","date":1369900001000,"wpid":22192,"isSticky":false,"featured_image":{"width":913,"height":521,"src":"2013/05/phoria.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAGAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAMI/8QAIRAAAQMDBAMAAAAAAAAAAAAAAQIEEQADEgUhMUEiQlH/xAAUAQEAAAAAAAAAAAAAAAAAAAAE/8QAGREBAQADAQAAAAAAAAAAAAAAAQIAEWEh/9oADAMBAAIRAxEAPwDM4cthbRm3zvBA84ACVA7bcKERz2TV3GlKDi6Au2RkfSO/k0pRaWU13GQFnvM//9k="},"createdAt":1587283450753,"updatedAt":1588403529812,"author":"5e9b68b27a1236eccfeb1d3c","old_image":"2013/05/phoria.jpg","categories":["newinterviews","music"]}