{"id":"5e9c33699b6559241525e060","title":"Interview: The Xcerts","content":"<p><a rel=\"attachment wp-att-2232\" href=\"https://admin.</p><p>crackintheroad.com/music/2231-interview-the-xcerts/attachment/the-xcerts-20\"><img class=\"alignnone size-totallysizedforever wp-image-2232\" title=\"The Xcerts-20\" src=\"https://api.crackintheroad.com/uploads/2010/08/The-Xcerts-20-740x555.jpg\" alt=\"\" width=\"740\" height=\"555\" /></a></p>\n<p><strong>The Xcerts</strong> are certainly making a name for themselves both in Scotland and the rest of Britain. Managing to escape the jinx affecting many Scottish bands outside of Glasgow, they took a risky move to Brighton in 2006 which evidently paid off. Their first album, <em>In The Cold Wind We Smile</em>, was hailed by magazines such as Q! and Kerrang and is, overall, an exceptional début. On returning from America after recording their second album with Mike Sapone of <strong>Taking Back Sunday </strong>and <strong>Public Enemy </strong>fame. This new producer has appeared to spark new life into the band who claim that this new album is deeper, darker and almost even sounds like a new band due to his influence. This promise of a new sound has gathered massive intrigue form their fans, myself included, who are unsure what exactly to expect, but no doubt it will keep its current fanbase and hopefully expand further as news spreads. Their tours with the likes of <strong>Get Cape. Wear Cape. Fly</strong> and <strong>Fightstar</strong> have also helped build up a more than respectable following, but <strong>The Xcerts</strong> have ambition well beyond this and I am sure they will expect this new album to be a real launchpad to greater things both in this country and abroad.</p>\n<p>Coming from Aberdeen, well two of them at least, they are one of only a few adventurous bands willing to travel above Glasgow to perform gigs, playing at The Doghouse in Dundee, last week where I managed to meet the band before they went on and saw them perform an exceptional set supported by two great acts, of which <strong>Tiny Little Robots</strong> stood out above the rest, a group of four local lads playing original tracks to a almost full crowd and were the perfect warm up for <strong>The Xcerts. </strong>Playing a lengthy and almost unstoppable set, <strong>The Xcerts </strong>played a large chunk of their first album which was sang back with equal vigour by the crowd as well as extracts from their new album, to make for a perfectly rounded and great set. This was my first encounter of <strong>The Xcerts</strong> live and I now know why they have constantly prided themselves on their live acts.</p>\n<p>Before the gig, I met up with the band and had an hour long chat with them about everything and anything of which extracts are available below:</p>\n<p>CitR: I have spoken to another band from Aberdeen who stated the difficulty of ‘making it’ if you’re from outside of Glasgow, did you have the same problem or was it an easier ride for you?</p>\n<p><strong>We understood that it would be difficult coming from Aberdeen and that is why we moved to Brighton because as far as the industry is concerned, Glasgow is the most north people generally look for musical talent. It isn’t Aberdeen’s fault as there is a thriving music scene up there, its just how the industry works.</strong></p>\n<p>CitR: You’re embarking on a tour with Get Cape. Wear Cape. Fly and from what I have read, Sam Duckworth has been a good help in your development as a band with regards to opportunities to perform. Would you agree with this?</p>\n<p><strong>Well firstly, he put out two of our 7” on his own label which was a great help and took us on tour which was very important for us as it got the likes of Zane Lowe excited about us. He is a great guy and helped us massively.</strong></p>\n<p>CitR: On your Myspace under influences and ‘sounds like’ sections your responses are Shutter Island and ‘a pissed off Scotland’, are these inside jokes or is there a deeper meaning behind it, such as taking influences from films?</p>\n<p><strong>Yeah we do take influences from movies but we watched Shutter Island when we were recording our new album in America and it was out before it was here so we were really just showing off that we’d seen it. Also it looked different, but we used to change it weekly but we just have not had time to change it lately.</strong></p>\n<p>CitR: I read on your site that you recorded your new album with Mike Sapone who has worked with some great bands. Do you see this as proof of your success as a band to be working with someone held in such high esteem?</p>\n<p><strong>It is incidental that we worked with him after he worked with these other bands, although we understand how it may look that </strong><strong>way. But he was the guy we wanted to work with ourselves and it was incidental too that we are the first British band he has worked with.</strong></p>\n<p>CitR: What are we to expect from your second album, especially after such positive feedback I read about your first album and what I listened too myself?</p>\n<p><strong>The second album is more of a rock record, and is the typical darker second album. We were out of our comfort zone recording as it was all done abroad which means the album makes us sound like a different band almost.</strong></p>\n<p>CitR: Do you enjoy touring and living on the road or do you find it a necessary evil?</p>\n<p><strong>You have to enjoy it but sometimes you can feel homesick, but overall it is a way of life so you have to deal with it. Its almost like perpetual student-hood but its still just like any other job. </strong></p>\n<p>CitR: Who is the best band/artist you have supported or been supported by?</p>\n<p><strong>Idlewild, there are only a few bands with their amount of success that remain as humble as them and are willing to help others and those guy have taught us a lot about how to act on and off stage. They are also from the same neck of the woods which is great too. Also there is a band called Straight Lines that supported us who are fantastic and good guys too, they’re well worth listening too.</strong></p>\n<p>CitR: How did you come up with the name The Xcerts?</p>\n<p><strong>The name itself is nothing really important, it just means an excerpt from a film or something, but the spelling is a mistake by the promoter of our first proper gig as it was The X-erts before, and we have also been called The X-certs too which is wrong as well.</strong></p>\n<p>CitR: What is your favourite gig of all time?</p>\n<p><strong>Hometown shows are always special especially if you have not been back in a while, also Christmas shows are always good. </strong></p>\n<p>CitR: What is your most embarrassing moment on stage?</p>\n<p><strong>Falls are typical, but as exuberant teenagers we used to move around too much in excitement which led to a few incidents such as out bass being stuck in camouflage netting put above the stage and when the bass hit Murray (guitarist, lead singer) in the back of the neck and I (Jordan, Bassist) thought he was dead, but we carried on playing! Also my (Murray) trousers ripped at the crotch when I was on the barrier and it was kinda in the face of a girl.</strong></p>\n<p>CitR: If you could have any superpower what would it be?</p>\n<p><strong>Murray: Invisibility, I could get a flight anywhere and see new things, and also for obvious reasons like seeing girls…actually, I would have no time to travel the world with all of that sort of thing to do!</strong></p>\n<p><strong>Jordan: I would like to control the weather, I know its not a grand superpower and there is limited scope but I would just like to stop the weather for a while at sundown when everything is so peaceful and you’re sitting outside and drinking a coffee or something.</strong></p>\n<p><strong>Tom: I am stuck between a Bernard’s watch type thing of stopping time so I can learn so many new things or be like the comic hero The Preacher who has the power of ‘the word’ which means whatever he says you have to do, that means I could cancel out Jordan’s wishes of having a relaxing evening at sundown! </strong></p>\n<p><a href=\"https://www.myspace.com/thexcerts\">Check out their Myspace here</a></p>\n<p><a href=\"https://www.thexcertsband.com/\">Their official website is here</a></p>\n","slug":"2231-interview-the-xcerts","category":"interviews","date":1280763148000,"wpid":2231,"isSticky":false,"featured_image":null,"createdAt":1587295081286,"updatedAt":1588441790979,"author":"5e9b68b27a1236eccfeb1d07","old_image":"generated/d2300cb3544315a9cd76f962e14b4e01bc458227.jpg","categories":["interviews","music","reviews"]}