{"id":"5e9c33679b6559241525e05d","title":"Review: Brooke Sharkey – A Taste Of Truth EP","content":"<p><img title=\"Brooke\" src=\"https://news.</p><p>bbc.co.uk/media/images/48317000/jpg/_48317967_introducing_stage_12.jpg\" alt=\"\" width=\"744\" height=\"511\" />Combining an intriguing synthesis of French and English, London based singer songwriter <strong>Brooke Sharkey </strong>manages to create a haunting, captivating sound, further justifying my opinion that female solo artists at the moment are far more forward thinking than their male counterparts. Having already played Glastonbury Festival, and several dates in Camden, <strong>Brooke</strong> is beginning to make a name for herself, despite only being twenty two. Previously compared to the likes of <strong>Eva Cassidy</strong> and <strong>Tracy Chapman</strong>, two connections not made carelessly, there is no doubting her musical talent.</p>\n<p>Midway through July, <strong>Brooke </strong>released her newest EP; <em>A Taste Of Truth</em>, a collection of five tracks produced by Chris Bond. As with many current releases, there is an understanding of the essence of a live performance, which Bond tries to capture on record. Opening track <em>If We Were Water </em>is a stunning ode to a distant lover, of which the majority is sung in French, bar the inspired, fragile chorus and an upbeat bridge. The gently strummed guitar allows<strong> Brooke’s</strong> voice to flow elegantly around the musical compositions, as she caresses and embraces every intricately picked word. Unlike the newest <strong>Laura Marling </strong>album, <strong>Brooke</strong> manages to find the perfect balance between fiery female singer and delicate, angelic songstress, jumping within persona from time to time.</p>\n<p><em>Home</em> brings out her French roots, with a Parisian-esque tune, despite the song being sung entirely in English, possibly hinting at her musical inspirations originating from France and her lyrical influence being more British passed. Our Ways is an exhilarating affair, as <strong>Brooke </strong>haphazardly chops and changes from French to English, never finishing a sentence in the language she begins with. With the growing success of songstress<strong> Charlotte Gainsbourg</strong>, it would be no surprise to see <strong>Brooke Sharkey </strong>soon reaching greater heights, as people begin to see there is far more to music than being able to recite, or even understand the lyrics.</p>\n<p style=\"text-align: center;\"><a href=\"https://www.myspace.com/brookesharkiii\">Check Out Her Myspace!</a></p>\n","slug":"2241-review-brooke-sharkey-a-taste-of-truth-ep","category":"music","date":1280775706000,"wpid":2241,"isSticky":false,"featured_image":{"width":188,"height":188,"src":"2011/06/48317967_introducing_stage_12-188x188.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAABwUG/8QAKhAAAQMCAwUJAAAAAAAAAAAAAQIDBQQRACFBBhMiMXEHEhUjM0JDYWL/xAAUAQEAAAAAAAAAAAAAAAAAAAAF/8QAGxEAAgIDAQAAAAAAAAAAAAAAAQIAAxITYbH/2gAMAwEAAhEDEQA/ABXszh6x2WbrTHb6P7qkuPuo8tIseRPTmL2xU8SkvigqB1v2uKYBKhoT1wkbTAU+xF2AGia/dko4eEM5Jy0zOX3jBxSlCLo7KPoo1/IwZntJciNpWaVFanvk/9k="},"createdAt":1587295079648,"updatedAt":1588403565031,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/06/48317967_introducing_stage_12-188x188.jpg","categories":["music","reviews"]}