{"id":"5e9c05c2774c2610387e4de0","title":"Interview: Bryony Hussey on the KX Archive Project","content":"<p>This week I bring you an interview with <strong>Bryony Hussey</strong>, an art student and aspiring curator who has worked hard over recent months to produce an archive which  contains a body of contemporary works produced by the staff and students of <strong>Central Saint Martins</strong>.</p><p></p>\n<p>The <strong>KX Archive Project</strong> has culminated in a 6-week exhibition programme that consists of 3 separate yet related displays. We are currently in the middle of the second show and the final show will go up in a matter of days.</p>\n<p>I sat down with Hussey to discuss the issues that I believe the project engages with, for example, what it means to archive today, the process of digitalisation in general and also how the work that comes out of a ‘crisis’ or change and how direct influence manifests itself.</p>\n<p style=\"text-align: center;\">—</p>\n<p><i>DC: You devised this project as there was no existing archive of the <strong>King’s Cross</strong> area, but also to shift the focus of a just-coping archive to the present cohort of students and what they are producing. Why did you think that this shift was an important one?</i></p>\n<p>BH: People often think only about archive in terms of a collection of what already exists, however the activity of archiving – a purposeful act of recording for preservation, is forgotten. I hoped that the KX Archive Project, with an emphasis on the word project, might shift perceptions from solely noticing what is already here to the iterative. What is happening around us right now is part of the constant renewal of an infinite archive.</p>\n<p>The project tried to uncover what was naturally occurring, to uncover artists and designers whose practices are dealing with the move, the building, or King’s Cross regeneration. I wanted to get personal accounts from people across the college and to record the traces that both staff and students are leaving on the building as much as the building’s effect on those that inhabit it. It was important to me that we try and capture what is happening here at this pivotal time in the history of Central Saint Martins <i>now</i> rather than trying to piece it together retrospectively.<i> </i></p>\n<p><i></i><i></i><i>DC: Archiving our creative endeavours is something that is championed in most instances, e.g. the museum, educational assessment etc. It could also be argued that the need to collect is simply a kind of ‘human nature’. I wondered if you could talk about why you decided to have a website and exhibition series as well as the more ‘hidden’ archive?</i></p>\n<p>BH: For a time I called the exhibition a ‘display’, perhaps because it seems less daunting but also because it is essentially a reflective point in the project where an audience can see what has been happening and potentially get involved. The motivation was as simple as that. Originally conceived as a static exhibition it evolved, like the project, into a series that changes and develops. The website made public the ‘hidden archive’ to be accessed without the white gloves. I was granted 6 weeks of exhibition time that spans both Central Saint Martins graduate degree shows; the series will see 3 rehangs that will involve 8 artists from both the staff and students.</p>\n<p>DC: <i>With the accompanying website you are also addressing the limitations archives have with space/resources. How do you think digitisation is affecting the way we archive?</i></p>\n<p>BH: Limitation with space and funding is a constraint for many organizations in the arts. Digitization offers another means to access primarily digital material without a need for their physical housing. Of course many works will be held in the archive stores and we do keep physical copies of digital material. However the website offers an archive of the archive, a space to record the exhibition series, which in itself needs to be archived, alongside a record of all submissions without the interference of curatorial selection. If through the website people wish to see more they can come and experience the physical records. Much like the exhibition series it is another opportunity to tell the story of this project.</p>\n<p>DC: <i>The first exhibition showed a variety of different works including </i><strong><em>Mir Gwilliam-Parkes</em></strong><i>‘ photography and </i><strong><em>Rebecca Botros</em></strong><em> and <strong>Isabella Carreira’s</strong> collaborative video that literally document the area and the changes around it. How and why did you choose the works for the first exhibition?</em></p>\n<p>BH: The artists involved in the first exhibition had a dialogue with each other, which was evident when I first went through the submissions. Many of the works as you say dealt with the CSM campus and the site of King’s Cross, a seemingly literal response to the move, but I hope on closer inspection they offer something more.</p>\n<p>Mir’s photographic series <strong>N1C</strong> and Rebecca and Isabella’s video <strong>67 Acres </strong>are example of students who felt the need to document what is lost daily in an area under such a large-scale development. This is at the very core of the <i>KX Archive Project </i>story. Both works sought to highlight what could otherwise be forgotten.</p>\n<p><strong>Renata Westenberger</strong> deals with this idea of the overlooked in the <strong><i>Lethaby Project</i></strong> by reinvigorating the discussion about the move through her appropriation of former Central Saint Martins sites, now derelict, into the new building. <strong>Connie Gallagher</strong>’s tour works seek to highlight the forgotten ‘quiet space’ on the first floor. Regardless of the particularities of enquires, each artist in this exhibition sought to use their artwork to preserve and showcase something about the move to King’s Cross. It seemed natural to form a relationship between these works.</p>\n<p>DC: <i>Following on from the quite literal documentation of the site that some of the work follows, do you think that that the move has affected CSM students conceptually?</i></p>\n<p><i></i>BH: Yes, <strong>George Bray</strong>’s piece <strong>The Only Way is Art School</strong> gets this point across directly with interviews of the first BA Fine Art class to graduate from CSM at King’s Cross. Whether you are making work about the physical site or not, it effects the way you use a studio space. How do you work in a building that has been adapted to function as an art school that isn’t purpose built? Even after the college moved, <strong>Granary Square</strong> was still being constructed therefore even the route into the building was altered daily.</p>\n<p>If I believed that it had no effect on students’ thinking I wouldn’t have felt compelled to conduct such a long-term project about such an impact on students, both emotionally and conceptually.</p>\n<p><i>DC: The window has transformed once again and currently contains two works, one of them being by <strong>Jennifer Hayton</strong> a member of staff at the college and the other is by <strong>Matt Taylor</strong> a graphic design student, can you talk briefly about them?</i></p>\n<p>BH: The works selected complement each other both aesthetically and conceptually. Both Jennifer and Matt worked with the architectural plans of the building to generate their artworks. Jennifer collaborated with West Architecture on <strong>Cross Stitch</strong> her interpretation of the journey between King’s Cross Station and the entrance to CSM, whereas Matt’s cyanotype typeface – <strong>Granary Complex </strong>references aspects of the actual building. Both pieces bear a strong relationship with the works on show in the first exhibition but due to the scale of <i>Cross Stitch</i> and its specific relationship to <i>Granary Complex </i>I decided to give them their own space.</p>\n<p><i>DC: So after this display I hear there will be a site-specific commission that you have organised with a Stage 2 fine art student </i><em><strong>Nicole Weisz</strong> what are you expecting from this work?</em></p>\n<p>BH: Nicole has created some inspiring tape pieces dealing with the architecture of the building that I was struggling to place in the exhibition series. The documentation of her, often large scale, installations fell short of expressing the site-specific nature of the work.</p>\n<p>I proposed to Nicole that she approach the window as a new site for creation. Thankfully she came back with some interesting proposals that seemed fitting for both the story of <i>KX Archive Project </i>and of her own artistic practice. Through the <i>KX Archive Project</i>’s it seemed important to provide an opportunity to showcase a student’s work, reminding the viewer that the archive is a contemporary and evolving process.</p>\n<p><i></i><i>DC: Finally this incarnation of the KX Archive Project will come to end, presumably [although I know haha] you wish the work you have done to continue, briefly can you reiterate the importance of the project and why you’d like it to continue.</i></p>\n<p>BH: Obviously I am only interning with the <strong>Museum and Study Collection</strong> and once the final exhibition is de-installed my time there will end. To be honest, I am not expecting a surge of works to come in after I leave. I set out to create the foundations of an archive and do what I could to get people to listen. Thankfully we have already gotten a submission of documentations by staff of student’s messages within the building, which is a promising start. I honestly don’t know what will become of this project but I hope to be happily surprised at what trickles in over the coming years.</p>\n<p style=\"text-align: center;\">—</p>\n<p style=\"text-align: left;\">Check out more of the archive on the website <a href=\"https://www.kxarchiveproject.co.uk\" target=\"_blank\">here</a> or take a trip to the Window Gallery at CSM’s campus in King’s Cross.</p>\n<p style=\"text-align: left;\">\n\n\t\t<style type=\"text/css\">\n\t\t\t#gallery-6 {\n\t\t\t\tmargin: auto;\n\t\t\t}\n\t\t\t#gallery-6 .gallery-item {\n\t\t\t\tfloat: left;\n\t\t\t\tmargin-top: 10px;\n\t\t\t\ttext-align: center;\n\t\t\t\twidth: 33%;\n\t\t\t}\n\t\t\t#gallery-6 img {\n\t\t\t\tborder: 2px solid #cfcfcf;\n\t\t\t}\n\t\t\t#gallery-6 .gallery-caption {\n\t\t\t\tmargin-left: 0;\n\t\t\t}\n\t\t\t/* see gallery_shortcode() in wp-includes/media.php */\n\t\t</style>\n\t\t<div id='gallery-6' class='gallery galleryid-22525 gallery-columns-3 gallery-size-thumbnail'><dl class='gallery-item'>\n\t\t\t<dt class='gallery-icon landscape'>\n\t\t\t\t<a href='https://localhost:8888/arts/22525-interview-bryony-hussey-on-the-kx-archive-project/attachment/rsz_h535_1_1'><img width=\"150\" height=\"150\" src=\"https://localhost:8888/uploads/2013/06/rsz_h535_1_1-150x150.jpg\" class=\"attachment-thumbnail size-thumbnail\" alt=\"\" srcset=\"https://api.crackintheroad.com/images/2013/06/rsz_h535_1_1-150x150.jpg 150w, https://api.crackintheroad.com/images/2013/06/rsz_h535_1_1-300x300.jpg 300w, https://api.crackintheroad.com/images/2013/06/rsz_h535_1_1-100x100.jpg 100w\" sizes=\"(max-width: 150px) 100vw, 150px\" /></a>\n\t\t\t</dt></dl><dl class='gallery-item'>\n\t\t\t<dt class='gallery-icon portrait'>\n\t\t\t\t<a href='https://localhost:8888/arts/22525-interview-bryony-hussey-on-the-kx-archive-project/attachment/944108_471675606248020_1974204201_n'><img width=\"150\" height=\"150\" src=\"https://api.crackintheroad.com/images/2013/06/944108_471675606248020_1974204201_n-150x150.jpg\" class=\"attachment-thumbnail size-thumbnail\" alt=\"\" srcset=\"https://api.crackintheroad.com/images/2013/06/944108_471675606248020_1974204201_n-150x150.jpg 150w, https://api.crackintheroad.com/images/2013/06/944108_471675606248020_1974204201_n-300x300.jpg 300w, https://api.crackintheroad.com/images/2013/06/944108_471675606248020_1974204201_n-100x100.jpg 100w\" sizes=\"(max-width: 150px) 100vw, 150px\" /></a>\n\t\t\t</dt></dl><dl class='gallery-item'>\n\t\t\t<dt class='gallery-icon landscape'>\n\t\t\t\t<a href='https://localhost:8888/arts/22525-interview-bryony-hussey-on-the-kx-archive-project/attachment/983845_10151926092188012_1782518553_n'><img width=\"150\" height=\"150\" src=\"https://api.crackintheroad.com/images/2013/06/983845_10151926092188012_1782518553_n-150x150.jpg\" class=\"attachment-thumbnail size-thumbnail\" alt=\"\" srcset=\"https://api.crackintheroad.com/images/2013/06/983845_10151926092188012_1782518553_n-150x150.jpg 150w, https://api.crackintheroad.com/images/2013/06/983845_10151926092188012_1782518553_n-300x300.jpg 300w, https://api.crackintheroad.com/images/2013/06/983845_10151926092188012_1782518553_n-600x600.jpg 600w, https://api.crackintheroad.com/images/2013/06/983845_10151926092188012_1782518553_n-100x100.jpg 100w\" sizes=\"(max-width: 150px) 100vw, 150px\" /></a>\n\t\t\t</dt></dl><br style=\"clear: both\" />\n\t\t</div>\n\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n","slug":"22525-interview-bryony-hussey-on-the-kx-archive-project","category":"arts","date":1371225824000,"wpid":22525,"isSticky":false,"featured_image":{"width":917,"height":535,"src":"2013/06/rsz_h535_1_1.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAGAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAYH/8QAHBAAAgIDAQEAAAAAAAAAAAAAAQIFEQADBCET/8QAFQEBAQAAAAAAAAAAAAAAAAAAAQP/xAAYEQADAQEAAAAAAAAAAAAAAAAAAQIDsf/aAAwDAQACEQMRAD8A3qZiJrfL793JONz8TEE6PipZfBdNleopQLvzGMEX1t1Mp8P/2Q=="},"createdAt":1587283394281,"updatedAt":1588403529680,"author":"5e9b68b27a1236eccfeb1d19","old_image":"2013/06/rsz_h535_1_1.jpg","categories":["arts"]}