{"id":"5e9c33659b6559241525e05a","title":"Mercury Nominations 2010 Part 1","content":"<img alt=\"\" src=\"https://4.</p><p>bp.blogspot.com/_Lmbijs2fZwI/S6UaJP38GrI/AAAAAAAAEe0/uZLuWGki04A/s640/mumford-and-sons-otw.jpg\" title=\"Mumford\" class=\"alignnone\" width=\"500\" height=\"358\" />\n<p>The <strong>Barclaycard Mercury Music Prize</strong> is one of the most highly sought after and prestigious awards in the entertainment business. First presented in 1992 and seen as a vital indication of up and coming talent, previous winners have included the likes of <strong>Primal Scream</strong>, <strong>PJ Harvey </strong>and <strong>Arctic Monkeys</strong>, all of whom have gone on to achieve phenomenal success. With this years shortlist being announced on July 20; here is my opinion on the first six of the twelve nominee’s for the 2010 award.</p>\n<p><strong>Biffy Clyro</strong> – <em>Only Revolutions</em><br />\nAccomplished fifth album from the Scottish trio, despite straying even further away from their heavier rock influences. Standout tracks include <em>That Golden Rule, Many Of Horror</em> and <em>Bubbles</em>, three of the six singles taken from the album, however the final three closing tracks are extremely non-distinct and appear to be very much there to fill out the record. An outsider for the award, considering the albums’ commercial success.</p>\n<p><strong>Corrinne Baily Rae </strong>– <em>The Sea</em><br />\nFar more consistent than her debut album, partially down to not being rush released, yet there is nothing as exciting or innovative about <em>The Sea</em> as the work being produced by many of her female counterparts. Recorded after the accidental death of her husband, there is far more passion than previously experienced in <strong>Rae’s</strong> work, although the songs themselves are unlikely to stand the test of time. Lead single<em> I’d Do It All Again</em> is a standout track, and due to it’s positive critical reviews, despite mediocre sales <em>The Sea</em> is certain to be one of the favourites for the award.</p>\n<p><strong>Dizzee Rascal </strong>– <em>Tongue ‘N Cheek</em><br />\nLeaving his grime roots behind, and selling himself entirely to the Radio 1 crowd, Tongue ‘N Cheek is by far <strong>Dizzee’s </strong>worst output to date. Featuring the diabolic, self indulgent singles<em> Dance Wiv Me</em> and <em>Bonkers</em>, there is very little of any excitement or genuine passion for which he was formerly known. Whilst the album has proved a club favourite this summer, <strong>Dizzee</strong> picked up the Mercury Prize in 2003 so is especially unlikely to do the reclaim is trophy.</p>\n<p><strong>Foals</strong> –<em> Total Life Forever</em><br />\nAfter the original hype following lead single<em> Spanish Sahara</em>, much of the appraisal for Oxford indie outfit <strong>Foals</strong> died down. Despite showcasing a more mature, developed sound, there were still those who looked upon it less favourably. For me, tracks like <em>Blue Blood</em> and <em>This Orient</em> prove that <strong>Foals</strong> are beginning to outgrow comparisons to their cheap imitators, and justify the hype that had been so unavoidably placed on them. Possibly my favourite from the Mercury 2010 List and a dark horse for the prize.</p>\n<p><strong>Laura Marling</strong> – <em>I Speak Because I Can</em><br />\nOne of my personal disappointments of the year, after her fantastically mature debut it seemed<strong> Marling</strong> was set to fulfil her potential, unfortunately she appears to have lost her way along the path to enchanting songstress. Many of the tracks lack the emotional prowess which made <em>Alas I Cannot Swim</em> such a revelation at the time. There are too many tracks that fail to reveal the triumphantly strong yet deeply impassioned side which <strong>Marling </strong>hinted at on her previous record. Although she has received backing from numerous radio DJs, <strong>Marling</strong> is still regarded as an outsider for the accolade.</p>\n<p><strong>Mumford & Sons </strong>– <em>Sigh No More</em><br />\nAnother of the more commercially successful of the nominees, <strong>Mumford and Sons</strong> were sighted by many as being the pioneers of modern folk pop. The early singles were at first a breath of fresh air in the turgid London music scene, however constant re-releases coupled with an unadventurous debut album, lead them to become a routine, lifeless group, living off the hype sown by Radio 1. Whilst I myself was disappointed with <em>Sigh No More</em>, it received plaudits from all over the music industry, thus making it one of the favourites for the Mercury Prize.</p>\n<p>As always, let us know what you think, either via email or by commenting below. Also be sure to check back later in the week for my summary of the other six nominated records, as well as an exclusive interview with 2010 nominee’s <strong>Kit Downes Trio</strong>.</p>\n","slug":"2257-mercury-nominations-2010-part-1","category":"music","date":1280852162000,"wpid":2257,"isSticky":false,"featured_image":{"width":188,"height":188,"src":"2011/06/mumford-and-sons-otw-188x188.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAwQG/8QAJhAAAgEDAwEJAAAAAAAAAAAAAQIDAAQRBTFBEwYHEhQhIiQyQv/EABQBAQAAAAAAAAAAAAAAAAAAAAX/xAAcEQABBAMBAAAAAAAAAAAAAAABAAIDBBFBkbH/2gAMAwEAAhEDEQA/AIdH7xL+ewMdtbs8gKxg28CCMu7AR5y2QCMk78bUyar2ilRZI/KFGHiX46n0O3NY/T55oLHT1hlkjHVAwjEflRxQQovRT2r9RxRkdiR+z0p91aNhIx4v/9k="},"createdAt":1587295077798,"updatedAt":1588403565005,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/06/mumford-and-sons-otw-188x188.jpg","categories":["music"]}