{"id":"5e9c05a7774c2610387e4dca","title":"Feature: Who On Earth Are The Yum Dee Days?","content":"<p>No website, no Facebook page, no Twitter and no band information whatsoever.</p><p> Brooklyn’s <strong>The Yum Dee Days</strong> are well and truly a ‘Jai Paul’ on the mystery meter. Having stumbled across (what I can only assume) is their debut release, uploaded to a <a href=\"https://theyumdeedays.bandcamp.com/\" target=\"_blank\">Bandcamp</a> page a couple of weeks ago, several commutes to and from London meant that it sat idly in a tab for a number of days, waiting for me to find time to give it a thorough listen. So, I can hear you asking, why is he making a fuss over a band with the bare minimum amount of coverage – is anyone going to care? Well, to put it simply, screw all the unwarranted PR generated hype bestowed upon the majority of new music; <strong>The Yum Dee Days</strong> are the best new band of the year.</p>\n<p>Forty eight hours or so later after finding the original upload, whilst trawling Bandcamp again for new releases, I chanced upon <a href=\"https://theyumdeedays1.bandcamp.com/\" target=\"_blank\">another page</a>, seemingly operated by the band, featuring the same ten tracks, in a slightly differing order and under the title <strong><em>Make It Rain</em></strong>, as oppose to<em><strong> A Thrilla Minute</strong></em>. The two separate Bandcamp pages don’t stink of PR ploy as much as they do the band simply forgetting their password, and having to register a new URL.</p>\n<p>Taking the time to sit down and properly immerse myself in their music, I was instantaneously hooked. From the cutting, social-commentary of <em>The Future Is A Drag</em> to the Beach Boys surf-pop twang of<em> King Slacker</em>, they showcase some of the most coherent and intelligent songwriting of recent years, and all from a band with seemingly no label or management connections. Checking back in to the Bandcamp page every day, for clues on the identities behind <strong>The Yum Dee Days</strong>, the release itself went under several monikers, switching from <em><strong>Make it Rain</strong></em>, to <em><strong>Twinzz</strong></em>, to <em><strong>Memory Of The Future</strong></em>, suggesting an indecisive nature to the band. Not only that, but over the course of a week or so, two new tracks have been added onto the album,<em> Be The One</em> and album closer <em>When It Was Over</em>.</p>\n<p><iframe src=\"https://w.soundcloud.com/player/?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F96856826\" height=\"166\" width=\"100%\" frameborder=\"no\" scrolling=\"no\"></iframe></p>\n<p>With the tags on the Bandcamp page suggesting that<strong> The Yum Dee Days</strong> hail from Brooklyn (hardly surprising, huh?), I asked several music industry friends from New York if they had any info whatsoever on the band, and much to my surprise, they had no leads at all. In an area with as much self-fulfilling music hype as Brooklyn, for numerous clued up heads to be completely at loss, is astoundingly rare.</p>\n<p>Given the very 50’s/60’s sound to <strong>The Yum Dee Days</strong>, I toyed with the idea that it was simply someone playing an elaborate hoax, by uploading a rarely heard album from decades past, however none of the song titles or lyrics match up with anything online. After sending the record to a close friend whose musical taste leans heavily towards the more vintage, it served as a true testament to the quality of songs that he’s been virtually unable to take the album off play since hearing it. It’s this classically simplistic yet utterly unique songwriting that sets them apart from other acts with similar musical inspirations. Touches of Fleetwood Mac, Belle & Sebastian and The Beach Boys are littered throughout, whilst remaining true to the unbelievably addictive nature of their own. It’ll be criminal if <strong>The Yum Dee Days</strong> don’t sign to one of the slickest indie labels around.</p>\n<p>Drawing highlights from <em><strong>Memory Of The Future</strong></em> is despairingly difficult, simply due to the exceptional quality of the entire record. The ludicrously funky bassline on <em>Out 4 Daze</em> flows seamlessly into a festival ready chorus, before switching effortlessly into the lovelorn stutter of<em> U R Heavy</em>. The crooner swing of <em>The Future Is A Drag</em> is far and away one of the finest songs of the year, a call to arms for an inattentive, perpetually wasted generation, before the record closes out with the Belle & Sebastian chimes of <em>To Take Us Through The Night</em> and the melancholic balladry of <em>When It Was Over</em>.</p>\n<p><iframe src=\"https://w.soundcloud.com/player/?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F97704060\" height=\"166\" width=\"100%\" frameborder=\"no\" scrolling=\"no\"></iframe></p>\n<p>Almost seven hundred words down, and I’m yet to say anything of real value regarding the identities of <strong>The Yum Dee Days</strong>, and that’s very much an indication of just how utterly enthralled I am by this new outfit. With a release date stated on the Bandcamp as 4 July, I’ll be eagerly watching for future developments, however until then be sure to stream the record in full, and tell all your friends, because, hell, it’s the best album of the year.</p>\n<p><iframe style=\"border: 0; width: 350px; height: 626px;\" src=\"https://bandcamp.com/EmbeddedPlayer/album=3317771320/size=large/bgcol=ffffff/linkcol=0687f5/notracklist=false/transparent=true/\" seamless><a href=\"https://theyumdeedays1.bandcamp.com/album/memory-of-the-future\">Memory Of The Future by The Yum Dee Days</a></iframe></p>\n","slug":"22625-feature-who-on-earth-are-the-yum-dee-days","category":"album-reviews","date":1371735838000,"wpid":22625,"isSticky":false,"featured_image":null,"createdAt":1587283367491,"updatedAt":1587825869866,"author":"5e9b68b27a1236eccfeb1d27","categories":["album-reviews","introducing","mpfree","stream","new","music","reviews"]}