{"id":"5e9c0543774c2610387e4d64","artists":["5e9b68c77a1236eccfeb1d4e","5e9b68da7a1236eccfeb1e89","5e9b68e57a1236eccfeb1f99","5e9b68ec7a1236eccfeb1fec","5e9b68f27a1236eccfeb2030","5e9b68f27a1236eccfeb2053","5e9b68f87a1236eccfeb2097","5e9b69047a1236eccfeb2136","5e9b69047a1236eccfeb216d","5e9b69047a1236eccfeb218e","5e9b690a7a1236eccfeb21af","5e9b690a7a1236eccfeb21ba","5e9b690a7a1236eccfeb21bf","5e9b69117a1236eccfeb21fd","5e9b69117a1236eccfeb224a","5e9b69177a1236eccfeb2265","5e9b69177a1236eccfeb22a5","5e9b69177a1236eccfeb22b0","5e9b69257a1236eccfeb2332","5e9b69257a1236eccfeb2368","5e9b693e7a1236eccfeb24bb","5e9b69517a1236eccfeb2623","5e9b69577a1236eccfeb2678","5e9b695d7a1236eccfeb26ba","5e9b695d7a1236eccfeb26c9","5e9b695d7a1236eccfeb26e8","5e9b695d7a1236eccfeb26e9","5e9b69637a1236eccfeb2741","5e9b69637a1236eccfeb2748"],"title":"I Am Gonna Make It Through This Year If It Kills Me: Our picks of 2k13","content":"<p><em>We had a cute little idea at CitR Towers (that’s not really a thing, though would that it were) a few weeks back that, like the </em>real <em>music websites, we’d each do a little list of our favourite songs and albums of the year thus far.</p><p> You people like lists, right?</em></p>\n<p><em>The team being the dedicated, enthused, and writerly bunch that they are, t</em><em>he response was overwhelming. We had lists coming out our fucking </em>pores, <em>man, and what’s more, writeups, thousands of words of passionate and percolating prose dedicated to the music we love, because really, what else is there? </em></p>\n<p><em>Due to the incredibly restrictive space constraints visited upon us by the Internet, though (I’m sure you’ll understand), </em><em> we can only feature one here, and we decided it should be Rob’s, since he took the trouble to travel back in time and commune with his perennially whingy sixteen-year-old self, who seems to think that fourteen was a lifetime ago, and pretends to like Islay malt. Anywho, the kid gave his typically emotional take on Rob’s favourites this year, and the results are below. </em><em></em></p>\n<p style=\"text-align: left;\"><em>We’ve also managed to shoehorn in some album and song lists from webgod <a href=\"https://api.crackintheroad.com/author/Andrew/\">Andy</a>, SEO cowboy <a href=\"https://en.gravatar.com/samgoldencouk\">Golden</a>, and…er…’comedy’ writer <a href=\"https://admin.crackintheroad.com/author/drwillynickle/\">Callum Booth</a>. So y’know, enjoy, and keep your powder dry. </em></p>\n<p style=\"text-align: right;\"><strong>– CitR, 2k13</strong></p>\n<p><strong>Rob</strong></p>\n<p>The virtue of the full-length has been extolled by so many before me, and with such eloquence, that I needn’t really bother telling you about how wonderful albums are. Scribes bulge tumescent with pearly liquid joy at things like narrative arcs, track sequencing, sustained production tropes, bands’ record-to-record evolutions. And why not? These things are the marks of true craftsmen, surely, and talent and imagination and hard bloody work are things wonderful to behold in our arts.</p>\n<p>So I won’t tell you about how wonderful albums are.</p>\n<p>I love long players because I relish the thought of some fidgety snapback amoeba having a panic attack at the notion of sitting through more than one song. I crow and praise myself for my patience and taste and effort. For listening to albums is a skill, a hard-fought war, like being able to drink a bottle of Laphroaig without throwing up.</p>\n<p>I love albums because I have neither the time nor the patience nor the mental capacity to catalogue endless songs by endless bands, but I come over all sweaty at the thought of letting a track tumble through my memory’s colander into black forgetfulness. Longer collections of songs (by fewer bands) help appease the angry amateur librarian knocking around my skull.</p>\n<p>I love albums because growing up has me running scared, and physical media with its art and liner notes and tangible product is the closest I can come to fourteen again, listening to the same CDs over and over with booklets spread out on the Aztec-print bedsheets my mum chose. Maps to my heart, or some shit.</p>\n<p>2013 has not yet graced me with an album that I love. There are some honourable mentions. It would be dishonest in the extreme for me to ignore the clout of <em><strong>Trouble Will Find Me</strong></em>, which I had to stop listening to a couple of weeks back after I woke up with a crusty nose and a throbbing brow and little memory of the previous evening. My phone’s outbox was full of the lyrics to <em>Demons</em>, my inbox with concerned enquiries as to my mental health. It was a dick move, sure (as is telling you about it on the Internet), but I have this one vivid snapshot of myself swaying under the lights of Vauxhall station, <em><a href=\"https://www.youtube.com/watch?v=yIWmRbHDhGw\">Sea of Love</a></em> on full in my ears, torching a smoke and feeling something more powerful than happiness beat its black wings at my centre. There is no light without the other. And so it is that <em><strong>Anything In Return</strong></em> has been a significant milestone in my discovery that I can gambol <a href=\"https://www.youtube.com/watch?v=PlD-2Dx5868\">weightless in effervescent funk</a> just as well as wallow in my ego’s more oft-produced cloying sludge. <em><strong>Nostalchic</strong></em>‘s exemplary (if unoriginal, but that’s never bothered me) <a href=\"https://admin.crackintheroad.com/music/20306-video-lapalux-without-you/\">marriage of machinist glitch to burning soul</a> has left me feeling more debonair on nighttime London Overground services than I have any cause to. <em><strong>Ghost On Ghost</strong></em> perhaps I like for all the right reasons, the impartial academic ones as well as the visceral and emotional ones, a happy example of a longstanding favourite refusing to stagnate and <a href=\"https://www.youtube.com/watch?v=XfJNzA0Z7xw\">delivering the tunes</a> into the bargain. <em><strong>Obsidian</strong> </em>sounds as <a href=\"https://www.youtube.com/watch?v=9ZG5jw36S6o\">black and glistening</a> as its namesake and as excellent as anything else I’ve heard this year, though I’ve only listened to it three or four times as yet. I haven’t heard 2013’s offerings from <strong>Foals</strong> or<strong> Frightened Rabbit</strong>, <strong>The Wonder Years</strong>, <strong>Waxahatchee</strong> or <strong>Crash of Rhinos</strong>, but I can bet that any one of them would make a list like this with ease. Roll on December.</p>\n<p>So though it flies in the face of everything I thought I knew about myself, my heart belongs to the songs that I have heard so far in 2013. My stars, but there have been some blinders, some real poke-your-eyes-out-good shit.</p>\n<p><iframe src=\"https://w.soundcloud.com/player/?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F98192595&show_artwork=true\" height=\"166\" width=\"100%\" frameborder=\"no\" scrolling=\"no\"></iframe></p>\n<p><em>Kids</em>, by the most excellently-named <strong>Diarrhea Planet</strong>, sounds like Fang Island doing Titus Andronicus, sterling tumbledown bar-rock with a stupid widdly solo and a cigarette hanging from its lip. I knew that <em>All These Things</em>, by Irish wunderkind <strong>Mmoths</strong>, was good before I listened to it walking home through Camberwell in spring sunlight, one golden 9am, spangled off my tits. But shit man, <a href=\"https://www.youtube.com/watch?v=DkrTL62CLCA\">that song</a> led me by the hand through the fabric of reality and didn’t feel even a little scared. In May, Brighton grunge-savants<strong> Love Among the Mannequins</strong> delivered their<a href=\"https://admin.crackintheroad.com/music/21747-new-love-among-the-mannequins-joseph-cassel-or-john-michael-ernahue-or-god-d-16/\"> finest slice of unflinchingly forward-thinking rock music</a> to date in <em>Joseph Cassell or John Michael Ernahue or God, D16</em>. A careening, explosive (seriously, it’s an overused descriptor, but I never heard guitars sound more like bombs) paean to fuck knows what, which managed the admirable feat of making me feel ten feet tall without resorting to sentimental booby-trappage. I kind of <a href=\"https://admin.crackintheroad.com/music/21928-new-ftse-tidal-wave-ft-saint-saviour/\"> have to love FTSE whether I want to or not</a>, but luckily <em>Tidal Wave</em>, first cut from the <em><strong>FTSE1</strong></em> EP, hits the perfect pitch between sexy and miserable. It’s got a hopelessly glum funk bassline and some surprise horns and this unreally powerful middle eight that sounds like Kanye’s samples would if he’d spent his adolescence indoors with minimal human contact, then grown up to find that he still didn’t feel any better.</p>\n<p><iframe style=\"border: 0pt none; width: 100%; height: 120px;\" src=\"https://bandcamp.com/EmbeddedPlayer/album=3569551326/size=medium/bgcol=ffffff/linkcol=0687f5/t=5/transparent=true/\" height=\"240\" width=\"320\" seamless=\"\"></iframe></p>\n<p>My ash-grey and desiccated heart belongs, though, to this. It’s called <em>The Unbearable Heaviness of Having</em>, by one <strong>Vincent Vocoder Voice</strong>. Whether it’s serious or sarcastic or somewhere between the two, it doesn’t matter. This is a song wholly and gorgeously at odds with all the inconsequential minutiae of middle-class modern living, the myriad nothings that gather and swarm like Valium-loaded hornets to benumb at every possible juncture – “There’s no gunshots” for the song’s narrator, nothing that extreme, “no enemies, no bomb-shelter ends.” He’ll just sit flicking through his iPhone ’til he chokes on his friends.</p>\n<p>Crucially, all this grey depiction of anaemic and infinite comfort is never framed as a complaint. What you choose to make of it is your business.</p>\n<p>But I know how it felt, being told “so suffer little children, see if I care, suck a Samaritan’s receiver if you don’t think it’s fair,” over awkward, clanking basslines and needling guitar chime, like Modest Mouse at their best, or something from Saddle Creek’s golden age.</p>\n<p>I know how it felt being asked whether or not “we’re just sucking in fibre and blowing out shit”, as does the distant, wheedling hook that snakes through the song and bursts out full force at its close.</p>\n<p>It felt like a hand closing tight around the back of my neck, and pressing my face hard against the reflective surface of the medicine cabinet.</p>\n<p>It felt like music.</p>\n<p><em>By Rob Hollamby, aged 16 and 3/4</em></p>\n<p><strong>Andy</strong></p>\n<p><span style=\"text-decoration: underline;\">Album</span><span style=\"text-decoration: underline;\">s</span></p>\n<p><strong>My Bloody Valentine</strong> – <strong><em>mbv</em></strong><br />\n<strong>Field Rotation</strong> – <strong><em>Fatalist: The Repetition of History</em></strong><br />\n<strong>Pantha du Prince & the Bell Laboratory</strong> – <strong><em>Elements of Light</em></strong><br />\n<strong>Jon Hopkins</strong> – <strong><em>Immunity</em></strong><br />\n<strong>Eleanor Friedberger</strong> – <strong><em>Personal Record</em></strong></p>\n<p><span style=\"text-decoration: underline;\">Songs</span></p>\n<p><strong>My Bloody Valentine</strong> – <em>In Another Way</em><br />\n<strong>Jon Hopkins</strong> – <em>Open Eye Signal</em><br />\n<strong>Factory Floor</strong> – <em>Fall Back</em><br />\n<strong>Young Summer</strong> – <em>Pretty Boy</em><br />\n<strong>Hookworms</strong> – <em>Away / Towards</em></p>\n<p><strong>Sam</strong></p>\n<p><span style=\"text-decoration: underline;\">Albums</span></p>\n<p><strong>Young Fathers</strong> – <strong><em>Tape Two</em></strong><br />\n<strong>My Bloody Valentine</strong> – <strong><em>mbv</em></strong><br />\n<strong>Born Ruffians</strong> – <strong><em>Birthmarks</em></strong><br />\n<strong>Vampire Weekend</strong> – <strong><em>Modern Vampires of The City</em></strong><br />\n<strong>John Grant</strong> – <strong><em>Pale Green Ghosts</em></strong></p>\n<p><span style=\"text-decoration: underline;\">Songs</span></p>\n<p><strong>Born Ruffians</strong> – <em>Needle </em><br />\n<strong>Lorde</strong> – <em>Tennis Courts</em><br />\n<strong>James Blake</strong> – <em>Retrograde</em><br />\n<strong>Jim Guthrie</strong> – <em>Don’t Be Torn</em><br />\n.<strong>CULT</strong> – <em>Masked</em></p>\n<p><strong>Callum</strong></p>\n<p><span style=\"text-decoration: underline;\">Albums</span></p>\n<p><strong>Wavves</strong> – <strong><em>Afraid Of Heights</em></strong><br />\n<strong>Le1f</strong> – <strong><em>Fly Zone</em></strong><br />\n<strong>Run The Jewels</strong> – <strong><em>Run The Jewels</em></strong><br />\n<strong>Waxahatchee</strong> – <strong><em>Cerulean Salt</em></strong><br />\n<strong>Kilo Kish</strong> – <strong><em>K+</em></strong></p>\n<p><span style=\"text-decoration: underline;\">Songs</span></p>\n<p><em>“I’ll put a song list together too.”</em></p>\n","slug":"22859-i-am-gonna-make-it-through-this-year-if-it-kills-me-our-picks-of-2k13","category":"editorials","date":1374169679000,"wpid":22859,"isSticky":false,"featured_image":{"width":958,"height":700,"src":"2013/07/horror.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAME/8QAIBAAAQQCAQUAAAAAAAAAAAAAAQIDBBEAIVEFBhIxcf/EABQBAQAAAAAAAAAAAAAAAAAAAAT/xAAcEQACAgIDAAAAAAAAAAAAAAABAgADBREhIrH/2gAMAwEAAhEDEQA/AKvddS5GlRJFhbbCigDYbCd2Nc16o5tid9wxEZBXMNITvwHH3GMTVSlo7jcdkUWu8qg0OPJ//9k="},"createdAt":1587283267775,"updatedAt":1588403529043,"author":"5e9b68b27a1236eccfeb1d3c","old_image":"2013/07/horror.jpg","categories":["editorials","music"]}