{"id":"5e9c0578774c2610387e4d9b","artists":["5e9b69047a1236eccfeb2189"],"title":"Interview: Jagwar Ma","content":"<p>You could be forgiven for thinking that <strong>Jagwar Ma</strong> were formed a few months ago, such has been the rapidity of their rise in 2013.</p><p> In fact their debut record <em>Howlin’</em> is the culmination of two years’ work, a carefully plotted techni-colour explosion that shall see them play an eye-watering amount of festivals all across Europe this summer.</p>\n<p>Announcing their arrival on the UK circuit with a weekend at Glastonbury seems a little like opting for heroin as your first drug. I decided to check up on the guys on Sunday to see how it had all gone.</p>\n<p> </p>\n<p><b>Are there certain kinds of festivals that you look to play?</b></p>\n<p><i>Gabriel:</i> I don’t have any discretion as long as the line-up’s cool and the people that put it on are really nice. There are a few in Australia that I really want to play, like Harvest and another called Splendour, which we are actually playing, that’s near Byron Bay. It’s nice to play places that are so nice, like Calvi on the Rocks and even Glastonbury, it’s just such a beautiful area.</p>\n<p><i>Jack:</i>  This is our first festival run so I haven’t really forged my opinion yet. Obviously in Australia we grew up going to those festivals, but it’s our first time playing festivals in Europe and Glastonbury is our first festival in the UK.</p>\n<p> </p>\n<p><b>Got a lot booked for the summer then?</b></p>\n<p><i>G:</i> Yeah, pretty full for the six months, I can’t remember all of them off the top of my head. All the obvious ones, Reading/Leeds, Bestival, Latitude, Ibiza Rocks, Number 6, T in the Park.</p>\n<p> </p>\n<p><b>How long have you guys been playing together?</b></p>\n<p><i>G:</i> We all used to play in different bands, but all of our bands used to tour together, and we’ve all known each other since we were about 16. Me and Jono started it about two years ago and then Jack joined about a year ago.</p>\n<p> </p>\n<p><b>When you sat down to write this record (Howlin’) was there a conscious idea of how you wanted it to sound?</b></p>\n<p><i>G:</i> I have sometimes sat down and thought I want to write a song that sounds like this. The song <i>Four</i> was very pre-meditated in that way, we’d just got back from Berlin, and I’d been to Berghain for the first time, so we tried to capture that feeling we had whilst we were there.</p>\n<p>But then there are other songs, like <i>The Throw </i>and <i>Come Save Me</i> which came about in a much more natural process.</p>\n<p> </p>\n<p><b>What was the idea that motivated the start of Jagwar Ma, compared to previous projects?</b></p>\n<p><i>G:</i> I think we wanted to simplify it, mostly. It started with just me and Jono in a room, other than that we didn’t really think about it too much.</p>\n<p>Jack wasn’t in the room for most of the record, but now he’s jumped in to play the bass live, which definitely adds a new dimension as far as what it sounds like live. So in that sense it has grown. I’d like it to grow even more as well. With most electronic acts you find them constantly trying to confine it, but we’d like more people playing more things.</p>\n<p><i>J:</i> It’s trying to delegate as much stuff to human beings as possible so it has much more of an earthy quality to it. We don’t see why dance music should necessarily be electronic, because dance music has been around for much longer than all this technology.</p>\n<p> </p>\n<p><b>So do you think it’s difficult to traverse that line between something gratifying that gets the tent going, with something that is more human perhaps?</b></p>\n<p><i>G:</i> Well I think it’s fairly easy to bring reality to the music, and to make sure that there are people at the front of the music. It’s about soul.</p>\n<p><i>J:</i> But that is how we would approach it, because we’re all players originally, not DJs. Whilst Jono in particular has gone quite far down that route, when we were teenagers we were all playing in punk bands. So that is the challenge, bringing our skill-set into the electronic world.</p>\n<p> </p>\n<p><b>Is your music happy music?</b></p>\n<p><i>G: </i>I think so. But without going too personal, I was going through a break-up through the album so there’s definitely part of that in the lyrics, it can’t be more obvious than a song called <i>That Loneliness</i>?!</p>\n<p><i>J:</i> Yeah, there’s melancholy in there but overall I think the attitude of the band is of optimism.</p>\n<p><i>G:</i> We’re optimistic people, and I like that.</p>\n<p> </p>\n<p><b>Have you ever considered not playing music?</b></p>\n<p><i>G: </i>No, I was born like this. My Dad played music, his Dad played music, his Dad played music. It didn’t feel like a choice, not that we were forced.</p>\n<p> </p>\n<p><b>What would be the first thing you made sure you always brought with you to a festival?</b></p>\n<p><i>J:</i> A bottle of water and a good attitude. A map which is circled and underlined.</p>\n<p>But as you do more festivals that desire to see all the bands you love just slowly drains away. We were on our way to see the Stones last night, and we were on the trek, and then just saw <i>Public Enemy</i> to our right, and there was this kind of magnetism that just sort of drew us away. We just started dancing and thought ‘I guess we’re watching Public Enemy!’ I don’t know, what do you bring to a festival?</p>\n<p><i>G: </i>Just vibes.</p>\n","slug":"22866-interview-jagwar-ma","category":"interviews","date":1372946153000,"wpid":22866,"isSticky":false,"featured_image":{"width":800,"height":535,"src":"2013/07/jagwa-ma-2013.jpeg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAQG/8QAIhAAAgIBAwQDAAAAAAAAAAAAAQIDBAAFBxEGEjFhFSFx/8QAFAEBAAAAAAAAAAAAAAAAAAAAAf/EABQRAQAAAAAAAAAAAAAAAAAAAAD/2gAMAwEAAhEDEQA/AJNu+u6tTQLV6K03yly2lWMSQmRixPeFBP1wVVzyT5I/c11TdDUZasMi2arBkVgXMiseR5ICEA+gSPeMYB//2Q=="},"createdAt":1587283320224,"updatedAt":1588403529363,"author":"5e9b68b27a1236eccfeb1d22","old_image":"2013/07/jagwa-ma-2013.jpeg","categories":["interviews"]}