{"id":"5e9c33629b6559241525e056","title":"Interview: The Ascent Of Everest","content":"<img class=\"alignnone\" title=\"AOE\" src=\"https://www.</p><p>meltface.net/storage/aoe%20woods%20promo.jpg?__SQUARESPACE_CACHEVERSION=1233811881376\" alt=\"\" width=\"600\" height=\"350\" />\n<p>After releasing their stunning second full length album <em>From This Vantage</em>, <strong>The Ascent Of Everest </strong>are quite rightly on top of the world. Their intricate combination of melancolic post-rock and heart-wrenching soothing vocals have lead them to produce their finest work to date. <em><strong>Crack in the Road</strong></em> caught up with the group to discuss the recording of <em>From This Vantage</em>, the formation of the band and their future plans.</p>\n<p><em>Crack in the Road: How did The Ascent of Everest come about, and what were the main inspirations behind forming the band, both musically and otherwise?</em></p>\n<p><strong>I had been making recordings and trading songs with Casey and Drew and they invited me to play in the group that would later become The Ascent Of Everest some three days after formation and 4 days before the first show. They were kind of doing a more traditional Sigur Ros Godspeed post-rock kind of thing and I did my best to run the ball in the other direction infusing some shoegazy textures and tried to mess with the arrangements. We wrote alot of material in a very short amount of time and much of it would later be deconstructed and reworked into our first record. The name The Ascent Of Everest was almost a stab as to the way those original songs were arranged, starting soft, building to extreme heights and slowly descending back to the other side of the mountain, coincidentally this form is something we’ve taken extreme measure to avoid in all subsequent writing, aha. But the name sticks although it’s not really a mantra or credo if you will for how we write songs.</strong></p>\n<p><em>Crack in the Road: How did you go about recording From This Vantage? Did you go into the studio knowing many of the songs that would feature on the record, or did it evolve as you went along?</em></p>\n<p><strong>Well we had about 10ish songs or so that we considered and we had to make tough decisions on how many we could fit on a single LP. We tried to take a diverse sampling of songs that would still fit well with each other. We also opted for songs we’d had for some time that were the longest overdue for recording; some of the songs on the recording are almost 3ish years old and we figured if we didn’t record and release them now they’d be buried forever. We recorded the record at the studio we run out of our house; Meltface Studios, produced by me and engineered by Rob and I. It kept the pressure down on the recording process and allowed us the freedom to experiment a little, we also had a pretty intense deadline on the record (it was recorded in about a month and a half). We kinda had to do everything we could to save money because we kinda have to pay for it all ourselves and we seem to have moved out of the era where people buy music so you have to cut every corner if we’re going to break even (someday) and hopefully be able to afford to make another record which I really can’t wait to do we have so much material that we’re chomping at the bit to record and release.</strong></p>\n<p><em>Crack in the Road: The vocals are very much shared throughout the band, was this a joint decision from the beginning?</em></p>\n<p><strong>I guess the decision at the beginning was to be an instrumental band… but with vocals. If that makes any sense. I really didn’t want to be the “lead singer” of an instrumental band, rather just another voice with equal significance as every other part of the texture. Everything that’s happened vocally just kind of progressed naturally as people have vocal or choral ideas we try to implement them, there really isn’t a grand scheme philosophy to it.</strong></p>\n<p><em>Crack in the Road: What has been your most memorable gigging experience to date?</em></p>\n<p><strong>Hmm so many to choose from. I’d have to say the final date of our UK tour with Shels, Rinoa, and Latitudes at the Underworld in london. What a great club, great sound, amazing audience, and playing with great bands; everything was spot on for that show.</strong></p>\n<p><em>Crack in the Road: Is there a link between the name of the band and the feelings you aspire to create through your music?</em></p>\n<p><strong>I guess you could look at it that way, we aren’t really set on creating one feeling through our music I’d really like to create something new with every song not just try to work at distilling one specific emotion. If anything I hope the name just serves as a clue to the range of emotions the band is capable of conjuring.</strong></p>\n<p><em>Crack in the Road: Do you have any plans to tour Europe or more specifically the UK in the near future?</em></p>\n<p><strong>We’re talking to a few people and crunching the numbers on it right now, but we really hope to be able to tour Europe and the UK here in April.</strong></p>\n<p><em>Crack in the Road: How has the increased use of illegal downloading, alongside the growth of Spotify affected you, both as fans, and as musically artists?</em></p>\n<p><strong>I’d actually never heard of Spotify until this interview! aha. But yeah it’s all the same, people will always find a way to steal your music no matter what you do. I’m sure I don’t have to say it but without the financial support of what used to be the record buying public either thru show attendance or record sales, quality alternatives to mainstream music will disappear as bands and labels cannot even break even on their expenses. It’s sad as a fan to know there’s little I can do to help my favorite bands tour close enough for me to see them or put out new records as their momentum grinds to a halt by financial restraints that will inevitably cripple their ability to make music or break up the band. I’d say making progressive music in our era is a truly selfless act of paying to play, record, and put out your music for the sake of those it means alot to. Maybe we’ll see more quality music because there is no money or future in music anymore because people won’t be attracted to it for “the wrong reasons” but who knows, I could speculate as to the future of the industry for pages and pages. Really the bottom line is we’re keeping the faith and we’re not going to give up on making our music for ourselves, our friends, and our fans because their support has been what made it possible to do what we love. Everytime you go to a show or buy a record, donate a handful of change or a couple cigarettes to a band you should feel great about it cause even the smallest support means so much to independent bands.</strong></p>\n<p><em>Crack in the Road: If you could have any super power what would it be?</em></p>\n<p><strong>Hmmm, how about to freeze time?</strong></p>\n<p style=\"text-align: center;\"><a href=\"https://www.myspace.com/theascentofeverest\">Check Out The Ascent Of Everest’s Myspace!</a></p>\n","slug":"2297-interview-the-ascent-of-everest","category":"interviews","date":1280917324000,"wpid":2297,"isSticky":false,"featured_image":null,"createdAt":1587295074745,"updatedAt":1587825935006,"author":"5e9b68b27a1236eccfeb1d27","categories":["interviews","music"]}