{"id":"5e9c0545774c2610387e4d68","artists":["5e9b68ec7a1236eccfeb1fd9"],"title":"Video: Earl Sweatshirt – Hive (Feat. Vince Staples & Casey Veggies)","content":"<p><iframe src=\"//www.</p><p>youtube.com/embed/0FcDXL5Aw0o\" height=\"315\" width=\"560\" allowfullscreen=\"\" frameborder=\"0\"></iframe></p>\n<p>Fuck. Yeah. The latest video from Earl Sweatshirt dropped early this morning and, if at all possible, it’s made me even more hyped for his debut album, <em>Doris</em>.</p>\n<p>‘Hive’, which features the consistently excellent Vince Staples and Casey Veggies, finds Earl in a darker mood than ‘Woah’. The video is almost a reversal of <a href=\"https://api.crackintheroad.com/music/20387-video-earl-sweatshirt-woah-feat-tyler-the-creator/\" target=\"_blank\">aforementioned song</a>. It moves through similar terrain (homes, streets and cars), but where ‘Woah’ was drenched in primary colours and sunshine, ‘Hive’ is swathed in shadows.</p>\n<p>You can see this reflected in the shots of Earl himself. While in his last video shots of the rapper were light, both tonally and mood-wise, in ‘Hive’ the close-ups of Earl display him as worn-down, complete heavy bags under his eyes.</p>\n<p>The song itself is what I would refer to as a “BIG ONE”. The bass rumbles and rolls underneath jazz-influenced hi-hat taps, alongside the barsmith living up to his burgeoning reputation as one of the finest lyricists currently working in rap. Vince Staples verse is also fantastic, his laid-back flow riding the beat perfectly.</p>\n<p>On top of all this, we now have a solid release date for <em>Doris: </em>20th August. Keep that one in your diaries folks; it’s gonna be huuuuuuuuge.</p>\n","slug":"23077-video-earl-sweatshirt-hive-feat-vince-staples-casey-veggies","category":"music","date":1373975235000,"wpid":23077,"isSticky":false,"featured_image":null,"createdAt":1587283269922,"updatedAt":1588441764425,"author":"5e9b68b27a1236eccfeb1d11","old_image":"2013/07/earl-sweatshirt-950x535.jpg","categories":["music","new","videos"]}