{"id":"5e9c33509b6559241525e03d","title":"Interview: Two Door Cinema Club","content":"<p>Featured on the <strong>BBC Sound of 2010 </strong>shortlist, electro indie pop trio <strong>Two Door Cinema Club </strong>have recently released their debut album <strong>Tourist History</strong>.</p><p> An album which showcases that Northern Ireland can produce more than just gritty rock bands, <strong>Two Door Cinema Club </strong>have spent the summer promoting their album release and <strong>Crack In The Road </strong>were fortunate enough to catch up with the band at <strong>Eurockeennes Festival. </strong>Coming off the back of a particularly annoying interviewer who claimed that the band <strong>‘had never had to work hard’</strong>, <strong>Crack In The Road</strong> took a far more jovial approach when we were lucky enough to interview <strong>Two Door Cinema Club</strong>. Oh and to feel the full effect of this interview, please do read out <strong>TDCC</strong>’s answers in your best Northern Irish accent.</p>\n<p><strong>CITR:</strong> Have you heard of a band called Goldheart Assembly?</p>\n<p><strong>TDCC</strong>: Yes! Their press releases say they’re meant to be the new British Fleet Foxes ..</p>\n<p><strong>CITR: </strong>Well it just shows you how wrong press releases can be! However we were chatting to them at <strong>Dot to Dot Festival</strong> in Manchester, and they said their shittest show was travelling to Aberdeen to play to two people. Have you had any similar experiences?</p>\n<p><strong>TDCC: </strong>Southampton! It was our second or third tour of the UK, when we were touring with <strong>Metronomy</strong>. Our agent was like; ‘I’ve booked you a warm up show to get you ready for the tour’.  I think it was just so we could have a practice, and they knew that no one would be there, but they didn’t tell us this! There were 5 people, 3 or 4 of which were in the support act.</p>\n<p>Castleford, that shit was ridiculous! It’s essentially a service station. It was booked as a club night show, but it ended up being this chavvy bar, like something from Hollyoaks! We got up on stage and everyone stood with their back to us. It was full, but no one was there to see us. No one even clapped after songs, there was just silence between songs. Someone asked Kev to play b*witched. By the end of the set they’d got more drunk and it was just like mums on a night off from the kids. I think they thought we were a cover band, so we just thought ‘let’s take the 50 quid for doing this show and get the fuck out of here’.</p>\n<p>We’ve had a lot of bad tours, but that’s what you have to go through initially. When shit goes wrong on stage, but the audience is still digging it, then you don’t consider it a bad show, as the vibes are still good. I think what a lot of people don’t realize is what they hear out front, is very different to what we hear on stage. If it doesn’t sound good for us on stage, then it may sound fucking amazing out front. It’s just so frustrating as now that there’s an audience, if you fuck up then it gets to you.</p>\n<p>There was this one show in Cambridge, there was maybe about 80 people there and it was a tiny little room, it felt like playing in someone’s bedroom! But the atmosphere was great and everyone was up for it.  When you feel like people are actually waiting for you to play, then that makes a good show. That was one of our first every headline shows, and we were like ‘holy shit, people have actually paid money to come and see us play’.</p>\n<p><strong>CITR:</strong> I noticed you were being a bit blinded by the sun today ..</p>\n<p><strong>TDCC:</strong> Yeah, off the pedals! Today felt like I had to really concentrate on which pedal I had hit last. It doesn’t help that it’s really warm either, as my guitar is from the 60’s and doesn’t stay in tune at the best of times!</p>\n<p><strong>CITR: </strong>Did you suffer similar problems at Hove?</p>\n<p><strong>TDCC:</strong> Nah, Hove was great. Maybe because we had the sun behind us! Due to the travel logistics as well, we’re having to rent in amps and things, so it’s never going to sound as good as you would like it. You do take it for granted when you have your own bus and all your own shit in your trailer.</p>\n<p><strong>CITR:</strong> As far as Two Door Cinema Club goes as a band name, is it true that it was born out of a mispronunciation?</p>\n<p><strong>TDCC:</strong> It is true! We were spinning band names and one of us mentioned ‘Two Door Cinema Club’, when it was actually ‘Tudor Cinema’. Maybe it’s too much American television! (This is followed by 30 seconds of various crude, but funny American accents of ‘Tudor’).</p>\n<p><strong>CITR:</strong> What is this I hear about TDCC and Kanye West working together?</p>\n<p><strong>TDCC:</strong> That was an April Fools joke! A friend back home who runs a magazine just started it and everyone seemed to forget that it was the 1<sup>st</sup> of April. But it just took off and everyone started claiming it as dead proof and that Daft Punk were going to produce! All the messages we got from friends were like ‘You’re such a dick, I can’t believe you didn’t tell me!’ People were just so upset that we didn’t tell them!</p>\n<p><strong>CITR:</strong> Kanye did mention you on his blog though, or was that all part of the act?</p>\n<p><strong>TDCC:</strong> Well what happened was that Kanye had found out about us from Daft Punk because Daft Punk are quite close to our label, Kitsune, as the guy who owns Kitsune used to tour with them. So he’d given them some of our music early on, and Daft Punk then passed it on to Kanye, before it all became this huge story!</p>\n<p><strong>CITR:</strong> Should this ever become more than a joke, would you work with Kanye?</p>\n<p><strong>TDCC:</strong> I’d work with Daft Punk, but not Kanye!</p>\n<p><strong>CITR: </strong>You’ve recently finished touring America, how was that as an experience?</p>\n<p><strong>TDCC:</strong> Amazing. We got to do it the proper way ..</p>\n<p><strong>CITR: </strong>What is the proper way?</p>\n<p><strong>TDCC:</strong> Damp, shitty motels! Budget tour essentially. We were in this little van touring from state to state and it was just this really really nice experience. We drove at least like 6 hours a day. We did one 26-hour drive none stop. Even their roads were more interesting than our roads! Things like, oh my god it’s a yellow school bus! It’s the LAPD! It happens in the movies! This big fat hairy trucker we saw really summed it up. Our Tour Manager was sick of us by the end of it.</p>\n<p><strong>CITR:</strong> How were you received across the pond?</p>\n<p><strong>TDCC: </strong>It was amazing. We started by supporting Phoenix, and those shows were to three to four thousand people every night. Then once we moved on it changed to playing to three to four hundred people a night. LA and New York were amazing, especially as we were allowed to be that unknown cool band across there for a while! Kind of ‘have you ever heard of them? No? Then they must be cool then!’ We even got our first celebs on guest list in America, including Daft Punk and the head of Apple! We were just hanging out with the high rollers in America, and then travelling back to our shitty hotel!</p>\n<p><strong>CITR:</strong> Thank you for your time guys and we’ll see you at Leeds!</p>\n<p><script type=\"text/javascript\" src=\"https://video.unrulymedia.com/wildfire_12390563.js\"></script></p>\n","slug":"2315-interview-two-door-cinema-club","category":"festivals","date":1281528046000,"wpid":2315,"isSticky":false,"featured_image":{"width":3456,"height":2304,"src":"2010/08/img_9797.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAYH/8QAIBAAAQQDAAIDAAAAAAAAAAAAAQIEBREAAxIGQQcTFP/EABQBAQAAAAAAAAAAAAAAAAAAAAL/xAAXEQEBAQEAAAAAAAAAAAAAAAABABFB/9oADAMBAAIRAxEAPwDOfhzw5r5FP6Uv0ILDTp/W4TsHX2DvlKAARQJqz6F5LTsZER03IMkzDlSWzjZpBSwFHlRFi9l+sYxAZsHl/9k="},"createdAt":1587295056899,"updatedAt":1588403564800,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2010/08/img_9797.jpg","categories":["festivals","interviews","music"]}