{"id":"5e9c335f9b6559241525e050","title":"Interview: Someone Still Loves You Boris Yeltsin","content":"<p><img class=\"alignnone\" title=\"SSLYBY\" src=\"https://c4.</p><p>ac-images.myspacecdn.com/images01/63/l_09f1fffff0a1ae50b05e56bb13a0f8e3.jpg\" alt=\"\" width=\"500\" height=\"336\" />After a year away, Missouri based indie group <strong>Someone Still Loves You Boris Yeltsin </strong>are back, with their third full length release <em>Let It Sway</em>. With the new album produced by <strong>Chris Walla</strong> (of<strong> Death Cab For Cutie Fame</strong>) released on the 17th of August, the wave of hype around the band is quickly gathering steam. The aesthetic is clean and crisp, echoing the sound they discovered on 2008’s<em> Pershing</em>, whilst they have also discovered a new are more adventurous side to the band, on tracks such as <em>Banned (By The Man)</em> and the epic that is<em> Stuart Gets Lost Dans Le Metro</em>. With the album release so soon, <em><strong>Crack in the Road </strong></em>were delighted to be given the chance to ask <strong>Someone Still Loves You Boris Yeltsin </strong>a few questions. Check back later in the week for a full, comprehensive album review.</p>\n<p><em>Crack in The Road: How do you think growing up in Missouri affected the music that you were to go on to later produce?</em></p>\n<p><strong>Well actually none of us spent much time growing up in Missouri.  I spent the school years in Queens New York and would spend only a few weeks each summer in the ozarks of Missouri.  Phil was born in Springfield but spent most of his childhood growing up in Cincinnati.  I think we both moved to Springfield for good around 10.  Give or take a year or so.  John was in Arkansas until college and I have no idea where Jonathan was or what he was doing.</strong></p>\n<p><strong><span style=\"font-weight: normal;\"><em>CitR: How did working with Chris Walla on Let It Sway turn out?</em></span></strong></p>\n<p><strong>Great.</strong></p>\n<p><em>CitR: What has been your most memorable tour moment to date?</em></p>\n<p><strong>Falling off the left side of America while camping in Oregon.  By all means I shouldn’t be here typing this.  11 years of gymnastics saved my life that night.</strong></p>\n<p><em>CitR: From both an artists point of view, and a fan, how has the increasing use of illegal downloading, and programs such as Spotify affected you?</em></p>\n<p><strong>I’ve actually never heard of Spotify.  I had to go to my dads house to use my step moms computer to even get access to the internet and a computer, so I’m a bit behind on anything related to this.    I think it has hurt us monetarily a bit for sure.  I think sometimes one student will put it on the intranet at a college and suddenly everyone at school will have it, but if they all like it then that makes us feel really good.  They come to our shows and show support and buy shirts and some even come us to us and say “I got your cd online but I loved it so much I wanted to buy an actual copy,” which is rad.  I think I’m more interested in making people happy than making a lot of money.  It only becomes concerning to think we may not be able to continue doing this because of a lack of it.</strong></p>\n<p><em>CitR: Making a limited edition of 1,000 coloured vinyls available is a brave and respectable move, does this show your belief that vinyl as a format still has a future?</em></p>\n<p><strong>Well so far it seems that more people have ordered the vinyl than the actual cd.  There’s something really neat about holding something as a big as a vinyl and feeling like you really got something special.  The art looks better, the vinyl itself is a neat contraption, and it can become part of your room, almost like art. Compared to seeing the cover of an album on a 2 inch screen on a small device I think it brings you a bit closer to how you may feel about the music, or make it seem more special.  It’s easy to jump around on an iPod from one band to another, but it’s different to put a vinyl on a record player and sit back and let it take over you.</strong></p>\n<p><em>CitR: How natural was the transition from Pershing to Let It Sway?</em></p>\n<p><strong>Very natural actually.  I feel like we almost didn’t notice it happen.  Pershing is a great middle ground that helps separate Broom from Let It Sway.  If we had gone from Broom and then released Let It Sway I think it would have been jarring and confusing to us and our fans.  But with Pershing I feel all three cd’s are like steps on a staircase, and it makes sense to transcend them.  Jumping from the bottom to the most recent would be a bit awkward.</strong></p>\n<p><em>CitR: What was your first album that you can remember purchasing?</em></p>\n<p><strong>Queens Greatest Hits on Cassette.  I think I was 11 or 12.  Bohemian Rhapsody wasn’t on the cassette version.</strong></p>\n<p><em>CitR: If you could have any super power what would it be?</em></p>\n<p><strong>Transform into a robot.</strong></p>\n<p style=\"text-align: center;\"><a href=\"https://www.myspace.com/boris\">Check Out Someone Still Loves You Boris Yeltsin’s Myspace!</a></p>\n<p style=\"text-align: center;\"><a href=\"https://www.polyvinylrecords.com/store/index.php?listID=69\">Order Let It Sway!</a></p>\n","slug":"2319-interview-someone-still-loves-you-boris-yeltsin","category":"interviews","date":1280937664000,"wpid":2319,"isSticky":false,"featured_image":{"width":500,"height":336,"src":"2011/06/l_09f1fffff0a1ae50b05e56bb13a0f8e3.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAMG/8QAHxAAAQQCAgMAAAAAAAAAAAAAAQACAwQFESExBhOR/8QAFQEBAQAAAAAAAAAAAAAAAAAAAwT/xAAYEQACAwAAAAAAAAAAAAAAAAABAgADEf/aAAwDAQACEQMRAD8Avgs9jmePTUYKXqkmjJD4tkt31yT2sBLZotleH1JHPBIJOuT9RFGLWUlY7VIRuT//2Q=="},"createdAt":1587295071657,"updatedAt":1588403564927,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/06/l_09f1fffff0a1ae50b05e56bb13a0f8e3.jpg","categories":["interviews","music"]}