{"id":"5e9c053d774c2610387e4d5e","artists":["5e9b69047a1236eccfeb2196"],"title":"Live Review: Japandroids at Dingwalls, London – 18th July","content":"<p>I really don’t know what to say about this show.</p><p> It always takes me a while to put words to page to describe something that just happened in a room, but this time I really don’t know if the right words will ever come. I am equally as clueless to if that is because I was so blown away by what I saw on Thursday night, or because it’s all been said before about this band*. <em><br />\n</em></p>\n<p>It was a set which by all means blew my shit in multiple directions, all over the sweat clad walls of yet another classic underground Camden bar venue, but that did not surpass my expectations in the slightest. It was everything I knew Japandroids to be, delivered to my face, and it felt weird. What do I say about something like that, ‘thank you’?</p>\n<p>So there we have it, nothing. I will say nothing. Is this malaise of confusion that I now feel some kind of delicious and deliberate execution of ‘<i>Post-Nothing’ </i>as a concept? If so it is quite possibly the most audacious artistic delivery of existentialism the world is yet to see. A master-plan of four years in the making that even Beckett himself could nay have fathomed, laboriously scrawling self-conscious insanities over page after page, for little did he perceive the future power of Canadian rock. Well done you have silenced a British live music ‘critic’ (very loose application of the term) in London. Now we don’t have to listen to anything they have to say ever again. Fuck yeah Brian.</p>\n<p>In reality, I will have been alone in feeling confounded afterwards, because I am the one that feels a certain pressure to try and dissect something about an experience that is so self-evidently the embodiment of what it is. It is a performance and it is music that is totally affirming to the fan. And that is why in truth the title of their second album, <i>Celebration Rock</i>, is a whole lot more to the point.</p>\n<p>Japandroids are the kind of band that make you feel silly for taking life too seriously, or escaping its most fundamental purpose with divergent excuses that lead to nothing but an after-thought. To me at least, they are about what is in the room now. ‘Remember that night you were already in bed, said fuck it and got up to drink with me instead.’ You can never go wrong with what is in the room now. The most relieving thing I found watching them live, was to see that this spirit and vigour that you envisaged through their music was alive in these two people, and that they could deliver it in equally summoning force onstage.</p>\n<p>After playing Latitude on Friday, Japandroids will have headed back to homely Canada to ponder what comes next after a solid four years of aggressively living in front of people’s faces. They said it would be their last stint in the UK for a long time, and they asked us to help them make it count. I guess the fact that I lost all sense of tally or measure means that we both succeeded with that one, bravo boys.</p>\n<p><em>Even by our own <a href=\"https://api.crackintheroad.com/music/18211-live-review-japandroids-heaven-london-281012/\">Rob Hollamby</a> – SG</em></p>\n","slug":"23198-live-review-japandroids-at-dingwalls-london-18th-july","category":"live-reviews","date":1374397803000,"wpid":23198,"isSticky":false,"featured_image":null,"createdAt":1587283261072,"updatedAt":1588441764341,"author":"5e9b68b27a1236eccfeb1d22","old_image":"generated/fbe77fc315c9d74a5b6ce8f0bbff2d2bf2b8fd75.jpg","categories":["live-reviews","music"]}