{"id":"5e9c0520774c2610387e4d45","artists":["5e9b68fe7a1236eccfeb20ff"],"title":"Interview: Halo Halo","content":"<p>I caught Halo Halo playing under the low lights of The Lexington earlier this month.</p><p> The room was packed to the back. Arriving unfashionably late, sweet Sinawi synth-pop spilled down the stairs as I walked through the door.</p>\n<p>Rachel Horwood (<strong>RH</strong>), Jack Barraclough (<strong>JB</strong>) and Gill Partington (<strong>GP</strong>) came together to form Halo Halo two years ago. At the beginning of July their self-titled debut EP was released on Upset The Rhythm.</p>\n<p>I found the album unconventional in production and filled with vast, colourful and fleeting narratives. Thanks to the band though you can make your own mind up and stream their new album below while reading.</p>\n<p>A week after the show I caught up with the guys to discuss cloudberry jam, cults and what’s coming up next for the intrepid trio.</p>\n<p><iframe style=\"border: 0; width: 100%; height: 120px;\" src=\"https://bandcamp.com/EmbeddedPlayer/album=2630668155/size=medium/bgcol=ffffff/linkcol=0687f5/transparent=true/\" height=\"240\" width=\"320\" seamless=\"\"></iframe></p>\n<p><span style=\"color: #999999;\">Text in light grey has been added as a postscript by the author.</span></p>\n<p><strong>Hi guys, how’s it going? Tell us where you are right now?</strong></p>\n<p><strong>JB:</strong> I’m sitting in my boiling kitchen drinking a pint of iced coffee.</p>\n<p><strong>GP:</strong> An attic in Lewisham</p>\n<p><strong>RH:</strong> Sweating at home</p>\n<p><strong>I know Halo Halo was inspired from the Filipino desert by the same name. How did that come about and why did it stick?</strong></p>\n<p><strong>RH:</strong> Coming up with band names is always difficult, when we started it was just me and Jack, and I wrote a list of possible names. I wrote Halo Halo as a bit of a joke and also because its one of my favourite things to eat. The word Halo means ‘mix’, and i think it stuck because its a good representation of what we do. Although people never know how to pronounce it.</p>\n<p><span style=\"color: #999999;\">/hăl-ŏ – hăl-ŏ/</span></p>\n<p><strong>How have things changed since the release of your multi-coloured 7” Manananggal in January last year?</strong></p>\n<p><strong>JB:</strong> We’ve finished and released our album, and got a bit better at playing, but other than that everything is exactly the same. We already knew a lot of the people we regularly play gigs with before starting the band. That’s not to say its getting stale though, its still fresh, soft and warm.</p>\n<p><strong>RH:</strong> Nothing’s really changed, and we kind of like things as they are right now, but we’re hoping that we’ll get to play some bigger gigs or festivals.</p>\n<p><strong> GP:</strong> I bought a jet.</p>\n<p><strong>So is this a full-time gig at the moment or still something on the side?</strong></p>\n<p><strong>JB:</strong> Its somewhere in between part-time and full-time and a bit of fun and a ‘career’. ‘Extra Curricular’ you might say.</p>\n<p><strong>GP:</strong> It’s not exactly full time, but it does take up a lot of our time, especially since we recently went on a three week tour of France.</p>\n<p><strong> RH:</strong> We wouldn’t be able to afford our rent if we didn’t have anything on the side, and any money we make with the band goes back in, for travel, practices, and equipment etc. Having fun is hard work!</p>\n<p><strong>You’ve played some interesting sets around the world over the last few years including performances in Israel, the Republic of Korea, the Arctic Circle. What was a stand-out gig for you, any crazy stories to share?</strong></p>\n<p><strong>GP:</strong> We played in a tiny village in Northern Sweden, at their annual fete. There were pony rides and fried fish stalls and things, and we played on a stage outside, to a crowd of old people and children. It was hilarious and a bit surreal. The compere lady gave us a wildly enthusiastic introduction in Swedish, danced around wearing a red cowboy hat, then afterwards she formally presented us each with a jar of cloudberry jam and made us read out some raffle numbers. Also, Jack had a nosebleed during the gig. There is video evidence on our blog.</p>\n<p><strong>RH:</strong> I think one of my favourite gigs was also at the village fete in Sweden. We played some really great gigs on our french tour with Reveille this summer too. We played at a festival in Saint-Cadou, in Brittany, in a blue big top covered in yellow stars. By the time we were on lots of people were pretty drunk and up for having a good time so there was lots of dancing and everyone got really into it. At one point a man jumped on stage and tried to pull a moony at the crowd though he was a bit too drunk to manage it. After the gig another drunk teenage girl hugged Gill, saying she liked to hug “future stars” – that was interesting, but its nice when people come up to you and have a really positive reaction, as its always a bit scary playing your songs to a new crowd.</p>\n<p><strong>JB:</strong> The last show of our tour with Reveille was in the Ardeche in France, we played a party in a barn, I think it’ll go down as one of my favourites. There was a really good atmosphere. There was a conga, some barking dogs, and the crowd wouldn’t let us leave, they physically blocked us from getting past them after the show and forced us back to our instruments!</p>\n<p><strong> One of the things I couldn’t help noticing when seeing you play live was a wild bearded gent at the front, getting absolutely tribal and rocking out to the music.</strong></p>\n<p><strong>JB:</strong> Its our friend Jan, he comes to nearly all our gigs and he has a pretty unique style of dancing. Its all in the legs.</p>\n<p><strong>GP:</strong> He’s not a pill head, he’s just high on music.</p>\n<p><strong>RH:</strong> When everyone else is it staring at you glumly or doing a bit of chin-stroking (massive generalisation I know) its really refreshing to have someone getting into the music who just doesn’t give a shit or care about how they’re supposed to behave.</p>\n<p><strong>Your self-titled debut album was released on Upset The Rhythm this month and has already attracted mixed reviews from the press. Tell us a little bit about the recording process of the album. Did it turn out as you had envisioned?</strong></p>\n<p><strong>JB:</strong> We recorded the album over 5 days at Soundsavers in London with Mark Jasper, pretty much live apart from our vocals and a few keyboard parts, a hurdy gurdy, and a hoover sucking a harmonica. Then it was mixed and mastered by Nico Marcel, who lives in France and sent us his mixes online, these went back and forth over a couple of months. Its hard to say if its as we envisioned. I didn’t have a clear vision of it in the first place. Its our first album, so I’m just happy and relieved that we actually made it.</p>\n<p><strong>RH:</strong> I didn’t know what to expect, I agree with Jack that its just good to have these songs finally recorded as we’ve been playing some of these songs for a couple of years. Now we can start to think about writing some new songs and how we may approach recording a second album. I have to say i always find recording difficult knowing that you’re making a more ‘definitive’ version of a song. I’m used to hearing our music live and I really hate listening back to my vocals on recordings. I’m just glad that some people like it and that we got it done, its nice to hold it in your hands and I’m really happy with how the art work turned out.</p>\n<p><span style=\"color: #999999;\">Just as this interview was about to be published Halo Halo have posted their debut album streaming in its entirety over at <a href=\"https://halohalo.bandcamp.com/album/halo-halo\"><span style=\"color: #999999;\">bandcamp.</span></a></span></p>\n<p><strong>I’ve counted cowbells and banjo among the instruments used in your latest album, how many instruments did you use altogether and who plays what?</strong></p>\n<p><strong>GP:</strong> Ten instruments, if you count two different banjos and two different keyboards. Rachel drew pictures of them for the album poster. I played bass and keyboard, Jack played drums, hoover and plastic tube thing, Rachel played banjo and keys, and our friend Joseph played his hand made hurdy-gurdy. Harmonicas were played by Jack, Rachel and Henry the Hoover.</p>\n<p>Your music harks back traditional eastern melodies with a heavy use of repetition, yet something about the delivery has a clear Western rock ‘n’ roll attitude. Was this deliberate?</p>\n<p><strong>JB:</strong> I think the rock ‘n’ roll attitude is more international and it must be part of our DNA by now, we just can’t help it baby!</p>\n<p><strong> Some of your songs have pretty wild titles including album opener ‘Djeddjehutyiuefankh’ named after an Ancient Egyptian mummy discovered without a heart. There’s also a song about time traveling fishermen. How do you come up with the concepts and stories told in your songs? What inspires the lyrics and who actually writes them?</strong></p>\n<p><strong>GP:</strong> The song about the mummy was based on something I read. The heart is usually buried with the body, because according to the Egyptian Book of the Dead, in the afterlife your heart is weighed against a feather, to determine your soul’s fate. Djeddjehutyiuefankh didn’t have one so basically he’s stuffed. The other lyrics are written by Rachel and Jack, but occasionally we invent them on the train on the way to a recording session.</p>\n<p><strong>JB:</strong> We often write lyrics together after thinking about the subject of a song. With Taro Taro Taro I wanted to find out when the first story about time travel was written, so I looked it up and found the story of Urashima Taro. A few of the songs are more personal, and are about ourselves and experiences. Though none of us spend a lot of our time writing lyrics, which is why a few of our songs are instrumentals with the occasional “WOOP”!</p>\n<p><strong>RH:</strong> A lot of our songs are inspired by old stories and myths, the idea for Comet came from a friend who was explaining a film that he wanted to make, in which one of the main characters joins a cult who believe they can escape Earth by riding on a comet. I didn’t know anything about the Heavens gate cult until Gill asked about the song and told me about them, which I suppose is where he got the idea from. Whatever catches our interest could be turned into a song.</p>\n<p><strong> What shows have you got coming up?</strong></p>\n<p><strong>JB:</strong> We have a few shows in London, including a festival put together by Upset! the Rhythm at the Yard theatre in Hackney on the 17th of August. We’re already planning another tour which will be in the new year. And we have plans to record a new single or e.p even soon.</p>\n<p><span style=\"color: #999999;\">Upcoming dates include the 1st August at Birthdays in London with Flamingods & Hypnotized and the 19th October at A Carefully Planned festival in Manchester.</span></p>\n<p><strong>Massive thanks to Halo Halo for taking the time to do this. Go find them over on <a title=\"Halo Halo's Facebook\" href=\"https://www.facebook.com/halohalomixmix\">Facebook</a>, maybe even like them if you feel so inclined.<br />\n</strong></p>\n<p> </p>\n","slug":"23307-interview-halo-halo","category":"interviews","date":1374751716000,"wpid":23307,"isSticky":false,"featured_image":{"width":100,"height":100,"src":"2013/07/halo-halo-2013-100x100.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFwAAAwEAAAAAAAAAAAAAAAAAAgMEB//EACEQAAMAAQQBBQAAAAAAAAAAAAECAxEABAUhBiMyUVKS/8QAFQEBAQAAAAAAAAAAAAAAAAAABAX/xAAaEQACAgMAAAAAAAAAAAAAAAAAAQIhAxFC/9oADAMBAAIRAxEAPwDJ57huK2DQMZmk8zNZMMZDdF/qD0M6TOvLtNGTYzZCAQSZ9j592i8ZRX4mtGVWoV7cjJOQM96gO3jk+jP8jRYzW3RReLpN2f/Z"},"createdAt":1587283232664,"updatedAt":1588403528910,"author":"5e9b68b27a1236eccfeb1d40","old_image":"2013/07/halo-halo-2013-100x100.jpg","categories":["interviews","music"]}