{"id":"5e9c0505774c2610387e4d2b","title":"Review: Latitude Festival 2013","content":"<p>We have a soft spot for <strong>Latitude</strong> here at Crack in the Road, having now ventured down to Suffolk for a third consecutive year.</p><p> Set in the truly beautiful surroundings of Henham Park, Latitude followed the same format and layout that had worked so well last year, as, after all, if it ain’t broke, don’t fix it. The only changes were a slightly different cast of sponsors, the most notable being BBC 6Music taking over the reigns of the second largest stage from the now defunct Word Magazine.</p>\n<p>If we cut directly to the chase, we love Latitude because of the legitimate platform it gives emerging new bands that we often share and promote through our own humble means. There is no ‘introducing’ stage, or anything else so garishly named, instead there is the iArena, tucked away neatly in the woods on the site, and as a new addition this year there was the Alcove Stage. The former has developed a sterling reputation over Latitudes past, and it’s location only compounds the sense of discovery one feels when one watches a band perform there. However the latter, as a new addition, stood up well as the festival’s smallest music-only stage, and saw many wonderful performances, including one slightly bizarre one from <strong>Chloe Howl</strong>.</p>\n<p>I started my own journey to Latitude from Manchester on the Thursday before, which involved a stay at Palmer’s Lodge in Willesden Green (https://www.palmerslodges.com), London that evening. A comprehensive hostel, Palmer’s Lodge provided a clean, safe, if basic, evening, which would be ideal for any eager traveler. The following morning brought the customary pilgrimage route of London Liverpool Street to Diss, however on this occasion a d<a href=\"https://www.bbc.co.uk/news/uk-england-suffolk-23434288\" target=\"_blank\">eranged Lithuanian man</a> decided to climb onto the roof of Ipswich Rail Station. Severe delays ensued, and I ended up in a mini bus with 7 strangers who had all decided to escape the confines of the stationary train.</p>\n<p>Despite a late arrival, I caught a majority of those highlighted on my clash finder, which is always a trusty companion at a festival. Stand out performances on Friday must be allocated to <strong>Wolf Alice</strong>, <strong>Sweet Baboo</strong>, and <strong>Cat Power</strong>. Wolf Alice, having moved from strength to strength since the release of ‘Bros’, commanded the Lake Stage with an unassuming power, delivering their pop sensible melodies and rock riffs to an eager crowd. <strong>Sweet Baboo</strong> followed later that day, and the Moshi Moshi starlets mixture of folk and pop influences, along with their Welsh heritage, provided a wonderful upbeat soundtrack to the ever increasing amount of sunshine. The largest reservoir of plaudits must be saved for <strong>Cat Power</strong>, who’s performance on the Obelisk Arena will last long in the memory. Strutting with an awkward self assurance, Cat Power matches an eager crowd’s expectation and as the set draws to an end she throws single flowers into the audience.</p>\n<p>With the move of Guilty Pleasures from its traditional slot of Saturday night to Friday night, Saturday morning was a slightly more hazy affair than usual. Many of you may have already seen the photos, however if you haven’t then you will not be able to comprehend the staggering attendance that marked <strong>Bo Ningen</strong>‘s performance on the Lake Stage. Always a brilliant live act, Bo Ningen were followed later in the day by <strong>Jagwar Ma</strong>, who themselves put on a lively, engaging performance, though to not quite as many people. However this lesser attendance didn’t stop the Australian outfit from fully embracing the Latitude atmosphere, and plying their psych-rock wares fantastically. Crowd favourites <strong>Hot Chip</strong> marked another considerable highlight of the weekend, presenting a professional yet entirely fun set that was littered with classics. Reaching the climax of the evening meant the inevitable trip to <strong>Kraftwerk</strong>, and while they are rightfully heralded for their important place in musical history, I couldn’t help but feel uninspired by their performance. However this was perhaps in great part due to the lack of atmosphere within the audience, and with most of Latitude’s attendees appearing to be 16-19, or part of a small family, this was sadly understandable.</p>\n<p>Sunday arrived in its usual glory, presenting us all with the final zap of energy one feels on the home straight. I could barely ask for a better start to a day than to watch <strong>Hookworms</strong> perform with an angst ridden zeal that spread through all of those who had made the journey into the woods. A slight change in mood as a wander to the Obelisk Arena concluded with a stunning afternoon set from the legend that is <strong>Bobby Womack</strong>. A complete performer, Womack engaged with his audience like the brilliant veteran that he is, and was simply a genius booking. <strong>Temples</strong> returned proceedings to a suitably raucous tempo, with a crowd that could barely fit within the woods themselves, never mind the modest tent covering the stage. With my mind and body failing, New York’s <strong>Friends</strong> produced the ideal pick-me-up with their endearingly fun and energetic set. This renewed enthusiasm lifted me to the BBC 6music stage, skirting around the rapturous <strong>Foals</strong> crowd, to my own personal conclusion of <strong>Beach House</strong>. Accompanied by a near blinding light show, <strong>Victoria Legrand</strong> is as close enough to an ultimate front woman that is necessary, and the band’s set was an appropriate conclusion to our second Latitude weekend.</p>\n<p>Whilst we were at Latitude, we managed to have chats with <strong>CHVRCHES</strong>, <strong>Rhye</strong>, and <strong>Local Natives</strong>, all of which will be appearing on the site over the coming week!</p>\n<p> </p>\n","slug":"23431-review-latitude-festival-2013","category":"live-reviews","date":1375089004000,"wpid":23431,"isSticky":false,"featured_image":{"width":1024,"height":677,"src":"2013/06/latitude.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAAAAb/xAAfEAABAwQDAQAAAAAAAAAAAAACAQMRAAQFEgYTYSH/xAAVAQEBAAAAAAAAAAAAAAAAAAAFBv/EABsRAAICAwEAAAAAAAAAAAAAAAECAAMEERQh/9oADAMBAAIRAxEAPwCVYvxvMCGJvnzax7hSoMAgT4RJJR4i/alneK4HtPVm412WIcpSpnotB8Ywps660Au2zP/Z"},"createdAt":1587283205546,"updatedAt":1588403528776,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2013/06/latitude.jpg","categories":["live-reviews","newreviews","music","reviews"]}