{"id":"5e9c335b9b6559241525e04d","title":"Mercury Nominations 2010 Part 2","content":"<p><a rel=\"attachment wp-att-2364\" href=\"https://admin.</p><p>crackintheroad.com/music/2357-mercury-nominations-2010-part-2/attachment/img_1737\"><img class=\"alignnone size-fullheader wp-image-2364\" title=\"IMG_1737\" src=\"https://api.crackintheroad.com/uploads/2010/08/IMG_1737-300x200.jpg\" alt=\"\" width=\"300\" height=\"200\" /></a>So following on from my summary of the first six of the 2010 Mercury Nominations, here are my brief thoughts on the other records vying for the £10,000 prize money, as well as the prestigious title.</p>\n<p><strong>I Am Kloot</strong> – <em>Sky At Night</em></p>\n<p>Easily their most accessible record to date,<strong> I Am Kloot’s</strong> fifth studio record has also been their biggest commercial success to date. With no hit singles, it did well to chart at number 24,  although it did stream for several weeks on the Guardian website. With production from<strong> Elbow’s</strong> Guy Garvey and Craig Potter, the media coverage it received was also the most extensive to date. The album was described as “poetic and meaningful” by one of our other writers, however it is a certain outsider for the award.</p>\n<p><strong>Kit Downes Trio </strong>– <em>Golden</em></p>\n<p>The wildcard on the list, jazz pianist <strong>Kit Downes</strong> and the rest of his band are relative unknowns, although the coverage they are sure to receive will do them wonders. Described as a “patient storyteller”<strong> Kit Downes</strong> has been in several bands before and his self titled debut album with Empirical earned Jazzwise’s album of the year in 2007.</p>\n<p><strong>The XX</strong> – <em>XX</em></p>\n<p>One of the favourites for the award, <strong>The XX</strong> released their debut album seemingly out of nowhere, and since it landed, the trip hop trio have garnered more and more praise. With hit singles such as Crystallised and Islands, <strong>The XX </strong>have performed with the likes of <strong>Florence</strong> and <strong>Dizzee Rascal,</strong> although who hasn’t performed them with this year. It took me several listens to understand the beauty and delicacy of the album, yet I still far prefer many of the remixes to the actual songs themselves.</p>\n<p><strong>Paul Weller</strong> – <em>Wake Up The Nation</em></p>\n<p><strong>Weller’s</strong> most successful solo album to date saw a much welcome return to form. Whilst it’s true that the former<strong> Jam </strong>frontman is not getting any younger, there is no doubting his musical and song writing abilities. Album highlight “Fast Cars, Slow Traffic” shows <strong>Weller’s</strong> yearning for another mod revolution, and should he claim the Mercury Prize, it would not be too optimistic to see it happening.</p>\n<p><strong>Villagers</strong> – <em>Becoming A Jackal</em></p>\n<p>Former <em><strong>Crack in the Road</strong></em> interviewee and <strong>Villagers </strong>frontman Conor O’Brien is another on the list for this years Mercury Prize. Having already played support slots for the likes of <strong>Bell X1</strong> and <strong>Tracy Chapman</strong>, even if they fail to win the award, they are certainly one to watch out for in the future. A charming yet dark record, one of my favourites for the prize.</p>\n<p><strong>Wild Beasts</strong> – <em>Two Dancers</em></p>\n<p><strong>Wild Beasts</strong> are a band who I have never really understood the appeal of, although I know that their popularity soared after the release of their second LP <em>Two Dancers</em>. I’ve seen them live several times and found it extremely underwhelming and entirely nonsensical, but not in an interesting way.<em> Two Dancers </em>received rave reviews from almost all publications, and is another of the favourites for the award.</p>\n","slug":"2357-mercury-nominations-2010-part-2","category":"music","date":1281195686000,"wpid":2357,"isSticky":false,"featured_image":null,"createdAt":1587295067089,"updatedAt":1588441790951,"author":"5e9b68b27a1236eccfeb1d27","old_image":"generated/922163afa546eca372c27be4513a481de06e9481.jpg","categories":["music"]}