{"id":"5e9c335c9b6559241525e04e","title":"Interview: Kit Downes","content":"<p><img class=\"alignnone\" title=\"Kit Downes\" src=\"https://c3.</p><p>ac-images.myspacecdn.com/images01/5/l_ea4ce3bcea5d80a989a044be15e3ea42.jpg\" alt=\"\" width=\"600\" height=\"450\" />Following on from his recent Mercury Nomination, <em><strong>Crack in the Road</strong></em> were delighted to be able to catch up with jazz pianist<strong> Kit Downes</strong> of the <strong>Kit Downes Trio.</strong></p>\n<p><em>Crack in the Road: What inspired you to play Jazz Piano?</em></p>\n<p><strong>I started improvising on organ originally, and then got an Oscar Peterson album called ‘Night Train’ … that started the whole thing off really.. I always liked improvising.</strong></p>\n<p><em>CitR: How did the formation of the Kit Downes Trio come about?</em></p>\n<p><strong>We all studied together at music colledge, then we lived together for three years. during that time we played a lot of music together and hung out a lot, forming a band seemed like a logical thing to do really! I had all this music that I’d written, and they were the perfect people to play it.</strong></p>\n<p><em>CitR: In terms of influences, which genres and artists would you say inspired you the most?</em></p>\n<p><strong>Bjork, Nick Drake, Bill Frisell, Keith Jarrett, Alfred Hitchcock, David Lynch, Ligetti, Messiaen, Bartok, David Attenborough.. that’s all I can think of right now.</strong></p>\n<p><em>CitR: How did it feel to be nominated for the Mercury Music Prize, alongside the likes of Biffy Clyro, Dizzee Rascal and Mumford & Sons?</em></p>\n<p><strong>Pretty strange, but nice.</strong></p>\n<p><em>CitR: What would it mean to you to win the award?<strong> </strong></em></p>\n<p><strong>Um.. I haven’t really thought that far ahead, seems fairly unlikely.</strong></p>\n<p><em>CitR: Your tours have already seen you play in various places around the world, do you think this nomination will allow you to play to bigger audiences in even more exotic places?</em></p>\n<p><strong>Hopefully.</strong></p>\n<p><em>CitR: Are there any other jazz piano artists who you would like to see receive more recognition, and do you think they will start to now that you have received this nomination?</em></p>\n<p><strong>I really hope so, there are many great UK pianist – Alex Hawkins, Tom Calwey, Gwilym Simcock, Django Bates, Tom Gibbs, lots of guys writing great music, on all instruments.. it would be good to see those guys getting checked out by more people.. I think if people knew about this stuff then they could get into it.</strong></p>\n<p><em>CitR: What has been your favourite tour moment to date?</em></p>\n<p><strong>James (our drummer) getting stung by a jellyfish when we went swimming.</strong></p>\n<p><em>CitR: And finally … if you could be any animal, what would you be, and why?</em></p>\n<p><strong>Great question! I was thinking about this the other day.. anything that could fly I think .. maybe an eagle…</strong></p>\n<p style=\"text-align: center;\"><a href=\"https://www.myspace.com/kitsmusic\">Check Out Kit Downes Trio’s Myspace!</a></p>\n<p style=\"text-align: center;\"><a href=\"https://kitdownes.wordpress.com/\">Check Out Kit’s Blog!</a></p>\n","slug":"2359-interview-kit-downes","category":"interviews","date":1281173550000,"wpid":2359,"isSticky":false,"featured_image":null,"createdAt":1587295068612,"updatedAt":1587825934904,"author":"5e9b68b27a1236eccfeb1d27","categories":["interviews","music"]}