{"id":"5e9c04d9774c2610387e4ce3","artists":["5e9b69577a1236eccfeb269f"],"title":"Introducing: TWYNS","content":"<p>Hailing from Brighton (UK), Manchester (UK) and erm, Oakland (California), dream-pop trio <strong>TWYNS</strong> comprised of Ed Tullett, Ffion Atkinson and Calvin Emerson are brimming with potential.</p><p> On their debut release, <strong><em>Chyr</em> </strong>(pronounced Choir), toy with a multitude of ideas, the majority of those linked in with extremely current trends, the most notable being the gothic-synthpop of <strong>Purity Ring</strong>. With all three of them taking it in turns to take centre stage on the vocals, from the opening arpeggio’s of <em>Remainer</em> to the closing flailing of<em> OMN</em>, it’s littered with slightly half formed ideas, be it the near immaculate, Bon Iver-esque falsetto vocals on <em>Opaque</em> or the chilled R&B stylings of <em>Myth</em>.</p>\n<p>Now don’t get me wrong, <strong>TWYNS</strong> are more than exciting enough as a prospect to merit featuring on these pages, however there’s an underlying feeling that there is still far greater to come from the three piece. The auto-tuning on the vocals is too much at times (King), cloaking the real beauty that lies hidden under the unnecessary overuse of sidechain compression, and tracks that lack any real edge, floating on a rather annoying, predictable beat (<em>Exists</em>), and turning into a frankly unappealing slush of messy electronica and rather perturbing vocals. Whereas the likes of <strong>Purity Ring</strong> and <strong>CHVRCHES</strong> excel when it comes to finding a killer hook, <strong>TWYNS</strong> lose much of this appeal by drowning it out with at times, distracting vocals, and as with Purity Ring’s debut album, <strong><em>Chyr</em></strong> suffers from a lack of variety. With the aforementioned musical ridges combining with the questionable promotional tactics (minimal information and purposefully ambiguous tweets ‘it exists’) feeling like they’ve been picked up from a marketing douchebag during a panel on social media at SXSW, detracting slightly from the music itself, on potential they’re one of the most interesting new outfits of the year, but not on finished output.</p>\n<p>All that said, you’d be forgiven for thinking that I don’t like <strong>TWYNS</strong> very much. I do, but I just feel that the high points of<strong><em> Chyr</em></strong> are close to equalled by the low points, and the production, that doesn’t measure up to the quality of the songwriting, greatly lets it down. What I’m trying to say, is that yes, <strong>TWYNS</strong> are a trio to get excited about, but with the right direction, guidance, and time allowed to them, they’re sure to blossom into something far more impressive.</p>\n<p><iframe style=\"border: 0; width: 350px; height: 791px;\" src=\"https://bandcamp.com/EmbeddedPlayer/album=4144440780/size=large/bgcol=ffffff/linkcol=0687f5/transparent=true/\" height=\"240\" width=\"320\" seamless=\"\"></iframe></p>\n","slug":"23653-introducing-twyns","category":"album-reviews","date":1375575133000,"wpid":23653,"isSticky":false,"featured_image":{"width":851,"height":315,"src":"2013/08/1044294_271284226347309_1349788896_n.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAEAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAQI/8QAHRAAAQQCAwAAAAAAAAAAAAAAAAEDESECEhNhkf/EABQBAQAAAAAAAAAAAAAAAAAAAAH/xAAVEQEBAAAAAAAAAAAAAAAAAAAAAf/aAAwDAQACEQMRAD8AzVmqvvPclwtdWQ7RUY+ADRH/2Q=="},"createdAt":1587283161798,"updatedAt":1588403528161,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2013/08/1044294_271284226347309_1349788896_n.jpg","categories":["album-reviews","introducing","mpfree","new","music"]}