{"id":"5e9c33599b6559241525e04c","title":"Interview: tinylittlerobots.","content":"<p><a rel=\"attachment wp-att-2369\" href=\"https://admin.</p><p>crackintheroad.com/music/2367-interview-tinylittlerobots/attachment/35927_131606536868577_100000576956647_250707_2037194_n\"><img class=\"alignnone size-full wp-image-2369\" title=\"35927_131606536868577_100000576956647_250707_2037194_n\" src=\"https://api.crackintheroad.com/uploads/2010/08/35927_131606536868577_100000576956647_250707_2037194_n.jpg\" alt=\"\" width=\"720\" height=\"480\" srcset=\"https://api.crackintheroad.com/images/2010/08/35927_131606536868577_100000576956647_250707_2037194_n.jpg 720w, https://api.crackintheroad.com/images/2010/08/35927_131606536868577_100000576956647_250707_2037194_n-260x173.jpg 260w, https://api.crackintheroad.com/images/2010/08/35927_131606536868577_100000576956647_250707_2037194_n-640x426.jpg 640w, https://api.crackintheroad.com/images/2010/08/35927_131606536868577_100000576956647_250707_2037194_n-165x110.jpg 165w\" sizes=\"(max-width: 720px) 100vw, 720px\" /></a></p>\n<p>After their brilliant support set at The Doghouse in Dundee I had to meet the band that managed to get the venue so lively even before the headline act. tinylittlerobots have established themselves as a very promising young Scottish band, with a list of acts who they’ve supported equally as impressive as their on-stage performances. Their songs remain with the listener long after its over, with lyrics that you can’t help but repeat continuously. I arranged to meet this new band a few days after this memorable performance and asked them a few questions about how they began and what to expect of them in the future:</p>\n<p>CitR: Which artists or bands would you describe as influencing your sound the most?</p>\n<p><strong>Initially we liked The View’s first album, <em>Hats off to the Buskers</em>, but also we were starting around the time Arctic Monkeys took off so they had a big effect on us too. As we got older though we have taken influences from heavier bands such as Twin Atlantic and The Xcerts. Craig also likes bands such as One Night Only and General Fiasco who are more cheesy than the rest of our tastes. Woods enjoys the drumming aspects in bands such as Paramore and Alexisonfire. Dan also likes Biffy Clyro’s older stuff. None of us were ever given any professional tuition so these bands are the people who taught us by us watching them. </strong></p>\n<p>CitR: I saw you guys perform the other night supporting The Xcerts, how did you manage to support them and also the other large bands that you have supported in the past?</p>\n<p><strong>Well we have met Murray (Xcerts) dad which did help but on the whole we bug bands continuously until they eventually give us a slot, which is what a band like us ought to do at this stage in our career.</strong></p>\n<p>CitR: Where do you see yourself in the future? Do you expect to move to gain a higher reputation or are you happy living where you currently do?</p>\n<p><strong>We may perhaps move in time but for the time being we are happy, we have free practice sessions locally and a growing local fan base which we find exciting, plus nowadays the UK is so small that there may be no need to move any time soon.</strong></p>\n<p>CitR: How did you guys start the band?</p>\n<p><strong>At school everyone started learning the guitar at the same time, so we formed a band full of around 9 guitar players! James, Dan and Craig then left this and James, being the only one who worked and could afford it, bought a bass. Initially we did covers of The View and a B side of The Fratellis and then we managed to write our own songs. Our first ever gig was at the Arctic Bar in Dundee which was amazing!</strong></p>\n<p>CitR: Have you any releases coming out soon?</p>\n<p><strong>We hope to record an EP soon and maybe get it released before Christmas time, but we only want to make limited copies as we would rather sell a small number than not sell a larger quantity.</strong></p>\n<p>CitR: Which other bands have you supported other than The Xcerts?</p>\n<p><strong>We have supported a whole host of bands throughout the UK including: One Night Only, General Fiasco, Underground Heroes, The Holloways, The Law, Red Light Company and Sargeant, so quite a few good bands!</strong></p>\n<p>CitR: If you could have any superpower what would it be?</p>\n<p><strong>Woods: A mixture between Wolverine and Spiderman.</strong></p>\n<p><strong>James: George Foreman grill hands with ability to cook perfectly.</strong></p>\n<p><strong>Dan: Both to fly and have magical powers.</strong></p>\n<p><strong>Criag: The ability to turn anything into food.</strong></p>\n<p>CitR: What is your most embarrassing moment on stage?</p>\n<p><strong>James: I was drunk once and after a poor set I slammed my bass down only to realise we hadn’t played our final song yet.</strong></p>\n<p><strong>Craig: When I was much younger during our first song I snapped my guitar string, stormed off stage and cried!</strong></p>\n<p><strong> </strong></p>\n<p style=\"text-align: center;\"><a href=\"https://www.myspace.com/tinylittlerobotsonline\">Check out their Myspace here!</a></p>\n","slug":"2367-interview-tinylittlerobots","category":"interviews","date":1281205209000,"wpid":2367,"isSticky":false,"featured_image":null,"createdAt":1587295065538,"updatedAt":1587825934852,"author":"5e9b68b27a1236eccfeb1d07","categories":["interviews","music"]}