{"id":"5e9c04bb774c2610387e4cbd","artists":["5e9b69637a1236eccfeb2716"],"title":"Introducing: Windbreaker","content":"<h2><em>There is something scratching its name on a wall to be remembered:</em></h2>\n<p>Earlier this year I was moved in a way that I’d never been before, and for a rather unexpected reason.</p><p> Having written this blog now for well over three years, I like to think that I remember, in some form, each and every artist that I’ve posted about. One of the major plus points of writing a music blog is getting to interact with so many talented individuals, all of whom are <del>driven by</del> live for their passion for the art that they create.</p>\n<p>Back in August 2011, I penned a short article on a release by Friends Crossing, the alias of Boston’s Jesse Hanawalt. As is often the case after I’ve written about a DIY musician, Jesse and myself connected on Facebook. Despite only sending each other a handful of messages, mainly to keep up to date on future releases, it was a heart-wrenching shock to the system when I logged onto Facebook on 30 May 2013, to find a message posted by his brother, stating that Jesse had unexpectedly passed away the previous day. The immediate feeling was one that I found hard to decipher.</p>\n<p><iframe style=\"border: 0; width: 350px; height: 527px;\" src=\"https://bandcamp.com/EmbeddedPlayer/album=952828285/size=large/bgcol=ffffff/linkcol=0687f5/transparent=true/\" height=\"240\" width=\"320\" seamless=\"\"></iframe></p>\n<p>The concept of caring for someone’s art, suddenly became detached from the personal being. In age when it’s all too easy to connect behind computer screens, thoughtlessly bashing out characters in a hope to convey a message to someone; and in a instant, my whole perception of the online / offline relationship was irreversibly altered. The sudden outpouring of emotion from friends and family, in particular that of Darin Thompson (whom I’d also had contact with), Jesse’s closest friend, helped to transform the connection I’d had with Jesse’s life, which had previously been no more than listening to, and subsequently writing about his music. As well as highlighting and reminding me of the beauty of his creative mind, it also jump started a harrowing onset of realism. Forgive me if this comes across wrong, I’m not trying to say that it took death for me to perceive Jesse as more than merely a name on a screen, I’m attempting to put into words the plethora of differing feelings that bowled me over.</p>\n<p>Having spoken to Darin, and hearing of him playing guitar at Jesse’s funeral (of which I believe footage exists online, but I won’t post out of respect for Jesse’s family), I began to understand not only the mutual respect and musical understanding that they had with each other, but also the love that they shared. Again, it seems so bizarre that I could believe in them sharing a feeling such as love, when I’d never met either of them in my life.</p>\n<p>A couple of months down the line, and Darin sent me his first recorded output since the death of his best friend. Released under the moniker Windbreaker, and titled Unemployment sucks and my best friend died, it’s about as cutting and honourably devastating as music comes. The startling honesty to the track, (“dear god why did you take my best friend from me?” “Jesse why’d you go”) is a feature that, given the (little) that I know, I’m sure Jesse would have both enjoyed and admired.</p>\n<p>Alongside Unemployment sucks… Darin also showed me I Can’t Believe That You’re Gone, and kindly allowed it to be featured in this article. The track has a special poignancy in that it was last track that Jesse played on, before his untimely departure. As with Unemployment sucks… it’s full of self-questioning, and an attempt to place some form of blame, which in times of grief seems like a logical step, yet truthfully, there is no blame there to be had. Instead of dissecting and over-analysing the music, I’ll let the quality and emotional sincerity of the tracks speak for themselves.</p>\n<p><iframe src=\"https://w.soundcloud.com/player/?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F104148133\" height=\"166\" width=\"100%\" frameborder=\"no\" scrolling=\"no\"></iframe></p>\n<p>Through many people’s eyes, there may not be any real uplifting message behind this story at this present moment in time. These past few months must have been more difficult than I can even begin to fathom for Jesse’s family and friends, and, as I’m sure, parts of the coming months and years, may well be. However, the music left behind by Jesse is a fitting testament to his talent and love, and Windbreaker is sure to be a monument to his friendship with Darin. As Darin himself admits,<em> “I started Windbreaker after my best friend passed away, through heartbreak and grief I’ve found a new voice and inspiration.”</em></p>\n<p>Instead of leaving you with a line from Darin’s own music, I’m sure that he’ll understand me quoting from one of Jesse’s songs.</p>\n<p><em>and I know my voice was weak / but it still moved you / closer to me</em></p>\n<p>Listen to Windbreaker’s eulogy to Jesse below, and for more information, check out <a href=\"https://aimlessfallingleaves.tumblr.com/\" target=\"_blank\">the blog</a> run by Jesse’s brother.</p>\n<p><iframe src=\"https://w.soundcloud.com/player/?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F99441194\" height=\"166\" width=\"100%\" frameborder=\"no\" scrolling=\"no\"></iframe></p>\n","slug":"23719-introducing-windbreaker","category":"introducing","date":1375839543000,"wpid":23719,"isSticky":false,"featured_image":{"width":165,"height":165,"src":"2013/08/1002840_209471559211622_355823074_n-165x165.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAABQb/xAAhEAADAAIBAwUAAAAAAAAAAAABAgMEBQARIjESIUGBkf/EABUBAQEAAAAAAAAAAAAAAAAAAAMG/8QAGREBAAMBAQAAAAAAAAAAAAAAAQACEQMS/9oADAMBAAIRAxEAPwADB1yYOPh5L6W1IELWkaAdKKVJHYCCB7fP3ydvoqUvR0qk1ZiwQEAKCfHnhmvzcq2s2Brk3ctVAS1Ceo9J5Lmj9T3t+8OlHoqOSgfNaGmz/9k="},"createdAt":1587283131335,"updatedAt":1588443767953,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2013/08/1002840_209471559211622_355823074_n-165x165.jpg","categories":["introducing","mpfree","new","music"]}