{"id":"5e9c04a0774c2610387e4c99","title":"Live Review: Visions Festival 2013","content":"<p>While we took a trip to the first ever Visions festival on Saturday, one of my friends stayed at home creating his own visions; tripping on magic mushrooms.</p><p> Speaking to him afterwards it emerged our day was more colourful than his. Suffice to say, if you’re hosting a festival more psychedelic than a psychoactive substance you’re probably doing something right.</p>\n<p>On Saturday we slummed it across the city of London. Riding the wave of the day long Visions Festival presented by Rockfeedback, SEXBEAT and Bird On The Wire. A ton of visual artists helped create the festival’s sweet aesthetic alongside the cornucopia of brilliant  musicians. The visuals included some specially prepared work from <strong>Belly Kids</strong>, a London based art collective that caught my eye with their lo-if sketch style. Check the featured picture above and click <a title=\"London based art collective Belly Kids\" href=\"https://www.bellykids.co.uk/\">here</a> for more.</p>\n<p>Visions Festival highlights included:</p>\n<p><strong>Public Service Broadcasting</strong> kicked it off for us at Oval Space, their cleverly concocted mix of synth, samples and stock footage drawing the crowd into their world. As a sucker for accompanying visuals, my retina flared on songs synced with footage of spitfires and explosive blooms.</p>\n<p>I sometimes found the band’s quirk of pre-recorded banter in between songs a little trite in delivery, especially when it reached the level of “Are you having fun?” <em>crowd woops</em> “I can’t hear you. I said are you having fun?” It seemed a bit too pre-teen play-scheme for me, regardless of if it all being slightly tongue in cheek.</p>\n<p>Having said that, finishing with footage of flowers exploding into bloom, Public Service Broadcasting really showed how making electronic music comes organically to some.</p>\n<p><iframe src=\"https://w.soundcloud.com/player/?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F77777976\" height=\"166\" width=\"100%\" frameborder=\"no\" scrolling=\"no\"></iframe></p>\n<p><strong>Jackson Scott’s</strong> slow grunge growls reverberated across the Brewhouse with a sense of apathy Cobain himself would’ve be proud of. I’m not the first to draw the comparison and I’m sure I won’t be the last, but Jackson’s style has 90s stoner rock written all over it. Bumping into Jackson looking for an afterparty after the afterparty, it’s safe to say the whole teen wasteman vibe wasn’t just an act.</p>\n<p><iframe src=\"https://w.soundcloud.com/player/?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F100444198\" height=\"166\" width=\"100%\" frameborder=\"no\" scrolling=\"no\"></iframe></p>\n<p>After a few teething problems during soundcheck, <strong>East India Youth</strong>‘s set was a joy to behold. William Doyles exhaled exuberant vocals over bassy synth pop beats. If I was going to try and put East India Youth in a box, I’d say Panda Bear meets Baths, but Will’s tracks are more diverse than that so just listen below.</p>\n<p><iframe src=\"https://w.soundcloud.com/player/?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F78761120\" height=\"166\" width=\"100%\" frameborder=\"no\" scrolling=\"no\"></iframe></p>\n<p><strong>Cloud Nothings</strong> stole the show at Netil House with a killer set. Gone were the heads-down hipsters shufflin’ to the beat and in their place were foolhardy fans diving from speaker stacks, throwing themselves around to the jangle of guitar. I’m not sure if it was the booze kicking in but this was how music was meant to be enjoyed. Fuck yr inhibitions.</p>\n<p><iframe src=\"https://w.soundcloud.com/player/?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F32484458\" height=\"166\" width=\"100%\" frameborder=\"no\" scrolling=\"no\"></iframe></p>\n<p>We caught just a glimpse of <strong>Jeffrey Lewis,</strong> who gets an honourable mention here for his latest mini film masterpiece exploring the life of comic book author Alan Moore, an interesting character if <a href=\"https://en.wikipedia.org/wiki/Alan_Moore\">you’re not familiar with him</a>.</p>\n<p>Half musician, half comic book artist, Lewis also put together a great illustration for the festival program that you can see <a href=\"https://www.facebook.com/photo.php?fbid=10151777689820189&set=pb.46027745188.-2207520000.1376335008.&type=3&theater\">here</a>.</p>\n<p>We blazed from the Brewhouse back to Oval Space – a fresh venue and badass use of an old warehouse – just in time to catch <strong>!!!</strong> in full flow. The room swarming with sweaty faces shoving their hands in the air to a plethora of funky dance jams. It’s performances like this that remind me why <strong>!!!</strong>, despite their still ludicrous name, are where they are today</p>\n<p><iframe src=\"//www.youtube.com/embed/l1GnHqNaoRM\" height=\"315\" width=\"560\" allowfullscreen=\"\" frameborder=\"0\"></iframe></p>\n<p>Massive thanks to Oval Space, Netil House and London Fields Brewhouse, the organisers and Trail of Press for having us.</p>\n<p> </p>\n","slug":"23779-live-review-visions-festival-2013","category":"events","date":1376329715000,"wpid":23779,"isSticky":false,"featured_image":{"width":300,"height":300,"src":"2013/08/bellykids-300x300.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAABgf/xAAeEAACAgICAwAAAAAAAAAAAAABAgURAAMEIRYxUf/EABUBAQEAAAAAAAAAAAAAAAAAAAEC/8QAFxEBAQEBAAAAAAAAAAAAAAAAAQARIf/aAAwDAQACEQMRAD8AvU3JOk7oKaGZuMWCCzTEjsnFeoltSMwokAkfMOyyr5XGChTI5br3RWrxJlOIIRicW//Z"},"createdAt":1587283104644,"updatedAt":1588403527575,"author":"5e9b68b27a1236eccfeb1d40","old_image":"2013/08/bellykids-300x300.jpg","categories":["events","festivals","newreviews","live-reviews","music"]}