{"id":"5e9c0491774c2610387e4c86","title":"Feature: E.D.L (English Disco Lovers)","content":"<p>On Monday, Brighton’s <b>Let The Machines Do The Work </b>premiered their debut single <b><i>Let Me Be The One</i></b>.</p><p> The song’s video is a piece of satirical genius, placing Tommy Robinson et al in complete idiocy. The three male protagonists who are all geared up for a day of needless violence on Birmingham’s streets, accidentally stumble upon the rebuttal of the English Defence League, <b>The English Disco Lovers, </b>and can’t help but catch that funky beat and boogie on down with their pro equality cause – with a pretty impressive choreographed dance routine I might add.</p>\n<p>The peaceful protest group have been in hot pursuit of the EDL’s notoriety for the past year, and are indeed catching up with the defence league’s amount of <a href=\"https://www.facebook.com/englishdiscolovers?fref=ts\"><strong>Facebook</strong></a> and <a href=\"https://twitter.com/EngDiscoLovers\"><strong>Twitter</strong></a> followers, as well as being second in Google’s search rank when you type in ‘EDL’ thanks to a Google bomb put in place last September.</p>\n<p>The Disco Lovers follow each Defence League protest around the country and annoy them with their good-natured and equality promoting disco moves. <b><i>‘Don’t hate. Gyrate!’</i></b> And <b><i>‘Don’t listen to Nazi Sympathisers. Dance along to Synthesisers!’ </i></b>are just a couple of their many punnerific mantras coined by their founder Alex Jones, a 21 year old art student.</p>\n<p>He explained to me the artistic influences that had a part in inspiring the project. A fantastic example, <b>Yael Bartana</b>’s <i>And Europe will be stunned 2012, </i>a stunning film trilogy documenting the movements of the <a href=\"https://www.jrmip.org/?page_id=240\"><b>Jewish Renaissance movement in Poland</b></a><i> </i>(<b>JRMiP</b>) a ficticious movement<i> </i>initiated by the artist, which then gained international notoriety and support through her films to present the utopian dream of the Jews returning to Poland, to right the wrongs caused by the Nazis in WWII.</p>\n<p>The Disco Lovers have taken leads from this beautifully executed artwork, re-appropriating hostile political propaganda and creating a new aesthetic which pokes fun at the ignorance of the E.D.L. This includes their logo and the use of disco music in a contemporary context, the unifying aspect of the music and lyrics that is intrinsic to the genre and the positive feelings created by the group as they spread their upbeat message.</p>\n<p>I do hope that in the very near future it should go without saying that the abbreviation of E.D.L. will stand for <b>English Disco Lovers</b>. That I won’t have to put the worthier cause in brackets beside it in a feature title, just to make sure you all know I’m not talking about nor endorsing the former.</p>\n<p>Be sure to catch an <b>EDL</b> event near you! Having just been at Glastonbury and Kendal Calling, they’ll also be at <b>Shambala </b>Festival from the <b>23<sup>rd</sup> August</b>, as well as putting on Charity fundraisers in <b>London, Brighton, Manchester, Newcastle and Bristol</b>. Check out their upcoming events on their website <a href=\"https://www.edl.me/upcoming_events.html\"><b>HERE</b></a>.</p>\n<p>I’d like to end this with a beautiful quote from Yael Bartana, which illustrates that by addressing one issue in detail can help us to see a bigger picture. Its also poignant in the idea of using art as a way to affect change.</p>\n<p><i>‘This is a very uni­ver­sal story; as in pre­vi­ous works, I have treated Israel as a sort of a social lab­o­ra­tory, always look­ing at it from the out­side. These are mech­a­nisms and sit­u­a­tions which can be observed any­where in the world. My recent works are not just sto­ries about two nations — Poles and Jews. This is a uni­ver­sal pre­sen­ta­tion of the impos­si­bil­ity of liv­ing together.” –Yael Bartana</i></p>\n<p><iframe width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/sYPpbfs5Vn4?feature=oembed\" frameborder=\"0\" allowfullscreen></iframe></p>\n<p><b>UNUS MUNDUS, UNA GENS, UNUS DISCO</b></p>\n","slug":"23834-feature-e-d-l-english-disco-lovers","category":"editorials","date":1376463184000,"wpid":23834,"isSticky":false,"featured_image":{"width":907,"height":960,"src":"2013/08/edl.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAALAAoDASIAAhEBAxEB/8QAFAABAAAAAAAAAAAAAAAAAAAAB//EACEQAAICAgEFAQEAAAAAAAAAAAECAwQFEQYAEiEiMRNx/8QAFAEBAAAAAAAAAAAAAAAAAAAAAf/EABURAQEAAAAAAAAAAAAAAAAAAAEA/9oADAMBAAIRAxEAPwBE5RjqlXkQhLXb8zO7PYmsy96E+2l7WAAG9AADwB0iU8E0VOCNc7lnVI1UM8yliAPpJXyejzk+Ngx3KFqUZLdes0hf847cqhS3se329fJJ8a+9I9PimDgqQQx46IJGiouyWOgNDZJ2f6eiVL//2Q=="},"createdAt":1587283089494,"updatedAt":1588403527416,"author":"5e9b68b27a1236eccfeb1d17","old_image":"2013/08/edl.jpg","categories":["editorials","arts","music"]}