{"id":"5e9c334f9b6559241525e03c","title":"Review: Curren$y – Pilot Talk","content":"<p><strong>Curren$y </strong>is the latest in a long line of prestigious artists signed to <strong>Def Jam Records</strong>, joining the likes of<strong> Kanye West</strong> and <strong>Ghostface Killah</strong> on their extravagant inventory.</p><p> Despite this being<strong> Shante Franklin’s</strong> third official release,<em> Pilot Talk</em> is his major label debut, featuring production from<strong> Ski Beatz</strong> and <strong>Mos Def.</strong> <em>Pilot Talk </em>is also the first release under<strong> Roc-A Fella’s </strong>new label executive <strong>Damon Dash</strong>, and it’s certainly a positive movement for the label which has been experiencing difficult times of late.</p>\n<p><em>Pilot Talk</em> also serves as a who’s who in the current US hip hop scene, featuring<strong> Snoop Dogg</strong>, <strong>Jay Electronica </strong>and <strong>Devin the Dude</strong>, amongst others. There is a confident arrogance evident on the record, similar to that which<strong> Kanye </strong>is renowned for, as<strong> Curren$y </strong>declares himself superior to his peers. The beat in <em>Audio Dope III </em>is one of the best showcased on the LP, with <strong>Curren$y </strong>spitting eloquently over the top, as he proclaims “<em>they’re not like me, that’s why they don’t like me</em>“.</p>\n<p>Elsewhere, recent single <em>Roasted </em>featuring <strong>Trademark</strong> and <strong>Young Roddy</strong> contains another of the albums’ slickest beats, and the <strong>Ski Beatz </strong>production is plain to hear. Whilst other rappers might see their major label debut as an opportunity to show off their own skills, <strong>Curren$y</strong> brings some of his closest friends in on the job, although he outshines them all. Album highlight <strong>The Day </strong>is by far the most accomplished moment in <strong>Curren$y’s</strong> career so far, and it’s no surprise to hear that this track contains appearances from <strong>Mos Def</strong> and <strong>Jay Electronica</strong>. This is perhaps the only track on which <strong>Curren$y </strong>is shown up with his ability to compose and deliver a line, however within a few years time there is no doubting he will be punching at a similar weight. Not only a brilliant first release for<strong> Damon Dash</strong>, but also a fantastic way for<strong> Curren$y </strong>to announce his arrival on the major label scene.</p>\n<p style=\"text-align: center;\"><a href=\"https://www.myspace.com/flyspitta\">Check Out Curren$y’s Myspace!</a></p>\n<p><script src=\"https://video.unrulymedia.com/wildfire_11244048.js\" type=\"text/javascript\"></script></p>\n","slug":"2391-review-curreny-pilot-talk","category":"music","date":1281549424000,"wpid":2391,"isSticky":false,"featured_image":null,"createdAt":1587295055384,"updatedAt":1587825934697,"author":"5e9b68b27a1236eccfeb1d27","categories":["music","reviews"]}