{"id":"5e9c046f774c2610387e4c52","artists":["5e9b69257a1236eccfeb2365"],"title":"New: MUTE – The Waitress EP","content":"<p>Just over a month has gone by since we’ve heard from exciting London producer, <strong>MUTE</strong>.</p><p> Just enough time for him to put together his first EP, the intriguingly titled <em>The Waitress</em>. The record is in many ways a free flowing consortium of ideas and influences, rather then a rigid statement of intent. The genres and samples pallets that <strong>MUTE</strong> borrows from are varying and at times speculative in their apparent relationship. Yet the differences in beat timings and era, both in genre and sampling are irrelevant to the overarching aims of the project. MUTE’s greatest strengths are found in his interpretation of modern forms to the backdrop of analogue and arguably archaic methods of creation. <em>Mute Meets King Tubbys in a Basement</em> as an example takes a heavy leaning towards the dusty sensibility of someone like <strong>Clams Casino</strong>, while following the rules of modern trap; all made on an original MPC.</p>\n<p>It’s also important to include that <strong>MUTE</strong> is more than capable of polishing off a banger, <em>Cry Cry</em> and <em>Take My Share</em> are the most obvious examples, not all of his successes are found in his method alone. Yet his practice somehow holds true, it’s hard to think of anyone that’s making purely sample based music like this at the moment.</p>\n<p>Stream the whole EP below.</p>\n<p><iframe style=\"border: 0; width: 350px; height: 470px;\" src=\"https://bandcamp.com/EmbeddedPlayer/album=3023493452/size=large/bgcol=ffffff/linkcol=0687f5/notracklist=true/transparent=true/\" height=\"240\" width=\"320\" seamless=\"\"></iframe></p>\n","slug":"23955-new-mute-the-waitress-ep","category":"music","date":1377634472000,"wpid":23955,"isSticky":false,"featured_image":null,"createdAt":1587283055809,"updatedAt":1588441763273,"author":"5e9b68b27a1236eccfeb1d24","old_image":"generated/ab67616d0000b2731bc31e16e89d046b71cb512c.jpg","categories":["music","new"]}