{"id":"5e9c33569b6559241525e046","title":"Review: Linkin Park – The Catalyst","content":"<p><img class=\"alignnone\" title=\"Linkin Park\" src=\"https://www.</p><p>barrystickets.com/concert-tickets/linkin-park/linkin-park.jpg\" alt=\"\" width=\"590\" height=\"477\" /><br />\nAfter the huge disappointment of Minutes to Midnight, Californian rock band Linkin Park are back with another bite at the cherry with new album A Thousand Suns. Despite recording one of the most played songs on US radio; 2001’s In The End, as well as performing with megastars such as Jay-Z and Metallica, they have never recaptured the spirit seen on 2000’s Hybrid Theory or even 2003’s Meteora. Their fusion of rap and nu metal made them one of the most exciting bands of the new millennium, however Mike Shinoda’s solo career Fort Minor took it’s toll on the band and their work since 2003 has been vastly inferior, culminating in the diabolical Minutes to Midnight.</p>\n<p>So to hear Linkin Park were coming back, well it was news I took with a pinch of salt. Sure, they have huge potential, but whether they fulfil it is another question. The Catalyst is the new single from the band, the first from upcoming album A Thousand Suns. Whilst there is still no rapping from Shinoda, lead singer Chester Bennington’s vocals are sounding as good as ever, and the beats are far more exciting than their copycat counterparts, such as Pendulum.</p>\n<p>Bennington screams, “and when I close my eyes tonight, two symphonies of blinding light”, a different league from the lyrics on the last album. After Minutes to Midnight I thought I would never say this again, but I’m really looking forward to the new Linkin Park album, especially if Shinoda is handed the microphone more.</p>\n<p>In true Linkin Park style, their comeback has been massively promoted, with the band running a competition asking fans to remix The Catalyst and submit their entry. The winner chosen by the band get their track featured on the new CD, as well as a chance to meet the band on their current tour. The song itself has also been used on a trailer for the upcoming new Medal Of Honor game, which you can watch below, the video itself which was directed by Linkin Park’s very own Joe Hahn. Be sure to check out the song below, as well as the album when it is released midway through September.</p>\n<p><script type=\"text/javascript\" src=\"https://video.unrulymedia.com/wildfire_12318498.js\"></script></p>\n","slug":"2398-review-linkin-park-the-catalyst","category":"music","date":1281468741000,"wpid":2398,"isSticky":false,"featured_image":{"width":188,"height":188,"src":"2011/06/linkin-park-188x188.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAABQb/xAAgEAACAQQDAAMAAAAAAAAAAAABAgMABAcSBREhMVFh/8QAFAEBAAAAAAAAAAAAAAAAAAAAAP/EABQRAQAAAAAAAAAAAAAAAAAAAAD/2gAMAwEAAhEDEQA/AALrOWTkvEmNnaJAkhbRLYsrKOyVJB9HRHo+hT8WSsupEivx/HBgoBEinYH99+ajL6NNrJdF1VyQOvASB3Ts00ryuzyOzMxJJYkk0H//2Q=="},"createdAt":1587295062134,"updatedAt":1588403564878,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/06/linkin-park-188x188.jpg","categories":["music","reviews"]}