{"id":"5e9c0462774c2610387e4c49","artists":["5e9b69517a1236eccfeb25e7"],"title":"Influences: The 1975","content":"<p>Last weekend I found myself wading through knee-deep mud at Leeds Festival, surrounded by GCSE celebrating, hormonal adolescents.</p><p> A far cry from the images of picturesque, Topshop-clad models that many associate with festivals. With the event falling on my younger sisters’ birthday, and two of her favourite artists on the line-up, it seemed only right for her to see in her fifteenth year with <strong>Alt-J</strong> and<strong> The 1975</strong>. Whilst one of those artists may already be a household name with a Mercury Award under their belts; after their electric performance on the Festival Republic stage, it’s clear that<strong> The 1975</strong> are primed for a similar destiny. What amazed me about their performance was the sheer adoration shown by the crowd, with the packed out tent swaying due to the sheer volume of people attempting to cram inside. Having followed this band through their various guises, it’s was quite a moment watching thousands of fans bellowing back each and every word, to an album that’s not even been released yet.</p>\n<p>Similarly, what impressed me was their ability to switch seamlessly between festival ready anthems (Chocolate, Girls, Sex) and the slower, perhaps more insightful numbers (Settle Down, Robbers). Whilst my sister admits to having a crush on lead singer Matt Healy, it’s clear that it’s not like her crush on Harry Styles or Justin Bieber. Her love is as much for his appearance as it is for his songwriting ability, and that for me, speaks volumes as to just how far The <strong>1975</strong> have come. It’s fans like her that will undoubtedly lead to them headlining festivals in the near future, and quite rightly so.</p>\n<p>Ahead of the Monday release of their highly anticipated debut album, Matt took the time out to talk us through a few influences that helped shape and inform the record. Having had the record on rotation for the past couple of weeks, it’s clear where inspiration has been found, be it the Phil Collins anthemic Girls, or the funkier, almost Prince-esque M.O.N.E.Y., yet they also stamp their own authority on the record, that is born of their experience and creativity. Read what Matt had to say below, and check out the full album stream (including my personal favourite – <em>Menswear</em>) underneath that, <a href=\"https://smarturl.it/the1975album\" target=\"_blank\">pre-order here</a>.</p>\n<p>1.<strong> John Hughes</strong> – The oeuvre of John Hughes has been a stylistic centre piece for how our music should make us feel. I fell in love with music through his films and have been heavily inspired by the romantic nature in which he portrays adolescence and lustful desire.</p>\n<p> </p>\n<p>2. <strong>Michael Jackson</strong> – Prime position in my pantheon of musical heroes and the most iconic cultural figure of all time in regards to my life. Coming from an atheist background I genuinely believe that at an early age he was the only person / bloke that I saw of as different or higher to others; yet oddly felt like he was one of my own, divinely connected. His production techniques are all over our music.</p>\n<p><iframe src=\"https://w.soundcloud.com/player/?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F107681591\" height=\"166\" width=\"100%\" frameborder=\"no\" scrolling=\"no\"></iframe></p>\n<p> </p>\n<p>3. <strong>Mike Skinner</strong> – One part Samuel Pepys – One part Dostoyevsky. I can’t remember who said that but I reckon it’s true. <strong><em>Original Pirate Material</em></strong> is essential to our vocabulary as a band; partly due to our love for UK garage – but also for it’s unflinching lyrical realism. It’s like a portrait of modern life – Baudelaire, but for the ‘Barret class’, for those in 21st Century Jones Homes. It’s that realism that inspired us.</p>\n<p> </p>\n<p>4. <strong>Jack Kerouac’s</strong> <em><strong>On the Road</strong></em> – Like any idealistic, impressionable 19 year old I was totally swept away by On the Road. It was all the girls and blazing about with a fag on that got me really excited. I thought “Right, I think i’ve chosen what kind of bloke I’m gonna be now. I’m gonna be like this lot’. I didn’t get too far in my quest to be quite so decadent as that, I hadn’t the environment – i’m from Macclesfield, not Hoxton. Though the poetry definitely bled into me.</p>\n<p><iframe src=\"https://w.soundcloud.com/player/?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F107681611\" height=\"166\" width=\"100%\" frameborder=\"no\" scrolling=\"no\"></iframe></p>\n<p> </p>\n<p>5. <strong>Collins</strong> / <strong>Gabriel</strong> – It’s probably unfair to bundle these two together seeing as the material they produced as solo artists totally surpassed anything they ever did together as Genesis. But Face value by Phil Collins. Massive. So by Peter Gabriel. Massive(er).</p>\n<p> </p>\n<p>6. <strong>My Bloody Valentine</strong> – I think <em><strong>Loveless</strong></em> is one of the most beautiful records ever. They create a sort of faded splendour. It’s chaotic and distorted but also very simple and pretty.</p>\n<p> </p>\n<p>7. <strong>Gospel</strong> – Black American Gospel music has had a profound effect on our band, especially with regards to the way we approach rhythm. It’s incredible musicianship twinned with grandeur pop arrangements. I reckon if I was a kid in America – and upon hearing gospel music for the very first time I was told that the way it made me feel, that feeling of euphoria and excitement, was actually the feeling of God – I would probably still believe that to this day.</p>\n<p><iframe src=\"https://w.soundcloud.com/player/?url=http%3A%2F%2Fapi.soundcloud.com%2Fplaylists%2F9598434\" height=\"450\" width=\"100%\" frameborder=\"no\" scrolling=\"no\"></iframe></p>\n","slug":"24018-influences-the-1975","category":"influences","date":1377880192000,"wpid":24018,"isSticky":false,"featured_image":null,"createdAt":1587283042695,"updatedAt":1588441763078,"author":"5e9b68b27a1236eccfeb1d27","old_image":"generated/94dd2feca73bdfb7e1c12751b499ec0a46024866.jpg","categories":["influences","stream","music"]}