{"id":"5e9c0450774c2610387e4c3a","artists":["5e9b68d47a1236eccfeb1e45"],"title":"Interview: Big Wave","content":"<p>I was lucky enough to be invited to this year’s Reading, and whilst a little too hungover and sleep-deprived for my own comfort on the Sunday afternoon I was introduced by a friend to one of the bands selected a couple of weeks before to play the BBC Introducing stage.</p><p></p>\n<p>With no questions prepared and little in the way of pressing points or time constraints, we were able to have a carefree discussion over a picnic bench in the sun. From this blossomed one of the nicer interviews I’ve had the pleasure of participating in and a remarkably telling story, of good things happening to ordinarily good people. Meet <i>Big Wave.</i></p>\n<p> </p>\n<p><b>So BBC Introducing has brought you from Devon to Reading, how did you find the whole process?</b></p>\n<p><i>Mel:</i> Well the only reason this all happened in the first place was because we uploaded a few songs to the Introducing web-site ages ago, and then got selected for BBC Introducing Devon. Then one night we got an email telling us we were being played on Radio One with Huw Stephens at this time, so I had to scramble to get everyone to wake up and listen!</p>\n<p>We’d only done a few performances and one small interview with them before James Santer, who works at the BBC there, decided to put us forward for some festivals and we got to play here this afternoon.</p>\n<p> </p>\n<p><b>So do you think the BBC Introducing model works?</b></p>\n<p><i>Mel: </i>Definitely. I think it’s the first year they’ve done it in Devon, so it’s proven to be a vital opportunity for us. Last year we played End of the Road, which again was through a competition that we entered. I think they chose three bands out of a thousand so it was a massive stroke of luck to get that one too. We were the first band on and then we stayed for the weekend, it’s an amazing festival.</p>\n<p><i>Rikki:</i> The band’s been going for about a year and a half and initially we just got our name out online, by uploading stuff to bandcamp. Through that we got picked up by a local label called <i>Art Is Hard</i>, we then released an EP with a small Scottish label called <i>Soft Power</i>, and then another couple of tracks which is when we started getting picked up by the BBC and from then onwards has been a real upward curve.</p>\n<p><i>Mel:</i> I don’t think we expected any of it, but every month that goes by we seem to be asked to do a better gig. We got asked to do one at the Old Blue Last recently which was great fun too.</p>\n<p><i>Rikki: </i>Being on a local label like <i>Art is Hard </i>is great because even though many of the artists on it are now from all over the country there is a community feel and we all know each other and often gig together, everyone supports each other. <i>Best Friends</i> and <i>Black Tambourines</i> are good examples, they’re both amazing bands.</p>\n<p> </p>\n<p><b>Has music ever been a career aspiration?</b></p>\n<p><i>Rikki:</i> Doing it for the money is kind of out the window for us, playing this weekend will cost us money but it’s so worth it because when we’re old and grey we can say we played Reading and Leeds. We all work full time to make the music thing happen, so on weekends like this where you get to play Reading and Leeds there’s a real feeling of having earned it and worked your way up in a lot of ways. You know, the driving’s a pain but you just get on with it!</p>\n<p>I went to University in Bournemouth, I had perhaps a bit too much fun and need to go back and finish my third year now. I plan to be a primary school teacher in a couple of years, I might have to lose the beard for it but it will be alright.</p>\n<p><i>Mel:</i> I had never been in a band before this, other than playing keyboard at school. But I’m a hairdresser and have recently opened my own salon so that’s going great.</p>\n<p> </p>\n<p><b>How is the transition from every-day life to the stage?</b></p>\n<p><i>Mel:</i> I think our first gig together was in the SU bar at Plymouth University, and that was such a scary experience. Now I’ve become more confident with it all and have been able to be a lot more creative as a result. We all write our own parts, and that is the bit I really struggled with at the start, I mean I can’t really play many songs other than our songs. But I feel a lot more expressive in it now.</p>\n<p> </p>\n<p><b>Has playing Reading and Leeds been what you expected it to be?</b></p>\n<p><i>Rikki: </i>I’ve never been on the guest side of a festival before, which is interesting. Flushing toilets, that freaked me out! It’s perhaps not as glamorous for us as others but we got free food vouchers and were over the moon!</p>\n<p>I’ll have a couple of beers before-hand to calm the nerves, and hope for the best really. I’m just focussing on enjoying it really, it might be the only time we ever get to play Reading and Leeds.</p>\n<p> </p>\n<p>Big Wave are on <a href=\"https://www.facebook.com/wearebigwaveband\">Facebook</a>, <a href=\"https://twitter.com/wearebigwave\">Twitter</a> and have a lovely website <a href=\"https://wearebigwave.com/\">www.wearebigwave.com</a>. <em>Featured photo by Chris Hines</em></p>\n","slug":"24061-interview-big-wave","category":"festivals","date":1378208482000,"wpid":24061,"isSticky":false,"featured_image":{"width":960,"height":640,"src":"2013/09/bigwave_chris_hines.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAYH/8QAIBAAAQMFAAMBAAAAAAAAAAAAAwECBAAFERIhEzFCYf/EABQBAQAAAAAAAAAAAAAAAAAAAAL/xAAYEQADAQEAAAAAAAAAAAAAAAAAAQIRYf/aAAwDAQACEQMRAD8Ay2XOtd6iAaGE+2yCHUbUAu7NsYwu3cZT3+1FGvPgK8RY4EINytdx69Ti/VKUIlKc6xOnp//Z"},"createdAt":1587283024648,"updatedAt":1588403526983,"author":"5e9b68b27a1236eccfeb1d22","old_image":"2013/09/bigwave_chris_hines.jpg","categories":["festivals","interviews","music"]}