{"id":"5e9c044c774c2610387e4c31","title":"Fuck You Ministry of Sound","content":"<p>Today Ministry of Sound decided to sue Spotify for copyright infringement, over user created playlists ‘copying’ its compilations.</p><p> Their thinking is that the very act of curating others’ work together is intellectual property and anybody curating content in the same manner is infringing on this.</p>\n<p>May I just say on behalf of everyone with half a brain cell <em>fuck you Ministry of Sound.</em></p>\n<p><strong><em>Fuck </em>your lawsuit</strong></p>\n<p>Spotify isn’t exactly ranking high in the esteem of most people who care about the rights of artists at the moment, thanks to it essentially paying the equivalent of a particularly stingy workhouse owner. But even then, the ridiculousness of this lawsuit – and more importantly, the worrying consequences a victory for Ministry of Sound would have for the wider music and digital industries – means that people still feel sorry for the slave driver on this occasion.</p>\n<p>Perhaps if the Ministry of Sound could take a moment to engage the logic circuits in their serotonin down-regulated brains and consider how their compilations differ to any of the <em>hundreds of millions </em>of curated playlists online, they might see why their proposition is laughable. Is it the fact you had the cheek to stick an extra tenner on top of the price of the tracks that makes them worthy of intellectual protection? Or is it that every compilation and playlist today should be protected and, therefore, need to be unique? Fuck off.</p>\n<p><strong><em>Fuck </em>your compilations</strong></p>\n<p>This is on behalf of every single teenager who ever received one of these from their nan at Christmas because they saw one of your garish, cluster-migraine inducing TV adverts. Yes you have put out some cracking compilations in the past – big shout out to last year’s <em>Anthems 90s – </em>but the majority fall in to one of two camps: 2 nightmarish hours of the trashiest cuts of the year, or 4 grating hours of the trashiest cuts of the last two decades.</p>\n<p>Even when you do – incredibly, incredibly rarely – hit the mark, do you really think you sound anything but embarrassingly out of touch and past it to claim that the track order alone (on an unmixed assortment of tracks that you had no creative involvement in producing, no less) is intellectual property? Fuck off.</p>\n<p><strong><em>Fuck </em>your club</strong></p>\n<p>Once upon a time you had a dream, a dream to open a club that brought the best elements of the US house scene to the UK. You had membership forms, a ‘music-first’ design policy and Larry Levan. Today you’ve got planning permission problems, Calvin Harris and Boris Johnson. That’s all that needs to be said. Fuck off.</p>\n<p>As a final point, below are most Ministry of Sound compilations released in the past year, free to stream from Spotify, in one place. For each week this lawsuit continues we’ll add more of their compilations below, just because – get this – <i>it’s completely legal and moral to build and share Spotify playlists like this and nobody should have to worry about a bloated hangover of a company kicking up a storm over songs they have no intellectual ownership over</i>.</p>\n<p>We even got involved with some of those fancy SEO shenanigans to encourage them to rank higher in future Google searches for related Ministry of Sound albums. They can thank us for that later.</p>\n<p> </p>\n<p><strong>Update from MoS:</strong></p>\n<p><em>“We understand your concern and are not trying to prevent you from putting together your own playlists.  This case is about playlists that copy our albums and that are made available by Spotify as playlists on a commercial basis, often including our logo and album art work.  Spotify does this without any recognition for the creative effort that goes into compiling our albums. Our case strives to ensure that Spotify recognises the value of our creative effort and that the service ensures that everyone (users and those that create great albums) is treated fairly.”</em></p>\n<p>Notice this makes no more mention of compilation ordering. Compare this statement to <a href=\"https://www.theguardian.com/technology/2013/sep/04/ministry-of-sound-sues-spotify\">those made by Presencer this morning</a>, it seems Ministry of Sound have backed down quite heavily from their earlier stance, or were trying to whip up a bit of attention at first. Either way, that’s not how quickly you’d expect a healthy company to change its stance.</p>\n<p>If this is the case, then the Ministry of Sound’s issue boils down to people using their album artwork in their playlists and anyone who has used Spotify for a moment will probably know what we’re about to say:<br />\n<strong></strong></p>\n<h2 style=\"text-align: center;\"><strong>You cannot set custom playlist artwork on Spotify</strong></h2>\n<p>If your compilation artwork is appearing in peoples’ playlists, then your compilation is on Spotify. In which case, you have licensed it for use by any of the users on Spotify in Spotify playlists. Even better, the only way that a playlist could have a single image as its cover – and therefore fully mimic the MoS’s compilation – is if the entire playlist was an exported copy of a Ministry of Sound compilation <em>that is already on Spotify in its entirety</em>, which is pretty common for mobile users wanting offline access. Oh, and that’s not illegal and probably formed part of the contract the MoS license holder signed.</p>\n<p>So that leaves one section of their reasoning intact: on a commercial basis.<strong> </strong>Spotify do not create the playlists that they make available via their service and largely give them free reign – why? Because they are made up entirely of songs licensed directly to Spotify by the relevant rights holders. So Spotify are not directly profiteering off the promotion of these playlists.</p>\n<p>Therefore, any logically sound argument based around Spotify using these on a ‘commercial basis’ comes down to the same old tired argument posed at digital organisations by out-of-touch music industry bodies: <em>y</em><em>ou’re making money off our work by having adverts on your service. </em>If that is all that this comes down to, we’ll have to see how this fares come court day. What I will say is that the tracks and artwork that this fuss is about were all licensed to Spotify with full knowledge of its advertising model.</p>\n<p>In other words, all the Ministry of Sound has to base its case on is the same issue they were publicly decrying this morning and were roundly lambasted for – playlist orders that mimic their compilations. Not only does this make their new statement slightly disingenuous, it also would suggest they have sensed the tides are not going in their favour over this matter.</p>\n<p> <br />\n<em> <iframe src=\"https://embed.spotify.com/?uri=spotify:user:holloway:playlist:6WZ47kZfyUWtpWczOK1TN4\" height=\"380\" width=\"300\" frameborder=\"0\"></iframe></em></p>\n<p><iframe src=\"https://embed.spotify.com/?uri=spotify:user:holloway:playlist:4VfEUG1W1hNtpbzUxIGmP3\" height=\"380\" width=\"300\" frameborder=\"0\"></iframe></p>\n<p><iframe src=\"https://embed.spotify.com/?uri=spotify:user:holloway:playlist:571Wmz8lgwWgYISV34mKuB\" height=\"380\" width=\"300\" frameborder=\"0\"></iframe></p>\n<p><iframe src=\"https://embed.spotify.com/?uri=spotify:user:holloway:playlist:67N7zGRKbBTNR4VqtdSx95\" height=\"380\" width=\"300\" frameborder=\"0\"></iframe><br />\nI’m not suggesting you actually <em>listen </em>to these, mind.</p>\n","slug":"24109-fuck-you-ministry-of-sound","category":"editorials","date":1378285680000,"wpid":24109,"isSticky":false,"featured_image":{"width":1280,"height":800,"src":"2013/09/tumblr_mezu1acdzu1rue0joo1_1280-1280x800.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAGAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAAAAf/xAAhEAABAgQHAAAAAAAAAAAAAAABAAUCAwQREhMUITFRof/EABQBAQAAAAAAAAAAAAAAAAAAAAP/xAAYEQACAwAAAAAAAAAAAAAAAAAAAwEiMv/aAAwDAQACEQMRAD8Ajb8/sE1lEuuYjVukZJ1ZmZZ42vh69spyiI1ZFdFj/9k="},"createdAt":1587283020281,"updatedAt":1588403526905,"author":"5e9b68b27a1236eccfeb1d0b","old_image":"2013/09/tumblr_mezu1acdzu1rue0joo1_1280-1280x800.jpg","categories":["editorials"]}