{"id":"5e9c33529b6559241525e040","title":"Standon Calling 2010","content":"<p><a rel=\"attachment wp-att-2439\" href=\"https://admin.</p><p>crackintheroad.com/music/2411-standon-calling/attachment/efterklang\"><img class=\"alignnone size-totallysizedforever wp-image-2439\" title=\"efterklang\" src=\"https://api.crackintheroad.com/uploads/2010/08/efterklang-740x740.jpg\" alt=\"\" width=\"740\" height=\"740\" /></a></p>\n<p>If there’s one thing that has been hammered into me by various festival workers and punters alike, it’s that Standon Calling has atmosphere. Even upon arrival, the steward handing out wristbands was all too eager to tell me that the atmosphere was “amazing down there.” On the one hand, promising, on the other hand, the very fact that she was telling me this fact made me suspicious. However, she seemed true to her word: onsite the people were friendly, the set design was interesting and the scenery was beautiful. Everything was incredibly laid back – this being proven when Wildbirds and Peacedrums raced through an energetic set to a tent half full with people casually sitting on the floor. But at the request of Jeremy Barnes of A Hawk and a Hacksaw, the crowd eventually got up, quite begrudgingly, judging by the first half of their set. However, things drastically changed when the power cut out mid-song and, in true Balkan style, the band simply unplugged and strolled into the middle of the crowd – all whilst still playing, of course. After entertaining for a few songs on the floor, the band eventually made their way back to the stage as the power was restored and launched into their last few songs, with a much transformed audience; all swaying and dancing to accordions, violins and trumpets.</p>\n<p>Following A Hawk and a Hacksaw was Fucked Up’s headline performance at Twisted Licks. In complete contrast to what came before, Fucked Up’s raucous set featured the familiar sight of Pink Eyes spending more time in the crowd than onstage, high fiving little kids and er…getting motor-boated by an overly enthusiastic fan. Needless to say, the hardcore punk band’s performance was a definite highlight of Standon Calling’s eclectic line up. To round off Friday evening, Liars provided a solid performance on the mainstage, but out of those who had turned up (the main stage area was not at all packed), many seemed to be bored by the post-punk rockers – perhaps they would have benefited from a smaller stage, or perhaps they just needed a more engaging audience, but either way, maybe Metronomy would have been better bets for Friday night headliners.</p>\n<p>Saturday was a quieter day for the music – Magic Numbers fans were treated with a rare intimate performance in the smallest music tent, whilst Sparrow and the Workshop’s three-piece set up worked surprisingly well on the main stage, as did the Fleet Foxes-esque Dry The River. British Sea Power also provided a strong set on the Twisted Licks stage. But the main highlight of Saturday came with the headliners – Étienne de Crécy’s magnificent Beats ‘n’ Cubes was a fantastic visual spectacle to accompany the French DJ.</p>\n<p>Sunday saw a strong performance from Norwegians Harrys Gym, and a performance which Summer Camp then failed to follow up. The duo, accompanied by a bassist and keyboardist, lacked energy, with only glimpses of song-writing talent to be seen in their set. Over on the main stage, the audience engaged well with Sound of Rum and Gabby Young & Other Animals, the former’s front woman and rapper Kate Tempest’s banter being well received. Sleepy Sun followed with an impressive, slow paced set, although in contrast to the former acts, the audience’s reaction was not so strong. This all changed by fellow Californians Fool’s Gold, as predicted by Sleepy Son’s front man: “Fool’s Gold are up next, you can dance to them.” The evening boasted an equally strong array of bands – including none other than Orquesta Buena Vista Social Club featuring Omara Portuondo as headliners. But this was not the performance of the evening. Danish group Efterklang took to the stage beforehand, and a combination of smiles, heart-melting trombone lines and spine-tingling harmonies made them a sure highlight of the weekend. Orquesta Buena Vista Social Club themselves seemed lacklustre in comparison – fun for a dance, maybe, but their set dragged out perhaps a little too long, with too many requests to the audience for handclaps and singalongs, especially by Omara Portuondo, who was nothing less than an embarrassment by the time she left the stage, still pleaing desperately to the crowd to continue their half hearted attempts at singing along.</p>\n<p>After Orquesta Buena Vista Social Club had done their thing, we were told that the fun didn’t stop there – one of the many boasts of Standon Calling was that it had an all night license, and that they intended to make full use of it. Indeed, Friday night had seen the German electronic producer and DJ Pantha du Prince take to the decks, an artist who, with his incredible musical talent and wonderful new <em>Black Noise</em> album, was sure to set the Twisted Licks tent on fire. Only…he didn’t. With the sound a little on the quiet side, one could barely hear him over the incessant drone of festivals goers who found it necessary to talk persistently throughout his set. Sure, the atmosphere may have been great, but the atmosphere was that of one helluva big party, and not that of a music festival with an internationally acclaimed and accomplished line up. By all means, if you like that kind of atmosphere, then Standon Calling is a great excuse for a weekend of boozing and partying, but if you are one of the seemingly rapidly decreasing minority who care about the music, then, in all honesty, I wouldn’t bother.</p>\n<p><script type=\"text/javascript\" src=\"https://video.unrulymedia.com/wildfire_11244048.js\"></script></p>\n","slug":"2411-standon-calling","category":"festivals","date":1281525746000,"wpid":2411,"isSticky":false,"featured_image":{"width":800,"height":800,"src":"2010/08/efterklang.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAABgf/xAAkEAACAQIFBAMAAAAAAAAAAAABAgMEBQAGEiIxERQhYTNBUf/EABUBAQEAAAAAAAAAAAAAAAAAAAUG/8QAGREAAwEBAQAAAAAAAAAAAAAAAQIDABFB/9oADAMBAAIRAxEAPwBLYc3ZtuNuV62odIqeUhpYdA8KT0LEA+uv7g1Ddb3JEjz3C6GZlDOS7g6jzwMMKjZk2ZU2q0LagPAPPOJvb3bsKbcfiX79DAy1ajcOqnWcgSq+7//Z"},"createdAt":1587295058792,"updatedAt":1588403564827,"author":"5e9b68b27a1236eccfeb1d14","old_image":"2010/08/efterklang.jpg","categories":["festivals","music"]}