{"id":"5e9c0409774c2610387e4be8","artists":["5e9b694b7a1236eccfeb25d1"],"title":"Interview: Teen Daze","content":"<p>It’s only September, and yet already summer is starting to feel like a distant dream.</p><p> As we become sharply reacquainted with blanketing rain and sliding temperatures, it’s not only our wardrobe decisions that need a seasonal rethink, but our musical ones too – blasting out <i>Get Lucky</i> on the headphones while being blinded by sleet just feels a bit perverse.</p>\n<p>Canadian producer <strong>Teen Daze</strong> does a fine job of ushering in the colder weather on his new album <b><i>Glacier </i></b>(Lefse, Oct 1<sup>st</sup>).<b><i> </i></b>With track names like <i>Alaska</i>, <i>Autumnal</i> and <i>Ice On The Windowsill</i> (and that’s just the first three songs), the album floats along lingering synth lines and intricate melodies, forming a beautifully emotive set of songs that are redolent of breath-in-the-air days and frosty nights.</p>\n<p>I caught up with <strong>Teen Daze</strong> a few weeks back via Skype, and we had a chat about his hometown, playing the new album with a live band, and problems with UK border control…</p>\n<p>_________________________________________</p>\n<p><b><i>Whereabouts in the world are you right now?</i></b><b><i> </i></b></p>\n<p>I’m in my town of Abbotsford, BC, on a nice grey sort of day.</p>\n<p><b><i>Did you grow up around there then?</i></b></p>\n<p>Well the greater Vancouver area stretches out throughout this area called the Fraser valley, and I grew up in a town one over from Abbotsford, further away from Vancouver. Everything feels pretty close and tight round here.</p>\n<p><b><i>So it’s quite a rural area?</i></b></p>\n<p>Vancouver’s been growing so much over the last ten years that it’s sort of spreading out and overflowing out of the city. My area still feels rural though, and it still has a small town mentality I’d say – it’s easy to get into dense nature if you really want to. There’s lots of hiking spots and lakes round here, and we’re pretty close to the Rocky Mountains. You can pretty much look in any direction and there’s some sort of nature going on.<b> </b></p>\n<p><b><i>Did your environment influence the songs on this new album?</i></b></p>\n<p>Definitely. I feel like we get a good look at every season out here – everything is pretty temperate, so for summer you get at least two months of sunny weather, and fall normally stays warm until about October. Because those seasons are so definite, it’s really easy to get into each one. For example this summer, my wife and me were really intentional about going to the lake as much as possible, really trying to do as many summery things as we can, while we can! In contrast, all of these songs [on <b><i>Glacier</i></b>] came out of a very definite winter feel.</p>\n<p><b><i>Shorter nights, colder temperatures…</i></b></p>\n<p>Yeah, and because where we live is more of a rural area, at that time of year everybody is into just going to other people’s houses. We don’t have a lot of great pubs or venues to go to, so there’s a real culture of going round to other people’s houses.</p>\n<p><b><i>A sense of community, then?</i></b></p>\n<p>Yeah definitely. Obviously, it’s nice to go on tour and play all these big cities and see all these busy metropolitan spaces, but it’s really nice to come home and have it be so mellow.</p>\n<p>Anyway, all that is to say that being indoors and being stuck inside for a certain amount of time made me romanticize the idea of it on the record – it was just really nice to be in that space.</p>\n<p><iframe width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/PAFEjUItP2M?feature=oembed\" frameborder=\"0\" allowfullscreen></iframe></p>\n<p><b><i>You’re going to be touring with a live band in support of the album – how’s that going to be different from the process of writing the songs on your own? Or did you actually write the songs with other people, or with others in mind?</i></b></p>\n<p>I think with this record I had live performance in mind a lot more. I was using more live instrumentation, more live drum samples and stuff like that, and my booking agent and management all agreed it would be really cool to be able to have a big full band – it’s something I’ve been wanting to do for a while.</p>\n<p>So in the process of writing the album I had that idea in mind. Having said that, because I record everything myself, I have a tendency to overdo things in the recording process. Because there are no real limitations, I find it really easy to just layer different sounds on top of each other. But then I come back to it afterwards and think, how on earth are we supposed to play this live?!</p>\n<p><b><i>Giving someone an impossible part to play…</i></b></p>\n<p>Exactly – there’s four of us trying to play these eight parts happening at once! So to get ready for the tour, we’ve been working out how to play the songs with just two or three of us – finding what’s really important in the song and deconstructing it, and then building up from there. Rather than try to play the song exactly as I came up with it by myself, we wanted to make something that’s more unique to our own experience; I like seeing shows when it’s not necessarily just exactly the record all the way through, and it has a new feel to it.</p>\n<p>I really like shows that have a lot of dynamics as well, so I like the idea of extending songs and writing new parts that can go in between songs – making something really unique and special just for this tour.</p>\n<p><b><i>Are you guys coming over to Europe for the tour?</i></b></p>\n<p>It’s been in talks, but nothing’s set in stone yet. We were actually supposed to be in London in April last year, but we got held up at the border…</p>\n<p><b><i>OK…so what happened?</i></b></p>\n<p>It was sort of a mess; we went there with the information that we didn’t have to worry about work visas, that we could just show up and it would be fine, but when we arrived there was this whole ordeal!</p>\n<p>We were going to play in London, Manchester and Newcastle, but we ended up having to stay on the French side. It was a bummer because I think those shows would have been the biggest of the tour – but we did stay in this beautiful chateaux in the north of France, so we took as many benefits out of the situation as we could! I still haven’t been to London though. I really want to – it’s on the list.</p>\n<p><b><i>Well hopefully next time you guys won’t have the same problems at the border next time round…</i></b></p>\n<p>Yeah, we’ll do a bit more research – I think once you go through that experience once, you’re not going to do it again!</p>\n<p><i>Glacier comes out on Lefse on October 1<sup>st</sup>.</i></p>\n<p> </p>\n<p> </p>\n","slug":"24345-interview-teen-daze","category":"interviews","date":1380100031000,"wpid":24345,"isSticky":false,"featured_image":{"width":618,"height":280,"src":"2013/09/teendaze-8519.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAFAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAIE/8QAIBAAAgIBAwUAAAAAAAAAAAAAAgMAAQQFERQhMkFh4f/EABUBAQEAAAAAAAAAAAAAAAAAAAIE/8QAGBEBAAMBAAAAAAAAAAAAAAAAAQACETH/2gAMAwEAAhEDEQA/ANKtXJj8PLFZLHCoqtIMugbuNd1et5TtWC2nfEX1K/PyIk9+ENXVn//Z"},"createdAt":1587282953207,"updatedAt":1588403526487,"author":"5e9b68b27a1236eccfeb1d1a","old_image":"2013/09/teendaze-8519.jpg","categories":["interviews","music"]}