{"id":"5e9c03f0774c2610387e4bd2","title":"“The Art of Being Kate”: Kate Moss retrospective","content":"<p> </p>\n<p>Retrospective on the world-renowned icon – somewhere amongst all the recent hoopla leading up to London Fashion Week.</p><p></p>\n<p> </p>\n<p><a href=\"https://api.crackintheroad.com/uploads/2013/09/kate-moss-the-edit.jpg\"><img class=\"size-full wp-image-24435 aligncenter\" alt=\"kate-moss-the-edit\" src=\"https://api.crackintheroad.com/images/2013/09/kate-moss-the-edit.jpg\" width=\"550\" height=\"683\" srcset=\"https://api.crackintheroad.com/images/2013/09/kate-moss-the-edit.jpg 550w, https://api.crackintheroad.com/images/2013/09/kate-moss-the-edit-242x300.jpg 242w, https://api.crackintheroad.com/images/2013/09/kate-moss-the-edit-40x50.jpg 40w\" sizes=\"(max-width: 550px) 100vw, 550px\" /></a></p>\n<p> </p>\n<p>The cover of NET-A-PORTER’s digital magazine <b>The Edit</b> was lucky enough to be graced with the presence of fashion luminary <b>Kate Moss </b>on its last edition, smouldering as always in an Alexander McQueen dress on a set created by artist <b>Mat Collishaw. </b>The firey volcanic concept, though striking, remains at the heart of things a fairly transparent allusion to Moss’ public lifestyle and temperament and even comes across a little tame for Kate in light of all that Doherty and Daily Mail chaos.</p>\n<p>But why rehash over petty tabloid scandals. When talking about Kate, I’d far rather reference her Lucian Freud portrait, her charity work, her enormously successful Topshop line, or the fact that despite being an editorial and catwalk model she’s only 5″8, which, as a lady of rather petite stature myself, I can fully respect. Perhaps the most insightful quote of the whole issue was from editor Lucy Yeoman in her introduction to the edition. Yeoman hit the nail on the head in her opener, stating that ‘whether stepping out with Johnny Depp or sitting for Lucian Freud, she has always enthralled, seeming somehow both everyday yet totally out of this world.’</p>\n<p>Overall this is an appealing and interesting retrospective. Minus a few overly arse-kissy clichés (‘muse of a generation’, ‘glint in her eye’ and ‘effortless style’ are all repetitive re-offenders), there is still a nicely curated set of images, good quotes from interesting people and some heartwarmingly celebratory, if not astoundingly original opinions. After all, this is the woman who was discovered in JFK airport at 16 and went on to spearhead basically every trend we’ve been wearing for the past fifteen years.</p>\n<p>I don’t say it enough, but thanks a bunch, Kate.</p>\n<p> </p>\n<p>Read The Edit in full <a href=\"https://www.net-a-porter.com/magazine/212/9\">here</a>.</p>\n","slug":"24433-art-kate-kate-moss-retrospective-collaboration-mat-collishaw","category":"arts","date":1380515457000,"wpid":24433,"isSticky":false,"featured_image":null,"createdAt":1587282928756,"updatedAt":1587825862959,"author":"5e9b68b27a1236eccfeb1d4b","categories":["arts"]}