{"id":"5e9c33429b6559241525e026","title":"Art Review: Tomás Saraceno","content":"<p><a rel=\"attachment wp-att-2552\" href=\"https://admin.</p><p>crackintheroad.com/visual/2459-tomas-saraceno/attachment/saraceno128\"><img class=\"aligncenter size-full wp-image-2552\" title=\"saraceno\" src=\"https://api.crackintheroad.com/uploads/2010/08/saraceno128.jpg\" alt=\"\" width=\"720\" height=\"475\" srcset=\"https://api.crackintheroad.com/images/2010/08/saraceno128.jpg 720w, https://api.crackintheroad.com/images/2010/08/saraceno128-260x171.jpg 260w, https://api.crackintheroad.com/images/2010/08/saraceno128-640x422.jpg 640w, https://api.crackintheroad.com/images/2010/08/saraceno128-165x108.jpg 165w\" sizes=\"(max-width: 720px) 100vw, 720px\" /></a></p>\n<p>The Argentinean artist <strong>Tomás Saraceno</strong> spent the last two years of his life collaborating with various engineers, architects, astrophysicists and arachnologists to create what can only described as a human spider web. Designed to replicate a poisonous Black Widow’s web, the construction comprises of 8,000 strings, hand-knotted 23,000 times. In many ways the figures are more impressive than the piece itself, but that’s by no means a criticism, because the work is so effortless in its impersonation that the painstaking work that went before it becomes momentarily irrelevant.</p>\n<p>While saying this, as a construct in itself the piece is still jaw dropping. Meticulous, sprawling, tangling and imposing; the work circles a viewer in very much the way a real spider web would; it manages to capture the physical and metaphysical aspects of a web. The humbling quality of the work is also dramatic, playing with humanities arrogance towards our fellow creatures. My friend points this out to me as we walk around the exhibition, to which I reply “yeah but I’d like to see a spider build a house”. The more I think about it though the more insignificant I feel, it took <strong>Saraceno</strong> 2 years to build a construction that would have taken a spider a matter of hours; sure the spider might not be able to build a house but I doubt they feel the same arrogance we do towards them.</p>\n<p>What really makes the piece however is the accompanying room filled with the plans that were made before the actual construction. In a word they are mind-blowing. Planned with microscopic amounts of detail, the sketches in many ways do as good a job as the main piece itself in revealing the amount of skill and proficiency that goes into a spider’s web. More than anything though it reveals the obsessive disposition of <strong>Tomás Saraceno</strong> himself; with work this awe inspiring it seems a certain amount of obsession is something an artist can’t go without.</p>\n<p style=\"text-align: center;\"><a href=\"https://www.balticmill.com/index.php\">Check Out the <strong>Baltic’s</strong> Website</a></p>\n","slug":"2459-tomas-saraceno","category":"arts","date":1281994379000,"wpid":2459,"isSticky":false,"featured_image":{"width":720,"height":475,"src":"2010/08/saraceno128.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAAAAf/xAAkEAABAwIEBwAAAAAAAAAAAAABAgMFAAQGETEyFCEiJEFRYf/EABUBAQEAAAAAAAAAAAAAAAAAAAAB/8QAFBEBAAAAAAAAAAAAAAAAAAAAAP/aAAwDAQACEQMRAD8AsFxIy78E+mKsG0LbaQlhTzwyeJ3kAbQkaZ6/Ki93EYl4p7uLU9aueZHn1SlUf//Z"},"createdAt":1587295042777,"updatedAt":1588403564624,"author":"5e9b68b27a1236eccfeb1d24","old_image":"2010/08/saraceno128.jpg","categories":["arts"]}