{"id":"5e9c03b3774c2610387e4b7b","artists":["5e9b694b7a1236eccfeb258e"],"title":"New: Sufjan Stevens – Take Me","content":"<p>To this day, I stand by my claim that Age of Adz was one of the finest albums of 2010.</p><p> Whilst the unrelentingly dense, hyperactive electronic compositions and achingly personal lyrics – not to mention 27 minute closer <em>Impossible Soul </em>– put many off, in the context of the record it all made sense. It reflected the mild insanity that its creator had developed during a long term illness, the subsequent need to get out all the ideas he’d pent-up and the schizophrenic imagery of inspiration Royal Robertson.</p>\n<p>Earlier, he dropped new track <em>Take Me </em>in appropriately understated fashion. Described as a ‘repetitive lo-fi pop demo’ he found under his desk, it fits with the more understated approach the track takes. The twitchy electronics and burst of static filled percussion from <em>Age of Adz </em>are present, but are far less overwhelming, sitting alongside ambient keys and twinkling piano. The personal lyrics remain, however they are closer to the despondent ‘letter-to-the-listener’ whispers and yelps of ‘Futile Devices’ and the closing movement of ‘Impossible Soul’, than the angry shouts that made up most of <em>Age of Adz.</em></p>\n<p>Whether this is a sign that a new album is to follow is anyone’s guess. The throwaway nature of its release would suggest not, however the flurry of activity that heralded <em>Age of Adz </em>was largely unforeseeable.</p>\n<p>Even if not, it’s great to hear an insight in to how his sound continues to evolve.</p>\n<p>[soundcloud url=”https://api.soundcloud.com/tracks/115523099″ width=”100%” height=”166″ iframe=”true” /]</p>\n<p> </p>\n<p>(Fuck off, I’m not mentioning his letter)</p>\n","slug":"24648-new-sufjan-stevens-take","category":"music","date":1382008386000,"wpid":24648,"isSticky":false,"featured_image":null,"createdAt":1587282867868,"updatedAt":1588441761671,"author":"5e9b68b27a1236eccfeb1d0b","old_image":"generated/02eb6f9f862cf905be646bcbfa52fc0ecc994410.jpg","categories":["music","new"]}