{"id":"5e9c331e9b6559241525dfeb","artists":["5e9b690a7a1236eccfeb21f1"],"title":"Review: Kendal Calling","content":"<p>Arriving at Penrith train station, <strong>Crack In The Road </strong>were in high spirits for a weekend of musical endeavours in the beautiful lake district.</p><p> In the space of 5 years, <strong>Kendal Calling </strong>has evolved from a one day event headlined by <strong>Pendulum </strong>to a three day extravaganza of fantastic dance DJ’s and an eclectic mix of artists from all genres of music. This year saw headline slots filled by <strong>The Coral</strong>, <strong>The Doves</strong>, and <strong>Calvin Harris</strong>, and a weekend of glorious sunshine that was more unexpected, and frankly more welcome, than a <strong>Take That </strong>reunion.</p>\n<p>Unfortunately our first experience of <strong>Kendal Calling </strong>did not begin well, and instead proved to be the most exhausting part of the weekend. On arrival, stewards from the <strong>Big Green Bus </strong>company were flanked on the exit of Penrith train station offering £10 return bus tickets to the festival. Wanting to be green, and fearing the cost of a local taxi, we decided to take these ingeniously positioned stewards up on their offer. However the bus, as with all the other buses, dropped us and other festival goers off at the ‘Disabled and Traders’ entrance, which meant a 2 mile hilly walk around the site to the correct entrance. Not necessarily a disaster, but when you have 20 kilograms of tent, sleeping bag, clothes, and beer to carry, it was a nightmare. When we finally did reach the correct entrance and pitched our tent, we immediately felt at home in the awe inspiring surroundings of the Cumbrian countryside.</p>\n<p><strong>Kendal Calling </strong>appeared to have mastered the formidable task of maintaing the charm and authenticity of a small festival, while harnessing the capacity and financial incentives of being a big festival. The campsite sprawled to meet the entrance to the arena, which opened up into a world of eclectic food stalls and, to your immediate right, a music stage powered entirely by solar energy. I was lucky enough to be given a tour around the electrics and sound system of this stage by the Stage Manager, who revealed that the system used on the stage was use by Jools Holland, <strong>20 years </strong>ago. However if it was good enough for him then, it certainly hadn’t lost its quality, perhaps rejuvenated by its green energy source. As I explored into the arena further, the Main Stage provided the heart of the festival, which spread musical veins across to the other stages, family areas and a fantastically odd alternative stage. While you felt you were in acres of space when wandering around, there was always something of interest, or something to quench your thirst and ease your hunger, within 20 yards. Again, big festival surroundings with a small festival feel. However such a balance cannot be held indefinitely, so I’d advise you to make Kendal a vital part of next year’s festival plans.</p>\n<p><strong>Band Highlights:</strong></p>\n<p><strong>DJ Yoda:</strong></p>\n<p>Named by <strong>Q Magazine </strong>as one of the top ten DJ’s to see before you die, <strong>DJ Yoda </strong>lived up to the shadow of massive hype that trails him everywhere he goes. A mash up of the classic and the modern, <strong>DJ Yoda </strong>skillfully mixed seemingly incompatible tracks in a joyful and infectiously energetic fashion that had Kendal’s dance tent dancing for the whole duration of his set.</p>\n<p><strong>General Fiasco:</strong></p>\n<p>After previewing these Northern Irish rockers, I really did expect a lot from them on their first festival season tour after releasing their debut album. However the band failed to ignite the crowd, and appeared to be unenthused during a very uninspiring set which made their tracks sound like a dull mess of guitars and vague vocals. However mother nature took pity on <strong>General Fiasco </strong>and opened the heavens, forcing festival fans to hurry into a tent they otherwise would have wisely vacated.</p>\n<p><strong>The Coral:</strong></p>\n<p>After releasing ‘<strong>Butterfly House</strong>‘, a noticeable rejuvenation of these North West musical heavyweights, <strong>The Coral </strong>performed a phenomenal set on the Main Stage. Pioneering the new album, while still managing to play a few of their classics, <strong>The Coral </strong>projected their dreamy, psychedelia sound in a set that left many awe inspired and others convinced that <strong>The Coral </strong>were definitely not in their last throes of musical integrity.</p>\n<p><strong>The King Blues:</strong></p>\n<p>Considered by some as protest heroes, and by others as untalented roustabouts, <strong>The King Blues </strong>performance lay somewhat in the middle of these two definitions. After having spoken to <strong>The Specials</strong>, the ska legends stated that the two bands they were most excited about were <strong>Kid British </strong>and <strong>The King Blues</strong>. Now while there are obvious similarities between the bands, essentially their anti racist, anti conservative ethos, <strong>The King Blues </strong>are a musical atrocity in comparison to their enshrined Ska heroes. While the set was full of energy and movement, which made it relatively interesting to watch, the musical integrity of the band was nowhere to be seen.</p>\n<p><strong>First Aid Kit:</strong></p>\n<p>Dreamy Swedish pop duo <strong>First Aid Kit</strong>, delayed a day by a medical emergency, performed an atmospheric set that drew influences from <strong>Slow Club </strong>and <strong>Laura Marling</strong>. Lyrically clever and soulful, vocally powerful yet sweet, <strong>First Aid Kit </strong>have a synergy in their sound that transcends through more than just their sibling relationship.</p>\n<p>While some bands failed to deliver, others provided sets that are still emblazoned on my mind. Kendal Calling is a festival for everyone, and while that is rarely said honestly, or without degrading the integrity of the festival, Kendal Calling allowed you to create your festival experience in a welcoming and exciting atmopshere.</p>\n","slug":"2465-review-kendal-calling","category":"festivals","date":1283523631000,"wpid":2465,"isSticky":false,"featured_image":{"width":3456,"height":2304,"src":"2010/09/subways.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAYH/8QAIRAAAQQCAAcAAAAAAAAAAAAAAQIDBBEABRIVMkFRUsH/xAAVAQEBAAAAAAAAAAAAAAAAAAABAv/EABURAQEAAAAAAAAAAAAAAAAAAAAB/9oADAMBAAIRAxEAPwDM4+r1adAxNagu80YkWYrpC2XUK6bVxA2PHfJheomFaiYyrv3SPuMZVD//2Q=="},"createdAt":1587295006258,"updatedAt":1588403564137,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2010/09/subways.jpg","categories":["festivals","music","reviews"]}