{"id":"5e9c0386774c2610387e4b48","title":"Join The Team","content":"<p>Three and a half years, almost 3,000 posts, and most importantly, experiences that will stick with me forever.</p><p> It’s fair to say that when I started Crack in the Road, I had no idea the places it would take me, and the opportunities it would offer up.</p>\n<p>Now, with very much the same people as when the website began, although with several departing along the way, I feel it’s necessary to open up the blog to new contributors; fresh faces if you will. Three years has not only seen changes in the blog, but also differing circumstances outside of the CitR sphere (in the real world), with many writers who had been at university now working those dreaded full-time jobs, or simply losing the passion they initially had for writing about new music. There’s no blame to be positioned, and those who are still contributing, or have done over the years should know how vital they are to the life of CitR.</p>\n<p>Every day I become more and more frustrated at only being able to cover a minuscule percentage of the fantastic array of talent out there. Emails go unanswered, posts remain half finished, feature ideas fall by the wayside, and not because of laziness or lack of passion for them, simply because there aren’t enough hours in the day. This is not a full-time job, hell, it’s not even a part-time job. There’s no pay and the rewards can at times seem inconsequential, hence why writing a blog is certainly not for all. For me, the greatest reward in writing a blog is the response, both from readers and from artists themselves. Nothing quite beats hearing from a musician on the other side of the world, who had no idea that their music could possibly be reaching the ears of other people thousands of miles away.</p>\n<p>Last time I asked for new writers, the response was rather overwhelming, and many signed up to be contributors, however a month or two down the line, and only two or three of them remained. Of the initial emails I received declaring interest, a relatively high percentage asked either where the offices were, or what the pay details where. I’m sorry to disappoint anyone who may be reading this as a job proposal; it’s not. There’s no money involved in CitR, aside from a handful of unobtrusive video adverts that don’t even cover the cost of hosting the website, let alone other outgoings.</p>\n<p>What I’m looking for is passion. Passion for music and for writing. A willingness to be part of a team, or if you will, part of the Crack in the Road family. No writing experience is required, you also don’t need to be unearthing obscure, never heard before artists. That said, this isn’t a blog where you’ll be fed the content. You won’t get sent press releases and asked to rehash them, and I’m not in the market for instructing people on what they can and can’t write about.</p>\n<p>So, in summary. If you’re interested in contributing to Crack in the Road, get in touch at:</p>\n<p>josh (at) crackintheroad.com</p>\n<p>Please send a brief email, simply outlining why you’d like to contribute to CitR. Please don’t attach a CV.</p>\n<p>Thanks.</p>\n","slug":"24718-join-team","category":"uncategorized","date":1382990179000,"wpid":24718,"isSticky":false,"featured_image":null,"createdAt":1587282822977,"updatedAt":1587825861278,"author":"5e9b68b27a1236eccfeb1d27","categories":["uncategorized"]}