{"id":"5e9c334b9b6559241525e036","title":"Review: The Cribs – Housewife","content":"<img class=\"alignnone\" title=\"The Cribs\" src=\"https://c2.</p><p>ac-images.myspacecdn.com/images02/6/l_503dbb14cd0545a38bdeffc0baf4c6c9.jpg\" alt=\"\" width=\"600\" height=\"401\" />\n<p>Wakefield’s indie darlings are back with their first single since last years highest charting album <em>Ignore The Ignorant</em>. Since recruiting <strong>Johnny Marr </strong>both on record and in the majority of their live performances, <strong>The Cribs </strong>have become a real force to reckon with in the commercial music industry. However, with that in mind, the release of <em>Housewife </em>was a somewhat obscure one, with no press coverage or campaign to get the ball rolling. So it was a delightful surprise when the single was featured on <strong>Zane Lowe’s </strong>Radio 1 Show on Monday 9th August, and within hours the song was available to download from iTunes.</p>\n<p>The single also premiers <strong>The Cribs</strong> first on record heavy usage of the synth, which came as a shock to many hardcore fans, who perhaps saw the band as being “above that”. Whilst the chorus is unlike anything heard from the Wakefield group before, the verses are very much in the style of <em>Ignore The Ignorant</em>, suggesting the guys aren’t entirely convinced with moving away from their brash edged, raw sound. However, that said, the synth does lead for the length of the song, almost echoing parts of <strong>Franz Ferdinand’s</strong> most recent release, so it comes as no surprise to know that the band worked with Alex Kapranos on their last record.</p>\n<p>A bold and adventurous move, sure to completely alienate <strong>The Cribs </strong>fans who began losing faith after <em>Ignore The Ignorant</em>. Far and away not their career highlight to date, yet still an exciting and promising slight change of direction from the group, and as if the song itself hasn’t shocked you enough, then check out the hilarious yet unnerving video.</p>\n<p style=\"text-align: center;\"><a href=\"https://www.youtube.com/watch?v=LKciOAXMxk0\">Check out the video for Housewife!</a></p>\n<p style=\"text-align: center;\">\n","slug":"2475-review-the-cribs-housewife","category":"music","date":1281638425000,"wpid":2475,"isSticky":false,"featured_image":{"width":600,"height":401,"src":"2011/06/l_503dbb14cd0545a38bdeffc0baf4c6c9.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAIH/8QAIhAAAQIFBAMAAAAAAAAAAAAAAgERAAMEBRIGEyFhFFFS/8QAFAEBAAAAAAAAAAAAAAAAAAAAA//EABgRAQADAQAAAAAAAAAAAAAAAAEAAgMx/9oADAMBAAIRAxEAPwDMplwt9MNOFGUk5gmUtfIp9xRYRV3J0d1+fUWevdMoZIVPcsn5wXEX6TLhOoQgDMt2K3Sf/9k="},"createdAt":1587295051888,"updatedAt":1588403564750,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/06/l_503dbb14cd0545a38bdeffc0baf4c6c9.jpg","categories":["music","reviews"]}