{"id":"5e9c030a774c2610387e4a89","artists":["5e9b69317a1236eccfeb2440"],"title":"Video: Planningtorock – Human Drama","content":"<p>Planningtorock aka Jam Rostron (formerly Janine Rostron) has released a psychedelic video of fluidity and androgyny to accompany her infectious new single Human Drama.</p><p> Donning an 50’s era pageboy haircut, Jam traipses in and out of technicolor Rorschach ink blots. Like a lava lamp the ink blots melt from one form to the next mimicking the fluid sexuality Planningtorock sings about. I would speculate on what the ink blots are truly meant to represent, but I’m afraid by the nature of the test that I’ll only be exposing my own psyche. Although I will admit that I’m convinced and not unsurprised that most of the forms appear phallic and vulvic. <em>Hardly a coincidence.</em></p>\n<p>“There’s lots to learn but so much more to unlearn<br />\nGimme a human drama<br />\nThe personal is so political<br />\nGimme a human drama<br />\nIt kinda feels like genders just a lie”–where The Knife queered their sound on “Shaking the Habitual,” Jam has brought queer culture right into the conversation. The unavoidable nature of the lyrics and success of the track gives this pessimist hope for the future of music as a force for change. From one release alone, Planningtorock’s next album, All Love Is Equal, has done a stunning job of bringing queer identity into pop culture.</p>\n<p><iframe src=\"//player.vimeo.com/video/81067735\" height=\"281\" width=\"500\" allowfullscreen=\"\" frameborder=\"0\"></iframe></p>\n<p><a href=\"https://vimeo.com/81067735\">Human Drama – Planningtorock</a> from <a href=\"https://vimeo.com/planningtorock\">planningtorock</a> on <a href=\"https://vimeo.com\">Vimeo</a>.</p>\n","slug":"25302-new-video-planningtorock-human-drama","category":"music","date":1386608055000,"wpid":25302,"isSticky":false,"featured_image":null,"createdAt":1587282698849,"updatedAt":1588441760791,"author":"5e9b68b27a1236eccfeb1d20","old_image":"2013/12/p2r_press_pic2-950x979.jpg","categories":["music","new","videos"]}