{"id":"5e9c33439b6559241525e029","title":"Review: Talk To Angels – She/Enemies Closer","content":"<p><img class=\"alignnone\" title=\"TTA\" src=\"https://c2.</p><p>ac-images.myspacecdn.com/images02/129/l_535ea1d2443846d284ca5a872ead4c2d.jpg\" alt=\"\" width=\"600\" height=\"399\" />Bradford born four piece <strong>Talk To Angels</strong> are fast becoming one of the most talked about bands around. Sure, they are buoyed by the fact that Embrace keyboardist<strong> Mickey Dale </strong>is one of the four members, however from a personal point of view, the songs I have heard from his new outfit are far more adventurous and enthralling than anything his previous outing produced. Having already been invited over to play South By South West in Texas, after which they embarked on a full US tour, their futures in music seemed already decided, unfortunately on the final night of their time in the States, two of the band members lost out in an argument with a speeding car, leaving both of them in hospital with severe injuries.</p>\n<p><em>She/Enemies Closer </em>is the new double A sided single from <strong>Talk To Angels</strong>, released via Warp Speed Carousel midway through October. Combining slick indie influences with their love of brash metal bands, they create a vivid, original sound that is lightly comparable to that of <strong>The Airbourne Toxic Event</strong>. However, the two tracks featured on this new release are decidedly different from each other. <em>She</em> is a captivating ode to an alluring couple, caught in an endless tumultuous romantic web, crescendoing elegantly into the chorus’s, whilst the verses tie the song together, telling a haunting yet titillating story. The heartache is evident, the laments are thorough, lonesome and passionate.</p>\n<p>On the other hand, <em>Enemies</em> showcases a snarling, ambitious side to the group, a heavy synth laden call to arms for other angst ridden youngsters. Their metal influences are incontestable, although there is a more anthemic edge to the song, unsurprising when you consider <strong>Mickey Dale</strong> has had his hand in writing some of the most known sing-alongs of the last twenty years. Anyway, don’t think for a second that<strong> Talk To Angels </strong>are at all living in the slowburning limelight of <strong>Embrace</strong>, they are an entirely new band, with astounding potential, be sure to check out on of their electric live shows on their upcoming UK tour which begins in September.</p>\n<p style=\"text-align: center;\"><a href=\"https://www.myspace.com/talktoangels\">Check Out Talk To Angels’s Myspace!</a></p>\n","slug":"2545-review-talk-to-angels-sheenemies","category":"music","date":1281975709000,"wpid":2545,"isSticky":false,"featured_image":{"width":600,"height":399,"src":"2011/06/l_535ea1d2443846d284ca5a872ead4c2d.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAQH/8QAIxAAAgECBAcAAAAAAAAAAAAAAQIAAxIEBQYRFCEiMVGh0f/EABUBAQEAAAAAAAAAAAAAAAAAAAYH/8QAHBEAAgICAwAAAAAAAAAAAAAAAQMCEQAEBSFR/9oADAMBAAIRAxEAPwDFaWh8M1Uji7rQCwsICi07nvz8+pK+QZezFlxFMKTuOhvkRDy9lsybl5lSdxOkmhFY7vP/2Q=="},"createdAt":1587295043453,"updatedAt":1588403564648,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/06/l_535ea1d2443846d284ca5a872ead4c2d.jpg","categories":["music","reviews"]}