{"id":"5e9c02d5774c2610387e4a2f","artists":["5e9b69517a1236eccfeb25fb"],"title":"Thematic Interview: The Correspondents (Music Videos)","content":"<p>Ever since that internet thing really kicked into gear, music videos have become an integral, if not crucial, part of the music industry.</p><p> Today, they’re far more than recorded performances of a song played over and over again on MTV. The effort behind them, and the hype they build, can be as significant as the songs themselves. With that in mind, this is the first of a series of thematic interviews – with more coming over the next few months – with various artists discussing various topics, ranging from local music scenes to the role of the internet to the darker side of touring. For our first, we sat down with <strong>The Correspondents’ </strong>Ian Bruce, shortly after the release of their highly innovative video for ‘Fear and Delight’, to talk about the role of the music video in the industry.</p>\n<p><em>CitR: Briefly tell us about your new video, and how it was filmed.</em></p>\n<p><b>Ian: It’s incredibly complicated. We feel very indebted to the director, Naren Wilks, who invented this camera technique which he calls composite camera, which – I hope I get this right or he’ll probably get cross – the basic gist of which is that you have eight, or any number, of cameras filming the same thing from different perspectives simultaneously and then that footage is then layered up, so you can create this crazy kaleidoscopic effect. He calls it composite of camera technique. He originally did a piece called ‘<a href=\"https://www.youtube.com/watch?v=E9LcP3WXFV0\">Collide-o-scope</a>’ – it was in a square room, and he had four cameras in each corner, and they were angled down into the space so that each camera theoretically viewed the same looking space – the same angle of the room. Then, when he gets into it, he turns into four. With us, he did it in a cylinder, so you can have as many cameras as you like set up around the edge. He managed to get hold of eight cameras, and then he’d multiply to sixteen. It’s a pretty extraordinary technique.</b></p>\n<p><em>CitR: It’s not the first highly stylised video that you’ve done. Do you find you intentionally try to avoid producing videos that might be seen as vanilla, or by-the-numbers?</em></p>\n<p><b>Ian: I don’t think we ever think in those terms. I don’t think we consider ourselves as a pop act, and I certainly wouldn’t want to put out a video that could be considered as generic. If anything, I’d rather that people just didn’t like it because they found the aesthetic wasn’t to their liking rather than being something that was just bog-standard. I don’t think anyone sets out to make a video that’s generic or bog-standard. Maybe they do. Maybe producers would set out to do that to appeal to a particular market. With the other videos – there’s the animation that I did. That was supposed to be this really simple thing, but I got bored after about a day and then it became something a lot more elaborate – and inevitably stylised, because if you’ve just got one person in a room with a pen it’s going to end up in a particular style. </b></p>\n<p><em>CitR: Do you feel that your genre of music lends itself to a particular visual style?</em></p>\n<p><b>Ian: Potentially. There’s something quite nostalgic about our music – it has links to the vintage. Looking at ‘Fear and Delight’, we made quite a conscious effort that yes, I’m wearing a suit, and that camera trickery has links to the zoetrope and those quite manual ideas. But those are the things I wear on stage, and I don’t think we’re trying to be a particular style. </b></p>\n<p><em>CitR: Going into making a video, do you have a specific aim in your head about what you want to achieve, or get across?</em></p>\n<p><b>Ian: With ‘Fear and Delight’, it was a different process because Naren had approached us with the idea and said he’d like to make a music video with us and we thought ‘Wow, this is an amazing opportunity’. And we couldn’t actually believe he approached us because we feel he could have approached anyone – even a really large artist, who would have just dropped everything and done it. He basically approached us and said he wanted to do it with this particular technique in a cylindrical space. When we first went down there, we had a very rough storyboard that we were going to play around with. Tim and I really homed in on a particular storyboard. I think Naren is an exceptionally good artist and a very good filmmaker, but he’s never made a music video before – and that’s a very different kettle of fish: every five seconds, scenes have to change and things have to really tap in with the beat, which is a slightly different thing. I think we had to sort of co-direct that part of it. But then, the video we’re about to release in January is actually a painted animation which I’ve done, which is actual stop-motion. I’ve painted portraits of myself from when I was a baby all the way up to now, and had a camera set up that takes a photo every eight seconds, so it records the painting as a process. Then, when you convert that into animation, you take out all the frames where you see my hands and end up with this weird painting that kind of paints itself. So you see this face aging over time.</b></p>\n<p><em>CitR: Do you find there’s anything you can get across in a video that you can’t in live music?</em></p>\n<p><b>Ian: Oh yeah, definitely. Live music is really chaotic. It can be really unrefined, and that’s why it’s so fun. People come to live shows because they’re aware things can go wrong at any moment. That’s the joy of it. You’re walking a tightrope, and seeing people fall off that tightrope is one of the most exciting things that you can see – or just doing weird things on stage that you wouldn’t expect. Whereas with a music video, you can look at every single split second and break it down, so that everything is as perfect as you want it to be. Unless you set up a video so that it’s more of a performance that’s recorded once, and that’s it. I’d certainly be up for doing that. </b></p>\n<p><em>CitR: Speaking more generally, there seems to be a trend over the last few years to produce, rather than music videos, short films that are soundtracked by an artist’s song. Do you believe a music video should be more about the music than the video or vice versa?</em></p>\n<p><b>Ian: I think it can be both. Our next video – or the one after our next video – is actually going to be a short film. Two of the songs of the album – one of them we play live, it’s a sort of slow, ballad-y thing, but the other we’ve never played – those are going to be sandwiched together and they’re going to create the soundtrack to a four-minute film. I don’t think there should be any restrictions. There are so many videos that I’ve watched where I remember the song and not the video, and vice versa. Sometimes the aesthetic is so strong that I just don’t even care. Often I find myself following particular music video makers rather than the artist. </b></p>\n<p><em>CitR: With regards to the internet, it seems apparent that music videos are more statistically popular than, say, Soundcloud or Bandcamp pages. Why do you think that is?</em></p>\n<p><b>Ian: I think it’s something like 80 percent of music is digested through music videos. It’s because peoples’ attention spans are becoming less and less. They want to be stimulated. It’s a very weird game, being a musician. Peoples’ attention spans are getting shorter and shorter and shorter – the fact that Vine exists and is so popular, means that peoples’ entertainment is being cut down to six seconds. It’s kind of crazy. Twitter’s very similar in that sense. I went to art college too, so for me, aesthetics are very important. I’d almost say they’re as important to me as the music. Tim doesn’t think quite so visually. He certainly knows what he likes, but his brain works musically. That’s why he’s such a great producer. </b></p>\n<p><em>CitR: What’s your view on videos that are produced, arguably, for shock value or to stir up controversy? Say, for example, Miley Cyrus.</em></p>\n<p><b>Ian: Fair enough, really. They all have their place. Miley Cyrus is really not that controversial – she thinks she’s being controversial because she used to be a teeny pop star. But they knew what they were doing, certainly. Die Antwoord, for example, they’re really entertaining. They are, I guess, a sort of highly-branded form of punk. They managed to create their own brand out of it. I think it all has its place. I don’t think there was anything particularly new about Miley Cyrus. Terry Richardson, I guess, is a kind of talented pervert. </b></p>\n<p><em>CitR: Is there any video that stands out as being particularly memorable from when you were growing up or starting out as an artist?</em></p>\n<p><b>Ian: I really don’t know. My mind’s gone blank. I can’t think of anything particular from when I was growing up that really hit a chord. I remember seeing that Radiohead one – what’s that one where his head is in that glass cylinder, and it fills up with water? </b>[It’s ‘No Surprises’] <b>That, to me, was one of those ones where it’s like you’ve set up an experiment, and then you record a video, so it’s much more like an art performance than a music video. There are so many forgettable videos of artists in various locations just strumming away.<br />\n</b></p>\n<p><em>CitR: Do you think that, in the next ten years, there’ll be any major technological advancements in the way music videos are produced or released? <b> </b></em></p>\n<p><b> Ian: I’m probably not the right person to ask. ‘Fear and Delight’, and the one we’re currently about to start, they’re pretty craft-based things. Naren would say that as well, all those techniques are manual. There’s a tiny bit of CGI involved in terms of green screen and layering stuff. I’m imagining that… I don’t know, 3D? People have done 3D music videos, haven’t they? Once you get to the stage where you’ve got Google Glasses or something like that… The problem is, things are becoming smaller and smaller. It’s the detail in things that might be lost. That’s why sensationalism works, that’s why really poppy, overt graphics work. It’s quite difficult to get subtlety across when you’re looking at it on an iPhone. I remember seeing <i>Gravity</i> in 3D at the IMAX. Like a lot of these things, it works, but a lot of things seem to be done for fad’s sake. If technology is used in the right way, and ties in really nicely with whatever concept a band’s director has come up with, then yeah – brilliant. </b></p>\n<p> </p>\n<p>Check out the video for ‘Fear and Delight’ – and the making of – below.</p>\n<p><iframe width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/ABS-mlep5rY?feature=oembed\" frameborder=\"0\" allowfullscreen></iframe></p>\n<p><iframe width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/mzVWUYjGoDg?feature=oembed\" frameborder=\"0\" allowfullscreen></iframe></p>\n","slug":"25565-interview-correspondents-music-videos","category":"interviews","date":1387207910000,"wpid":25565,"isSticky":false,"featured_image":{"width":842,"height":464,"src":"2013/12/correspondents.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAGAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAUH/8QAHxAAAgICAgMBAAAAAAAAAAAAAQIDBAARBSESIjFB/8QAFAEBAAAAAAAAAAAAAAAAAAAAAP/EABQRAQAAAAAAAAAAAAAAAAAAAAD/2gAMAwEAAhEDEQA/AMJq2abwl4ojWWCQRGCOJWR9EexLHZJHlsHf52MpR8fQuotpeJrIJwJQolZQPLvWtdffmMYH/9k="},"createdAt":1587282645834,"updatedAt":1588403523126,"author":"5e9b68b27a1236eccfeb1d16","old_image":"2013/12/correspondents.jpg","categories":["interviews"]}