{"id":"5e9c331a9b6559241525dfe5","artists":["5e9b694b7a1236eccfeb2591"],"title":"Review: Summer Sundae","content":"<p>Celebrating it’s 10th birthday, <strong>Summer Sundae </strong>once again provided an eclectic mix of artists and comedians to suit all tastes.</p><p> As the festival is located within Leicester’s city centre, getting there was easy and finding a camping space was even easier due to the limited capacity of the site. Set within the grounds of De Montfort Hall, <strong>Summer Sundae </strong>is unique in it’s festival feel. There is a main thoroughfare to the site, laced with fantastic food and drink stalls (including the very friendly and tasty Lucy’s Toasties) which provide more than just the normal overcooked burgers and warm, flat drinks. This thoroughfare led to all 4 stages which compromised of the Main Stage, a <strong>Last FM</strong> Rising Stage, a (very small) Musician stage, and the Indoor Stage. Rarely at a festival do you get to enter a building other than a tent, however De Montfort Hall provided a fantastically atmospheric venue for some of the best acts of the weekend.</p>\n<p>Perhaps due to it’s relatively cheap ticket price and promise of a children friendly area, the main demographics at <strong>Summer Sundae </strong>appeared to be 14-17 and families. The former became annoying when they gave <strong>Tinchy Stryder </strong>more than the audience of 3 that he and his set deserved, and a combination of the both meant that the only post music events was a Silent Disco that ended at 1am. However you don’t go to a festival like <strong>Summer Sundae </strong>if you want the alcohol fueled scenes of <strong>Leeds </strong>and <strong>Reading</strong>, instead <strong>Summer Sundae </strong>provides one of the most intimate festival platforms for some of the best grass roots and well known musicians alike. A hidden gem amongst festivals, make sure <strong>Summer Sundae </strong>is on your festival calendar for next year.</p>\n<p><strong>Band Highlights:</strong></p>\n<p><strong>The Sunshine Underground:</strong></p>\n<p>They had one good song. They still do.</p>\n<p><strong>The Besnard Lakes:</strong></p>\n<p>Canadian indie rock four piece <strong>The Besnard Lakes </strong>claimed to have gone without 36 hours of sleep as to get to Summer Sundae, however there were no signs of fatigue in their fantastically atmospheric set. One of the few bands to make the most of their indoor setting, their set was full of vocal harmonies between husband and wife duo <strong>Jace Lasek </strong>and <strong>Olga Goreas</strong>, and guitars that ranged from the dreamily distorted to heavy rock riffs. <strong>The Besnard Lakes </strong>are definitely a band to see live at least once in your life.</p>\n<p><strong>Caribou:</strong></p>\n<p>London born, Canadian raised <strong>Daniel Victor Snaith </strong>(a.k.a. <strong>Caribou</strong>) performed one of the best sets of the festival, however a set that still left me thinking it could be better. When I say it could be better, this is no failing of Snaith’s musical ability, rather his electronic tracks laced with progressive percussion would be much better suited to a low ceiling club packed to capacity, instead of a grand hall. Regardless of this slight preference of mine, <strong>Caribou </strong>performed an innovative and entertaining set that made it impossible for you not to dance. Instead of the band being spread across the stage, Snaith organised them all into a tightly packed circle at the front of the stage, which seemed to create a centre of energy that could have been lost otherwise. Another musician that you must see live, <strong>Caribou </strong>has managed to create a sound that is both indie synth and electronic dance at the same time. Amazing.</p>\n<p><strong>Dog is Dead:</strong></p>\n<p>The only band to beat <strong>Caribou </strong>as my favourite act of the weekend, <strong>Dog is Dead </strong>played a phenomenally energetic set of ‘uplifting pop for jazz junkies and choir folk’. While indie-pop may be a slightly more recognisable term for the band’s music, this quote from the band themselves demonstrates their genuine passion of simply playing music they all enjoy. Upbeat and underscored by a fantastic Alto Saxophone, <strong>Dog is Dead </strong>play catchy tracks with choir-like vocals that help maintain a great level of music integrity. There next single ‘Young’ is out on September 25th; buy it.</p>\n<p><strong>Lissie:</strong></p>\n<p>Having seen <strong>Lissie </strong>perform before, my high expectations were surpassed yet again. A warm and friendly stage presence is reflected in her music, which is influenced by genres ranging from Country to Rap and contains some of the most stunning female vocals of recent times. Built around story telling themes, <strong>Lissie</strong>‘s tracks all have that energy of personal passion and familiarity, which in turn make them entertaining to watch. While some may say her music is too simplistic and superficial, they only need to listen to tracks like ‘Oh Mississipi’ and ‘Everywhere I go’ to demonstrate this isn’t the case.</p>\n<p><strong>Mumford & Sons:</strong></p>\n<p>Their only headline festival appearance, <strong>Mumford & Sons </strong>have come a long way in the 18 months since I saw them perform to 50 people in the <strong>Cumberland Arms </strong>in Newcastle. Performing a set that now must be emblazoned upon their minds, <strong>Mumford & Sons </strong>did not need to do much for a crowd that seemed excited enough to simply be in the same geographical spot as the band. However <strong>Mumford & Sons </strong>performed a solid set with the same intimacy that I had witnessed 18 months earlier, with their only let down being the suggestion that even <strong>Tinchy Stryder </strong>shouldn’t be booed. I guess no one is perfect.</p>\n<p><strong> </strong><strong>Summer Camp:</strong></p>\n<p>Former <strong>Crack In The Road </strong>interviewees, <strong>Summer Camp </strong>performed an entertaining set that displayed the musical promise of the <strong>Warmsley/Sankey</strong> partnership. Very much still a project in development, <strong>Summer Camp </strong>float within a chillwave movement that sees the band create dreamy synths with mellow vocals galore. Make sure to watch out for their upcoming EP ‘Young’, due out in September and promises to excite many.</p>\n<p><strong>Tinchy Stryder:</strong></p>\n<p>Awful. Was fortunate not have been struck by a piece of rock candy that appeared to be fired at him from the audience.</p>\n","slug":"2558-review-summer-sundae","category":"festivals","date":1283644469000,"wpid":2558,"isSticky":false,"featured_image":{"width":3456,"height":2304,"src":"2010/08/img_2832.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAQH/8QAIBAAAgICAgIDAAAAAAAAAAAAAQIDBAARBSEGEhQxYf/EABUBAQEAAAAAAAAAAAAAAAAAAAIE/8QAGREAAwADAAAAAAAAAAAAAAAAAAECERIx/9oADAMBAAIRAxEAPwDO6V0V7DXvj10tq5lDAEq7kjoqTr1A30NH9y2PzeeGNYo+K4EIgCrujs6HX37Yxgdsl3rmT//Z"},"createdAt":1587295002651,"updatedAt":1588403564086,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2010/08/img_2832.jpg","categories":["festivals","music","reviews"]}