{"id":"5e9c333f9b6559241525e020","artists":["5e9b69447a1236eccfeb2577"],"title":"Review: Star Slinger – Volume 1","content":"<p><img class=\"alignnone\" title=\"Star Slinger\" src=\"https://www.</p><p>starslinger.net/biography_files/selection.png\" alt=\"\" width=\"696\" height=\"469\" />Having already dabbled his toes in the colourful, chromatic waters of dance music,<strong> Darren Williams </strong>aka <strong>Star Slinger </strong>began to find himself constrained to certain genres and artists, a convention that his extensive vinyl collection would simply not allow. So despite receiving plays from Radio 1 as well as support from<strong> Paul Van Dyk</strong>, <strong>Williams </strong>spread his roots, and took up producing beat tapes, and with just one listen to his recent release <em>Volume 1</em>, it appears there has been no hesitant looking back from <strong>Star Slinger</strong>.</p>\n<p>Coming in at just over thirty minutes, <em>Volume 1</em> is a turbulent and pulsating ride, racing through all genres from reggae, 90’s soul and 80’s hip hop. There is no doubting<strong> Darren’s</strong> skills at mixing and sampling, so it’s no surprise to learn that he’s been producing since he was 14, spending his pocket money on purposefully purchasing a computer for that very use. First two tracks <em>Mornin’ </em>and <em>Minted </em>are fantastic introductions, the hand clapped beat on the opener is distinctive and complimented beautifully by the soulful vocals.</p>\n<p><em>Dutchie Courage </em>is arguably the most adventurous moment on the record, sampling the classic 80’s track by <strong>Musical Youth</strong>, underlaying a simple yet infectious beat. Uplifting, jovial and blissful, a brilliant example of the skills <strong>Williams</strong> has at his disposal. He hasn’t completely shunned his dance roots, and some of the vocal samples especially could easily fit into a Saturday night floorfiller, however it’s the way in which <strong>Star Slinger </strong>constructs and ties the tunes together that makes the record. There is a sparkling kaleidoscopic feel to <em>Volume 1</em>, each tune takes the record in a different, erratic direction, yet it’s insanely enslaving. Family Friend includes a reggae style beat, with a tinkling piano, an exotic but triumphant sound.</p>\n<p><em>Volume 1</em> by <strong>Star Slinger </strong>goes to show that as well as having dazzling skills, it’s also of vital importance to have a wide and impressive knowledge of a variety of music styles, allowing him to collate ideas magnificently. As if the release itself wasn’t enough, you’ll also be please to know that <strong>Darren Williams</strong> has thoroughly embraced the musical download culture we live in today, by making <strong>Volume 1 </strong>available for free download from his official site. Make sure to check back in the next few days for an interview with <strong>Star Slinger.</strong></p>\n<p style=\"text-align: center;\"><a href=\"https://www.starslinger.net/home.html\">Check Out Star Slinger’s Official Site!</a></p>\n","slug":"2566-review-star-slinger-volume-1","category":"music","date":1282066369000,"wpid":2566,"isSticky":false,"featured_image":{"width":165,"height":110,"src":"2010/08/star-slinger-3-165x110.png","placeholder":"data:image/jpeg;base64, iVBORw0KGgoAAAANSUhEUgAAAAoAAAAHCAYAAAAxrNxjAAAACXBIWXMAAAsTAAALEwEAmpwYAAABF0lEQVR4nAXByUoCAQCA4cFDB0sMksiWsRoU01HGfTSzXBqzsqyLZjTZYsaAlVFSQlC0CNHJU3TuITp2C3qBrkEP8vd9glGIsh9OsOGQsfa7EEfdTIkenGMeGpkQnXWV+moS4eUyzUFRo5WLUQ27eTiK8nQyS0ULsLcSoXeeo5qPIVisEmaTyP1Oiq+PNj/fd7y/1ugeZ3nczdBcjrGg+BFCaoo+k52r0zp/v5/cdi8wjDK91hKGFuSskkQvxhGkSAKb6GZuTaPe1CktyrQPE7zdpLneVtEiCnGXF8E84mFC8iHJCoMOL9moHz2v0CgotDZjPNeiBGZ8CBablyG7zLgoMzDswznto5yP0NlSKSVD6PNBPJMy//CfgVF82boTAAAAAElFTkSuQmCC"},"createdAt":1587295039487,"updatedAt":1588443779897,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2010/08/star-slinger-3-165x110.png","categories":["music","reviews"]}