{"id":"5e9c02c2774c2610387e4a0f","artists":["5e9b68e07a1236eccfeb1f01"],"title":"The strange case of Clarence Clarity","content":"<p>Sometimes you completely miss the bandwagon on a story.</p><p></p>\n<p> </p>\n<p>“<i>Clarence Clarity’s part of the future right there, it really is, pushing the boundaries on every level, sonically and lyrically” – </i><b>Zane Lowe</b></p>\n<p><em>“alternatively terrifying, hilarious and amazing”</em> – <strong>Wonderland Magazine</strong></p>\n<p><em>“Whether or not you like shadowed newcomer Clarence Clarity’s debut track 4GODSLUV you’re most certaintly going to remember it, and him.” – </em><strong>Abeano</strong></p>\n<p><em>“There were rumours bandied about that perpetually elusive Jai Paul was in fact Clarence Clarity. Maybe it’s Burial in a slimy disguise?”</em><strong> – Line of Best Fit</strong><br />\n<em>“It’s pop music for the f*cked up, insane, odd and those of us who want music to do deranged things now and then…So who is Clarence Clarity?”</em><strong>Breaking More Waves</strong></p>\n<p>Back in July, a number of outlets were keen to unmask who exactly self-described Fijian <strong>Clarence Clarity</strong> was. Coming out with a handful of tracks made of ominous, whining sounds, the attention to his music seemed to appear for a couple of days and vanish.</p>\n<p>Guess it was shit.</p>\n<p>Except it’s not. As we’re gearing up to do our end of year list in the next few days, I decided to trawl my iTunes by date and stumbled on a his music – unplayed, and the name not ringing a bell at all. So I gave it a listen and I was quite pleased to see that an artist we’ve been covering on the site since way back in the early days of 2010 had finally put out new material. Not least because I’d been a fan of his music since his first band ■■■■ ■■■■■■<strong> </strong>broke on to the scene in 2004/05.</p>\n<p>As with his other recent music, the tracks were all dark patchworks of vocal snippets, disjointed synth lines and foley sound effects. The poly-rhythms are off kilter, the vocal hooks are rife and it comes off like tortured pop for future-goths. But despite this, or perhaps because of it, Clarence’s <em>Save Thyself EP </em>feels like the follow up that never came to his earlier act’s final 2010 EP – infact I’ll swear the sparkling intro noise on The Gospel Truth was sampled straight from it.</p>\n<p>So what was all the mystery about, and why had nobody realised it was ■■■■ ■■■■■? Sure his former band, as well as later project ■■■■■■■■■■■■■<strong>, </strong>never broke out in to the mainstream consciousness, but they both attracted a solid and fairly devoted fan base. In particular, their fan base were generally the people who you now see typing out hundreds of words daily under the titles “Introducing” and “Breaking”, something didn’t make sense.</p>\n<p>Naturally, therefore, I figured I was wrong. It wouldn’t be the first time two artists were confused due to their vocalists sharing certain mannerisms – shout out to everyone who still has a ‘System of a Down’ cover of the Legend of Zelda theme tune lying around somewhere. Which, again naturally, meant the next step was to hit Google for a bit of research – there were a fair few stories about him in July and September, surely someone realised? It’s not like he’s vanished off the face of the earth, <em>Bad Dream Hotline </em>was plastered over a lot of ‘Best albums of the year’ lists 12 months ago.<strong><br />\n</strong><strong></strong></p>\n<p>The first thing I did was to check the same place I found out about his last project back in 2010: a long dead fan forum for his first band. There was a post on there that connected them to Clarence Clarity.</p>\n<p>Second point of call was to do whois search on the website linked to from his Soundcloud. ■■■■ ■■■■■.</p>\n<p>Okay that seems quite conclusive. It’s him.</p>\n<p>[soundcloud url=”https://api.soundcloud.com/tracks/109573156″ params=”color=76499d&auto_play=false&show_artwork=true” width=”100%” height=”166″ iframe=”true” /]</p>\n<p> </p>\n<p>But you’re not idiots and have probably noticed none of the above specifically points to the artist in question. Why? As we’ve seen on a number occasions during 2013, artists and blogs have clashed over just how far is too far when “exposing” the mystery behind an artist. Sometimes it’s questions over <a href=\"https://laurasnapes.tumblr.com/post/48060203153/this-wont-be-the-last-time-but-today-felt-like\">whether the exposer went too far (hey!)</a>, whilst the exposers in turn have <a href=\"https://twitter.com/disconaivete/status/413292195731341313\">argued at times that the information they’re posting is all already in the public domain</a>.</p>\n<p>We enter a whole other minefield when the mystery has been purposefully constructed. Since the mystery behind artists like Burial and Wu Lyf has been seen to bolster the attention they received, as well as add an otherwise unattainable sense of mystique and isolation to their music, not a day goes by that a new artist doesn’t email blogs across the world positioning themselves as “anonymous”. Most of them are now ignored, or receive only a cursory glance at their background – <a href=\"https://breakingmorewaves.blogspot.co.uk/2013/09/clarence-clarity-alive-in-septic-tank.html\">just as with our friend Clarence Clarity</a> – but there’s a growing sense that this trend long ago reached capacity. In fact, the big “anonymous” artists of late (Jai Paul, Boots etc) have all been those where their anonymity was not constructed, it was not the product of a PR department spending 30 minutes brainstorming in their lounge, it was not spelled out in a carefully worded press release: it’s been down to a genuine desire to lay low and shun the spotlight.</p>\n<p>There was a recent incident on this very site – <a href=\"https://api.crackintheroad.com/music/21107-feature-finding-jai-paul/\">nope, not that one</a> – where an artist was unhappy with the mystery behind their alias being revealed. Nothing the writer of that piece did was illegal, immoral, or intrusive, but nonetheless the artist got in touch in a perturbed manner. By revealing their past, they argued, they were being prevented from having the fresh start that they were craving. They hadn’t claimed they were anonymous as part of some marketing hook, in fact they hadn’t promoted themselves at all – who was the blogger to deny them a second chance? In this particular case, the writer took the piece down, for the simple reason that the artist was right – everyone is entitled to a fresh go at things. If being an anonymous artist meant their music could receive the full commendations it deserved without being subjected to half-arsed, snide comments about the musician’s previous work (see: almost The Horrors), or lumped with expectations from former fan bases (see: Captain Murphy) then any music fan should be in support of that.</p>\n<p>Any good writer, blogger, journalist (whatever you want to call yourself) that stumbles on a potentially interesting mystery needs to first ask, is there any real benefit in the mystery being deconstructed and exposed? This is the same test any “real” journalist would use before exposing potentially personal information. If people are being asked to spend their real money on a set of questionable Bandcamp tracks that may or may not be real, it could easily be argued that there is a very real public interest in revealing that. If a guy’s name is attached to a headline grabbing album but he is trying his hardest to not reveal his personal history, there’s a story there, but you’re probably not going to be winning any moral victories any time soon.</p>\n<p>It’s half two. I’m fairly sure I haven’t re-read half of what I just wrote. But my key point is this: whilst trying to confirm who Clarence Clarity is via Google, I found that he made the following statement only earlier this month:</p>\n<blockquote><p>I’ve kept my personal details out of the picture for now, just while people are still being introduced to the music. I’d like the listener to paint their own picture of who they think Clarence Clarity is first. I’ll introduce bits of myself as we go. The music should have its own story, starting now.</p></blockquote>\n<p>I can’t think of any real benefit that can come from revealing who he is. I’ll therefore leave you with the knowing description that accompanied his video for <em>Alive in the Septic Tank </em>when it was first premiered on Noisey.</p>\n<blockquote><p><em></em>The keen eared audio entrepreneurs, those who inject themselves with forward-thinking music like jetsetting Mother’s digest Elle, should be able to distinguish the guy behind these vocals instantaneously.</p></blockquote>\n<p>[soundcloud url=”https://api.soundcloud.com/tracks/99214929″ params=”color=76499d&auto_play=false&show_artwork=true” width=”100%” height=”166″ iframe=”true” /]</p>\n","slug":"25678-strange-case-clarence-clarity","category":"editorials","date":1388196062000,"wpid":25678,"isSticky":false,"featured_image":{"width":1257,"height":800,"src":"2013/12/maxresdefault1-e1388199571964-1257x800.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAGAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAUH/8QAIxAAAQMDAgcAAAAAAAAAAAAAAQIDBAAFBwYREyIkMTJCYf/EABQBAQAAAAAAAAAAAAAAAAAAAAX/xAAZEQEBAQADAAAAAAAAAAAAAAABAgARYcH/2gAMAwEAAhEDEQA/AImL4NtuGKdYTpMBp56FzNFwkgLCCQrbtuASPtZ4zcWeEjp0eI9RSlCgNUd+ZEkq653/2Q=="},"createdAt":1587282626383,"updatedAt":1588403522888,"author":"5e9b68b27a1236eccfeb1d0b","old_image":"2013/12/maxresdefault1-e1388199571964-1257x800.jpg","categories":["editorials","introducing","music"]}