{"id":"5e9c333d9b6559241525e01f","title":"Review: Beat Connection: Surf Noir EP","content":"<p><img class=\"alignnone\" title=\"beat connection\" src=\"https://c1.</p><p>ac-images.myspacecdn.com/images02/74/l_faa4fc0243c04b0da449704e8d98d740.jpg\" alt=\"\" width=\"600\" height=\"612\" />One of the most exciting acts to come out of Seattle in recent years, <strong>Beat Connection</strong> are comprised of the mystical musical minds o<strong>f Jordan Koplowitz</strong> and <strong>Reed Juenger</strong>. There is no shortage of artists trying to break through in the electronic dream pop genre, however there are few who have can maintain a level of quality control to sustain any form of momentum. With the increased use of synthesisers and electronic equipment, it is becoming easier every day for artists to produce listenable tunes, so it’s even more admirable when a group are be able to produce music that is engrossing and entertaining.</p>\n<p><strong>Beat Connection</strong> released<em> Surf Noir </em>in early July via bandcamp, the latest in a long line of unsigned artists to make their music accessible for all via the site. From the first track there are the obvious <strong>Kraftwerk </strong>influences, although it sounds far from forced, each song offers something completely distinctive and imaginative. <em>In The Water </em>is a mystical, vocal heavy tune, partially carried by the prominent beat and familiar handclaps. Elsewhere, there are steel drums, maracas and pan pipes, showing the duo’s knowledge of a vast range of instrumental values, as well as their compositional skills.</p>\n<p>Personal favourite<strong> </strong><em>Silver Screen</em><strong> </strong>is one of my tracks of the year so far, emanating an ethereal quality, showcasing<strong> Koplowitz</strong> and <strong>Juenger</strong> at their spellbinding best. <em>Same Damn Time</em> closes the EP in epic style, simplistic yet charismatic, another standout track on the release. The rhythms are muscular, the melodies are enchanting and most of all, the way in which they are sewn so perfectly together makes<em> Surf Noir</em> an encouraging and clairvoyant listen from a duo who are sure to be on their way to bigger and better things.</p>\n<p style=\"text-align: center;\">Check back over the next few days for an interview with Beat Connection.</p>\n<p style=\"text-align: center;\"><a href=\"https://www.myspace.com/beatconnexion\">Check Out Beat Connection’s Myspace!</a></p>\n","slug":"2568-review-beat-connection-surf-noir-ep","category":"music","date":1282215126000,"wpid":2568,"isSticky":false,"featured_image":null,"createdAt":1587295037906,"updatedAt":1587825934397,"author":"5e9b68b27a1236eccfeb1d27","categories":["music","reviews"]}