{"id":"5e9c02c1774c2610387e4a0e","title":"Three words upon my headstone: Albums of 2013","content":"<p>True to character, we’re a bit apprehensive about lists at CITR.</p><p> Call it being unnecessarily obtuse, call it reactionary, either way we usually end up pulling something together regardless. Below you’ll find the lists of albums of the year for a selection of writers and contributors – have you skipped there yet? I really doubt you’re reading this first. Some people wrote short lists, others included explanations of their choices, some numbered them, whilst others left them unnumbered, and a few others exempted themselves entirely from the roster below.</p>\n<p>But we feel we’re right to be apprehensive. Every December, anyone who remotely visits or follows any publication or service even tangentially related to music is bombarded by a glut of lists. Albums of the year, songs of the year, videos of the year, food ingested by a band of the year (<a href=\"https://drownedinsound.com/in_depth/4147225-tourmet-delights--the-best-things-musicians-ate-on-the-road-in-2013\">no that really happened</a>), and now the lists have spilled over in to next year, with every fucking man and his chihuahua offering up their own bit of crystal ball gazing in Sound of next year lists. It’s all too much, of very little real merit in 2013 and smacks of a lot of back slapping, traffic harvesting and a race-to-the-bottom of obscurity – and that’s before even taking in to account how the usual attempts of elitist types to appear as contrarian and “in-the-know” as possible undermine the entire exercise.</p>\n<p>This year saw a whole new area of competition opened up, as music blogs finally caught on to the fact that the major news sources around the world are using special designs for their big stories, and long form pieces. Kudos to those who took the time to turn their lists in to an experience, however the reality is few did this in a way that enhanced the user’s reading experience. As with the news outlets that inspired them, too often they fell back on bloated Javascript based animations, poorly optimised and mobile melting images and a laptop crushing number of Soundcloud embeds on a single page, with the end impact being that a huge percentage of their audience were unable to comfortably read their articles at a decent speed. Geocities, Myspace, the early days of the jQuery library – history doesn’t half repeat itself.</p>\n<p>As a result, what is essentially a relic of the days of magazines – when an easy to index and compile list of the most popular, or most obscure, or critically acclaimed music from a year wasn’t possible to automate with some micro-formatting – is starting to look tired. It’ll always get hits and that’s the reason the biggest (if not boldest) places are unlikely to break the mould any time soon, in the same way that the NME site continues to be one of [if not <strong>the</strong>] the UK’s biggest music news sources <a href=\"https://www.nme.com/news/kanye-west/74627\">with PR puff pieces on celebrity neighbours</a>. But the current format is not optimal for whatever purpose people use them for – discovering hidden relics, as a reference for the music that most characterised popular culture during the year, or what album was the most enjoyed en masse in a 12 month period. Rather, it benefits one group and one group alone: the bloggers and/or their advertisers.</p>\n<p>So here’s our list. It might be our last, it might not. Who knows. But either way, something needs to change in 2014 – might you be the one with the solution to this never ending arms race?</p>\n<p> </p>\n<h2><span style=\"text-decoration: underline;\">Lists</span></h2>\n<h3>Andrew</h3>\n<ol>\n<li>Blue Hawaii – Untogether</li>\n<li>Jon Hopkins – Immunity</li>\n<li>Baths – Obsidian</li>\n<li>My Bloody Valentine – mbv</li>\n<li>Los Campesinos – NO BLUES</li>\n<li>These New Puritans – Field of Reeds</li>\n<li>Wavves – Afraid of Heights</li>\n<li>Fat White Family – Champagne Holocaust</li>\n<li>Young Galaxy – Ultramarine</li>\n<li>Foxygen – We Are the 21st Century Ambassadors of Peace & Music</li>\n</ol>\n<h3>Joel</h3>\n<ul>\n<li>Jai Paul – Jai Paul</li>\n<li>Majical Cloudz – Impersonator</li>\n<li>Jon Hopkins – Immunity</li>\n<li>DJ Koze – Amygdala</li>\n<li>Ka – The Night’s Gambit</li>\n<li>Vampire Weekend – Modern Vampires of the City</li>\n<li>Chance the Rapper – Acid Rap</li>\n<li>Baths – Obsidian</li>\n<li>Forest Swords – Engravings</li>\n<li>Kanye West – Yeezus</li>\n</ul>\n<h3>Joey</h3>\n<ol>\n<li>Modern Baseball – Sports</li>\n<li>Beyoncé – Beyoncé</li>\n<li>Inspectah Deck with 7L & Esoteric – Czarface</li>\n<li>Keaton Henson – Birthdays</li>\n<li>Oneohtrix Point Never – R Plus Seven</li>\n<li>Jonwayne – Rap Album One</li>\n<li>Kavinsky – Outrun</li>\n<li>Denzel Curry – Nostalgic 64</li>\n<li>Vampire Weekend – Modern Vampires of the City</li>\n<li>Elvis Depressedly – Holo Pleasures</li>\n</ol>\n<h3>Phillip</h3>\n<ul>\n<li>Dean Blunt – the redeemer</li>\n<li>Dirty Beaches – Drifters/Love Is The Devil</li>\n<li>Factory Floor – Factory Floor</li>\n<li>Forest Swords – Engravings</li>\n<li>Foxygen – We Are the 21st Century Ambassadors of Peace & Music</li>\n<li>Larry Gus – Years Not Living</li>\n<li>The Haxan Cloak – Excavations</li>\n<li>KU – Feathers</li>\n<li>Laurel Halo – Chance Of Rain</li>\n<li>Darkside – Psychic</li>\n</ul>\n<h2><span style=\"text-decoration: underline;\">Lists with explanations</span></h2>\n<h3></h3>\n<h3>Ian</h3>\n<p>Every year I think doing one of these lists is the best idea in the world, but when the time comes for me to actually choose anything I can’t. Its like when someone asks you, “What kind of music do you listen to?” My response is usually “ALL,” but that answer is usually a conversation killer. Also most of the artists I listen to don’t even have full albums out because they aren’t even signed. Alas this is actually a list of 13 albums/mixtapes/EPs that I think have defined 2013. By that I mean defined 2013 for myself, as some of those posted below might not ever cross your radar. (But should)</p>\n<ul>\n<li><strong>BANKS – London EP</strong><br />\nBANKS has been one of my most exciting finds of 2013. Her spin on R&B is not only impressive, but also the beginning of a new direction for the genre that will expand in 2014. It also doesn’t hurt that she’s beautiful because in the words of Warhol–“I’m a deeply superficial person.”</li>\n<li><strong>Nomi Ruiz – Borough Gypsy Mixtape</strong><br />\nThis mixtape from Jessica 6 front woman, Nomi Ruiz, somehow managed to completely slide under the radar in 2013. The seductive songstress takes on real issues facing people growing up in the streets with unquestionable authenticity. Here’s hoping this is not the last we hear of Nomi.</li>\n<li><strong>Active Child – Rapor EP</strong><br />\nThere’s no hiding the fact that I am an Active Child super fan. I’ve always felt his music manages to define whatever period of life I’m in and that did not end with the release of Rapor. Sonically, Rapor was one of the most impressive releases of the year. Pat Grossi is hands down the most underrated artist of 2013.</li>\n<li><strong>Alex Cameron – Jumping The Shark</strong><br />\nAlex Cameron is another artist that’s flown under the radar this year despite the release of a provocative and perfectly executed album. His obscurities make him something of an enigma to me.</li>\n<li><strong>CHARLI XCX – True Romance</strong><br />\nChances are you’ve heard of Charli XCX so all I’m going to say is this album was my summer.</li>\n<li><strong>CHVRCHES – The Bones of What You Believe</strong><br />\nWhen the hype of CHVRCHES was building there was a time that I thought they’d fall incredibly flat, but the release of The Bones of What You Believe proved me utterly wrong. There is not a single filler on the entire album.</li>\n<li><strong>CREEP – Echoes</strong><br />\nThere are only a few tracks on Echoes that weren’t previously released prior to 2013, but to ignore the album for this list would be foolish. CREEP’s appropriation of hiphop elements into underground electronic music makes them more innovative than Kanye (which actually is not that difficult). Throw Sia in the mix and CREEP is giving a fat finger to genre boundaries.</li>\n<li><strong>Lorde – The Love Club EP</strong><br />\nWhile Lorde’s emergence was actually in the late part of 2012 her influence didn’t reach its potential until 2013.</li>\n<li><strong>The Knife – Shaking The Habitual</strong><br />\nAfter 6 long years of nothing from these superstar siblings, Shaking The Habitual was well worth the wait and while I don’t believe its at the same caliber as Like A Pen it is still leagues ahead of everyone. I will also admit that they could’ve released an album of nothing and I’d still be obsessed.</li>\n</ul>\n<h3></h3>\n<h3>Sam</h3>\n<p>Excuse the brevity, I’ve been building this list in my mind for a while, but, following an evening of overindulgence and an impending deadline, I’m writing in haste. 2013 was a slow burner with some diverse and beautiful monsters crawling out of the woodwork in the latter part of the year.</p>\n<p>It Starts in May with <strong>Obsidian</strong> by American electro artist and falsetto king, Will Wiesenfeld, better known under his stage name <strong>Baths</strong>. Tender vocals and understated lyrics ride high on layer after layer of clicks, glitches and piano.</p>\n<p><strong>June</strong> was overwhelming. There was <strong>Tape Two </strong>by Scottish hipster-hop-pop (see what I mean about brevity?) crowd pleasers <strong>Young Fathers</strong>, who really do put on a good live show. Tape Two turns the mundane into something tribal, industrial and noisy.</p>\n<p>Then there’s the obligatory shout out to <strong>YEEZUS</strong> who apparently just rose again. Yeah what can I say? It’s a masterpiece. A distressing, angry and hilarious masterpiece mocking the very industry that created it. With Rick Rubin’s magic touch and <a href=\"https://www.stereogum.com/1385792/yeezus-credits-revealed/news/\">a list of credits almost as big as Kanye’s ego</a>, it’s hardly suprising.</p>\n<p>Unfortunately for Arizona based .CULT, Yeezus leaked the same time their debut album <strong>The Three Beggars</strong> dropped and that, coupled with the admittedly terrible cover art, was why it was largely overlooked. With some wickedly clever lyrics, interesting use of samples and a general atmosphere to it, The Three Beggars was a promising start for these foul-mouthed southerners who just premiered a track from their 2014 album over at <a href=\"https://noisey.vice.com/blog/premiere-cult-paragon-music-video\">NOISEY</a>.</p>\n<p>June finished off with something as far from .CULT as you can get. <strong>Habits</strong> by <strong>Flying Ibex </strong>needs an honourable mention as initial reviews were quite dismissive. Coming from a group who started out improvising to silent films in a South London commune, Habits is technically brilliant, and more surprisingly, pretty damn good. The album makes great use of subtle layers of sound and has solid vocal harmonies throughout.</p>\n<p>August saw the arrival of the haunting and theatrical, <strong>Shadow of Heaven</strong> by Manchester based <strong>MONEY</strong>. I admire this album for its use of space and silence with vocalist Jamie Lee giving the whole thing an ethereal quality. The influence of Manchester shines throughout with echoes of Joy Division creating images of gritty streets and grey northern skies.</p>\n<p>After the purity of MONEY I was back off the bandwagon with <strong>Doris</strong> by <strong>Earl Sweatshirt</strong>. This album undoubtedly made every suburban gangster’s list this year (shout out to C.R.B.) so I won’t elaborate too much. With a lot of amazing wordplay especially for such a young gun, Earl’s own lyrics summarise Doris: <em>“Misadventures of a shit-talker/Pissed as Rick Ross’s fifth sip off his sixth lager”.</em></p>\n<p>As September seeped in, I sought solace in Someone Still Loves You Boris Yeltsin. <strong>Fly By Wire</strong> is the band’s first real album since 2010, and my favourite since their debut Broom. Fly By Wire is what I’d call SSLYBY’s ‘grown-up album’, the production fits like a familiar suit and the composition makes me want to murder the whole band and absorb their talent (that works right?)</p>\n<p>Thus began the winter of discontent where other issues occupied my mind other than thinking up a list no one is probably going to read. I emerged from the fog of war momentarily in December for <strong>Precession</strong> by <strong>Alden Penner</strong> which, despite being an EP, is more than worthy of a mention. It’s artistic, honest and pure. <a href=\"https://api.crackintheroad.com/music/25595-stream-alden-penner-precession-ep/\">Listen for yourself </a>as words can’t do it justice.</p>\n<p>Here’s to 2014 for more amazing music and less overwhelming melancholy. Keep sweet.</p>\n<h3></h3>\n<h3>Joshua</h3>\n<ol>\n<li><strong>Foals – Holy Fire</strong><br />\nIt seems odd that it should be Foals that made this album. When I first heard Hummer in 2007 I never thought we’d reach this point, where Foals stand on the brink of superstardom. I think the track that really made them contenders for festival/arena headliners has to be Inhaler. It really made everyone sit up and take notice. I also respect a band that has managed to cultivate an audience over a number of years and seize their chance to sit at the top table of guitar rock when it comes.</li>\n<li><strong>Savages – Silence Yourself</strong><br />\nIt’s rare that a band comes along so fully formed and ready with a manifesto such as Savages. Music writers often discuss how there are so few bands for people to believe in nowadays. If that’s the case then they should look no further.</li>\n<li><strong>MONEY – The Shadow Of Heaven</strong><br />\nThis album has been so long coming that by the time it finally arrived I wasn’t sure what to expect. Thankfully I wasn’t disappointed. Mancunions have known for the last two years how special MONEY are. This was an album of pseudo religious lyrics, hopes, dreams and eulogies to forgotten parts of the rainy city. A unique blend of Nick Cave, Sigur Ros and The National created something truly beautiful.</li>\n<li><strong>King Krule – 6 Feet Beneath The Moon</strong><br />\nAn odd record in many ways but what Archie has managed to do is combine street poetry with a fusion of RnB, Jazz and crooned/rapped lyrics to create a style completely of his own. The most original album I’ve heard this year.</li>\n<li><strong>Parquet Courts – Light Up Gold</strong><br />\nI spent half the year hating this album. Musically it is very derivative but then once you start listening to the words then it becomes something different entirely. It’s so rare today to hear an indie guitar band with genuinely interesting/funny lyrics. The music (guitars in particular) become more addictive with every listen.</li>\n<li><strong>Hookworms – Mystic Pearl</strong><br />\nThe best of the psychedelic bands that have broken through this year, unlike Toy/Charlie Boyer etc Hookworms are also a thrilling live prospect and that feeds into the record. It’s always nice to see a band with a genuine DIY ethos come to the fore.</li>\n<li><strong>James Blake – Overgrown</strong><br />\nDespite the hype, this album was still his most cohesive work to date. He showed genuine progression with tracks such as Life Round Here and Voyeur. Retrograde is also one of my singles of the year.</li>\n<li><strong>Drenge – Drenge</strong><br />\nThere’s been so many two pieces over the last few years and these are the best since The White Stripes in my opinion. They’ve managed to produce heaviness without using the dreaded pog pedal.</li>\n<li><strong>The 1975 – The 1975</strong><br />\nI was surprised that I enjoyed this at all. But strangely this album was somewhat of a triumph. A bizarre mix of indie landfill, RnB, Hip Hop and 80’s pop. Sort of sounds like the music ITV used play when Mr Motivator was doing his workouts but in the best possible way.</li>\n<li><strong>Iceage – You’re Nothing</strong><br />\nPost punk played at its most visceral with maximum energy.</li>\n</ol>\n<h3></h3>\n<h3>Callum</h3>\n<ol>\n<li><strong>Waxahatchee – Cerulean Salt</strong><br />\nWhen I first heard Cerulean Salt it left me reasonably nonplussed, but on each repeat listen I found something more. The melodies worm their way into your head, Katie Crutchfield’s voice growing to walk a flawless line between vulnerability and power and her lyrics are incisive, all sharp barbs with melancholic tinges. An astonishingly touching album.</li>\n<li><strong>Braids – Flourish // Perish</strong><br />\nBraids are one of those groups that I hope are together for a long time. Their first album, Native Speaker, was one of my favourite debuts in 2011 and Flourish // Perish takes the strongest elements from that and twists them into something innovative. The songs are intricate and delicate, looping round one another with propulsive percussion, alongside undulating and imaginative vocal lines.</li>\n<li><strong>THEESatisfaction – THEESatisfaction Loves Erykah Badu</strong><br />\nThere aren’t many groups out there who could get away with releasing an album of Erykah Badu samples, but my god, THEESatisfaction pull it off. THEESatisfaction Loves Erykah Badu is an EP as opposed to a proper album and not every track has vocals, but the whole thing is slick, rammed full of ideas and, honestly, cool as fuck.</li>\n<li><strong>Earl Sweatshirt – Doris</strong><br />\nThe fact that Earl didn’t make the album he’s capable of, but it ranks at number 4 in my list should tell you everything you need to know about Doris. There aren’t many rappers out there who have the lyrical virtuosity of Earl and when he ties a cohesive narrative to his words, he’s close to untouchable. Combine with his burgeoning talents as a producer and Doris made for one of the most engaging listens of 2013.</li>\n<li><strong>Wavves – Afraid Of Heights</strong><br />\nSometimes, albums don’t have to be revolutionary. Afraid Of Heights does nothing that countless bands haven’t done before, but what it does, it does flawlessly. There’s not a weak track on the album, everything is taut, energetic and has enough hooks to empty the pacific.</li>\n<li><strong>Little Pain – When Thugz Cry</strong><br />\nYou could be forgiven for thinking that Little Pain’s approach to rap is a gimmick, but repeated listens disprove this entirely. As far as genres go, rap is often disconnected from emotion, in most cases for good reason, but Little Pain reacts against this trend. When Thugz Cry is strong throughout, with the rapper forming an impressive relationship with the producer Suicideyear. Their collaboration provides some of the mix tape’s stand-out moments.</li>\n<li><strong>Phosphorescent – Muchacho</strong><br />\nBreak-up albums don’t get much better than this. Matthew Houck imbues each of the album’s ten tracks with tenderness, each song swirling with hooks, his voice constantly breaking with emotion. Muchacho is far from a dirge, although a sadness runs through it, the arrangements, rich and gorgeous, give it an inspiring edge.</li>\n<li><strong>Yung Lean – Unknown Death 2002</strong><br />\nYou would expect a rap album from Sweden to sound, well, Swedish, but Yung Lean makes music more reminiscent of the American South. The beats are woozy and futuristic, the lyrics delivered in an understated drawl, everything coming together to make something unique, downbeat, but, somehow, strangely fun.</li>\n<li><strong>Cakes Da Killa – The Eulogy</strong><br />\n2013 has been a bumper year for hip hop. Cakes Da Killa is one of a number of artists I could’ve included on this list, but, for me, The Eulogy stands out. HIs delivery is razor sharp and filed with wit, while the beats are always inventive and inherently danceable.</li>\n<li><strong>John Wizards – John Wizards</strong><br />\nThere isn’t much out there that reminds me of John Wizards. Sure, you might be able to pick out odd influences in the occasional sound or snippet, but this is exploratory music, John Wizards unable to stay in one place for too long, ebbing and flowing through genres and, in the process, making something vital and unorthodox.</li>\n</ol>\n<h3>Chris</h3>\n<ul>\n<li><strong>Arcade Fire – Reflektor</strong><br />\nHype is a terrible thing. It can break a band as easy as it’ll make one, it completely dominates everything from casual conversation to social media for as long as it lasts, and it inexplicably keeps the Mercury Prize going. And yet, Reflektor managed to come damned close to living up to it – no small feat for an album which stuck Bowie on their lead single. Reflektor’s glam-rock, disco, carnival brilliance is no Funeral, but nothing really is – and it speaks volumes that it’s the album that propelled them from stardom to Glastonbury-headlining, hype-riding, Bowie-esque superstardom.</li>\n<li><strong>Los Campesinos! – No Blues</strong><br />\nOn the subject of hype, this is an album which should have had more. As much as you might have heard about No Blues, it’s more than likely it was a die-hard Los Campesinos! fan who was talking about it. A criminally underrated LC! LP isn’t exactly a new phenomenon, but that doesn’t make it any less criminal. Album highlights ‘As Lucerne/The Low’, ‘What Death Leaves Behind’ and ‘Avocado Baby’ rank among some of their best ever tracks, and it’s an album which translates to live performance even more impressively than their previous records.</li>\n<li><strong>Youth Lagoon – Wondrous Bughouse</strong><br />\nYouth Lagoon, it seems, is a bit of a favourite with CitR – and why not? In terms of sheer atmosphere, Trevor Powers’ second album is probably one of the best on this list. It’s deliciously mad and summery, and absolutely represents Powers hitting his stride. Essentially, it’s what AnCo should have become.</li>\n<li><strong>Of Montreal – Lousy with Sylvianbriar</strong><br />\nWhat a year for Elephant 6. Putting aside that other band’s comeback and touring (you know the one), Of Montreal made this. They’ve never been afraid to traverse the landscape of musical history in terms of inspiration, but Lousy with Sylvianbriar is a more-than-welcome return to some simple, no-frills guitar-led garage psych rock. It’s more than a little bit Grateful Dead, more than a little bit beautiful, and more than a little bit goddamn brilliant.</li>\n<li><strong>Sigur Ros – Kveikur</strong><br />\nThe promise of a darker, heavier album might have fallen apart a bit after every track apart from (the admittedly sublime) ‘Brennistein’ turned out to be pretty much classic Sigur Ros, but there’s not really much wrong with classic Sigur Ros, is there? Transcendentally beautiful at its high points and downright frightening in its heavier moments, Kveikur is both evidence that the band can turn in an exciting new direction, and evidence that they also don’t necessarily need to.</li>\n<li><strong>The Flaming Lips – The Terror</strong><br />\nSpeaking of bands going in new directions: holy shit. Remember when these guys were fun, nonsense-loving crazies? The Terror is terrifying. It’s dark, brutal and emotionally gut-wrenching. No easy listening, for sure, but it’s an experience like nothing else this year, and that’s saying nothing for what the wall-of-sound, epilepsy-inducing, shellshock live renditions of the album’s songs have been like.</li>\n<li><strong>Villagers – {Awayland}</strong><br />\nShould have won the Mercury Prize. Let’s just move on before somebody mentions James Blake.</li>\n<li><strong>CHVRCHES – The Bones of What You Believe</strong><br />\nAh, more hype. It’s been a pretty impressive year for CHVRCHES. Outside of all that Guardian stuff, the band have done more than a little well for themselves with The Bones of What You Believe. It’s nothing spectacularly new or innovative, sure, but they do what they do – catchy, harmless enough synth-pop fun – to near perfection.</li>\n<li><strong>The National – Trouble Will Find Me</strong><br />\nArguably, the National had a lot to live up to after High Violet, one of 2010’s best. I’m still unsure whether they succeeded. Trouble Will Find Me has the occasional lull which stops the album reaching its full potential, but its better moments – the final minutes of ‘I Should Live in Salt’, or the fantastic ‘Pink Rabbits’ and ‘Humiliation’ – are displays of genuinely gorgeous song-writing.</li>\n<li><strong>My Bloody Valentine – m b v</strong><br />\nChrist, we waited long enough for this, didn’t we? Loveless’ follow-up managed to somehow come out of absolutely nowhere, despite being over 20 years in the making. It definitely did not disappoint. Exciting without relying on hype and refreshing without being outwardly different, m b v is pretty much the perfect example of how to do a comeback.</li>\n</ul>\n<h3>Rob</h3>\n<ul>\n<li><strong>Crash of Rhinos – Knots</strong><br />\nI care little for composition, form, relevance. Music is next to useless unless it makes us feel. And the moment that Crash kick into Luck Has A Name, I feel ten goddamn feet tall for 53 minutes.</li>\n</ul>\n<ul>\n<li><strong>Diarrhea Planet – I’m Rich Beyond Your Wildest Dreams</strong><br />\nFun fun fun fun fun. The only band I heard this year who sounded like Fugazi, Cheap Trick, Springsteen and Weezer all at once.<br />\nAlso, they have four guitarists. Four guitarists. There’s loads of solos. None of them sound like J. Mascis, but all of them sound good.<br />\n(File under: Fun.)</li>\n</ul>\n<ul>\n<li><strong>Waxahatchee – Cerulean Salt</strong><br />\nHere are some lyrics from Cerulean Salt –<br />\n“I left like I got my way, but truly I left with nothing at all.”<br />\n“We are only 30% dead, and our parents go to sleep early. We destroy all of our esteem and the sunlight starts to shine through the trees.”<br />\n“I had a dream last night, we had hit separate bottoms. You yell right in my face, and I poison myself numb.”<br />\n“We will find a way to be lonely any chance we get, and I’ll keep having dreams about loveless marriage and regret.”<br />\nC’mon.</li>\n</ul>\n<ul>\n<li><strong>Ka – The Night’s Gambit</strong><br />\nThe inexorable ticking of the second hand, in the days just before time runs out.</li>\n</ul>\n<ul>\n<li><strong>Flatbush Zombies – BetterOffDEAD</strong><br />\nBy turns hilarious and terrifying. My Grandpa never made crack, he fought in World War Two and lived in a thatched cottage in the English countryside until he died. Hasn’t stopped me becoming wholly addicted to BetterOffDEAD. Not one bit. Aside from the Zombies’ idiosyncratic flow, by turns grizzled and bratty, Erick Arc Elliott’s production on this is a retina-scarring collision of past and present.</li>\n</ul>\n<ul>\n<li><strong>Speedy Ortiz – Major Arcana</strong><br />\nI like Elliott Smith. I like noisy weird guitar bands. I like sad/funny lyrics. I like Speedy Ortiz.</li>\n</ul>\n<ul>\n<li><strong>The Wonder Years – The Greatest Generation</strong><br />\nPop-punk. Not, like, Cloud Nothings, but not Blink-182 either. Distortion polished to glittering, choruses the size of that massive donut that Lard Lad holds up.</li>\n</ul>\n<ul>\n<li><strong>Defeater – Letters Home</strong><br />\nHate. Bile. Anger. Desperate yelling. Something about a multiple-record story arc concerning a working-class family in post-WW2 New Jersey.</li>\n</ul>\n<ul>\n<li><strong>Toro Y Moi – Anything In Return</strong><br />\nBecause I got high.</li>\n</ul>\n<ul>\n<li><strong>Kevin Devine – Bubblegum</strong><br />\nJust about has the edge on Devine’s Bulldozer, which was released at the same time. Lots of snarling lefty buzzsaw pop-rock about all that bad stuff going on out there.</li>\n</ul>\n","slug":"25712-three-words-upon-headstone-albums-2013","category":"editorials","date":1388327550000,"wpid":25712,"isSticky":false,"featured_image":null,"createdAt":1587282625227,"updatedAt":1588441760550,"author":"5e9b68b27a1236eccfeb1d0b","old_image":"2013/12/aptopix+russia+meteorite-950x633.jpg","categories":["editorials"]}