{"id":"5e9c02b3774c2610387e49ef","artists":["5e9b69317a1236eccfeb2408"],"title":"Review: Pandreas – Rås","content":"<p> </p>\n<p>December’s ‘<em>Rås</em>’ EP goes some way to pull us out of the winter mire, pulsing throughout with the uplifting rhythms and echoes of a summer faraway and seemingly out of reach.</p><p> Norway’s up-and-coming talent gives the lie to the idea that the country’s cultural produce strictly reflects its sparse and gloomy topography, not to mention a troubled recent history. For a nation that has become repeatedly current in recent years for its suitably macabre – and often very high-quality – pop culture output, which has repeatedly captured the imagination of a wide audience, this producer’s changing of the record might initially come as something of a surprise, if not a refreshing relief from all that death and existential baggage. Less in the line of Ibsen and a lot more along that of soul-based 90s house, Andreas Kleven Rasmussen – or <strong>Pandreas</strong> – has given us something absorbing and addictive with this euphoric end-of-year offering.</p>\n<p>The opener, like the EP as a whole, is keyed and pitched at a lovely balance between outward artificial rapture and a personal, more inner-oriented sound. The titular first track doesn’t waste much time in stamping its imprint on the record, giving us a fairly clear indication of where it intends to lead us, with its more or less instant surge of pulsating synth and chant-like sample. Following this is an underpinning of fuzzy bass and a pounding four-on-the-floor that gives ‘Rås’ a purposeful energy and drive, before it strips itself back to something distilled and purer around the two-and-a-half minute mark. A skillful layering of high-pitch, manipulated vocal sampling continues the upward trajectory, and then withdraws for the track to round off neatly.</p>\n<p><iframe src=\"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/playlists/12668100&color=ff6600&auto_play=false&show_artwork=true\" height=\"450\" width=\"100%\" frameborder=\"no\" scrolling=\"no\"></iframe></p>\n<p>The distinctive steel drum and heady synth of the EP’s second track, ‘Vàr’, ensures a continuation of what ‘Rås’ starts. Its well-textured and feel-good refrain comes in early and propels the EP on into the ecstatic, but still curious, landscape it ends up occupying. The injection of bass circa three minutes in is well-timed and keeps track momentum going where others might start to flag, giving an example of ‘Vàr’s’ clearly considered build-up and often successful execution. And despite the way the track suggests a folding in on itself towards the end, it at no point seems to look back.</p>\n<p>Where the EP really effects any sort of self-assessment it might hint at towards the end of track two is during its brilliant third and final part – a kind of aftermath close to what feels like a much longer record. ‘Goest’ takes on a developed depth in the tension it establishes between the EP’s closing part and what has gone before it, investing ‘Rås’ with a heightened sense of transience and nostalgia. A trance-like use of opening synth sounds out at the beginning of the track and works to slow the pace right down. Inaudible, blurring background conversation, which morphs into the sort of oppressive speaker-phone announcements used in airports and train stations, initially creates a slightly unsettling backdrop of white noise. There’s also something about ‘Goest’ which seems to have echoes of ‘Casyam_59#02’, the final track from Gold Panda’s ‘Trust’ EP, running through it. And this, of course, brings us back to the very start of the year that was.</p>\n<p>‘Rås’ lives forwards and is understood backwards, and maybe this helps to account for why the EP, which doesn’t seem like it will have much staying power when you first listen to it, becomes very repeatable with each play through. ‘Goest’s’ closing strings and its layers of trance-inspired synth both come together at its end to package the record’s overall effect, which is a pleasing, but also peculiar and, at times, mesmerising one.</p>\n","slug":"25734-introducing-pandreas-ras","category":"introducing","date":1389018203000,"wpid":25734,"isSticky":false,"featured_image":null,"createdAt":1587282611435,"updatedAt":1588441760521,"author":"5e9b68b27a1236eccfeb1d4a","old_image":"generated/ab67616d0000b2734405058f61813a41c79dc925.jpg","categories":["introducing","music","reviews"]}