{"id":"5e9c33369b6559241525e013","title":"What Next?","content":"<p><a rel=\"attachment wp-att-2620\" href=\"https://admin.</p><p>crackintheroad.com/life/2575-what-next/attachment/exams-2\"><img class=\"aligncenter size-full wp-image-2620\" title=\"exams\" src=\"https://api.crackintheroad.com/uploads/2010/08/exams1.jpg\" alt=\"\" width=\"700\" height=\"460\" srcset=\"https://api.crackintheroad.com/images/2010/08/exams1.jpg 700w, https://api.crackintheroad.com/images/2010/08/exams1-260x170.jpg 260w, https://api.crackintheroad.com/images/2010/08/exams1-640x420.jpg 640w, https://api.crackintheroad.com/images/2010/08/exams1-165x108.jpg 165w\" sizes=\"(max-width: 700px) 100vw, 700px\" /></a></p>\n<p>What’s next? Many of us at this moment will be receiving the emails entitled with this question, and the answers will invariably begin with “erm…?” because really, who knows? For those of you who got into the university of choice (me included) congratulations! But even for us lucky ones, the question still applies. None of us know what is next, and quite frankly, UCAS, its rather rude to keep asking. We know vaguely where we are headed, if we didn’t get in, to get a job, if we did, to Uni, but what does that entail? Every university is different, and those going will be packing what seem to be their infinitesimal lives into mum and dad’s cars, driving to a city where you know nobody, and waving bye-bye to security. Exciting? Yes. Terrifying? Definitely</p>\n<p>The first thing most 18 year olds did on receiving results last Thursday, was to go out on the most disgusting night of the year that isn’t a holiday, and either drown their sorrows or celebrate, generally culminating in vomit, sweat, blood and or tears with a comfort kebab and ruined clothing, or in my case exactly 17 bruises, a stolen pint glass, and an earful of moralising from a very interfering taxi driver. Waking up however, the haze ascending, we peer bleary eyed through last night’s calamity with naivety into the future. With the colossal task of organising accommodation, finance, supplies or jobs, re-sitting exams, and rent/travel. And although all of this is exciting and progressive, stepping into your future and making decisions – it does beg the question, is it all worth it?</p>\n<p>I ask you to think back, to when at the beginning of first year at the vulnerable age of 16, they begin to harass you about university choices, the course you want to study. The establishment asking for forms of confirmation so that they can self righteously publish how many students that <strong>they</strong> sent to get degrees, how clever of them. Then the following year the dreaded UCAS demands that you turn the empty word document into a personal statement that treads the fine line between arrogance and being self obsessed, and fill in the 5 spaces you pin your hopes on for future. Not to mention exams and the knowledge that in reality, nothing is certain or prepared. I know that I started having doubts at this point, wondering if I should even bother or just wait till next year. Here you are barely sustaining the pressure of not only your college, your family, and your friends, but also the credit crunch obliterating the job market, and University places getting harder and harder to come by. Not only this but the success of David Cameron making it known that if you wait a year it’s unlikely that anyone below the upper middle class will be able to afford education, means that everyone is pointing the finger expectantly at you to rise above the prejudiced scrutiny of the world.</p>\n<p>Is all this pressure on students necessary? Don’t you remember the days when passing ‘O-Levels’ was an achievement? Let alone going to university, or getting the newly created A* to make even those with As feel like they could have done just a bit better? Never mind the likes of Richard and Judy,( whose qualifications amounted to them being paid to be ‘lovely’) claiming that exams are easy, and students aren’t as smart as they were. How about students just began trying harder? Or teaching standards got better? Personally I like to put it down to jealousy that makes the UCAS swine tell  new students to apply for less impressive universities.  I challenge Boris Johnson to learn 42 Blake poems and two Renaissance plays off by heart in the space of 6 months and come up smelling like roses. In fact, no I don’t, because he’s just so damn adorable, the Etonion idiot.</p>\n<p>What I want is to take things back to when you were congratulated for doing your best. So here’s a big pat on the back for even sitting A-Levels, a hip-hip for sticking with it for two years,  a large chorus of “for they are jolly good fellows” to those of you who tried hard, and a cacophonous SCREW YOU UCAS because we all did well just for getting here.</p>\n<p>I personally am jealous of those off travelling this year, and am as nervous as a Geordie in a spelling test about going to University. However, here I am ready to undergo the next wave of pressure so I guess it was worth it for me. Then.. what next? Life begins? Well, let’s not be too hasty, we have to survive fresher’s first.</p>\n<p style=\"text-align: center;\"><em>Honor. </em></p>\n","slug":"2575-what-next","category":"life","date":1282738558000,"wpid":2575,"isSticky":false,"featured_image":{"width":456,"height":342,"src":"2010/08/exams.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAUG/8QAIhAAAgAEBwEBAAAAAAAAAAAAAQIAAwQFBgcREiExQRMi/8QAFQEBAQAAAAAAAAAAAAAAAAAABQb/xAAdEQADAAEFAQAAAAAAAAAAAAABAgMABBFBsdHw/9oADAMBAAIRAxEAPwCHhrB9quWXMqfTlRSTFZl+qfosZx2FtO+ABp5yYyNRlVdZdRNRdhCsQCoQA8+at1CETqaqk6uoPJ7xusUM0Yj7Ye5//9k="},"createdAt":1587295030676,"updatedAt":1588403564471,"author":"5e9b68b27a1236eccfeb1d1f","old_image":"2010/08/exams.jpg","categories":["life","opinion"]}