{"id":"5e9c333b9b6559241525e01c","artists":["5e9b68e07a1236eccfeb1f1c"],"title":"Interview: Come On Gang!","content":"<img class=\"alignnone\" title=\"come on gang\" src=\"https://c4.</p><p>ac-images.myspacecdn.com/images02/88/l_a8f3bb86da2b4034b2c66c129db488af.jpg\" alt=\"\" width=\"600\" height=\"401\" />\n<p>Having already played numerous festivals, including <strong>SXSW, Reading, Leeds</strong> and<strong> T in the Park</strong>, Edinburgh based post-punk trio <strong>Come On Gang!</strong> are rapidly building up an impressive musical repertoire. Their boisterous blend of twee pop and coarse guitar riffs caught the ear of distinguished producer <strong>Paul Savage</strong> who took up the production duties on their recently completed debut album. With two single releases under their belt thus far,<em> Fortune Favours The Brave</em> out on 10th September will be their third, and most likely the one to propel them to future stardom. With a full UK tour upcoming, <em><strong>Crack in the Road</strong></em> caught up with Mikey, Rob and Sarah to discuss the magnificent Scottish music scene, the formation of the band and <strong>Come On Gang!’s</strong> plans for the future.</p>\n<p><em>Crack in the Road: How did Come On Gang Form!?</em></p>\n<p><strong>Mikey: Through the shared love of ‘musicians wanted’ posters. No one had ever called me a musician before I replied to that poster, so it was clearly a good start.</strong></p>\n<p>Sarah: Yeah, I moved up to Edinburgh a few years ago and wanted to make music with people, as no one wants to hear a drummer playing alone, unless you’ve got industrial-strength eardrums. The others were foraging for bandmates too; eventually we all found each other.</p>\n<p><strong>Rob: Mikey and I both grew up in the Scottish Borders and our lives occasionally crossed over – being in a band together was the serendipitous outcome!</strong></p>\n<p><em>CitR: For those who haven’t heard Come On Gang!’s music, how would you describe your sound in your own words?</em></p>\n<p><strong>Mikey: I’d describe it as honest, song-driven music, which feeds on melody as much as it does on energy, optimism and reflection.</strong></p>\n<p>Sarah: Wow Mikey, that’s pretty spot-on. I hope our music is fun, I have a lot of fun playing it, but it’s got a bit more upstairs than that as well.</p>\n<p><strong>Rob: I think our music sounds a bit punky and a bit rocky, while Sarah’s vocals sound quite folk-inspired. The sound we end up with is something I like listening to, which means there’s probably lots more people out there that would like it too.</strong></p>\n<p><em>CitR: The music scene in Scotland is really exciting at the moment, what do you think the reasons for this are and how do you think growing up in Scotland has affected the music you create?</em></p>\n<p><strong>Mikey: It is exciting, but I think it has been for a number of years now. I’m not sure why it perhaps seems a little stronger at the minute than usual but I suspect it’s probably to with a handful of bigger bands unwittingly opening a few doors for smaller bands of a similar ilk. This is a good thing, of course, and is unavoidable in somewhere as small as Scotland – as soon as one band breaks through people outwith the country start to suddenly take notice. I guess the first Scottish band I completely got into was Idlewild, and ‘Hope is Important’ made me realise I could do whatever the fuck I want on guitar.</strong></p>\n<p>Sarah: I didn’t grow up in Scotland, I’m from Brighton but to be honest since a lot of people hear me sing and think I am Scottish because of the slightly folky quality, I don’t think where you grow up necessarily shapes your music. It’s all about what you identify with. You could grow up in Reading and have a deep spiritual connection with Delta Blues, or grow up in Sweden and love Northern Soul – who cares? But I do think there’s load of great bands in Scotland at the moment, and lots of dedicated promoters, scribes and tons of other folk to really add power to it.</p>\n<p><strong>Rob: I think the music scene in Scotland is growing in every direction, which I find totally inspiring: it makes me want to make more music. So I reckon it’s a matter of exponential growth – the better Scottish music is out there, the better the next generation of Scottish music is.</strong></p>\n<p><em>CitR: You have played festivals in the States and the UK, how did they differ and what has been your most memorable gigging experience to date?</em></p>\n<p><strong>Mikey: Everyone loves playing a big show, there’s something so affirming about it; so Reading festival stands out as one of my favourites. The stage was on a really good spot so it was just a constant sea of people, thousands of them. In America though, we’ve been received very well and crowds there seem a little more keen to meet you afterwards to tell you how much they enjoyed it. We got a last minute offer to support White Lies last year so, after going to the Queen’s garden party, we opened the show for them and it was just superb. Never met the guys or anything, but the 1000+ crowd made us feel very welcome.</strong></p>\n<p>Sarah: Playing in the Reagan Building in Washington DC, to represent Scotland. That was certainly memorable. Trouble was, it was a businessy, schmoozy cocktail evening, and we were playing in this beautiful glass-ceilinged room with these government-types. But we had a fantastic time over there.</p>\n<p><strong>Rob: My favourite gig was one we did last year, a couple of days before our slot at Rockness – it was the end of the year party at the Edinburgh College of Art. During the first song, a bunch of drunken students invaded the stage, so there were randoms on stage for most of the set! Was a real challenge trying to play bass while getting pushed around the stage, and one I’ll never forget!</strong></p>\n<p><em>CitR: And your most embarrassing?</em></p>\n<p><strong>Mikey: Nothing springs to mind, but every band’s played gigs when they first start where you realise it will be shit as soon as you meet the promoter. You know, they guy doesn’t know who you are, or who’s playing, or even his own fucking name so, inevitably, no one shows up.</strong></p>\n<p>Sarah: For pure weirdness value, that same Washington gig! Not one person wasn’t wearing a pinstripe suit, I couldn’t help but feel a little out of place!! Though a couple of them showed us the town afterwards, they weren’t all business.</p>\n<p><strong>Rob: Like Sarah, my most embarrassing/weird gig is also my favourite! The Art College event was Circus-themed fancy dress, so I was dressed as a bearded lady – it’s the only gig I’ve ever played while dressed in drag!</strong></p>\n<p><em>CitR: Your music appears very much to deal with the trials and tribulations of being young, would you agree with that assumption, and is there any particular story behind ‘Fortune Favours The Brave’?</em></p>\n<p><strong>Mikey: I’m not sure about ‘Fortune’ but I gather the lyrics deal a lot with the city and the hand it throws you from time to time. I think musically that’s certainly a big influence on us.</strong></p>\n<p>Sarah: I’m the lyricist and I try to distil my experiences into a song without it being too hyper-real, there’s plenty of room for metaphor and rhyme, like the idea of the ship in Fortune Favours the Brave, or the woven fabric in Red Thread. Other songs are just stompy and fun, but they are definitely about the trials and tribulations of being young, you’re right – just learning the hard way as you wander through life…</p>\n<p><em>CitR: The music industry is now heavily based around the illegal downloading culture, what have been the repercussions for you, both as an performer and a fan?</em></p>\n<p><strong>Mikey: As a performer this hasn’t affected us significantly yet, as we’ve had no pressure to sell a certain amount of any release. As a fan it’s been a kick in the balls though, as a lot of people seem to see music as an essential ‘must-have’ rather than a treat or a luxury. No one needs music to the extent they have to steal it and, unfortunately, if bands don’t make any money they’ll just pack it in or get dropped. I find it all very short-sighted.</strong></p>\n<p>Sarah: Who knows. It’s not a problem for us at the moment but it is a struggle when funds are limited. But it’s not going to go away and I do like the fact that you can get access to so much music easily. People aren’t going to change when the getting’s good and I have no idea what the future might hold, but it seems like it’ll be a far more democratic and less naive future.</p>\n<p><strong>Rob: Music sync (having your music featured on TV/movies/adverts) and live performance are the biggest earners for bands, and neither of those are horrifically damaged by illegal downloading. So as a performer, I’m not too stressed about it. As a fan, unlimited access to music is a really liberating thing, but I’d prefer for people to get that access through subscription music services where the artists still get paid appropriately.</strong></p>\n<p><em>CitR: Where would you like to see Come On Gang! being in a years time?</em></p>\n<p><strong>Mikey: Well we’ve been invited to New York a bunch of times and, so far, we’ve always had to decline, so definitely having played there at last! Other than that, our album will be out and by now we will hopefully have just finished a string of festivals before a Sept/Oct tour starts. Assuming we don’t die of Ginsters of course.</strong></p>\n<p>Sarah: Hear hear Mikey. I just want to travel, and to know that people who aren’t just mates of the band really like our music.</p>\n<p><strong>Rob: I’d like to be in the middle of a big tour, with only occasional breaks so we can write new songs!</strong></p>\n<p><em>CitR: What was the first record you can remember really falling in love with?</em></p>\n<p><strong>Mikey: Easy, The Bends. My brother bought me it for my 13th birthday and it just opened so many doors in terms of songwriting, playing guitar and what a band could actually sound like if they ignored all that pish about genres. I can’t believe how timeless it sounds even today, especially when so many bands settle for trundling along familiar ground record after record.</strong></p>\n<p>Sarah: It must’ve been the kinks cd – a compilation of tracks, not an album proper – that I found around the house, their songs seemed (and still are) perfect to me. I was about ten and the charts were full of aural vomit and then I listened to this and pop with personality filled the air! Joy.</p>\n<p><strong>Rob: I remember listening to loads of music that I really liked when I was younger, but the first album I really fell in love with was Give Up by The Postal Service. It was totally unlike anything I would normally listen to, and it took me a long time to get into. But every listen pulled me in further, and I eventually concluded that it’s the only album where I can honestly give every track 5 stars!</strong></p>\n<p><em>CitR: If you could be any animal, what would you be?</em></p>\n<p><strong>Mikey: A dog. There is no better animal.</strong></p>\n<p>Sarah: A deer. After reading ‘The Children of the New Forest’ I have always respected their elegant ways.</p>\n<p><strong>Rob: A lion, no question. ROAR.</strong></p>\n<p><em>CitR: If any celebrity (alive or dead) could join you onstage, who would it be?</em></p>\n<p><strong>Mikey: Anyone but Marc Bolan really. A journalist phoned us a few months back to ask what it was like having Ricky Wilson (from a certain God-awful troupe) join us on stage. I didn’t know who he was at the time, so I just said I’d call them back. Anyway, probably a Parallel Lines-era Debbie Harry or Nick Cave at his at his sleazy, devilish, Grinderman best.</strong></p>\n<p>Sarah: Mikey, how dare you. He knows Marc is my hero. But actually, I think I’d have Pixie Lott join us onstage, so I could show her how much I respect her musically.</p>\n<p><strong>Rob: Otis Redding! Man, that would be amazing…</strong></p>\n<p>Make sure to check out<strong> Come On Gang!</strong> on their upcoming UK tour, or head over to their site on 10th September to download <em>Fortune Favours The Brave</em> for free!</p>\n<p style=\"text-align: center;\"><a href=\"https://www.myspace.com/comeongangmusic\">Check Out Come On Gang’s Myspace!</a></p>\n<p><script type=\"text/javascript\" src=\"https://video.unrulymedia.com/wildfire_11244048.js\"></script></p>\n","slug":"2577-interview-come-on-gang","category":"interviews","date":1282334366000,"wpid":2577,"isSticky":false,"featured_image":{"width":292,"height":50,"src":"2011/06/l_a8f3bb86da2b4034b2c66c129db488af-292x50.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAACAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAUG/8QAHxAAAgICAQUAAAAAAAAAAAAAAQIDBAARIQUSFFGR/8QAFAEBAAAAAAAAAAAAAAAAAAAABP/EABoRAAEFAQAAAAAAAAAAAAAAAAACAwQycUL/2gAMAwEAAhEDEQA/AIfXZHNmshding1D2742IIyPh5zb3bdlrk5axMSZGJJc+8Yw7PWj5NUYf//Z"},"createdAt":1587295035123,"updatedAt":1588403564546,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/06/l_a8f3bb86da2b4034b2c66c129db488af-292x50.jpg","categories":["interviews","music"]}