{"id":"5e9c33399b6559241525e019","artists":["5e9b68da7a1236eccfeb1e89"],"title":"Review: Born Ruffians – Say It","content":"<p style=\"text-align: left;\"><a rel=\"attachment wp-att-2589\" href=\"https://admin.</p><p>crackintheroad.com/music/2587-review-born-ruffians-say-it/attachment/say-it-born-ruffians2\"><br />\n</a></p>\n<p style=\"text-align: left;\"><strong>Born Ruffians</strong> return to our ears and screens with their second full album in the form of  <strong>‘Say It’</strong>;  a soul-filled, rock ‘n’ roll 10-track record bringing with it a  slightly more mature and grown-up sound. Don’t get me wrong, this isn’t  the moody, change-of-sound second album you sometimes expect in the  music industry, this is still as fun as the debut, with as many  sing-a-longs, certain things have just been tweaked. Lead singer <strong>Luke LaLonde</strong> has developed a stronger voice and the band as a whole have taken a  more rock ‘n’ roll approach to their music this time round, these two  factors working charmingly together.</p>\n<p style=\"text-align: left;\">‘Say It’ bounces along with  tracks of mixed pace and sounds resonating Vampire Weekend and early  Kings Of Leon. The album features singles <strong>‘What To Say’</strong> and <strong>‘Sole Brother’</strong> – a track loosely about being an only child, and has a great feel-good  vibe to it. The record is carried by some brilliant funk-dripped  basslines, clean guitar tones and clever lyrics; “<em>when I wake up I’m  speaking slow/when I get drunk I’m speaking more/get too drunk and I  don’t speak at all/get too close to you and I don’t know, oh, what to  say.</em>“</p>\n<p style=\"text-align: left;\">If I had a car, then I can see this  definitely being a perfect driving record; easy sing-a-longs and a  catchy rhythm section throughout.</p>\n<p style=\"text-align: left;\">Highlights on this record are <strong>‘Higher and Higher’</strong>,  with its cool instrument alternating fills. On first listen, it seems  like a track that might just burn out and not go anywhere else but it  builds up nicely to an uplifting ending. Other stand-out tracks are <strong>‘Retard Canard’</strong> with its slamming bass fill which comes in every so often, suitably  indicating this albums funky element, and the stick-in-your-head lyric<em> ‘I just wanna set the world on fire!’ </em>In addition, opener <strong>‘Oh Man’</strong> is a great track, rumbling and creeping the album into action, along with track eight, <strong>‘Nova Leigh’</strong> with its simple, off-beat drumming throughout the song, which  eventually develops and bursts the song into life over and over again.  Great track.</p>\n<p style=\"text-align: left;\">The only hint of filler on this album is closing track <strong>‘At Home Now’</strong> which never seems to get going and sadly, leaves an otherwise solid  record on a slightly weak note. However, in a musical age full of  experimental and arty try-hards, <strong>Born Ruffians have put the fun back into rock ‘n’ roll.</strong></p>\n<p style=\"text-align: center;\">www.myspace.com/bornruffians</p>\n<p style=\"text-align: left;\"><a title=\"Buy 'Say It' Here\" href=\"https://http//www.recordstore.co.uk/productdetail.jsp?productPK=unittest-M5cCOLVX9spDIt96qN3IEb-1\" target=\"_blank\"><br />\n</a></p>\n","slug":"2587-review-born-ruffians-say-it","category":"music","date":1282568859000,"wpid":2587,"isSticky":false,"featured_image":{"width":600,"height":600,"src":"2010/08/say-it-born-ruffians2.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAABgUH/8QAIxAAAgIBAwMFAAAAAAAAAAAAAQIDBAAFERMSIWEGIkFRwf/EABQBAQAAAAAAAAAAAAAAAAAAAAT/xAAcEQABBAMBAAAAAAAAAAAAAAACAAEEEQMFQfD/2gAMAwEAAhEDEQA/AI9v1PDrWnu8UvRDXUM/VJw+4sCpA3AIAVh+HfAl6G7du2LUdiyqTyNKoHYAMd/rzhWFmYaMGYkci9ic2qmimpASq78a/HjDxsDUk7OaYE1e6v/Z"},"createdAt":1587295033290,"updatedAt":1588403564521,"author":"5e9b68b27a1236eccfeb1d49","old_image":"2010/08/say-it-born-ruffians2.jpg","categories":["music","reviews"]}