{"id":"5e9c0289774c2610387e498f","title":"Exhibition Review: À Triple Tour","content":"<p>Perhaps the only place to hold an exhibition about imprisonment given its <a href=\"https://en.</p><p>wikipedia.org/wiki/Conciergerie\">history</a>, the Conciergerie de Paris hosted a selection of François Pinault’s famous art collection. The exhibition, entitled <i>A Triple Tour, </i>featured works by 22 different artists centred around two different types of imprisonment; <i>Crises and Imprisonment, </i>which focused on the types of imprisonment we face as a society and <i>The Individual and Imprisonment </i>which explored just that.</p>\n<p>The exhibition begins with Diana Thater’s <i>Chernobyl</i>, an installation of video footage projected on to large screens, placed in a way that closes in around the spectator. It is not immediately clear what the link is between the videos, which show eerie footage of a desolate landscape, and imprisonment but the exhibition leaflet explains that Thater ‘initiates a dialogue between the site and the work, the visitor’s attention vacillating between awareness of the actual site and the projected illusion.’ <b></b></p>\n<p>The exhibition continues through the <i>Hall of Whispers </i>by Bill Viola; a dark passage lined with videos of people speaking, whose words are barely audible as they are each gagged by a white cloth; undoubtedly a comment on the individual’s suppressed political voice. The exhibition then opens out into a large gallery of paintings, videos and sculpture by different artists which consider the link between politics and war and imprisonment, including Boris Mikhaïlov’s paintings of propaganda from Soviet Russia, showing Stalin sporting a rather fetching shade of red lipstick.</p>\n<p><a href=\"https://api.crackintheroad.com/uploads/2014/01/DSCF6087.jpg\"><img class=\"size-medium wp-image-25917 aligncenter\" alt=\"DSCF6087\" src=\"https://api.crackintheroad.com/images/2014/01/DSCF6087-260x195.jpg\" width=\"260\" height=\"195\" /></a></p>\n<p>One pertinent issue which is revisited time and time again in French works of art is immigration and integration in or exclusion from society.  Mohamed Bourouissa’s <i>Temps Mort </i>shows video footage of a conversation via text message which is heavy with slang and text speak, which are sometimes viewed as an attribute of the marginalised. Considering the physical setting of society is Julie Mehretu with two paintings depicting hectic landscapes which illustrate the chaotic existence of urban life.</p>\n<p>The second part of the exhibition begins with what appears to be a day out from a retirement home; scarily lifelike dummies of elderly men sit in wheelchairs, some even moving, clearly uninterested in the surrounding art. It turns out to be Sun Yuan & Peng Yu’s aptly named <i>Old Person’s Home</i>. The leaflet explains that the artists ‘[challenge] notions of perception, death and the human condition, combining their relentless obsession with death with an almost comical interest in the macabre,’ so you don’t feel too bad for sniggering.</p>\n<p><a href=\"https://api.crackintheroad.com/images/2014/01/DSCF6093.jpg\"><img class=\"size-medium wp-image-25918 aligncenter\" alt=\"Pinault2\" src=\"https://api.crackintheroad.com/images/2014/01/DSCF6093-260x195.jpg\" width=\"260\" height=\"195\" /></a></p>\n<p>Also in this part of the exhibition are paintings by Llyn Foulkes which incorporate odd objects such as human hair and Tetsumi Kudo’s series of works which depict variously deformed genitals in cages, amongst other sculptures and videos which explore the idea of imprisonment and the mind/body paradigm. Even Damian Hirst’s <i>The Fragile Truth </i>makes an appearance.</p>\n<p>The idea of societal marginalisation is revisited in this part of the exhibition but the works are more personal to the artist. Chen Zen’s <i>Sleeping Tao, </i>showing<i> </i>dusty French novels encased in a glass box covered with Chinese characters,<i> </i>illustrates the link to his native China versus the subsequent fascination he developed with the western world upon coming to Paris to pursue his studies. Freidrich Kunath’s <i>The Past is a Foreign Country, </i>a mannequin wearing summer clothing whose head is encased in a sort of snow globe, demonstrates the divide he feels between two cultures after he left his birthplace in East Germany to live in sunny Los Angeles.</p>\n<p><a href=\"https://api.crackintheroad.com/images/2014/01/DSCF6108.jpg\"><img class=\"size-medium wp-image-25919 aligncenter\" alt=\"DSCF6108\" src=\"https://api.crackintheroad.com/images/2014/01/DSCF6108-260x346.jpg\" width=\"260\" height=\"346\" /></a></p>\n<p>The exhibition ends with Michelangelo Pistoletto’s <i>La Gabbia</i>, a large mirror covered by metal bars to give the appearance of a prison cell. In fact, the exhibition actually began with this work but I, at least, had not noticed that it was part of the art work then and so I left the exhibition that little bit more aware of the concept of imprisonment; exogenous and personal.</p>\n<p><a href=\"https://api.crackintheroad.com/images/2014/01/DSCF6111.jpg\"><img class=\"size-medium wp-image-25920 aligncenter\" alt=\"Michaelangelo Pistoletto\" src=\"https://api.crackintheroad.com/images/2014/01/DSCF6111-260x195.jpg\" width=\"260\" height=\"195\" /></a></p>\n<p> </p>\n<p style=\"text-align: center;\"><strong>À Triple Tour exhibited at the Conciergerie, Paris<br />\n22nd October 2013 – 6th January 2014<br />\n<a href=\"https://www.monuments-nationaux.fr/en/actualites/a-la-une/bdd/actu/1299/a-triple-tour-collection-pinault/\">More information</a></strong></p>\n","slug":"25916-exhibition-review-triple-tour","category":"arts","date":1389643395000,"wpid":25916,"isSticky":false,"featured_image":{"width":4000,"height":3000,"src":"2014/01/dscf6107.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAIAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAIG/8QAIhAAAQMEAAcAAAAAAAAAAAAAAQACAwQFERIGExUhMVFh/8QAFQEBAQAAAAAAAAAAAAAAAAAABAX/xAAWEQEBAQAAAAAAAAAAAAAAAAARAAH/2gAMAwEAAhEDEQA/AL4kbfeo8m3Q1L6LbclpbrkgeO/xbaCKkbDGHyDYNAOfeERTCZi7f//Z"},"createdAt":1587282569391,"updatedAt":1588403521774,"author":"5e9b68b27a1236eccfeb1d2d","old_image":"2014/01/dscf6107.jpg","categories":["arts"]}