{"id":"5e9c023f774c2610387e4905","title":"Film Review: Sur le Chemin de l’Ecole (On the Way to School)","content":"<p>Last Tuesday I had the pleasure of helping to supervise around a hundred 12 year olds to the cinema.</p><p> Luckily, the cinema is a stone’s throw from their school, so there wasn’t too much actual supervising to be done, and the film was excellent. Pascal Plisson’s documentary film <i>Sur le Chemin de l’Ecole </i>is the story of how four children, and their friends or siblings, get to school. It doesn’t sound too exciting or epic but when you consider that these real-life journeys take place in the Atlas Mountains and over the Savannah, explosions and plot twists are not really necessary.</p>\n<p>The film follows Jackson, 11, and his younger sister Salome on the two hour journey that they undertake every day in order to get to school. They traverse the Savannah on foot, all the while looking out for wild animals such as elephants and scorpions which are prone to attack.</p>\n<p>Zahira, 12, lives in the Atlas Mountains and travels for four hours every Monday to arrive at her boarding school. With her two friends and chicken in tow, they walk through the mountains for hours until they arrive at a village near to the school and attempt to get a lift for the rest of the journey with anyone who is willing to take them.</p>\n<p>Carlos, 11, and his little sister Micaela embark on the 1 hour 30 minute horse ride to school through the Patagonian planes of Argentina, stopping off to pray, meet fellow horse-bound friends, and let Micaela steer the horse.</p>\n<p>Finally there is 13 year old Samuel from the Bay of Bengal, who is unable to walk due to a bone disorder. His two brothers transport him over various landscapes in his wheelchair -literally, a plastic chair with wheels attached – for 1 hour and 15 minutes every day.</p>\n<img class=\"size-medium wp-image-26297 alignleft\" alt=\"sur le chemin de l'ecole\" src=\"https://api.crackintheroad.com/uploads/2014/01/sur-le-chemin-de-lecole-260x260.jpg\" width=\"260\" height=\"260\" />\n<p>The film is touching and moving and all of the other positive adjectives you can imagine. What is great about the film is that it really is honest; the children are not actors and the scenario is real. We were lucky enough to have a Q&A with the director after seeing the film and he explained that he told the children to act exactly as they would were the camera not there. The only speech in the film is the dialogue between the children and their various interlocutors; Plisson purposely did not add any explanation or a voice over because he wanted the spectator to experience the journey as the children do, and you really do feel like you are seeing exactly what these children go through due to their motivation to be at school and learn.</p>\n<p>The film is a French production so I’m not sure if it will have an international release but I sincerely hope so. I would urge anyone who has the chance to see this film. Watch the film’s trailer below.</p>\n<p><iframe width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/aEHQePgNXNU?feature=oembed\" frameborder=\"0\" allowfullscreen></iframe></p>\n","slug":"26296-film-review-sur-le-chemin-de-lecole-way-school","category":"arts","date":1390554024000,"wpid":26296,"isSticky":false,"featured_image":{"width":1200,"height":800,"src":"2014/01/jackson.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAAAAX/xAAgEAABBAEEAwAAAAAAAAAAAAADAAECEQQFEhMxQ+Hw/8QAFAEBAAAAAAAAAAAAAAAAAAAABf/EABoRAAICAwAAAAAAAAAAAAAAAAABAgMEIUH/2gAMAwEAAhEDEQA/AJI9RzJQEwZhHitC5O4bd3rrv6lGNnm5Z0cVbn8HtERayLW9yEHTBcP/2Q=="},"createdAt":1587282495420,"updatedAt":1588403520507,"author":"5e9b68b27a1236eccfeb1d2d","old_image":"2014/01/jackson.jpg","categories":["arts"]}