{"id":"5e9c33319b6559241525e00a","artists":["5e9b68e57a1236eccfeb1f73"],"title":"Interview: Deadhorse","content":"<img class=\"alignnone\" title=\"Deadhorse1\" src=\"https://c4.</p><p>ac-images.myspacecdn.com/images02/150/l_d2423bee90c34c1fa96b5706fdc51037.jpg\" alt=\"\" width=\"600\" height=\"398\" />\n<h6>Photograph by Tanner Douglass</h6>\n<p>After the release of their debut full length record,<strong> Deadhorse </strong>are one of the most exciting names in post-rock music. Combining an intriguing synthesis 0f classical and rock music, fusing pianos, guitars and percussion to excellent effect, <em>We Can Create Our Own World </em>is a raw, emotional affair, sure to inspire many. In between touring their new release,<strong> Deadhorse</strong> managed to take a couple of minutes off to answer a few questions for<em><strong> Crack in the Road</strong></em>.</p>\n<p><em>Crack in the Road: How did the formation of Deadhorse come about?</em></p>\n<p><strong>Deadhorse actually started as a side project to another band that I (Brian) was doing.  The band was called Awaken, North Wind! And the music was a melodic ambient indie, sort of the vein of As Cities Burn.  I had a bunch of solo music that I was playing at the time, and I felt like doing it full band, playing a few shows with it, and just seeing what would happen.  4 of us got together and started piecing those songs into something more full sounding.  We played a couple shows, and then decided we wanted to start writing together.  When the writing process started, we toyed with the idea of doing something completely instrumental as we had never done anything like that before.  Personally, it is something I had been wanting to do for years, so it was definitely nice, and going to be a new challenge if we moved forward with it.  After shifting some members around, we decided to just push forward with it.  At the same time, Awaken dissipated, and our bass player Tyler started playing with Deadhorse.  At that point it took center stage, and we really started to push forward with the music.  And here we are!</strong></p>\n<p><em>Crack in the Road: In terms of influences, what would you cite as your main inspirations, both musically and otherwise?</em></p>\n<p><strong>I think for each one of us it is drastically different.  It seems like  with a lot of instrumental bands there is a lot of super intense  influence that goes into what they create from an artistic or cinematic  perspective.  I read through interviews with some bands and I’m  like….what on earth is this guy talking about, haha.  We are very  simple, down to earth kids from no where special, with a lot of roots in  the punk rock world.  Everything we listen to, read, or watch is really  a very broad range of eclectic influence.  As far as music goes, we do  have our post-rock influences, such as bands like Giants, Caspian, Sigur  Ros, Olafur Arnalds, Braveyoung, This Will Destroy You, Godspeed You!  Black Emperor, etc.  Then we have a wide variety of different  indie/punk/folk influences such as Manchester Orchestra, Twothirtyeight,  Further Seems Forever, Strike Anywhere, Crass, The Loved Ones, Dignan,  etc.  Rachel has a lot of classical background which shines through in  her piano playing, Tyler loves a lot of straight forward punk rock, it  really is unique for each of us.  A lot of bands never can really answer  these questions which I think is hilarious in itself.  I feel in some  way everyone is definitely a product of their influence, and you can at  least point people in the right direction for something that you might  sound like, or where a certain mix of style blend can come from.  Too  many people are claiming to do something new, different, and  revolutionary, when it’s really not the case, haha.</strong></p>\n<p><em>Crack in the Road: For those who haven’t heard your music before, how would you describe Deadhorse’s sound?</em></p>\n<p><strong>Powerful, tragic, and triumphant all at the same time.  In a post-rock  sense, there’s a lot of records I listen to that I say “Wow, this is a  really good record…but it would be SOOO much better if it was just a  little bit…bigger, louder, harsher, etc.”  We really try to capture a  lot more intense blend of dynamic, and push our live show and recordings  a lot louder than most other post-rock bands out there.  We want the  music itself to command attention from the listener, whether during loud  or quiet parts.  We try to eliminate a lot of the drone-y 20 minute  ambient parts that people seem to always skip over unless they are  sleeping, and replace it with parts we feel more listeners can more  easily connect to.</strong></p>\n<p><em>Crack in the Road: With your album release, you appear to have embraced the download  culture, yet you still are releasing a limited number of records on  vinyl. Does this show your belief that the vinyl format still has a  future?</em></p>\n<p><strong>We actually haven’t released any vinyl yet, haha.  As of right now we  are releasing limited pressings of cds.  We are hand making everything,  and putting a lot of time and effort into each disc.  We’ve been hand  numbering and limiting each pressing to 50, while spreading the album  like wildfire online for download.  As it looks right now though, we  will be releasing the album on vinyl this fall/winter through Broken  Circles Records out of Cincinatti, OH.  The label is awesome, and they  have done a lot of really great releases such as Discover America,  Beloved, Further Seems Forever, Zao, and more.  We couldn’t be more  excited to work with them, and we’ll have more details about the vinyl  release in the near future.  As far as the downloading goes, we are  really trying to embrace the internet, as it has a lot of helpful tools  for bands trying to spread their music to the four corners of the  world.  If you really try and work constantly, you can really see some  serious exposure come just from internet promotion.  Our album has been  out since June at this point, and we have seen over 5,000 downloads of  the album online, and trying to get that number as high as we can get  it.  Personally, I know I never really buy an album anymore unless I’ve  already heard it and love it.  If I was trying to make music, I feel it  would be no exception to anyone else.  We want to make sure the music is  out there wherever people get their music so they can give it a try,  and then in turn, get a copy from us if they enjoy it.  We’ve seen a lot  of positive response from parts of the country and even the world that  we definitely haven’t been anywhere near yet, and we’ve been sending out  cds all over the world because of embracing the download culture.  In  terms of vinyl, I definitely feel it has a future.  I have recently been  bit by the vinyl bug, and started collecting a lot.  More and more,  people are only buying vinyl as something they can hold on better than  cds.  They have a lot better lasting value, and embrace and showcase the  artwork and design of the albums so much better than a small cd.  We  fully support that, and plan to offer a vinyl release as soon as our  finances will let us!</strong></p>\n<p><em>Crack in the Road: How did you go about recording We Can Create Our Own World? Was  it a simple process with you already knowing which songs were going to  feature, or did the album evolve in the studio as you recorded it?</em></p>\n<p><strong>In December of 2009, we went into the studio with half of an album  written, having put ourselves on a strict time frame giving us six  months within which we wished to have the album completely finished and  at the same time have a tour booked and ready to go for the beginning of  June 2010.  So, as we headed into Take Two Studios to record, we not  only had in front of us the grueling process of recording track upon  track of the songs that we already had finished, but also the task of  writing 3 more songs to satisfaction and recording those as well, and on  top of THAT booking a tour without anyone being able to reference a  final product of our music.  We knew it was going to be a lot of hard  work, time, money, and effort, with only a fifty-fifty chance of  success, but we decided to go for it.  As the months quickly passed, we  finished recording the first four songs of the album that were already  completely written, and with time not on our side, we were forced to  begin writing the last three songs of the album as we recorded them,  piecing together as a team what sounded good here, what didn’t sound  good there, what one track that had been recorded made us want to write  and add on to and create, and so on.  So, in response to your question,  yes, some of our songs evolved in the studio, and two of those songs  especially (Last Night of the World, track 5, and The Long Rain, track  7) became favorites and features of our album.</strong></p>\n<p><em>Crack in the Road: What has been your most memorable gig experience to date?</em></p>\n<p><strong>We’ve had so many wonderful, memorable show experiences, met may  wonderful people, and it’s hard to pick just one.  Out of all of them, I  would have to say one of our last shows on our first tour in a little  town called Jamestown in Pennsylvania, was a pretty magical experience.   From the lighting, to the people, it was unbelievable.  When we began  our set, Brian introduced us, explained what we are all about, what the  album promotes, and as he talked, not one person spoke a word…which  doesn’t happen very often, if ever at any show.  Even when he had  finished talking and we began to play, the building (filled with about  70 to 100 people) stayed absolutely silent.  It was amazing and  beautiful to be able to look up from playing and see people with their  eyes closed, soaking in the sound, others with heads bowed, deep in  thought, some sitting, some standing,  more with tears in their eyes,  and others with smiles of sheer joy on their faces; all of these  bringing to reality the idea that we wanted to create with our music.   It was indescribable the feeling I got seeing people taking what all of  us in the band were playing, and creating the music, molding it into  something of their own – a make-believe story, a painful past  experience, things hoped for, love, hate, death, beauty, anger,  happiness, all of it.  And to see these expressions and stories written  on people’s faces as music played was one of the most beautiful things I  have seen.  Even as we finished our set and began packing away our  instruments, the packed room and ourselves remained silent and  thoughtful, and this is something I will never forget.</strong></p>\n<p><em>Crack in the Road: And your most embarrassing?</em></p>\n<p><strong>It’s funny to say, but at this point, we haven’t really had any sort  of overly embarrassing stories from the road.  All of our shows have  been pretty fun, filled with familiar faces, of at least friendly  strangers that have grown into friends over time.  Nothing has really  gone wrong on stage, or there really hasn’t been any insane funny moment  that made a show terrible or extremely memorable.  That is a pretty  boring answer and probably makes us sound like weirdos, but I apologize,  we don’t really seem to have anything that stands out at this point!   I’m sure something is bound to happen in the very near future though,  hahaha.</strong></p>\n<p><em>Crack in the Road: As a band, where do you see yourself in a years time?</em></p>\n<p><strong>So much can happen within a year’s time. I think what we all would like  to see happen first is a full-time touring schedule, where we would be  touring 11 months out of the year without it being a hassle or a problem  money-wise or people-wise, and as that progresses, find a booking agent  to share the load of booking.  The beginnings, if not the total  product, of a second album being written is definitely something we see  happening within the next year.  Other than that, I know we would all  like to see a Europe tour booked on our calendar before the end of next  year (2011).</strong></p>\n<p><em>Crack in the Road: And finally, if you could be any animal, what would you be?</em></p>\n<p><strong>No question, it would have to be a velociraptor, the only animal I’ve  ever wanted to be.  Ever since I was a kid and I saw Jurassic Park, I  was obsessed with them.  Something about them seems to be so smart and  cunning, a lot more clever than most animals out there.  Also, the way  that they seem to work in packs and communicate efficiently has always  been a draw.  I just love the idea in anything I’ve ever read that if an  animal spotted a velociraptor ahead of them and panicked, it wouldn’t  matter what they did next because they were already being trailed and  hunted by at least two others that had surrounded them from the sides,  back, etc. and used the one in broad daylight as a decoy.  Genius!</strong></p>\n<p style=\"text-align: center;\"><em>We Can Create Our Own World</em> is out now, available for download at the band’s bandcamp site.</p>\n<p style=\"text-align: center;\"><a href=\"www.deadhorse.bandcamp.com\">Check Out Deadhorse’s Bandcamp!</a></p>\n<p style=\"text-align: center;\"><a href=\"www.myspace.com/deadhorsepa\">Check Out Deadhorses’s Myspace!</a></p>\n<p><script type=\"text/javascript\" src=\"https://video.unrulymedia.com/wildfire_11244048.js\"></script></p>\n","slug":"2637-interview-deadhorse","category":"interviews","date":1282908529000,"wpid":2637,"isSticky":false,"featured_image":{"width":600,"height":398,"src":"2011/06/l_d2423bee90c34c1fa96b5706fdc51037.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAMH/8QAIhAAAQMEAQUBAAAAAAAAAAAAAgEDBAAFESESBxMVMUFR/8QAFQEBAQAAAAAAAAAAAAAAAAAAAwT/xAAYEQADAQEAAAAAAAAAAAAAAAAAAjEhIv/aAAwDAQACEQMRAD8Aziy+VtFoiORybciiBMhH7iihqY45Lr5tcL+aqsDqdLtkGPAbslmMIrYsCRo5lUFOOVwvvVKVKvVGbIf/2Q=="},"createdAt":1587295025647,"updatedAt":1588403564393,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/06/l_d2423bee90c34c1fa96b5706fdc51037.jpg","categories":["interviews","music"]}