{"id":"5e9c0222774c2610387e48c5","title":"Exhibition Review: Salla Tykkä at The Baltic, Gateshead","content":"<p>Finnish artist <b>Salla Tykkä</b>, known for her dramatically edited and psychologically charged films, has been working on her most recent series entitled <i>The Palace </i>since 2008.</p><p></p>\n<p>The immediate subjects of the three films namely flowers, horses and gymnastics, serves to justify the title of the trio suggesting a fairytale theme reminiscent of the play of small children. However, much like the misleading stance of a fable, the films uncover darker themes of humankind’s perceived dominance over the natural world and our unremitting desire to control, alter, and take for ourselves.</p>\n<p>Presented in the round on three imperious cinema screens, the story begins with the <i>Victoria</i>, a flower deemed the most beautiful in the world. Tykkä’s grandmother used to take her to visit the Helsinki Botanical gardens to see the flower, which was brought to Europe from the Amazon Basin in the 19th century during colonization. It opens only at night so Tykkä was never able to see it in its full glory. Her film <i>Victoria 2008</i> follows the flower blooming and unfurling, first with pure white petals, and finally revealing an inner circle of red. The accompanying grandiose score is akin to that of an epic fantasy film and accentuates the thematic context of man’s dominion and governance.</p>\n<p><a href=\"https://api.crackintheroad.com/uncategorized/26483-exhibition-review-salla-tykka-baltic-gateshead/attachment/airsabovethe-ground8-1-2/\" rel=\"attachment wp-att-26496\"><img class=\"alignnone size-large wp-image-26496\" alt=\"\" src=\"https://admin.crackintheroad.com/uploads/2014/02/AirsAbovethe-Ground8-11-640x360.jpg\" width=\"640\" height=\"360\" /></a></p>\n<p>The second film, <i>Airs Above the Ground</i>, explores two sides of the Lipizzan horse. The breed, which was developed for the Spanish Monarchy in the 16th century, is born nearly black. As they grow their colour changes to white, bay and chestnut shades, however as white was the colour preferred by the royal family it remains dominant and is emphasized in breeding practices. Footage of the young horses galloping freely is intercut with scenes of the strict ‘haute école’ movements of the highly-stylized classical dressage of the Spanish Riding School of Vienna. It is said the dressage jumps, commonly known as ‘airs above ground’, originated when horses were used in warfare, though this is unlikely as the moves expose the sensitive underbelly to foot soldiers and it is now thought the airs were only used as training exercises. Tykkä tinkers with the film’s sound, markedly emphasizing the landing ‘thud’ of the Lipizzans tremendous leaps, reminiscent of drums of a great army on the edge of battle. Here beauty and morbidity go hand in hand.</p>\n<p>The final offering <i>Giant 2013</i>, co-commissioned by the Baltic, and only finished the day before the exhibition began combines footage of young Romanian gymnasts in their training centers and interviews with the girls. Tykkä sensitively documents the training regimes and practices of a gymnastic culture largely leftover from the era when Romania was under dictatorship. The girls are said to have been extremely concerned with how the footage would turn out and were keen to express to Tykkä the great honour that accompanies being a gymnast, a quality reflected in their competition attire, which consists of a white leotard to symbolize strength and purity. Much like ‘Airs Above the Ground’ Tykkä emphasizes the landing sounds transforming them into great explosions when the girls hit the beam. She also experiments with scale, presenting close-ups of feet making them look like that of a giant’s contrasting the petite frames of the gymnasts themselves.</p>\n<p>Tykkä’s trio of videos offer the perfect balance between visual information and time for contemplation. The sparse documentary style with its overlapping themes of the colour white, and man’s alteration of nature bind together the three films. Although each stood up in its own right, as a series they worked to produce a harmonic dialogue and were altogether better for being in union.</p>\n<p>Salla Tykkä’s exhibition ‘The Palace’ is on at the <b>BALTIC</b> in Gateshead until 2nd March 2014. For more information click <a title=\"Baltic\" href=\"https://www.balticmill.com/\">here</a>.</p>\n<p>USEFUL INFORMATION: Catch the Quaylink bus from Newcastle Central Station down to the Baltic. A day ticket is only £2.10 and the Quaylink stops at all the major attractions in Newcastle & Gateshead. Whilst at the Baltic don’t forget to go up to the top floor to see stunning views over the city.</p>\n<p><a href=\"https://admin.crackintheroad.com/uncategorized/26483-exhibition-review-salla-tykka-baltic-gateshead/attachment/salla-tykka_giant_baltic-4-2/\" rel=\"attachment wp-att-26499\"><img alt=\"\" src=\"https://api.crackintheroad.com/images/2014/02/Salla-Tykka_Giant_BALTIC-41-640x360.jpg\" width=\"640\" height=\"360\" /></a></p>\n<p> </p>\n","slug":"26483-exhibition-review-salla-tykka-baltic-gateshead","category":"newreviews","date":1391528666000,"wpid":26483,"isSticky":false,"featured_image":null,"createdAt":1587282466927,"updatedAt":1588441760496,"author":"5e9b68b27a1236eccfeb1d0a","old_image":"2014/02/sall-tykka_victoria_baltic1-950x529.jpg","categories":["newreviews","arts"]}