{"id":"5e9c332f9b6559241525e007","artists":["5e9b69047a1236eccfeb2155"],"title":"Interview: I Like Trains","content":"<p><a rel=\"attachment wp-att-2663\" href=\"https://admin.</p><p>crackintheroad.com/music/2653-interview-i-like-trains/attachment/7f7o7289big\"><img class=\"aligncenter size-totallysizedforever wp-image-2663\" title=\"7F7O7289big\" src=\"https://api.crackintheroad.com/uploads/2010/08/7F7O7289big-740x467.jpg\" alt=\"\" width=\"740\" height=\"467\" /></a></p>\n<p>An interest in historical events and musical prowess are a combination rarely explored, with bands trying to ‘make it’ so much they are willing to stray from their desired path to make their music more accessible to a wider audience. <strong>I Like Trains </strong>on the other hand relish the prospect of reading about, and then writing songs on, well-known or obscure historical events; such as the life of Spencer Perceval, Britain’s only assassinated Prime Minister, with the A-side to the single being an account of the assassination by the murderer himself, John Bellingham, and the consequences he faced. Repetition of ‘<em>You were the rope around my neck</em>‘ in the background indicates his death by hanging but the fact that this is in the background suggests a negative attitude, and rightly so, of this man. The music in this song is typical ILT, with noise levels unmatched by most hitting peaks and troughs and concluding in an epic instrumental. The B-side to this incredible single is a plea from Perceval himself asking the murderer why he shot him, after he ‘<em>kept the French at bay in Portugal and Spain/ As our king went insane/ and this, this is the thanks I receive</em>‘. This single doesn’t even scratch the surface of ILT repertoire, with every song dedicated to something purposeful, full of unique and vastly interesting examples of history that tends to be forgotten, leaving the listener with no choice but to research events further. Many bands come from intellectual backgrounds but from what I have listened to, ILT are the only band that really attempt to <em>teach</em> people an academic subject through the art of music.</p>\n<p>Their début album, <em>Elegies to Lessons Learnt</em>, was released in October 2007, and even came with a book of essays about the events wrote about in the songs, after their first EP <em>Progress Reform</em> in 2006 and a new album is due for release once enough pledges are made to complete the process from fans. What is incredible are the opportunities open to fans, depending on how much they pledge; from playing the bassist Alistair at Scrabble to getting guitar lessons from the band. This shows the commitment ILT put into their music, willing to do more than any other band I know just to release music that, as far as I am concerned, <em>needs</em> to be put to the wide world. Listen to <strong>I Like Trains</strong>, and get pledging!</p>\n<p>I Like Trains were good enough to answer some of CitR’s questions and here is their response:</p>\n<p>CitR: How did you come up with the idea of releasing a book of essays with your début album?</p>\n<div>\n<p><strong>We printed those up for the promo copies that were going out to press.  It was so that the people reviewing the record had some idea of what we were going on about.  Some of the historical stories were reasonably well known, but most are a little obscure.  Just a little helping hand to our friends in the press!</strong></p>\n</div>\n<div>\n<p>CitR: What prerequisites would an historical figure or event have required to achieve in order for you to write a song about it?</p>\n</div>\n<div>\n<p><strong>It is difficult to put your finger on.  When I heard or read about a story I would know whether or not I could relate to the main characters, and if there was a song in there.  I think that under extreme circumstances, normal people are capable of extraordinary things, both positive and negative.  It’s these stories that really appealed.</strong></p>\n</div>\n<div>\n<p>CitR: What is the best venue or best gig you have ever played?</p>\n</div>\n<div>\n<p><strong>So many gigs, that were great for different reasons.  The one that really sticks out, is when we headlined the second stage at Off Festival in Poland.  Everything came together.  Thousands of people in a little clearing in a forest, on a big stage.  The atmosphere was electric.</strong></p>\n</div>\n<div>\n<p>CitR: How did you come up with the name and also the unusual case format (iLiKETRAiNS)?</p>\n</div>\n<div>\n<p><strong>We got rid of the unusual case formatting because we got tired of people asking this question!</strong></p>\n</div>\n<div>\n<p>CitR: I understand you are waiting to release a second album, what are we to expect from it and are there any outstanding individuals or events that you are focussing on?</p>\n</div>\n<div>\n<p><strong>Well, we have stopped looking to the past for inspiration.  This is our future album.  I have been reading books about the science of climate change, and our slow self inflicted demise dominates the record. </strong></p>\n</div>\n<div>\n<p>CitR:Where did your love of history and music stem from and when did you think you could combine them together in such a way?</p>\n</div>\n<div>\n<p><strong>I’m not entirely sure.  Music has been a constant.  My older brother had a big record collection that I would pour over, and he encouraged me to start playing guitar.  History wasn’t something I studied.  I’m interested in people and stories.  I realised that these people had a much more interesting life story than I would ever have, and yet most people had never heard of them.  That spurred me on to discover more and more ‘lost’ stories to re tell.  Bring these people back to life so to speak.</strong></p>\n</div>\n<div>\n<p>How would you describe your genre as: ‘post-rock’, ‘library rock’ or something else?</p>\n</div>\n<div>\n<p><strong>I wouldn’t.  Genres are for journalists!</strong></p>\n</div>\n<div>\n<p>CitR: If you could describe your band in three words to entice new fans, what would they be?</p>\n</div>\n<div>\n<p><strong>Intelligent.  Dark.  Dynamic.</strong></p>\n</div>\n<div>\n<p>CitR: You have used unusual and clever ideas such as a single’s B-side being the same story from a contrasting viewpoint, how did you think of such a different way of creating music and have you any new ideas for upcoming releases?</p>\n</div>\n<div>\n<p><strong>That particular idea was pretty obvious to us.  Every story has at least two sides, and conveniently so does a pop single.  Likewise with the new album.  It seemed pretty obvious that after looking to the past for inspiration for so long, it was a logical move to start looking forwards.  The difficulty will come with the 3rd album, but I’m sure that something obvious will reveal itself in good time!</strong></p>\n</div>\n<div>\n<p>CitR: When I bought your album, Elegies to Lessons Learnt, I researched the people and events you described, is this your intention in creating this music, to make people take a greater interest in history?</p>\n</div>\n<div>\n<p><strong>Absolutely.  I like to think that these songs reward the listener who digs a little deeper.  The new record is a little less obvious in its themes.  I made a conscious decision to be a little more cryptic in my lyric writing so that people can make their own decisions as to what the songs are about.  Maybe one day I will reveal more.</strong></p>\n</div>\n<div>\n<p>CitR: If you could have any superpower what would it be?</p>\n</div>\n<div>\n<p><strong>I would like for everything I touch to turn to gold.  I can’t see how that could possibly go wrong.</strong></p>\n</div>\n<div>\n<p>CitR: What is your most embarrassing moment on stage?</p>\n</div>\n<div>\n<p><strong>Probably when we were playing in Sheffield and for some reason I said ‘hello Southampton’.  I think that the other boys in the band were more embarrassed than I was.  It led to some good banter.  We haven’t played a great deal in Sheffield since though…</strong></p>\n</div>\n<p>Pledge here @ <a href=\"https://www.pledgemusic.com/projects/iliketrains\">https://www.pledgemusic.com/projects/iliketrains</a></p>\n<p>Go to their official site @ <a href=\"https://www.iliketrains.co.uk/\">https://www.iliketrains.co.uk/</a></p>\n<p>Visit their Myspace @ <a href=\"https://www.myspace.com/iliketrains\">https://www.myspace.com/iliketrains</a></p>\n","slug":"2653-interview-i-like-trains","category":"interviews","date":1283004845000,"wpid":2653,"isSticky":false,"featured_image":{"width":522,"height":365,"src":"2010/08/ilt1.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAMG/8QAHxAAAgIBBQEBAAAAAAAAAAAAAQIDBBEABQYHQRIh/8QAFQEBAQAAAAAAAAAAAAAAAAAAAAH/xAAXEQEBAQEAAAAAAAAAAAAAAAABAAJB/9oADAMBAAIRAxEAPwCPIOy9sWK5PW5Du0deeGC1GEaQyqTJhkXK4ClHLEZ8AyPMPc7M2JLc61bHIpa6uwjkNpVLLn8OPg4yPM6aaJU0nb//2Q=="},"createdAt":1587295023809,"updatedAt":1588403564368,"author":"5e9b68b27a1236eccfeb1d07","old_image":"2010/08/ilt1.jpg","categories":["interviews","music"]}