{"id":"5e9c0213774c2610387e48a1","artists":["5e9b69257a1236eccfeb236b"],"title":"New: Mykki Blanco – She Gutta (Prod. Jeremiah Meece)","content":"<p>This latest release from the cross-dressing performance alter ego of Michael Quattlebaum Jr.</p><p>, Mykki Blanco, sees her team up with Jeremiah Meece, formerly Jeremiah Chrome of Chicago-based production duo The-Drum. The punchy, pounding four-minute track works as an impressive snippet of, as well as partial statement of intent for, the pair’s imagined year to come, with 2014 looking a promising one for these two some-way-established and currently rising artists.</p>\n<p><iframe src=\"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/44084948&auto_play=false&hide_related=false&visual=true\" height=\"450\" width=\"100%\" frameborder=\"no\" scrolling=\"no\"></iframe></p>\n<p>Blanco enjoyed a successful 2013, after the 2012 release of her mixtape ‘Cosmic Angel:The Illuminati Prince/ss’ and 2011’s ‘From the Silence of Duchamp to the Noise of Boys’, a book of poetry which encompasses another facet of her flamboyant live performances. 2013 saw the ‘Betty Rubble: The Initiation EP’ received well and tracks like ‘Wavvy’ (above) hit a nice crossing point between the experimental fluidity and boldness of New York underground hip hop and the slick, sharp production of much current pop. As part of The-Drum, Meece and Brandon Boom released ‘Contact’ last July, an interesting part-concept record combining a variety of influences. The two have also poured their energies into several side projects, including all-male outfit JODY and Clique Talk. Now Meece looks to go it alone with a recent cache of production mixes and edits, and a debut album due to be released at the start of this year.</p>\n<p><iframe src=\"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/131725494&auto_play=false&hide_related=false&visual=true\" height=\"450\" width=\"100%\" frameborder=\"no\" scrolling=\"no\"></iframe></p>\n<p>…Back to ‘She Gutta’, though. The murky, throbbing centre of this track is prefaced by thirty seconds of enveloping sonic effects and the creaking groans of vocal samples that sit recognisably with both the output of Blanco and recent US hip hop in general. Elements of Chicago electronica and bombastic horns – that don’t sound a million miles away from the production features on certain tracks in ‘Yeezus’ – are there making their impact felt throughout the song. And this tough backing is followed up by a growing tenacity in the energetic glam-drag performer, who rhymes critically about the obstacles of social prejudice and vampirish characters both inside and outside of the music industry: “they stakin’ what they makin’ ’cause they snakes and they ain’t making shit”. Blanco’s volatile raps work well over an intoxicating smog of blurring beats and sampled vocals. The final package (linked just above) is totally absorbing and entertaining, to boot.</p>\n<p><iframe width=\"100%\" height=\"450\" scrolling=\"no\" frameborder=\"no\" src=\"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/122832919&auto_play=false&hide_related=false&visual=true\"></iframe></p>\n<p>The track itself is intriguing and instantly likeable, marrying Blanco’s growing confidence and dexterity as rapper and all-round artist with the production talents of Meece, who himself recently produced a mixtape with emerging Chicago rapper KIT. But more interesting is the nod it makes towards the trajectory of these two over the course of 2014, as both are very much worth keeping an eye on. Meece at the start of the month dropped a collection of edits (you can listen to ‘Summer Fling’ from that offering, posted above) and his album is due out very soon. For Blanco, what is immediately in the offing is less clear. She has repeatedly voiced her intention to not sell out, and following a number of successful records, live performances, and one-off tracks like this one, it’ll be interesting to see what shape her next conception will take.</p>\n","slug":"26552-new-mykki-blanco-prod-jeremiah-meece-gutta","category":"music","date":1391802561000,"wpid":26552,"isSticky":false,"featured_image":{"width":583,"height":358,"src":"2014/02/mykki-blanco-.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAGAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAUG/8QAIRAAAgEDAwUAAAAAAAAAAAAAAQIDAAQRBSExBhITIsL/xAAUAQEAAAAAAAAAAAAAAAAAAAAF/8QAFhEBAQEAAAAAAAAAAAAAAAAAAQIA/9oADAMBAAIRAxEAPwCFq/Ues3d7DdJqEoisyHjhPr5ctkiQg77jnHBNbZL4OiszyBiMkDuP1SlKzSrg0CTf/9k="},"createdAt":1587282451604,"updatedAt":1588403519627,"author":"5e9b68b27a1236eccfeb1d4a","old_image":"2014/02/mykki-blanco-.jpg","categories":["music","new"]}