{"id":"5e9c01fa774c2610387e4873","artists":["5e9b69637a1236eccfeb274b"],"title":"Interview: Younghusband","content":"<p>Younghusband’s ‘Dromes’ was one of my favourite releases of last year.</p><p> The album blends 60s pop sounds with 90s-infuenced shoegaze and is fantastic from start to finish. I managed to catch-up with Euan, Adam, Joe and Pete of the London-based band before their show at Madame JoJo’s in Soho.</p>\n<p><strong>Callum – I’m sure you guys have been asked pretty much the same questions again and again, so I’m gonna try and keep it lighthearted. Still, I might start with a few of the standards. Who would you say are your biggest influences?</strong></p>\n<p><strong>Euan</strong> – Wire, Beach Boys, Television Personalities and Yo La Tengo.</p>\n<p><strong>Pete</strong> – Birthday Party.</p>\n<p><strong>C – What are your current favourite bands?</strong></p>\n<p><strong>Joe</strong> – I’d say Cate Le Bon, but it’s a tough question. It’s like that feeling walking into a record shop and instantly forgetting what music you want to buy.</p>\n<p><strong>C – Exactly, it’s like being asked what your favourite film is and even if you’ve just been talking to someone about it, your mind goes blank.</strong></p>\n<p><strong>E</strong> – I’ve been listening to a lot of Julia Holter.</p>\n<p><strong>J</strong> – Pretty much everything Ty Segall does.</p>\n<p>C – I feel that, it’s amazing how he puts out so many albums that good, I’ve got no idea how he does it. Where did the album title ‘Dromes’ come from?</p>\n<p><strong>E</strong> – Not really sure, it’s a mixture of drones and dreams. Also, an aerodrome as a place of departure resonated. Just think it sums of the music really well.</p>\n<p><strong>C – What are your biggest interests outside of music, do you have any hidden talents?</strong></p>\n<p><strong>P</strong> – Hidden talents… shit.</p>\n<p><strong>J</strong> – *chuckles* I like cooking.</p>\n<p><strong>P</strong> – You’re good at cooking man.</p>\n<p><strong>C – Anything in particular you like cooking?</strong></p>\n<p><strong>J</strong> – Pies</p>\n<p><strong>C – What other band names did you try before Younghusband?</strong></p>\n<p><strong>E</strong> – Pink Saris</p>\n<p><em>*at this point music starts playing loudly*</em></p>\n<p><strong>J</strong> – This gonna be alright?</p>\n<p><strong>C </strong>– Dunno, might drown the recording out.</p>\n<p><strong>P</strong> – You gonna notate it after this?</p>\n<p><strong>C – Yeah.</strong></p>\n<p><strong>P</strong> – It’ll be fine then.</p>\n<p><em>*and it was*</em></p>\n<p><strong>C – What do you reckon the grimiest place you’ve ever played is?</strong></p>\n<p><strong>E</strong> – The Hull Adelphi.</p>\n<p><strong>A</strong> – That place’s fucking grimy.</p>\n<p><strong>E</strong> – Yeah, it’s great, but really dirty. The first time I ever played there was there this moat of mud and shit going around the whole venue. You had to walk across bits of wood to get into it.</p>\n<p><strong>P</strong> – You ever play it when the dog was on the roof?</p>\n<p><strong>E</strong> – Nah…</p>\n<p><strong>P</strong> – Well, this dog used to hang out up there. It was deaf apparently. It was the venue’s dog and it was this big fucking thing that would just bark and bark all night. Got to say though, I often find it’s the grimy venues you get looked after really well in. I think it’s cos they’re independent and run by people who love music, rather than places like the O2. They’ve just got more soul.</p>\n<p><strong>J</strong> – I think the Hull Adelphi is owned by Paul Heaton out of the Beautiful South.</p>\n<p><strong>P</strong> – He funds it.</p>\n<p><strong>J</strong> – Ahhhh.</p>\n<p><strong>P</strong> – The guy who runs it is called Paul too and he’s a great guy.</p>\n<p><strong>J</strong> – Yeah, whenever we play there he always buys us curry and stuff.</p>\n<p><strong>P</strong> – The Shacklewell Arms, that’s pretty filthy.</p>\n<p><strong>J</strong> – Great place to play though.</p>\n<p><strong>C – Yeah I like it there, it’s a good spot. What are your plans for the future?</strong></p>\n<p><strong>E</strong> – Got a lot of shows coming up, we’re going on tour with Cloud Control in mid-Feb and then we’re going to Europe with Toy.</p>\n<p><strong>C – Cool, well that’s all the boring ones done, thanks for getting through it! I read your name came from ‘Seven Years in Tibet’, so, on that note, if you could choose one fictional character to be in the band, who’d it be?</strong></p>\n<p><strong>E</strong> – TinTin.</p>\n<p><strong>J</strong> – Jesus Christ.</p>\n<p><strong>C – Ha, suppose you’d have a pretty big ready-made fan base with Jesus in the band.</strong></p>\n<p><strong>P</strong> – And his carpentry skills would come in handy.</p>\n<p><strong>C – No doubts, he could build you a stage wherever you wanted and you’d never have to worry about food.</strong></p>\n<p><strong>J</strong> – It’s a tough one on the spot.</p>\n<p><strong>E</strong> – Adam who do you think you’d like?</p>\n<p><strong>A</strong> – Ha, I’ve got no idea, sorry.</p>\n<p><strong>E</strong> – Barry from Eastenders.</p>\n<p><strong>J</strong> – Barry from Eastenders would be good! Did you hear about that? When he sang on some sports thing?</p>\n<p><strong>E</strong> – Yeah, he sang at the indoor bowls world final.</p>\n<p><strong>P</strong> – Did he? What did he sing?</p>\n<p><strong>E</strong> – It’s the oddest thing I’ve ever seen in my life. He sang a really famous song, I forget what it was.</p>\n<p><strong>A</strong> – Any good?</p>\n<p><strong>E</strong> – It was fucking weird. There were loads of shots of the audience looking really embarrassed as he’s sweating and singing.</p>\n<p><strong>J</strong> – And he’s taking it really seriously?</p>\n<p><strong>E</strong> – Yeah, and at the end he was like “HAVE A GREAT AFTERNOON”, walks off and the bowls just started happening.</p>\n<p><strong>P</strong> – Is he into indoor bowls?</p>\n<p><strong>E</strong> – No idea.</p>\n<p><strong>J</strong> – He probably got paid for it.</p>\n<p><strong>E</strong> – Yeah, £500.</p>\n<p><strong>C – Maybe he did it for the love of bowls?</strong></p>\n<p><strong>E</strong> – It’s possible.</p>\n<p><strong>C – What’s the greatest film ever made?</strong></p>\n<p><strong>J</strong> – Paris, Texas or Midnight Cowboy?</p>\n<p><strong>E</strong> – I was gonna say Paris, Texas.</p>\n<p><strong>P</strong> – The best film ever made right? Not necessarily your favourite film?</p>\n<p><strong>E</strong> – Space Odyssey?</p>\n<p><strong>J</strong> – I dunno man, maybe it’s too new to say it’s the greatest film ever made, but Melancholia by Lars Von Trier is amazing.</p>\n<p><strong>E</strong> – Fuuuck, Easy Rider?</p>\n<p><strong>J</strong> – First use of glare in that.</p>\n<p><strong>P</strong> – Accidental though?</p>\n<p><strong>J</strong> – Yeah, it was completely accidental, they kept it in because they thought it looked cool.</p>\n<p><strong>C – Stallone, Statham or Schwarzenegger?</strong></p>\n<p><strong>J</strong> – Schwarzenegger.</p>\n<p><strong>P</strong> – Schwarzenegger.</p>\n<p><strong>E</strong> – Schwarzenegger.</p>\n<p><strong>P</strong> – Junior, what a film!</p>\n<p><strong>J</strong> – Total Recall!</p>\n<p><strong>P</strong> – You can’t put Statham on that list!</p>\n<p><strong>C – You definitely can, Statham’s the modern day action hero.</strong></p>\n<p><strong>P</strong> – No way.</p>\n<p><strong>E</strong> – They were all in The Expendables.</p>\n<p><strong>J</strong> – Also, Schwarzenegger’s a bit of a perv.</p>\n<p><strong>P</strong> – Did you see the thing where he went to Brazil?</p>\n<p><strong>J</strong> – Yeah, there’s this thing where Schwarzenegger goes to Brazil to make a film for tourists of brazil and he’s basically just getting drunk and letching on these girls.</p>\n<p><strong>C – You guys ever seen Pumping Iron? It’s this documentary about him training for bodybuilding competitions. There are some great scenes, there’s one when he’s talking about lifting weights and *puts on shitty german accent* “it’s as satisfying as cumming, I’m getting the feeling of cumming in the gym.”</strong></p>\n<p><strong>J</strong> – It’s gotta be Schwarzenegger then, I don’t think Stallone is as nuts as that.</p>\n<p><strong>P</strong> – So we’re in agreement then? Schwarzenegger.</p>\n<p><strong>C – If you could get one actor to do a spoken word intro on your next album, who would you choose?</strong></p>\n<p><strong>J</strong> – William Shatner.</p>\n<p><strong>E</strong> – Nah, Schwarzenegger.</p>\n<p><strong>P</strong> – Dustin Hoffman.</p>\n<p><strong>J</strong> – Woody Allen/</p>\n<p><strong>C – What about Christopher Walken?</strong></p>\n<p><strong>All</strong> – Ahhhh!</p>\n<p><strong>J</strong> – That’s a big shout.</p>\n<p><strong>E</strong> – Done us.</p>\n<p><strong>P</strong> – Ha!</p>\n<p><strong>J</strong> – But William Shatner would be great.</p>\n<p><strong>C – Who’d win in a fight, Springsteen or Dylan?</strong></p>\n<p><strong>E</strong> – Dylan, he’d talk him down.</p>\n<p><strong>J</strong> – I dunno, Springsteen.</p>\n<p><strong>P</strong> – Dylan’s tasty.</p>\n<p><strong>J</strong> – No he’s not, he’s old!</p>\n<p><strong>C – We can say they’re both in their prime to make it interesting.</strong></p>\n<p><strong>J</strong> – Then it’s definitely Springsteen in a physical fight. Maybe not in a fight of words.</p>\n<p><strong>E</strong> – I don’t know, I think Dylan would win.</p>\n<p><strong>J</strong> – Why?</p>\n<p><strong>E</strong> – In a film scenario, both in their prime, Springsteen would be trying to grab him and Dylan would be hopping onto railings, shouting things down at him and skipping round.</p>\n<p><strong>P</strong> – Dylan would be a dirty fighter, a hair-puller.</p>\n<p><strong>E</strong> – Yeah, just killing him with words. Springsteen would just start crying after Dylan insults his, I dunno, his “papa”. Game over.</p>\n<p><strong>J</strong> – But if Springsteen gets hold of Dylan…</p>\n<p><strong>E</strong> – He’ll kill him.</p>\n<p><strong>P</strong> – It’d be a draw.</p>\n<p><strong>E</strong> – You could make the whole fight into a musical, like a Westside Story.</p>\n<p><strong>C – If Younghusband were any fruit or vegetable, what would they be?</strong></p>\n<p><strong>J</strong> – Grapefruit.</p>\n<p><strong>A</strong> – Nahhh, plum!</p>\n<p><strong>E</strong> – Banana.</p>\n<p><strong>J</strong> – Why?</p>\n<p><strong>E</strong> – I like ’em.</p>\n<p><strong>J</strong> – Fruit salad.</p>\n<p><strong>C – So, final question. If you had a boat and took it into international waters, what would you do?</strong></p>\n<p><strong>J</strong> – Can you do anything?</p>\n<p><strong>C – Yeah, Sea Law, if that’s a thing.</strong></p>\n<p><strong>E</strong> – More of the same, really, but we’d get away with it. More of the same.</p>\n","slug":"26693-interview-younghusband","category":"interviews","date":1392292277000,"wpid":26693,"isSticky":false,"featured_image":{"width":100,"height":100,"src":"2014/02/younghusband1-100x100.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAABgf/xAAiEAACAQQCAQUAAAAAAAAAAAABAgMEBREhABIGBzFBUYH/xAAVAQEBAAAAAAAAAAAAAAAAAAACBf/EAB0RAAICAQUAAAAAAAAAAAAAAAECAAMEERUxkdH/2gAMAwEAAhEDEQA/ABVqstJJe5bRA8D1g7LGQx6u4zkHWvY8Zp6XSsimSppVcjLLknB+uTG2yyQ+XXCaGR45VmqeroxDDfwf08tVPVVDQRlp5SSoJJc71yRZQqtoINixGPB7Ps//2Q=="},"createdAt":1587282426967,"updatedAt":1588403519285,"author":"5e9b68b27a1236eccfeb1d11","old_image":"2014/02/younghusband1-100x100.jpg","categories":["interviews","music"]}