{"id":"5e9c01e9774c2610387e4850","title":"Exhibition Review: You Don’t Need a Weather Man to Tell You Which Way the Wind Blows","content":"<p>I’m looking at two deer, their heads turned from me.</p><p> Two black and white photographs of the same deer?  Together they murmur incongruence. The mysterious dainty heads against the patterned formations of the paving stones. <strong>Joseph Lempart</strong>’s photographs examine the friction between human and animal activity, how they transform each other’s environments. The question asked is what are the conditions of our environment? What is inescapably present? Both mirroring and change are what I see here. Another duo of narratives linked together are the two screens of <strong>Helen Cammock</strong>’s <i>The Singing Will Never Be Done,</i> which echo different racial voices through the prism of the family.  We hear a part of Enoch Powell’s late 1960s <i>Rivers of Blood </i>speech which reflected the terror of many native British people at the sudden influx in immigration.  Paralleled in the natural world, we are shown the miraculous and unsolved appearance of green parakeets in West London. They serve here as a reminder of the unstoppable tide of changing demography. There is a plea for adaptability- life goes on whilst we look at the artists’ mother tending to her garden.</p>\n<p>The title of the exhibition<i>, <strong>You Don’t Need a Weather Man to Tell Which Way the Wind Blows </strong></i>Is taken form the Bob Dylan song <i>Subterranean Homesick Blues</i>, written at the time of the American Civil Rights Movement. These lyrics are a calling for the younger generation to make up their own minds about the political changes around them. The exhibition not only references this viewpoint, but shows works by artists who deploy animals to speak of moments of change.  Perhaps the instinctual ability to simply just look and see for ourselves, is more akin to our natural animal relations than the social environments we have constructed.</p>\n<p><strong>Knut Henrik</strong>‘s Elephant sculpture is made up of precisely cut planks of wood. Using the wall as support, the timber pieces are structured into a gradual slope that forms a half cylindrical head, with the last piece, the trunk, resting on the floor. My eye wanders around it and it teases for me to dig here, behind it, to see how it may be imbued into the rest of the building. The bronze sculptures of <strong>Andrea Büttner</strong>’s, <i>Table Decorations, </i>are<i> </i>cast zebra droppings from her local zoo in Frankfurt, suggesting value and change. They speak of the unstoppable processes  within the Earth which turn all living life into mineral and living life again. Everything is used.</p>\n<div id=\"attachment_26713\" style=\"width: 270px\" class=\"wp-caption aligncenter\"><a href=\"https://api.crackintheroad.com/uploads/2014/02/IMG_4361.jpg\"><img aria-describedby=\"caption-attachment-26713\" class=\"size-medium wp-image-26713    \" title=\"Andrea Büttner's 'Table Decorations'\" alt=\"IMG_4361\" src=\"https://api.crackintheroad.com/images/2014/02/IMG_4361-260x173.jpg\" width=\"260\" height=\"173\" /></a><p id=\"caption-attachment-26713\" class=\"wp-caption-text\">Andrea Büttner’s ‘Table Decorations’</p></div>\n<p>The importance of environment in shaping ourselves is also carried within <strong>Bruno Pacheco</strong>’s <i>Whale</i>, a small painting of the beached animal taken from a found photograph of the larger work displayed at the Serralves Museum in Portugal. The moment of the whale’s beaching is the moment of it’s transformation from weightlessness in water to deathly disability on shore. The Artist and philosopher Pierre Huyghe, also in the exhibition, with <i>A Way to Untilled,</i> once spoke of his work as a suspending of time, ‘suspend[ing] the moment of the opening forever. It’s an endless opening.’ If what we are looking at in some of these works is the moment of change, suspended for us to see, then we see the very timelessness of this change.</p>\n<p> </p>\n<div id=\"attachment_26714\" style=\"width: 270px\" class=\"wp-caption aligncenter\"><a href=\"https://api.crackintheroad.com/images/2014/02/IMG_4372.jpg\"><img aria-describedby=\"caption-attachment-26714\" class=\"size-medium wp-image-26714  \" title=\" Bruno Pacheco’s 'Whale' and Knut Henrik's 'Elephant' \" alt=\"IMG_4372\" src=\"https://api.crackintheroad.com/images/2014/02/IMG_4372-260x173.jpg\" width=\"260\" height=\"173\" /></a><p id=\"caption-attachment-26714\" class=\"wp-caption-text\">Bruno Pacheco’s ‘Whale’ and Knut Henrik’s ‘Elephant’</p></div>\n<p> </p>\n<p>Huyghe’s video of his created landscape at <i>Documenta </i>shows us a place outside of culture yet deeply informed by it. A representation of timelessness, we see the layered activity of insects, a dead mouse and aphrodisiacal plants amongst a dumping ground for building materials. Whilst bees scuttle across the secret folds of a beehive-headed statue, the Tarkovskyian appearance of a gaunt white dog with one painted pink leg acts as an inexplicable navigator in the <i>Way of Untilled. </i>The dog is a massive reference to Tarkovsky’s <i>Stalker</i>, to cinema itself. But culture is not a dead-end quoting machine. It creates through re-using itself, just as much as the bugs in this place. We are deeply embedded into our environments, culturally or otherwise, like the whale in Pacheco’s painting.</p>\n<div id=\"attachment_26715\" style=\"width: 270px\" class=\"wp-caption aligncenter\"><a href=\"https://api.crackintheroad.com/images/2014/02/IMG_4343.jpg\"><img aria-describedby=\"caption-attachment-26715\" class=\"size-medium wp-image-26715   \" title=\"Pierre Huyghe's film, 'Way of Untilled'\" alt=\"IMG_4343\" src=\"https://api.crackintheroad.com/images/2014/02/IMG_4343-260x173.jpg\" width=\"260\" height=\"173\" /></a><p id=\"caption-attachment-26715\" class=\"wp-caption-text\">Pierre Huyghe’s film, ‘Way of Untilled’</p></div>\n<p> </p>\n<p>This twilight zone, between creation and collapse, is formed too in the exasperated mini landscapes of<strong> Aaron Angell</strong>’s sculptures. Looking at them I want to laugh. The use of clay in making these objects makes me think of hobbyists, kitsch decorations in second-hand shops and car-boot sales that nobody really wants. There is a narrative in these little tableaux’s of drooping wheels and toadstools. Angell has suggested that they are a ‘maquette for bad ideas,’ How do we judge these? Are they unfinished or in bad taste?</p>\n<div id=\"attachment_26716\" style=\"width: 270px\" class=\"wp-caption aligncenter\"><a href=\"https://api.crackintheroad.com/images/2014/02/IMG_4389.jpg\"><img aria-describedby=\"caption-attachment-26716\" class=\"size-medium wp-image-26716  \" title=\"Aaron Angell's sculptures\" alt=\"IMG_4389\" src=\"https://api.crackintheroad.com/images/2014/02/IMG_4389-260x173.jpg\" width=\"260\" height=\"173\" /></a><p id=\"caption-attachment-26716\" class=\"wp-caption-text\">Aaron Angell’s sculptures</p></div>\n<p> </p>\n<p>Our need to interact with our environment, to categorize its worth to us is explored through the behavior of flocking pelicans, a parallel of housewives who are <i>Charming for the Revolution </i>in <strong>Pauline Boudry and Renate Lorenz</strong>’s film.<i> </i>Using the pelican as a symbol for an ineffective crowd-pleasing milleu, we are shown enactment, drag, and a dandy of the 19<sup>th</sup> Century described by Walter Benjamin as walking a tortoise on a leash in protest against the workings of industrialization. Animals in the works of these artists are used to confront a reality, to recalibrate oneself or to describe a state of mind.</p>\n<div id=\"attachment_26717\" style=\"width: 270px\" class=\"wp-caption aligncenter\"><a href=\"https://api.crackintheroad.com/images/2014/02/IMG_4427.jpg\"><img aria-describedby=\"caption-attachment-26717\" class=\"size-medium wp-image-26717  \" title=\"Pauline Boudry and Renate Lorenz’s film, 'Charming for the Revolution'\" alt=\"IMG_4427\" src=\"https://api.crackintheroad.com/images/2014/02/IMG_4427-260x173.jpg\" width=\"260\" height=\"173\" /></a><p id=\"caption-attachment-26717\" class=\"wp-caption-text\">Pauline Boudry and Renate Lorenz’s film, ‘Charming for the Revolution’</p></div>\n<p>The exhibition is about many things; looking at animals we could go almost anywhere. It is through confrontation with change and our grasping of understanding that is the consistent subject reflected in the title of <i>A Way to Untilled. </i></p>\n<p>It is in<i> The Singing </i>[that]<i> Will Never Be Done.</i></p>\n<p>Check out the exhibition at Hollybush Gallery, 17<sup>th</sup> January- 22<sup>nd</sup> February.</p>\n<p>For more info click <a href=\"https://hollybushgardens.co.uk/\">HERE</a>.</p>\n<div id=\"attachment_26718\" style=\"width: 270px\" class=\"wp-caption aligncenter\"><a href=\"https://api.crackintheroad.com/images/2014/02/IMG_4377.jpg\"><img aria-describedby=\"caption-attachment-26718\" class=\"size-medium wp-image-26718 \" title=\"Joseph Lempart and Aaron Angell\" alt=\"IMG_4377\" src=\"https://api.crackintheroad.com/images/2014/02/IMG_4377-260x173.jpg\" width=\"260\" height=\"173\" /></a><p id=\"caption-attachment-26718\" class=\"wp-caption-text\">Joseph Lempart and Aaron Angell</p></div>\n<p> </p>\n","slug":"26711-exhibition-review-dont-need-weather-man-tell-way-wind-blows","category":"arts","date":1392461145000,"wpid":26711,"isSticky":false,"featured_image":null,"createdAt":1587282409896,"updatedAt":1587825854016,"author":"5e9b68b27a1236eccfeb1d21","categories":["arts"]}