{"id":"5e9c332c9b6559241525e001","title":"The Last of The Libertines?","content":"<img class=\"alignnone\" title=\"The Libs\" src=\"https://img.</p><p>metro.co.uk/i/pix/2010/08/10/article-1281440031593-08F2FC11000005DC-870378_636x377.jpg\" alt=\"\" width=\"636\" height=\"377\" />\n<p>If like thousands across the UK, you’ve tuned in to any of the<strong> Reading & Leeds Festival</strong> coverage, or you were lucky enough to have attended the events, then you will no doubt have been somewhat caught up in the “heroic” returns of <strong>The Libertines, Gun ‘n’ Roses</strong> and<strong> Blink 182</strong>. Unfortunately for me, I couldn’t help but watch on jealously from the comfort of my own armchair.<strong> </strong>A pitifully overweight <strong>Axl Rose</strong> painted a forlorn figure as he awkwardly strutted around the stage, racing through the few tracks that any of the sizable crowd did recognize, dollar signs so unashamedly lit up in his eyes. <strong>Blink 182 </strong>appeared rather more enthused, however still lacked the true raw energy which made their original songs so quirky and undeniably humorous. So it was with gritted teeth that I viewed the performance from<strong> The Libertines</strong>, for all the hype, a lackluster show appeared on the cards.</p>\n<p>It’s no coincidence that the revival of <strong>The Libertines</strong> came exactly when several of the band members were in financial trouble, never mind the fact that none of them had anything else going for them musically what with the swift demise of Dirty Pretty Things and the monumental failure that called itself<strong> Doherty’s </strong>solo career. <strong>Babyshambles</strong> achieved minimal success however they are yet to write a song that even touches the potential portrayed by his previous outfit. So when Festival Republic lay £1.5million on the table in front of the band, it must have been stupendously difficult for them to resist.</p>\n<p>Believe me, I was as shocked as anyone when I tuned into <strong>The Libertines </strong>Reading performance to see what appeared to be a completely reinvigorated<strong> Doherty</strong> waltzing around the stage, arm in arm with <strong>Barat</strong>, sharing the mic in true Lennon-McCartney style; a sure indication that they had finally put their much documented past problems behind them. It was by no means a tight or transcendent performance, a complete opposite to<strong> Arcade Fire</strong> who were to precede them on the stage later that night, yet<strong> The Libertines</strong> never had that sort of unparalleled elegance or composure. It’s a real tribute to a band when they can play countless B-sides and still have the mammoth crowd chanting every word back at them. Tracks like the timeless<strong> Don’t Look Back I</strong><strong>nto The Sun </strong>and the anthemic <strong>Time For Heroes</strong> seemingly brought about the largest singalongs, with both <strong>Doherty</strong> and<strong> Barat </strong>appearing far more relaxed than they had done in the previous 7 years with their other groups. <strong>The Libertines </strong>had finally achieved what they failed to do all those years ago, play an accomplished, captivating headline show.</p>\n<p><strong> </strong></p>\n<p><strong>So please Pete, Carl, Gary and John, please leave it there. </strong></p>\n<p>Unfortunately for them, I cannot see them writing anything to the standard of their first two albums, times have changed and judging by their recent musical outings, so have their song writing abilities. With their reformation have come murmurings of another record in the works, along with the possibilities of world wide tours, however I have no doubt in my mind that they would end up like <strong>The Verve</strong> did two years ago; fading into musical obscurity, releasing a diabolic return album and exploding again in a fire ball of expanded egos and heated arguments.</p>\n<p>For all parties involved, I believe the best option here would be to wave an emotional, but thankful farewell to<strong> The Libertines</strong>. A thank you to the band who captured so many restless young hearts with their vibrant blend of heartfelt songs, their unfaltering image and their countless yet captivating problems. A brilliant, gargantuan comeback is how they should be remembered, not a band who became swamped in their own fame and finances that they turn into a tribute group to their previous greatness. Thank you Pete, Carl, Gary and John, thank you and farewell.</p>\n<p><script type=\"text/javascript\" src=\"https://video.unrulymedia.com/wildfire_11244048.js\"></script></p>\n","slug":"2671-the-last-of-the-libertines","category":"festivals","date":1283176383000,"wpid":2671,"isSticky":false,"featured_image":{"width":636,"height":377,"src":"2011/06/article-1281440031593-08f2fc11000005dc-870378_636x377.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAGAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAUH/8QAJBAAAQMCBAcAAAAAAAAAAAAAAQIDBAARBQcTIRIUIkFCQ3H/xAAVAQEBAAAAAAAAAAAAAAAAAAAEBf/EABgRAQADAQAAAAAAAAAAAAAAAAEAAhED/9oADAMBAAIRAxEAPwDO8uE4biLfJTIrkic+7qKfU5wpA6glIAvYC1/tVdSH7HpBX5HQbO/fe+9KUDoGsp1vZB2f/9k="},"createdAt":1587295020352,"updatedAt":1588403564316,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/06/article-1281440031593-08f2fc11000005dc-870378_636x377.jpg","categories":["festivals","music","reviews"]}