{"id":"5e9c332d9b6559241525e004","title":"Review: Blink 182 (Leeds Festival)","content":"<p>Over 25 million albums sold and 18 years after their inception, <strong>Blink 182 </strong>graced the <strong>Leeds Festival </strong>Main stage once again.</p><p> Reportedly brought back together by <strong>Travis</strong>‘ lucky plane crash escape, <strong>Blink 182 </strong>set about a US Tour to test the waters before deciding to go further afield. Met with massive acclaim, the band built on this wave of seeming rejuvenation and <strong>Blink 182 </strong>hype began to resurface once again. The big question still remained however; how was a pop punk band, which thrived on rebellion and being fantastically juvenile, meant to be just as convincing when the band members were all thirty somethings?</p>\n<p>Short answer: Amazingly well. <strong>Blink 182 </strong>arrived on stage with the same exuberance, albeit with a definite sense of nervousness, that we were so familiar with a decade ago. Each track was played with the same anarchistic energy that had given life to them so many years ago, with the band <strong> </strong>belting out the classics fantastically to a baying audience. However what truly made the show a <strong>Blink 182 </strong>performance was the immaturely comical banter that existed between <strong>Mark </strong>and <strong>Tom</strong>, with <strong>Tom </strong>at one point stating that he was going to ‘<strong>go down on Obama</strong>‘.</p>\n<p>However, and sadly, we must still consider time’s effects. <strong>Mark </strong>himself stated before playing ‘<strong>What’s My Age Again?</strong>‘ that this track was ‘<strong>because I am old</strong>‘. A self referential point that stuck with me for the rest of the performance, and was ever present for the occasional lyrical mistake, or musical mishap. While the band still managed to capture the spirit of their past, there is no denying we only witnessed moments of their former magnificence. Now many will reel at the suggestion that <strong>Blink 182 </strong>were ever magnificent, but the fact is they were. This magnificence was embedded in their listenability, their incredibly engaging live shows and the sheer rebellious youthfulness that was transferred into a pop punk sound not yet matched. However while they may still have their listenability and their energy, they do not have their youth. It is hard to believe tracks such as ‘<strong>What’s My Age Again?</strong>‘ with lyrics like ‘<strong>Nobody likes you when you’re 23</strong>‘, as by that logic people must really dislike you by 33, and fucking hate you by 43. And that is an age not too distant for the band members. While tracks such as ‘<strong>My First Date</strong>‘ and ‘<strong>Rock Show</strong>‘ seem archaic in their meaning, as if the band were simply reminiscing about past memories rather than actually living them. This said, there were moments where you could see this magnificence in their show, small reminders of stunning musical solos, energetic sprints across the stage, and even the lyric ‘<strong>Left me roses by the stairs</strong>‘ being replaced with ‘<strong>Left me blowjobs by the stairs</strong>‘.</p>\n<p>The band’s encore began with a, frankly, out of this world drums solo by <strong>Travis Barker, </strong>which saw him play the drums upside down 10 feet above the air in front of 85000 people. This was rightly recognized by <strong>Mark </strong>who concluded the solo with ‘<strong>Ladies and Gentlemen, the most talented member of Blink 182</strong>‘. Promptly followed by two more songs, <strong>Tom </strong>left the stage repeating ‘<strong>What a great show .. what a fucking great show!</strong>‘ And ultimately he was right, it was a fucking a great show.<strong> </strong>While it is noticeable <strong>Blink 182 </strong>are no longer the young rapscallions that they once were, by no means have they become simply a testimonial to themselves. The band managed to create the same buzz and excitement in their audience that they would have done a decade ago, and played their tracks with the same energy and enthusiasm that catapulted them to their worldwide fame. With plans for a new album and further touring, I have no doubt, barring any sudden fall outs, <strong>Blink 182 </strong>will hone their sound and become once again familiar and comfortable with their massive musical fame. However I am glad I witnessed the band before all of this, when they were still raw with nerves and trying to recapture their old sound, as these intimate indiscretions will eventually be patched and the moments of magnificence will be absorbed into <strong>Blink 182 </strong>Version 2.</p>\n","slug":"2674-review-blink-182-leeds-festival","category":"festivals","date":1283128125000,"wpid":2674,"isSticky":false,"featured_image":{"width":594,"height":440,"src":"2010/08/blink-182-.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAUG/8QAIRAAAQMEAQUAAAAAAAAAAAAAAQIDBAAFERIhBhMUFXH/xAAVAQEBAAAAAAAAAAAAAAAAAAACA//EABYRAQEBAAAAAAAAAAAAAAAAAAEAAv/aAAwDAQACEQMRAD8Axsi42pPTzEhmPo83HHk6J4JVjPB+1dtN+jeqhbhJX2UZJZHJ1FKUK7pb/9k="},"createdAt":1587295021981,"updatedAt":1588403564343,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2010/08/blink-182-.jpg","categories":["festivals","music","reviews"]}