{"id":"5e9c01e9774c2610387e484f","title":"Arts Review: Printed Matter, New York","content":"<p>Nestled among the 350 primarily commercial galleries in New York’s Chelsea district, <b>Printed Matter</b> represents a refreshing anomaly.</p><p></p>\n<p>The non-profit bookstore annually circulates over 32,000 publications on behalf of artists and small publishing channels. Representing a slice of the micro-publishing world, the 15,000 ‘labors of love’ crammed into Printed Matter’s storefront at 195 10th Avenue make for a captivating browsing experience due to the sustained intrigue of not knowing what will pop up next.</p>\n<p>Given the growing popularity of artists’ books since the 1960s, when pioneering conceptual and performance artists started to explore the book as a meaningful artwork which could be distributed widely (and often cheaply), Printed Matter has provided a space that not only allows for the dissemination of such materials, but also an invaluable platform for art to circulate outside the gallery sphere. Free from the constraints of clients and dealers, artists can disseminate material of their choosing that challenges the traditional content of the book as well as its physical and technical aspects.</p>\n<p>An explosion in self-publishing over recent years demonstrates a heightened desire for the freedom of expression that this medium allows. A renewed interested in not just artists books, but zines, periodicals, flip-books and alternative communications has made Printed Matter more pertinent than ever. To experience a physical book object is a refreshing change from staring into the backlit screens that pervade modern life and the craftsmanship and attention to detail that many of Printed Matter’s titles possess further enhance the qualities of published print. The hours slip by when browsing in the endless treasure trove of shelves and there are too many delights to mention here, these though are a few of the titles which caught my eye:</p>\n<p><i>ABSENCE</i><i> </i>by <b>J. Meejin Yoon </b></p>\n<p>As much an art object as a book, <i>ABSENCE</i> is a memorial to the twin towers of the World Trade Center. The piece recreates the towers in negative space, right from the antenna of the north tower down to an imprint of Ground Zero on the final page.</p>\n<p>At a substantial size and weight the cube-like construction of thick white card-stock makes the void inside ever more ghostly. Turning through the pages of <i>ABSENCE </i>takes us on a floor-by-floor journey of the missing buildings. The simple and streamlined structure focuses the reader on the immense tragedy of the event, allowing for uninterrupted contemplation. The books acts as a kind of invisible sculpture only fully realised by the participation of the reader.</p>\n<p><a href=\"https://api.crackintheroad.com/uncategorized/26846-arts-review-printed-matter-new-york/attachment/2005_32_alt-2/\" rel=\"attachment wp-att-26851\"><img class=\"alignnone size-full wp-image-26851\" alt=\"\" src=\"https://admin.crackintheroad.com/uploads/2014/02/2005_32_alt1.jpg\" width=\"460\" height=\"346\" srcset=\"https://api.crackintheroad.com/images/2014/02/2005_32_alt1.jpg 460w, https://api.crackintheroad.com/images/2014/02/2005_32_alt1-300x226.jpg 300w, https://api.crackintheroad.com/images/2014/02/2005_32_alt1-50x38.jpg 50w\" sizes=\"(max-width: 460px) 100vw, 460px\" /></a></p>\n<p><i>A Pocket Companion to Books from The Simpsons in Alphabetical Order </i>by <b>Olivier</b><b>Lebrun, </b>published by Rollo Press.</p>\n<p>French graphic designer Olivier Lebrun spent a period of a couple of years putting together screenshots from the Simpsons that in one way or another feature books. A jovial collection of 174 of Lebrun’s favorite images, the books range from ‘The Holy Bible’ to ‘The 10 Do’s & 500 Don’ts of Knife Safety’. The bizarre guide is one of the reasons people continue to get excited about zines and it has proved so popular that a second book <i>Another Companion to Books from The Simpsons in Alphabetical Order </i>was produced in November last year featuring a further 216 fictional publications.</p>\n<p><a href=\"https://api.crackintheroad.com/images/2014/02/091.jpg\"><img class=\"alignnone size-large wp-image-26847\" alt=\"091\" src=\"https://api.crackintheroad.com/images/2014/02/091-640x386.jpg\" width=\"640\" height=\"386\" /></a></p>\n<p><i>B.L.A.D. : Muscle Temple, No. 8</i> by <b>Blank Blank, Sex Tags</b></p>\n<p><i>“Imagine walking through your local beach or neighbourhood swimming area… Friends noticing your titanic legs, your manly shoulders, rock hard stomach muscles, and last but not least, your full high-peaked biceps that attract second glances from all!”</i></p>\n<p>Dedicated to the intriguing world of bodybuilding, this issue of B.L.A.D. delves into the enhancement of the body and muscles. The A6 booklet entitled <i>Muscle Temple </i>brings together adverts, features and editorials of all things flexed. Other B.L.A.D. issues include: <i>Inflatable! Sexciting!, The Complete Guide To Mushrooms</i> and <i>Rat Salad</i>. The word ‘blad’ means magazine or leaf in Norwegian, and as a nice little touch a real leaf is included in the book.</p>\n<p><a href=\"https://api.crackintheroad.com/images/2014/02/musceltemple01.jpg\"><img class=\"alignnone size-full wp-image-26850\" alt=\"musceltemple01\" src=\"https://api.crackintheroad.com/images/2014/02/musceltemple01.jpg\" width=\"458\" height=\"366\" srcset=\"https://api.crackintheroad.com/images/2014/02/musceltemple01.jpg 458w, https://api.crackintheroad.com/images/2014/02/musceltemple01-300x240.jpg 300w, https://api.crackintheroad.com/images/2014/02/musceltemple01-50x40.jpg 50w\" sizes=\"(max-width: 458px) 100vw, 458px\" /></a></p>\n<p>As well as its store, <b>Printed Matter</b> also runs two book fairs in New York and LA. Ever-expanding the New York fair received over 27,000 visitors last year, and has an active program of exhibitions, talks, workshops, book launches and performances.</p>\n<p>Artists books, in their varying shapes and sizes, can be a compelling vehicle for the transferal of information, giving a voice to the unrepresented and marginalised, allowing for a democratic dispersal of ideas from the social and political to the just plain silly.</p>\n<p>Printed Matter is located at 195 Tenth Avenue, New York, NY 10011.</p>\n<p>For more information including opening hours, click <a href=\"https://printedmatter.org/visit_the_store\">here</a>.</p>\n<p><a href=\"https://api.crackintheroad.com/images/2014/02/Book-Board.jpg\"><img class=\"alignnone size-large wp-image-26855\" alt=\"Book Board\" src=\"https://api.crackintheroad.com/images/2014/02/Book-Board-640x425.jpg\" width=\"640\" height=\"425\" /></a></p>\n","slug":"26846-arts-review-printed-matter-new-york","category":"reviews","date":1392660848000,"wpid":26846,"isSticky":false,"featured_image":null,"createdAt":1587282409466,"updatedAt":1588441760279,"author":"5e9b68b27a1236eccfeb1d0a","old_image":"2014/02/printed-matter-header-photo-950x630.jpg","categories":["reviews","arts"]}