{"id":"5e9c33299b6559241525dffb","artists":["5e9b69637a1236eccfeb274f"],"title":"Interview: Youth Pictures Of Florence Henderson","content":"<img class=\"alignnone\" title=\"YPOFH\" src=\"https://c4.</p><p>ac-images.myspacecdn.com/images02/113/l_3efd2b1f0f094df699ea01ca80a38433.jpg\" alt=\"\" width=\"600\" height=\"426\" />\n<p>Having already made a name for themselves in Norway, 7 piece post-rock outfit <strong>Youth Pictures Of Florence Henderson</strong> are gearing up to break the UK. With their debut record released to rapturous reviews and their new self titled album split in two parts Puzzle / The Detective released earlier this year, they are the star in the crown of the fantastic<strong> How Is Annie </strong>records. Fusing an intriguing synthesis of post-rock, folk and rock, <strong>YPOFH </strong>create a sound that is both encapsulating and inspiring. <em><strong>Crack in the Road</strong></em> were lucky enough to get a few questions answered by drummer Morten.</p>\n<p><em>Crack in the Road: At the moment the music scene in Norway is arguably as strong as it  has ever been, what reasons do you think there are for this? </em></p>\n<p>I’m not sure exactly how strong it really is, but there are a lot of  people playing in bands and expressing themselves through music these  days. How well they’re doing is another matter entirely. One of the  reasons many scenes are growing in Norway is the financial state of our  country. The Norwegian economy is very solid and people are relatively  well off. Our basic needs are filled, and more and more people are  looking for fulfilment through other aspects of life. Just take a look  at out art schools, they’re packed. But although a lot of people are  playing music, which is great, there are also people playing music that  should never have picked up an instrument. It might seem like a harsh  and cocky thing to say, but it’s true, and the sheer number of more or  less qualified musicians might be the reason the music scene appears to  be strong, I don’t know. For me personally, it’s been a long time since  I’ve been amazed by a Norwegian artist, but hey, most Danes don’t think  they have any good movie directors either, and they arguably do! And  of-course we have the same problem as everywhere else: Business kills,  or at least overshadows, good music. Anyway, check out Norwegian acts  like Team Me, Monzano, Kråkesølv and Dominic – or old heroes like Catena  Collapse and Angora Static.</p>\n<p><em>Crack in the Road: Would you agree with Sjur Lyseid that the “northern gloominess and  melancholy” of Norway has an affect on the music that is produced, both  by yourselves and your peers?</em></p>\n<p>Sjur sure has a way with poetic words, doesn’t he? Of course we have  polar bears, the midnight sun and northern lights – the latter which we  actually made our first record under – way up north in Norway. Still, I  think it might be overly romanticized to say that Norwegians are making  this extraterrestrial, melancholic, life changing music. That said, when  it comes to Youth Pictures of Florence Henderson I think most of the  members get an outburst and might act out some negative and darker  thoughts through our music. Hopefully our listeners can relate to that.  In everyday life we are in fact really cheerful and outgoing human  beings – who would have thought! People say melancholy is a Nordic  phenomenon, but I think it’s universal. But of course, we know and  cherish the fact that we live in an utterly fantastic and beautiful  country, and we are not afraid to make references to both the deep, deep  fjords and the shimmering northern lights, we just rarely do.</p>\n<p><em>Crack in the Road: Your debut album sounds very much post-rock inspired, almost to the  verge of early 90’s “dream pop”, what were your main inspirations for  the new record? Both musically and otherwise?</em></p>\n<p>Our first album was really inspired by post rock. We listened a lot to  bands like Godspeed, Sigur Ros, Explosions in the Sky and Mogwai, while  implementing some inspiration from the post hardcore bands like Funeral  Diner and City of Caterpillar. On our new record (double album called  “Puzzle/The Detective”) we wanted to take the genre a step further and  not do the build-up-and-explode-thing that many bands grow stuck doing  all over again. On the other hand we didn’t want to lose “our sound”  that defined us on the first record. While doing a lot more vocals and  more intriguing arrangements, we hopefully managed to bring something  new into a genre that many people has grown a little bit tired of. To  me, that is defining post rock – doing rock in new shapes, a genre in  constant movement. There is no use hiding the fact that some of us also  are into that 90s old-school emo thing, which I think also can be easily  spotted throughout our latest album. You are not fully human before you  have heard Christie Front Drive’s s/t record from 1996! Some reviews  have mentioned shoegaze as our genre, but most of us aren’t really into  that (except from Slowdive, which we love!). What I know for sure is  that the album needs time, and I hope our listeners give us the benefit  of the doubt and try it out. Lyrically we are way out, just so you know.  We find words and phrases that we love, and puzzle them together so  they might, or might not, give some sort of meaning. Like our music the  words are fragments of a whole and it’s up to the listener (the  detective) to decipher or comprehend them on their own. Single words  trigger different emotions with different people and make them remember  something they have experienced – both good and bad. It’s not up to us  to make the connections, even though we have our own ways of finding  meaning into our lyrics. And just to make the puzzle even more complex,  the cover of the album is a 32 page art-book made by two friends of  ours. Pretentious? Yes… The next album is going to be packed with  3-minute melodic punk rock-tunes.</p>\n<p><em>Crack in the Road: Who comes up with the fantastic song titles and where does the inspiration come from?</em></p>\n<p>The inspiration comes from our northern gloominess, but not from our  melancholy. Enough jokes. As said before we just find words and phrases  that we think have a certain feel to them. It can be dark, it can be  sad, it can be fun, it can be weird. Mainly we want people to start  spinning their own stories around them. The inspiration can come from  phrases and words we find on the internet, hear on TV, on the radio,  read in books or in other bands lyrics. We have pages upon pages with  different titles – too bad we’ve got so few songs… We might have song  titles for our next 6 albums. Hopefully we never make that many  records…</p>\n<p><em>Crack in the Road: If you had to describe your own sound in three words, what would they be?</em></p>\n<p>Never-ending: We have long songs. Very long. So long that people never know when we actually change song at concerts.<br />\nMelodic: We will never lose the good melodies found in our guitars. That is the main ingredient.<br />\nDetailed:  We have details that the listener can discover the 20th time they  listen to a song. We like to put a lot of things into our arrangements,  so that they almost seem messy at first, but reward the ones who hang in  there.</p>\n<p><em>Crack in the Road:</em><em> If you could have any super power, what would it be?</em></p>\n<p>Øystein: The power of failing<br />\nTorbjørn: I’d like to be the Hulk. That way I can always cross the street.<br />\nMorten: Superpowers are for losers<br />\nGjermund:  The ability to change into any form of paper. That way I could mail  myself as a threatening letter and make my escape as a paper airplane  when pursued by enemies, just like the greatest supervillain of all  time: The Perilous Paper Doll Man.<br />\nElling: The power of love.<br />\nAudun:  The power of looking exactly like the pink panther. Hey, wait. I  already do look exactly like the pink panther! How lucky.<br />\nAnders: The power of being like E. Davis Ester from the planet Touston.</p>\n<p>If you are around in London on 11th September, head over to The Fighting Cocks in Kingston-upon-Thames to see the first ever UK live date from <strong>Youth Pictures Of Florence Henderson</strong>.</p>\n<p style=\"text-align: center;\"><a href=\"https://www.myspace.com/youthpictures\">Check Out Youth Pictures Of Florence Henderson’s Myspace!</a></p>\n<p style=\"text-align: center;\"><a href=\"https://www.facebook.com/youthpictures#!/event.php?eid=147712715253853&ref=mf\">Check Out The Facebook Event For Their First UK Gig!</a></p>\n<p><strong><br />\n</strong></p>\n<p><script type=\"text/javascript\" src=\"https://video.unrulymedia.com/wildfire_11244048.js\"></script></p>\n","slug":"2687-interview-youth-pictures-of-florence-henderson","category":"interviews","date":1283259033000,"wpid":2687,"isSticky":false,"featured_image":{"width":600,"height":426,"src":"2011/06/l_3efd2b1f0f094df699ea01ca80a38433.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAUH/8QAHxAAAgEEAgMAAAAAAAAAAAAAAQIDAAQFERIxITJx/8QAFAEBAAAAAAAAAAAAAAAAAAAABv/EAB4RAAIBAwUAAAAAAAAAAAAAAAECAAMSIQRRcdHw/9oADAMBAAIRAxEAPwDM7W6yl1iJBFiBIA6rNEZIVBXtdN7A67PyoT3Ewdg+NHIHR26HzSlH6eoudltGPbxSVdEDBznjqf/Z"},"createdAt":1587295017038,"updatedAt":1588403564265,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/06/l_3efd2b1f0f094df699ea01ca80a38433.jpg","categories":["interviews","music"]}