{"id":"5e9c01ca774c2610387e481e","title":"Exhibition Review: JG – Tacita Dean","content":"<p><strong>Tacita Dean</strong>’s exhibition<strong> <em>JG</em></strong> centres around her new 26 and a half minute film of the same name and a simple collection of photographs, and postcards and objects found at the Great Salt Lake in Utah.</p><p> In the <strong>Marian Goodman Gallery, Paris</strong>, the collection of photographs and other objects, named <em>Salt</em>, are displayed in a large, light room and includes found postcards and chunks of crystallised salt, black and white photographs of such objects and a large photogravure of an imagined landscape with annotations pointing out the different features of this landscape.</p>\n<p style=\"text-align: left;\"><a href=\"https://api.crackintheroad.com/uploads/2014/02/IMG_20140221_170436493.jpg\"><img class=\"size-medium wp-image-26957 aligncenter\" alt=\"Tacita Dean JG photographs\" src=\"https://api.crackintheroad.com/images/2014/02/IMG_20140221_170436493-260x462.jpg\" width=\"260\" height=\"462\" /> </a><a href=\"https://api.crackintheroad.com/images/2014/02/IMG_20140221_170318168.jpg\"><img class=\"size-medium wp-image-26955 aligncenter\" alt=\"Tacita Dean JG postcard salt crystal\" src=\"https://api.crackintheroad.com/images/2014/02/IMG_20140221_170318168-260x462.jpg\" width=\"260\" height=\"462\" /></a></p>\n<p>The film, shot on site at the salt marshes of Utah and California, is shown on a loop in the gallery’s basement. It is difficult to discern whether there is a ‘beginning’ or an ‘end’ to the film. Perhaps watching the film from its actual beginning would shed some light on whether there is a logical progression, but it is clear that showing the film on a loop holds some significance. It seems that the concept of time is important precisely because the progression of time is so unclear. The narrator, Jim Broadbent, sporadically refers to the time, accompanied by an image of a clock telling that time, however, time is not linear. The film shows footage of large and small bodies of water and landscapes interposed on to each other in various shapes, such as, not unintentionally, circles and spirals which evoke the progression of time on an analogue clock. Dean achieves the image layering effect using gate masking, the same method she used to shoot her previous film, <em>FILM</em>. The footage not only shows water and landscapes and their links with time, but also focuses on the sun’s rising and setting and the wildlife to be found around these sites.</p>\n<p>The project was inspired by a challenge given to Dean by J. G Ballard shortly before his death in 2009. The story begins in 1997 when Dean went in search of Robert Smithson’s <em>Spiral Jetty</em> in Utah but failed to locate it. Noticing a link between Smithson’s work and Ballard’s short story ‘The Voices of Time’ (1960), Dean began a correspondence with Ballard on the subject of Smithson’s elusive Spiral Jetty which culminated in Ballard telling her, before he passed, to “treat it as a mystery that your film will solve.”</p>\n<p><a href=\"https://api.crackintheroad.com/images/2014/02/IMG_20140221_170427266.jpg\"><img class=\"size-medium wp-image-26956 aligncenter\" alt=\"Tacita Dean JG photogravure cascade\" src=\"https://api.crackintheroad.com/images/2014/02/IMG_20140221_170427266-260x462.jpg\" width=\"260\" height=\"462\" /></a></p>\n<p>The film is technically complex and fascinating; Dean shot the footage in analogue film which allowed her to create the gate masking technique and it has been said that the film could only work in analogue and not digital as this is what gives it the kaleidoscopic effect. It is unclear whether Dean did solve the mystery of Smithson’s work, however, what is certain is that she manages to capture the beauty of these landscapes for the public to enjoy but also maintains their mystery, in turn creating her own enigmatic work.</p>\n<p>There is, finally, an adjoining room which you pass just before you leave the gallery, with a sofa and a large sculpture rendered from a tree and in this room are stills from the film; it was great to be able to go into this room after watching the film and contemplate it a little further.</p>\n<p><a href=\"https://api.crackintheroad.com/images/2014/02/IMG_20140221_173328924.jpg\"><img class=\"size-medium wp-image-26958 aligncenter\" alt=\"Tacita Dean JG tree sculpture\" src=\"https://api.crackintheroad.com/images/2014/02/IMG_20140221_173328924-260x462.jpg\" width=\"260\" height=\"462\" /></a></p>\n<p style=\"text-align: center;\">Tacita Dean’s new film <em>JG</em> exhibits at the <a href=\"https://www.mariangoodman.com \">Marian Goodman Gallery</a>, Paris, from 15<sup>th</sup> January to 1<sup>st</sup> March.</p>\n","slug":"26960-jg-tacita-dean","category":"newreviews","date":1393323268000,"wpid":26960,"isSticky":false,"featured_image":{"width":1456,"height":2006,"src":"2014/02/img_20140221_1733514671.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAOAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAABQT/xAAhEAACAQMDBQAAAAAAAAAAAAABAgMABBESITEFFFFhkf/EABUBAQEAAAAAAAAAAAAAAAAAAAME/8QAGBEAAwEBAAAAAAAAAAAAAAAAAAEDESH/2gAMAwEAAhEDEQA/AELCRFiA0Ngnnbele3TxQHSLlHitVZDqmUN9GavuLxlnkUZwGI591PJPBqvp/9k="},"createdAt":1587282378892,"updatedAt":1588403518454,"author":"5e9b68b27a1236eccfeb1d2d","old_image":"2014/02/img_20140221_1733514671.jpg","categories":["newreviews","arts"]}