{"id":"5e9c01c9774c2610387e4815","artists":["5e9b69377a1236eccfeb249b"],"title":"Interview: Reptile Youth","content":"<p>With such a masterful aesthetic and almost anthemic sound its hard not to be captivated by Danish-duo, Reptile Youth.</p><p> Following the success of their debut self-titled album, the guys are back and ready to release their sophomore album “Rivers That Run For A Sea That Is Gone”—RTRFASTIG for short. (<a href=\"https://www.bit.ly/1btWhhI\">Preorder here!</a>) Only two weeks ago they released the gorgeous black-and-white music video for the album’s first single, “JJ”. In my transatlantic email chat with one-half of the boys I found out a little more about the band, the visuals and the man named JJ. x</p>\n<p><b>Off the bat can you give me your name, how you met and the biggest lie you ever told your mother?</b></p>\n<p>I’m Mads Damsgaard Kristiansen. I have the band with Esben Valløe. I remember seeing him for the first time at a party in a squatted building. He was doing an electronic show. It was completely out of control. And that attracted me. Later we ended up in the same class at a weird entrepreneurial art school. And the the rest just kind of happened. I never lie to my mother. I lie a lot. But never to my mother.</p>\n<p><b>For your sophomore album “Rivers That Run for a Sea That Is Gone” whats different? Whats the same? i.e. any elements you carried over from ‘Reptile Youth’ or chose not to use again. Also maybe metaphoric—how have your lives changed?</b></p>\n<p>Its still music that likes when people dance to it. And its still songs that are grounded in my life. RTRFASTIG is a little darker though. More rough. And recorded on tape. On this one we wanted to make electronic music played by hand. And as a band. So we invited 3 good friends into the process of recording it. And let them colour the music as well. Which was sometimes hard. But also extremely valuable.</p>\n<p><b>Do you guys think you’ve found your voice and are sticking to it or is RTRFASTIG experimenting with something new?</b></p>\n<p>Its experimenting with something new. We like to play around with stuff. And promised each other never to get stuck on something. Of cause you find things you like. And ways of doing things that you like. But it’s important to always try to push them. The day you stop challenging yourself is the day you stopped caring enough.</p>\n<p><b>Who does the cover art for your albums?</b></p>\n<p>For this record Roger Ballen did all the cover art. Both for the album and the singles. He is a South African photographer that we love. A lot of his work has a childish tone to it. But at the same time its really dark. And most of it really weird. It was kind of a long shot when we asked him about working with us. Its so nice when your idols want to play along.</p>\n<p><b>As a gender studies minor in college I read heaps into your ‘jj’ cover art. Is that supposed to be a nod towards gender non-conformity or just non-conformity in general?</b></p>\n<p>Sometimes I don’t like explaining lyrics because I like when people read their own lives and thoughts into them. Like you just did. But this time I’ll do it anyway. With the possibility of destroying. There is a story related to this song. JJ is a drug addict. He’s been that for more than 20 years. Smoking heroine. He has kind of followed me for a long time through the different bands that I have been playing in. And 2 years ago he somehow got my email address and started mailing me. I really liked his emails. They were completely without any filter. As if the words just jumped from his face and onto the screen without any form of editing. He wrote about his life. His thoughts. The drugs. Art and music. Whatever was on his mind. This continued for months. I slowly started replying him cause I enjoyed his words. At some point he told me that he was in a very good period of his life and that he wanted to try to get of the drugs for 10 days. He hadn’t been off the drugs for that long in more than 10 years. And so we made a deal. Cause I wanted to encourage him. That if he kept off the drugs for those 10 days I would write a song about him. And he did it. We were in contact every day during those days. I still haven’t played him the song. Don’t know if he will like it. In a month I’m going to the town where he lives. I think I will meet up with him there and play him the song.</p>\n<p><b>Also which of you write the song titles? I’m in love with a lot of them because of how evocative they are. “Be My Yoko Ono” “Black Swan Born White” “Fragile But Possible” “Diseased by Desire” and even RTRFASTIG. </b></p>\n<p>I write the song titles. Most of the time they make themselves though. I’m happy you like them</p>\n<p><b>What is the environment in Copenhagen right now? As far as fostering arts. Like London seems to be pretty dark and electronic right now, Sweden can’t stop producing pop and Denmark seems to have artists in all different niches. I’m thinking of MØ and her style of pop, When Saints Go Machine that I might call experimental and then you guys who seem to combine a little bit of both and yet completely different.</b></p>\n<p>The environment is nice. A lot of good things are coming out of Copenhagne I think. Also a lot of nice punk. Like Iceage or Lower. And I like how the scene here is so diverse. But still very small. Everybody kind of know everybody.</p>\n<p><b>What is happening (<a href=\"https://instagram.com/p/hEJhHllhPh/\">here</a>)? </b></p>\n<p>Hahah. I think we just took a shower. Actually I think it is a hotel room in Berlin. We are probably getting ready to leave for the venue. And we are talking about music I could imagine. Looks like the guitar player (Who’s name is also Mads) is playing something on a guitar that is not there. It was a good day. I remember that.</p>\n<p><b>What does success look like to you?</b></p>\n<p>I don’t know. Don’t like that word too much. Looks a lot like happiness doesn’t it?</p>\n<p><b>Let’s pretend it’s a Friday night, what are you doing, who are you with and more importantly where are you?</b></p>\n<p>I’m maybe drinking beers at my place. I live with 2 of my good friends. And they can’t stop partying. People always end up here when they have had enough of it all out there. For good and bad. I’m with a girl. She is really nice.</p>\n<p><b>Now let’s pretend you wake up one morning and can’t remember a single thing after 6pm from the night before. Make up a story of what you did and why you can’t remember. </b></p>\n<p>You are a weird journalist. I like it.</p>\n<p>I can’t remember much cause my brother bought this weird spice back from a trip he was on in Russia. He said he got it from an old woman in Siberia. And that she told him that the world would be a better place if he shared it with someone he loved. I remember feeling happy. That’s the last thing I remember. And then we woke up by the ocean. I love waking up by the ocean. I have no idea how we got there. Andreas probably paid a taxi. He loves adventures. And spends his money really unwisely.</p>\n<p><b>Any question that you can’t believe I forgot to ask and you would love to answer?</b></p>\n<p><b></b>No. Not really:) I liked your questions</p>\n<p><iframe width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/8ZtlmVoxU6Y?feature=oembed\" frameborder=\"0\" allowfullscreen></iframe></p>\n<p>[soundcloud url=”https://api.soundcloud.com/tracks/130599062″ params=”color=ff5500&auto_play=false&hide_related=false&show_artwork=true” width=”100%” height=”166″ iframe=”true” /]</p>\n<p> </p>\n<p> </p>\n<p> </p>\n","slug":"27049-artist-interview-reptile-youth","category":"newinterviews","date":1393417808000,"wpid":27049,"isSticky":false,"featured_image":{"width":1280,"height":800,"src":"2014/02/promo-1-1280x800.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAGAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAUH/8QAIxAAAQMCBQUAAAAAAAAAAAAABAECAwAiBQYREiEHFjJBgv/EABQBAQAAAAAAAAAAAAAAAAAAAAP/xAAXEQADAQAAAAAAAAAAAAAAAAAAAQIx/9oADAMBAAIRAxEAPwCV12z1i4ufQwwCpRgQoxnrC17lSRzpNyq67nTY2t07nHkv0Lu58l9/VKU8aw6xH//Z"},"createdAt":1587282377241,"updatedAt":1588403518376,"author":"5e9b68b27a1236eccfeb1d20","old_image":"2014/02/promo-1-1280x800.jpg","categories":[]}