{"id":"5e9c33279b6559241525dff8","artists":["5e9b69447a1236eccfeb2577"],"title":"Interview: Star Slinger","content":"<img class=\"alignnone\" title=\"Star\" src=\"https://farm5.</p><p>static.flickr.com/4095/4929146933_a0b368df6a_z.jpg\" alt=\"\" width=\"640\" height=\"640\" />\n<p>In my mind, <strong>Star Slinger</strong> is one of the most innovative artists in the current UK music scene, it only takes a quick glance at my <a href=\"https://www.last.fm/user/CITRjoshdalton\">Lastfm </a>to see that I’m telling the truth; over the past few days I have become well and truly star slung. With his first music video just released today, which you can watch below, as well as a mix in the works for<strong> Dazed & Confused</strong>, Darren Williams is sure to soon become a household name in independent music. As well as making fantastic music, he also deals with his fans in a down to earth and appreciative manner, and as if that wasn’t enough, all his music is available to download for free from his <a href=\"https://starslingeruk.bandcamp.com/\">bandcamp site</a>. Following on from <a href=\"https://api.crackintheroad.com/music/2566-review-star-slinger-volume-1\">my review</a> of his new release<em> Volume 1</em>, I caught up with Darren to find out about Volume 2 and what else is currently happening in the world of<strong> Star Slinger</strong>.</p>\n<p><iframe src=\"https://player.vimeo.com/video/14565381\" frameborder=\"0\" width=\"400\" height=\"225\"></iframe></p>\n<p><a href=\"https://vimeo.com/14565381\">Star Slinger Remix – Coolrunnings “I Am You” *Official Music Video*</a> from <a href=\"https://vimeo.com/starslingeruk\">Star Slinger</a> on <a href=\"https://vimeo.com\">Vimeo</a>.</p>\n<p><em>Crack in the Road: How do you normally go about creating a track? Is it a case of stumbling upon songs and mixing them, or do you have certain songs in mind when you start?</em></p>\n<p><strong>It usually starts in the record shop. The first track I made “Star Slinger” was a result of me going in to browse for BT Express records. An old disco/funk/synth boogie band I really liked before from hearing on compilations. I knew there’d be some gems in their catalog. Anyway, I found this one 7″ with a track called Cowboy Dancer. It was an instrumental with an awesome groove. I recorded it in mono, slowed it down, chopped it up and made it even more lo-fi than it was.</strong></p>\n<p><em>CitR: From the sounds of Volume 1, you appear to be a perfectionist with the intricacy on each track, would you agree with that description?</em></p>\n<p><strong>I wouldn’t say I’m a total perfectionist. I’m pretty good at expressing myself with melody, so I’d say a lot of it comes naturally. I’m very spontaneous in how I do things, and take a positive view on looking at things that way. When you make a song, essentially its documented and will be remembered by someone – so I try to make it as fun as possible.</strong></p>\n<p><em>CitR: Have you ever considered going into the production of other artists, or more specifically hip hop artists?</em></p>\n<p><strong>Yes for sure. I’m working with an awesome young canadian MC / Producer called Emay, on a project with him and Blackbird Blackbird from San Francisco. The track samples Memoryhouse who have heard the progress and they love it so far. We’re honoured. We’re putting it out as a single under the name Seeing Suge later this year.</strong></p>\n<p><em>CitR: What has been your most memorable tour moment to date?</em></p>\n<p><strong>I was in a band some years ago. We were on a mini tour and played this show in Worcester to about 400 people. As I came off stage this girl grabbed me and started groping and tongueing me. Funny memory since I was always the least likely to pull back then. My bandmates were in stiches.</strong></p>\n<p><em>CitR: How is work going on Volume 2? Have you completed any tracks for it and if so, is there are change in sound from Volume 1?</em></p>\n<p><strong>I have completed tracks for it, and some are out there on the web. Longtime, Slow N Wet and May I Walk With You? are all up on my bandcamp page. Some of the songs are more spacey than Vol 1. The title will be Jetpack Jam. Its homage to how an artist has his heads in or above the clouds most of the time. When I’m producing I like to think my head is in space even though my feet are on the ground in reality. I feel like I’m in some higher zone.</strong></p>\n<p><em>CitR: What was the first record you can remember that really moved you and inspired you to create your own music?</em></p>\n<p><strong>I was blown away by a few tracks at a young age. My Dad was always jamming The Beatles. I remember spinning his Sgt Peppers picture disk LP. “A Day In The Life” really hit me and made it clear how powerful music can be. De La Soul “Me, Myself & I” – I was so young I had no idea it was sampled. I just fell in love with the synths, hooks and the drums. Such a feel good song.</strong></p>\n<p><em>CitR: For people who like your music, are there any other musical projects around that you would recommend?</em></p>\n<p>Thallus (<a href=\"https://www.thallus.bandcamp.com/\" target=\"_blank\">www.thallus.bandcamp.com</a>)<br />\nEmay (<a href=\"https://www.emay.bandcamp.com/\" target=\"_blank\">www.emay.bandcamp.com</a>)<br />\nTeams (<a href=\"https://www.teeeams.bandcamp.com/\" target=\"_blank\">www.teeeams.bandcamp.com</a>)<br />\nPandit  (<a href=\"https://www.myspace.com/lancesmithmusic\" target=\"_blank\">https://www.myspace.com/lancesmithmusic</a>)<br />\nAlpine (<a href=\"https://www.myspace.com/alpineband\" target=\"_blank\">www.myspace.com/alpineband</a>)<br />\nKiss Kiss Fantastic (<a href=\"https://www.myspace.com/kisskissfantastic\" target=\"_blank\">https://www.myspace.com/kisskissfantastic</a>)</p>\n<p><em>CitR: And finally, on a less serious note, if you could have any super power, what would it be?</em></p>\n<p>I’d love to be able to read minds, melt panties and stop time. Those would be super dope.</p>\n<p style=\"text-align: center;\"><a href=\"https://starslingeruk.bandcamp.com/\">Download From Star Slinger’s Bandcamp!</a></p>\n","slug":"2709-interview-star-slinger","category":"interviews","date":1283280281000,"wpid":2709,"isSticky":false,"featured_image":{"width":640,"height":640,"src":"2011/06/4929146933_a0b368df6a_z.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAQYH/8QAJBAAAgEDAwMFAAAAAAAAAAAAAQIDAAUGBBEhEiJSFDEyQXH/xAAVAQEBAAAAAAAAAAAAAAAAAAAEBf/EABgRAQADAQAAAAAAAAAAAAAAAAEAAhEh/9oADAMBAAIRAxEAPwCvznIMm0+a6mK335bfFAwWC3tpev1AChgR5dZJXj84IrZoO+GNpeyQqCy+J25FBhiciV4kaWP4OVBZN/fY/W9NQr3EDIoHXs//2Q=="},"createdAt":1587295015153,"updatedAt":1588403564239,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/06/4929146933_a0b368df6a_z.jpg","categories":["interviews","music"]}