{"id":"5e9c01b3774c2610387e47e4","artists":["5e9b68c77a1236eccfeb1d9e"],"title":"Bedroom Pretender: ALX – Beautiful Criminal","content":"<p>As of mid-February, everyone’s been talking about ‘Beautiful Criminal’, a track by a new mysterious multi-instrumentalist called ALX.</p><p> Or Alex. He’s had Radio 1 play. Music bloggers everywhere are comparing him to Jai Paul, Jai Paul, Jai Paul, and Frank Ocean. Browsing his twitter feed, I saw he’d posted a picture of something by NME’s online editor Greg Cochrane, which, among other things, compared him to Jai Paul and Frank Ocean:</p>\n<p>“If there’s one question plaguing the universe right now – apart from why everyone’s still banging on about Pharrell’s hat – it’s where the flamin’ heck is Jai Paul? Because frankly, if he doesn’t reappear soon then bedroom pretenders like 22-year-old ALX from Scotland will steal his thunder. This debut track – deliciously artful, full of allure, dark hearted – has all the glistening hooks of a song like Frank Ocean’s ‘Swim Good’. And we all saw where that took Frank.”</p>\n<p>Very nice. Nice track. But why hasn’t anyone said hey, that’s doesn’t sound like Jai Paul: it is Jai Paul. It’s the same riff! Now we all know there’s no such thing as a truly <em>new</em> riff. No riff is innocent in 2014. Everything, including ‘Jasmine,’ comes from another tune, somewhere down the line. But at least change the context of the riff. ALX uses the same guitar sound; the same percussion. But then, at least he changed the key of the riff. He moved it up one semi-tone.</p>\n<p>Here’s the Jai Paul’s track:</p>\n<p><iframe src=\"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/41479635&auto_play=false&hide_related=false&visual=true\" height=\"450\" width=\"100%\" frameborder=\"no\" scrolling=\"no\"></iframe></p>\n<p>And here’s ALX’s Beautiful Criminal:</p>\n<p><iframe src=\"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/134770394&auto_play=false&hide_related=false&visual=true\" height=\"450\" width=\"100%\" frameborder=\"no\" scrolling=\"no\"></iframe></p>\n<p>Sounds a bit like Jai Paul, doesn’t it? Oh, and Frank Ocean. Then there’s a David Gray middle eight.</p>\n<p>I first heard this song a couple of weeks ago when a friend incredulously posted it to me. Isn’t that a Jai Paul riff? he said. I thought, ah, it’s a sample of the beginning of ‘Jasmine’ No harm in that. Jai Paul samples everyone, and everyone samples Jai Paul. But then the riff went somewhere else less satisfying. Wait a sec. Somebody has manually played that riff and minimally altered it. Somebody actually thinks he <em>wrote</em> that riff. At the time of my first listen I was also watching the youtube video, with its two girls going to chicken shops in what is presumably East London, and smoking in what looks like a house in South London. It is also full of visual references to Jai Paul. This is the artwork for a Youtube clip for ‘Jasmine’ which has been up since 2012, and that, regardless of whether it was official, will be associated with Jai Paul:</p>\n<p><a href=\"https://api.crackintheroad.com/uploads/2014/03/Jasmin.jpg\"><img class=\"alignnone size-medium wp-image-27181\" alt=\"Jasmin\" src=\"https://api.crackintheroad.com/images/2014/03/Jasmin-300x300.jpg\" width=\"260\" height=\"146\" srcset=\"https://api.crackintheroad.com/images/2014/03/Jasmin-300x169.jpg 300w, https://api.crackintheroad.com/images/2014/03/Jasmin-1024x576.jpg 1024w, https://api.crackintheroad.com/images/2014/03/Jasmin-50x28.jpg 50w, https://api.crackintheroad.com/images/2014/03/Jasmin.jpg 1366w\" sizes=\"(max-width: 260px) 100vw, 260px\" /></a></p>\n<p>This is from ALX’s Beautiful Criminal:</p>\n<p><a href=\"https://api.crackintheroad.com/images/2014/03/AXLJasmin.jpg\"><img class=\"alignnone size-medium wp-image-27182\" alt=\"AXLJasmin\" src=\"https://api.crackintheroad.com/images/2014/03/AXLJasmin-300x300.jpg\" width=\"260\" height=\"146\" srcset=\"https://api.crackintheroad.com/images/2014/03/AXLJasmin-300x169.jpg 300w, https://api.crackintheroad.com/images/2014/03/AXLJasmin-1024x576.jpg 1024w, https://api.crackintheroad.com/images/2014/03/AXLJasmin-50x28.jpg 50w, https://api.crackintheroad.com/images/2014/03/AXLJasmin.jpg 1366w\" sizes=\"(max-width: 260px) 100vw, 260px\" /></a></p>\n<p>And here:</p>\n<p><a href=\"https://api.crackintheroad.com/images/2014/03/AXL2.jpg\"><img class=\"alignnone size-medium wp-image-27183\" alt=\"AXL2\" src=\"https://api.crackintheroad.com/images/2014/03/AXL2-300x300.jpg\" width=\"260\" height=\"146\" srcset=\"https://api.crackintheroad.com/images/2014/03/AXL2-300x169.jpg 300w, https://api.crackintheroad.com/images/2014/03/AXL2-1024x576.jpg 1024w, https://api.crackintheroad.com/images/2014/03/AXL2-50x28.jpg 50w, https://api.crackintheroad.com/images/2014/03/AXL2.jpg 1366w\" sizes=\"(max-width: 260px) 100vw, 260px\" /></a></p>\n<p>And there’s the x:</p>\n<p><a href=\"https://api.crackintheroad.com/images/2014/03/AXL3.jpg\"><img class=\"alignnone size-medium wp-image-27184\" alt=\"AXL3\" src=\"https://api.crackintheroad.com/images/2014/03/AXL3-300x300.jpg\" width=\"260\" height=\"146\" srcset=\"https://api.crackintheroad.com/images/2014/03/AXL3-300x169.jpg 300w, https://api.crackintheroad.com/images/2014/03/AXL3-1024x576.jpg 1024w, https://api.crackintheroad.com/images/2014/03/AXL3-50x28.jpg 50w, https://api.crackintheroad.com/images/2014/03/AXL3.jpg 1366w\" sizes=\"(max-width: 260px) 100vw, 260px\" /></a></p>\n<p>I wanted to comment being like ‘JAI PAUL!!!??’ but comments were disabled for the video. Presumably because they were all just JAI PAUL!!!?? Fair enough. Paul hasn’t patented that kind of light-play, but it’s pretty obvious that whoever did the video wants to play as much as possible on the similarities to Jai Paul rather than make a case for ALX’s originality</p>\n<p>This wouldn’t be an issue if the song was a travesty. ‘Beautiful Criminal’ is good – it’s likely most journalists would concede that. Mainly because Jai Paul’s ‘Jasmine’ riff is great, but also because it has form and clean lines. Here is Jai Paul’s sound stripped of anything that might have stood in the way of its commercial acceptance. There is none of the ambiguity in the production – no sonic self-sabotage, no bogus panning in the mix. There is also none of the charm and the lyrics are pretty throw-away, though lyrics weren’t necessarily Jai Paul’s feature ingredient. There is a real risk, as Cochrane said, that because ALX is a lighter option, he will eventually take the credit. He is already taking some of it. And even people who know Jai Paul are likely to accept ALX. Either because the man himself is pretty quiet or they don’t want to torrent the leaked album, people will be happy for new material which could pass for that of the Rayner Lane magician.</p>\n<p>Jai Paul has lots of compadres who don’t play live and release semi-anonymously. None of them are bedroom pretenders, and if they are then so is Paul. It’s just a fashionable way of existance for musicians at the moment. They’re no doubt all influenced by Paul. Child of Lov, who sadly died recently, was the best of them. Ben Khan hasn’t fully stepped out of Paul’s sonic shadow, but has his own signature: he’s slicker, suaver, sleazier, more VVegasy. Jungle, who I wrote about for this blog, are the most exciting, and their latest track, ‘Busy Earnin’, is their most diverse release, yet also entirely recognisable as coming from them. Brooklyn’s ANG LOW sounds nothing like Paul, but he has the same kind of profile and deserves a mention. I can’t wait to hear more of him. Whenever you hear any of these acts spoken of, the immediate referent is Jai Paul. None of them have taken a riff verbatim from him, though.</p>\n<p>I’m desperately hoping that ALX is a hoax linked to XL/ the Jai Paul team to promote a new release this April. That’s when he operates, after all. Or, more ingeniously, a plan by a Jai Paul fan to lure the artist out of hiding. If not, I’m sad that I have to diss what would otherwise be a good track.</p>\n","slug":"27180-bedroom-pretender-alx-beautiful-criminal","category":"music","date":1393791509000,"wpid":27180,"isSticky":false,"featured_image":{"width":500,"height":500,"src":"2014/03/avatars-000066387520-p7jq41-t500x500.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFwAAAwEAAAAAAAAAAAAAAAAAAAQFB//EACAQAAEDBAMBAQAAAAAAAAAAAAECAwQABRESEyExBkH/xAAUAQEAAAAAAAAAAAAAAAAAAAAA/8QAFBEBAAAAAAAAAAAAAAAAAAAAAP/aAAwDAQACEQMRAD8A36F9TJf2TJtM2IsiRxhxhZ3KNSjwdbJVnB7yCPact9/54EZ6SzLjvuNJW4yqE6S2ogEpOB+Hqr1FB//Z"},"createdAt":1587282355821,"updatedAt":1588403517940,"author":"5e9b68b27a1236eccfeb1d26","old_image":"2014/03/avatars-000066387520-p7jq41-t500x500.jpg","categories":["music","new"]}