{"id":"5e9c33259b6559241525dff7","artists":["5e9b68d47a1236eccfeb1e26"],"title":"Interview: Beat Connection","content":"<img class=\"alignnone\" title=\"beatc\" src=\"https://c4.</p><p>ac-images.myspacecdn.com/images02/69/l_9d3453a3763345cdab80a8f945c29327.jpg\" alt=\"\" width=\"600\" height=\"400\" />\n<p>With the release of their debut EP<em> Surf Noir </em>earlier this year, Seattle duo <strong>Beat Connection</strong> are rapidly gaining momentum in the aptly named “chillwave” scene. Fusing a love of music, life and expansive creativity, Jordan Koplowitz and Reed Juenger have composed an elegant and uplifting record, with tracks like the dance inspired <em>Silver Screen </em>and the blissed-out <em>In The Water</em> showcasing their ability to locate and form a joyous melody. Following on from our review of their first release,<em><strong> Crack in the Road </strong></em>were lucky enough to catch up with Jordan and Reed to discuss the formation of <strong>Beat Connection</strong>, future ambitions and the recording of<em> Surf Noir</em>.</p>\n<p><em>Crack in the Road: For those new to your music, how would you describe the sound that you create?</em></p>\n<p>Jordan: This is always a tough one for us. We’ve been getting grouped in a lot with chillwave which is alright, but I feel like we’re actually quite different than most chillwave artists. I think it mostly lies in the fact that we like faster tempos and emphasizing percussion. So, essentially we’re Balearic-dance-indie-pop haha. Genres are getting pretty ridiculous these days anyway.</p>\n<p>Reed: Yeah, the genre game is tough for us, I think we like to call it Balearic Trunk Muzik, but the whole trunk rattling aspect of music is maybe a bit on the down low.</p>\n<p><em>CitR: How did Beat Connection come about?</em></p>\n<p>Jordan: Reed had some awesome semi-broken synthesizers in his dorm room and I instantly was like “ah this guy is fkn rad!” We were also in the same nerdy sound programming class so that’s kind of how we became friends. After a while we realized that we both had a love for DJing parties and getting people to dance/make bad decisions so we started to do such things. This endeavor was called Beat Connection and the name stuck.</p>\n<p>Reed: Yeah… I’m fuckin rad, lulz.  That’s how this came about.  (I hope that quote gets used out of context so i look like an ass!)  Well, yeah we started making tunes in dorm rooms, we had both been making loop/crap music in garage band for a while and had played in some bad high school bands etc, so it was a normal progression, we were both into the same music.  We started DJing some new disco/house kind of music and took the name Beat Connection, which is a better DJ name, but whatever.</p>\n<p><em>CitR: What would you describe as your biggest influences, both musical and otherwise?</em></p>\n<p>Jordan: You know that really awesome night you had like a couple months ago where you got a perfect level of drunk with your friends, hit up an awesome party where everyone was having a good time, drunkenly got a delicious slice of pizza and then met a girl that you’d really like to get to know. That.</p>\n<p>Reed: Hooking up with that girl.</p>\n<p>But mostly experiences that you get nostalgic for because the day dream about that experience is so much better than the reality of it.  That might not make total sense, but its kind of like, things that exist only in your mind or in dreams are quite often better as fantasies, and the reality is maybe a bit underwhelming.  Or you get all nostalgic for your childhood and you totally omit all the bad parts.  That’s an influence, the fact that people do that haha.  Also pop music is a big influence…. and when I say pop music I mean more like Saint Etienne and less like Taio Cruz.</p>\n<p><em>CitR: Your music has an almost dreamlike quality to it, is that intentional, or did it just evolve as you found your musical feet?</em></p>\n<p>Jordan: I’ve always found music that makes me daydream to be super enjoyable. I think it helps me get away for a little bit, just in my mind. And I don’t mean daydreaming in a boring type of way, more-so inducing visuals and thoughts. I think/hope it comes through in the music because I want people to have the same experience that I do</p>\n<p>Reed: Yeah, I think the dream like qualities were definitely calculated, we are big fans of bands like Air France and Cut Copy who I think definitely have a similar quality to some of much of their material.</p>\n<p><em>CitR: How did you go about recording your recent Surf Noir EP? Did you know which tracks would feature before you started recording, or did it take shape in the studio?</em></p>\n<p>Jordan: Surf Noir was essentially all the good songs we had made in the last 6 month period…it’s funny to think that we only made 27 minutes of usable material in half of a year. At one point we just sifted through what we had and said yes to some things and no to a lot of things. Then after that we worked on the yesses and tried to make them the best possible.</p>\n<p>Reed: Yeah we tried to make something that worked as a whole.  We were coming off of DJing very often and the way that songs worked together became really important to us.  It also helped us to learn things like some songs are great, but really only for like a minute, then they loose their charm.  Other times songs need a way long time to unfold or there is no emotion when the chorus kicks in.  As for recording etc.  we did that kind of sporadically.  A little here a little there and then toward the end it was just obsessive, any moment we had to make sure the drums were they way we wanted em, we took.  I definitely worked on some songs on the bus haha.  And a lot of it also happened really quick in the studio, or attic space.  We would stand around for hours trying to come up with lyrics or something and then it would just happen in like 20 minutes.</p>\n<p><em>CitR: As both musicians and fans, how has the increased use of illegal downloading affected yourselves? And if you could, how would you change the system?</em></p>\n<p>Jordan: Well…..since we’re giving out our EP for free it hasn’t really affected us at all. To be honest the system may be flawed, but I don’t think it should be any different. Illegally downloading music has really increased the amount of music a given person listens to and therefore has made it easy to find new bands and genres. It also helps get people that would normally see an album for $10 and say “Fuck that, I’d rather buy a case of beer” into music. I think that’s pretty much our fanbase.</p>\n<p>Reed: It’s a tough argument, because yeah, there is music that I can listen to now that I might not have paid for and I’m exposed to it anyway, but it really sucks that its become so hard for artists to make any money.  If I’m paying for music (which I feel especially compelled to do now-a-days) I like to have something I can hold on to and collect, so that’s a big selling point for me.  One thing that’s happened since we put out this EP is that I’ve been exposed to way more music than ever before, and its awesome, but its tough to keep track of it all.  As for changing the system, man, that’s tough, music renting never really took off, I think I would try and increase the incentive to go out and buy a real chunk of vinyl or a cd instead of downloading, but then again, I listen to almost all of my music on my computer or my mp3 player.  Shit.</p>\n<p><em>CitR: Where would you like to see Beat Connection in a years time?</em></p>\n<p>Jordan: Performing on the moon, that’s next-level shit right there! Actually more like next-atmosphere shit. No, but really, we’d like to almost be releasing our first full-length LP and touring the US and maybe a little bit in Europe. I really just want to travel, and if I can at least break even that’d be badass.</p>\n<p>Reed: Gotta keep working on new material, expanding the live horizons.  Maybe going on tour (that would be a dream).  We are working on some DJ stuff again and some music for a movie, some remixes, we are going in a lot of directions and its great.</p>\n<p><em>CitR: What was the first record you can remember falling in love with?</em></p>\n<p>Jordan: I’m going to be honest here, so no making jokes. The OST for Space Jam. I would listen to that shit every night when I was going to be. I Believe I Can Fly is fire. Respek R. Kelly</p>\n<p>Reed: The Beatles – Revolver.  That album is so damn good.  I listened to a lot of crap and was really disappointed in music because of bands like P.O.D when I was younger so my musical genesis was pretty late in the game, like 12 or 13.  But yeah that one for me was just something I totally fell in love with, its amazing how much they could do with 2 minutes, absolutely amazing.  Another early one for me was David Bowie – Queen Bitch and then I discovered Arcade Fire, Funeral is still my favorite album ever.  Just saying.</p>\n<p><em>CitR: And finally, if you could be any animal, what would you be?</em></p>\n<p>Jordan: Fox</p>\n<p>Reed: Wolf</p>\n<p>Jordan: …shit.</p>\n<p><em>CitR: Thanks very much guys!</em></p>\n<p style=\"text-align: center;\">To download <strong>Surf Noir</strong> for free, head over to <a href=\"https://beatconnection.bandcamp.com/\">Beat Connection’s Bandcamp!</a></p>\n<p><script type=\"text/javascript\" src=\"https://video.unrulymedia.com/wildfire_11244048.js\"></script></p>\n","slug":"2719-interview-beat-connection","category":"interviews","date":1283417424000,"wpid":2719,"isSticky":false,"featured_image":null,"createdAt":1587295013371,"updatedAt":1587825934025,"author":"5e9b68b27a1236eccfeb1d27","categories":["interviews","music"]}