{"id":"5e9c01ad774c2610387e47dc","artists":["5e9b691e7a1236eccfeb22c7"],"title":"Video: Lykke Li – Love Me Like I’m Not Made Of Stone","content":"<p><strong>Lykke Li</strong> has always been something of an enigma.</p><p> I’ve grappled uneasily with her music (and the pronunciation of her name). At times I find it pretentious and banal, at others I feel I’m hearing the exquisite few moments of a burgeoning young genius. It’s with some relief, then, to say that her new single<strong> ‘Love Me Like Im Not Made Of Stone’</strong> is excellent. She finally feels comfortable in this song; it’s as if she’s emerging from the wilderness (where <em>has</em> she been for the last three years?!) and living up to the potential she demonstrated, but never quite achieved, in her first two records.</p>\n<p><iframe src=\"//www.youtube.com/embed/D7iLERCEznI\" height=\"315\" width=\"560\" allowfullscreen=\"\" frameborder=\"0\"></iframe></p>\n<p><strong>Lykke Li’s</strong> new single is a diamond nestled in amongst the irritating mass of ‘acoustic guitar/female vocal’ drivel that you hear so often on tv in yoghurt/car/tampon adverts… but her unique handling of this classic formula lifts the song elegantly out of the quagmire of monotony. The character of her voice is the pure fragility to it and the unobtrusive strumming of an acoustic guitar is the perfect platform for this delicate beauty to unashamedly take centre stage. Coupling this frailty with the repeated refrain, ‘love me like I’m not made of stone’, she touches on the tragic with such quiet grace. The guitar responds naturally to her ever-intensifying vocal and the song sparkles with seemingly effortless charm.</p>\n<p>The video, directed by Tarik Saleh, is a perfect complement to the song: it’s as equally simple and powerful. The camera poised on her face, Lykke Li revolves (on a human-sized turntable one would imagine!) with every raw emotion that accompanies heart break clearly visible on her face (Miley could learn a lot) A beautiful video, a beautiful song. It leaves me greatly anticipating her forthcoming album ‘I Never Learn’ due for release in May this year.</p>\n","slug":"27210-video-lykke-li-love-like-im-made-stone","category":"music","date":1394469238000,"wpid":27210,"isSticky":false,"featured_image":{"width":658,"height":367,"src":"2014/03/lykke.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAFAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAUI/8QAHhAAAQQBBQAAAAAAAAAAAAAAAQACAxEFEyExYYH/xAAUAQEAAAAAAAAAAAAAAAAAAAAC/8QAGBEAAgMAAAAAAAAAAAAAAAAAAAECMUH/2gAMAwEAAhEDEQA/AM4vh0sKWhxIdEyc924ivKu1IMW/KIktHOkf/9k="},"createdAt":1587282349960,"updatedAt":1588403517875,"author":"5e9b68b27a1236eccfeb1d2c","old_image":"2014/03/lykke.jpg","categories":["music","newnews","videos"]}