{"id":"5e9c33209b6559241525dfee","artists":["5e9b69257a1236eccfeb235e"],"title":"Interview: Mt. St. Helens Vietnam Band","content":"<img class=\"alignnone\" title=\"MTSH\" src=\"https://www.</p><p>seattleshowgal.com/uploads/2009/12/MSHVB-Band-Photo-01-Marshall-Verdoes-Traci-Eggleston-Benjamin-Verdoes-Jared-Price-Matthew-Dammer-Tom-Mulder-manager-of-the-Mount-St.-Helens-National-Monument--604x403.jpg\" alt=\"\" width=\"604\" height=\"403\" />\n<p>Rapidly becoming a gem in the crown of Dead Ocean Records, <strong>Mt. St. Helens Vietnam Band</strong> provide a refreshing, exhilarating approach to music. Formed around lead singer Benjamin’s will for his adopted younger brother, Marshall to learn the drums, with their newest release <em>Where The Messengers Meet</em>, the band have recorded their finest work to date. With the new LP released at the beginning of last month, we caught up with the band to find out about their inspirations and the recording process.</p>\n<p><em>Crack in the Road: For those new to Mt St Helens Vietnam Band’s music, how would you describe the sound you create?</em></p>\n<div><strong>The  first record was a strange mixture of pieces fused together, sometimes  rather frantic sounding. It was based on parts I had been jamming on  with Marshall for a few years. The riffs, lyrics, and textures were  intended to serve as chapters and scenes that resolved by the end of the  song. Most of the songs were short narratives.</strong></div>\n<div><strong><br />\n</strong></div>\n<div><strong>The  new record is a dark, elaborate and cohesive piece of work. The songs  are more layered musically and lyrically. There is a narrative that runs  throughout all of the songs. We are quite fond of it.</strong></div>\n<div><strong><br />\n</strong></div>\n<p><em>CitR: How was it to work with Scott Colburn on your most recent album?</em></p>\n<div><strong>We worked with Colburn on the 1<sup>st</sup> record. He’s a cool guy. The new record was engineered and co-produced  by Jonathan Warman, a good friend and very talented man. I loved working  with him. We did most of it in his loft, in the historic section of  Seattle, a block from the waterfront.</strong></div>\n<div><em><br />\n</em></div>\n<div>\n<div><em>CitR: How do you think growing up in Seattle affected the music you were to produce?</em></div>\n<div><strong><br />\n</strong></div>\n</div>\n<div>\n<div><strong>I  grew up listening to local bands like Built to Spill, Pedro the Lion,  Sunny Day Real Estate, so I imagine I took a good many cues from them. I  went to a lot of local shows and bought a lot of records. It makes  sense that we would take influence from bands that were in a close  proximity. I would run into some of them of the street, or at record  stores. Local music makes you feel like what you’re doing is possible.</strong></div>\n<div><em><br />\n</em></div>\n</div>\n<div><em>CitR: As  both music fans, and artists in your own right, how has the increasing  use of illegal downloading, as well as the growth of programs like  Spotify affected yourselves?</em></div>\n<div><strong><br />\n</strong></div>\n<div><strong>I  imagine we might be making more money if people bought more records.  But things are always changing and shifting, and the best thing to do is  concentrate on creative ways to market and connect with fans. Right now  is an exciting time to explore new ideas.</strong></div>\n<div><em><br />\n</em></div>\n<div><em>CitR: How important is it to you to be able to put on an exciting and interesting live performance?</em></div>\n<div><strong><br />\n</strong></div>\n<div>\n<div><strong>We  always try to play outstanding shows. If someone puts the effort into  coming to see us, I want it to be a special experience. Every time you  see a band live it is a singular experience; it always sounds different,  the energy is different, and people have an opportunity to hear  textures in the songs they might have missed or not felt as strongly in  prior listens.</strong></div>\n<div><strong><br />\n</strong></div>\n</div>\n<div><em>CitR: If you could have any super power what would it be?</em></div>\n<div><em><br />\n</em></div>\n<div><strong>Teleportation: thus reducing the need for a tour van.</strong></div>\n<div><strong><br />\n</strong></div>\n<div><em>CitR: Thanks very much guys!</em></div>\n<div><a href=\"https://www.myspace.com/mtsthelensvietnamband\"><br />\n</a></div>\n<div style=\"text-align: center;\"><a href=\"https://www.myspace.com/mtsthelensvietnamband\">Check Out Mt. St. Helens Vietnam Band’s Myspace!</a></div>\n<p><script src=\"https://video.unrulymedia.com/wildfire_11244048.js\" type=\"text/javascript\"></script></p>\n","slug":"2724-interview-mt-st-helens-vietnam-band","category":"interviews","date":1283510582000,"wpid":2724,"isSticky":false,"featured_image":{"width":604,"height":403,"src":"2011/06/mshvb-band-photo-01-marshall-verdoes-traci-eggleston-benjamin-verdoes-jared-price-matthew-dammer-tom-mulder-manager-of-the-mount-st.-helens-national-monument-604x403.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAYH/8QAIRAAAgEDAwUAAAAAAAAAAAAAAQIDAAQRBQYSFCFBgeH/xAAVAQEBAAAAAAAAAAAAAAAAAAAAAf/EABkRAQACAwAAAAAAAAAAAAAAAAEAIQIRMf/aAAwDAQACEQMRAD8AziTdV2dJuYumMd+uQrqw4occhkeRxB9kVPvuvWldgZrbIOO8P2lKtN6jNTjP/9k="},"createdAt":1587295008103,"updatedAt":1588403564162,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/06/mshvb-band-photo-01-marshall-verdoes-traci-eggleston-benjamin-verdoes-jared-price-matthew-dammer-tom-mulder-manager-of-the-mount-st.-helens-national-monument-604x403.jpg","categories":["interviews","music"]}