{"id":"5e9c01a2774c2610387e47c0","title":"Film Review: Nymphomaniac: Volume I, Lars von Trier","content":"<p><i>Nymphomaniac: Volume</i> <i>I</i> is the most recent offering from everyone’s favorite Dane, <b>Lars von Trier</b>.</p><p></p>\n<p>The premise is somewhat of a cliché and the opening of the film delivers us to an enclosed alleyway (which has a distinct ‘film set’ feel) where a man discovers a bloody and beaten women. She does not want to the police to be called and the man takes her home for a cup of tea, where she is, without hesitation, able to open up about her life story to a complete stranger.</p>\n<p>The narrative undulates between Joe’s <b>(Charlotte Gainsbourg)</b> recollections of her exploits as a self-diagnosed nymphomaniac and Seligman’s <b>(Stellan Skarsgård)</b> metaphorical interpretations of her confessions which include fly-fishing, Bach and cake forks.</p>\n<div id=\"attachment_27389\" style=\"width: 650px\" class=\"wp-caption alignnone\"><a href=\"https://api.crackintheroad.com/uploads/2014/03/chapter_1_photo_by_Christian_Geisnaes.jpg\"><img aria-describedby=\"caption-attachment-27389\" class=\"size-large wp-image-27389\" alt=\"B & Joe (Sophie Kennedy Clark & Stacy Martin)\" src=\"https://api.crackintheroad.com/images/2014/03/chapter_1_photo_by_Christian_Geisnaes-640x363.jpg\" width=\"640\" height=\"363\" /></a><p id=\"caption-attachment-27389\" class=\"wp-caption-text\">B & Joe (Sophie Kennedy Clark & Stacy Martin)</p></div>\n<p>The film performs a delicate balancing act between revealing the debilitating nature of addiction and lighter moments chronicling Joe’s sexual discoveries. As a teenager Joe’s friend ‘B’, the ring leader of a group who chant “mea maxima vulva” in a cult-like manner and are forbidden from sleeping with any man more than once, triggers Joe’s continuing descent. Whilst B, whose sworn enemy was once love, succumbs to a loving relationship, Joe continues down a path of self-destruction, embarking on a unfulfilling and relentless quest.</p>\n<p><b>Stacy Martin, </b>perfectly cast as Joe’s younger-self, plays out Joe’s story as framed by her older self, from Seligman’s sparsely furnished apartment. Martin’s wonderfully innocent face, chronicles 30 years of a sprawling and chaotic sex-life, set against a backdrop of a beige 70s style England.</p>\n<p><b>Uma Thurman</b> steals the show with a surreal and maniacal cameo. When Joe’s backfired attempt to get rid of a clingy lover results in him leaving his wife (Thurman) for her, she appears at Joe’s apartment, children in tow, ready to dementedly wedge herself in her husband extramarital affair with as much vigor as is possible. Spurred on by her rage and a ‘duty’ to teach her three boys all about Daddy’s new life she asks, “Would it be all right if I showed the children the whoring bed?,” which of course is fast becoming the most quoted line of the film. Unhinged, psychotic & hysterical Therman’s<b> </b>performance certainly makes an impression on the viewer, but all the while, Joe remains unflinching.</p>\n<div id=\"attachment_27388\" style=\"width: 650px\" class=\"wp-caption alignnone\"><a href=\"https://api.crackintheroad.com/images/2014/03/chapter_3_photo_by_zentropa.jpg\"><img aria-describedby=\"caption-attachment-27388\" class=\"size-large wp-image-27388\" alt=\"Uma Thurman as 'Mrs. H'\" src=\"https://api.crackintheroad.com/images/2014/03/chapter_3_photo_by_zentropa-640x359.jpg\" width=\"640\" height=\"359\" /></a><p id=\"caption-attachment-27388\" class=\"wp-caption-text\">Uma Thurman as ‘Mrs. H’</p></div>\n<p>Although chronicling a first-person perspective of a female sex-addict, the movie has a male filter applied. Joe’s sexual journey features her dressed up like a hooker, a schoolgirl and a secretary. As a teenager she roams train cars with her friend B for penises to blow and as a young adult seeks out office-based affairs. Perhaps Joe herself is so ingrained in a culture that focuses on the male perception of sexuality, she actively seeks these fantasies that she knows will please her male lovers. Or maybe von Trier is employing some kind of male lens with the intent of critiquing it. Either way the more important question is whether Joe is telling her story truthfully or merely trying to please her attentive audience. Seligman regularly assures her she is not as evil as she thinks and avoids Joe’s unspoken wish for verbal punishment which helps to divert those viewers whose immediate reaction might be condemnation of her actions. Indeed it is not a-given that Joe is even telling the truth. She is frequently prompted by objects in the room as starting points for her tales, coincidence or artistic license on her part?</p>\n<p>Many questions remain unanswered, setting up a promising pretense for <i>Volume II</i>, which is sure to delight, offend and divide audiences in typical Lars von Trier style.</p>\n<p><i>Nymphomaniac: Volume</i> I is showing at cinemas around the UK and in Europe, and you can watch both films On Demand from <a href=\"https://www.curzoncinemas.com/nymphomaniac/\">Curzon Cinema’s.</a></p>\n","slug":"27387-arts-review-nymphomaniac-volume-lars-von-trier","category":"opinion","date":1395250225000,"wpid":27387,"isSticky":false,"featured_image":{"width":1382,"height":778,"src":"2014/03/chapter_2_photo_by_christian_geisnaes.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAGAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAAAAT/xAAeEAACAgIDAQEAAAAAAAAAAAABAgMRAAUEEiFRgf/EABQBAQAAAAAAAAAAAAAAAAAAAAT/xAAVEQEBAAAAAAAAAAAAAAAAAAAAAv/aAAwDAQACEQMRAD8Am1KJFz9Mzd5m2AfjtGX6KihlPe/bYe+V+5JOQJpArNQY1YH3GMBJdP/Z"},"createdAt":1587282338964,"updatedAt":1588403517631,"author":"5e9b68b27a1236eccfeb1d0a","old_image":"2014/03/chapter_2_photo_by_christian_geisnaes.jpg","categories":["opinion","arts","reviews"]}