{"id":"5e9c33239b6559241525dff4","artists":["5e9b69257a1236eccfeb235e"],"title":"Review: Mt. St. Helens Vietnam Band – Where The Messengers Meet","content":"<img class=\"alignnone\" title=\"MTST\" src=\"https://1.</p><p>bp.blogspot.com/_54AhULmDL64/TECVILwKJmI/AAAAAAAACzc/k75gZJGpajY/s1600/mtsthelensvietnamband_large.jpg\" alt=\"\" width=\"637\" height=\"320\" />\n<p>“<em>The fire only burns in your eyes at night</em>” And so begins the second major label release from<strong> Mt. St. Helens Vietnam Band</strong>. Signed to the prolific <strong>Dead Oceans,</strong><em> Where The Messengers Meet</em> is the follow up to 2009’s critically acclaimed self titled record. Two records in just over a year, not bad for a band who’s youngest member,; their fifteen year old drummer Marshall, has only recently hit his adolescent years, never mind the drums. But boy does he hit them hard.</p>\n<p>Whilst their self titled release seemingly took inspiration from the likes of catchy pop tunes of<strong> Pavement</strong> and the twee songs of <strong>Modest Mouse</strong>, their newest release sees them broadening their horizons and experimenting with a more epic sound, pushing the boundaries which they so excellently yet carefully placed last year. <em>Hurrah</em> is a vivacious beauty; managing to be sharp and compelling at the same time, with <strong>Benjamin Verdoes</strong> vocals landing just on the right side of original. The violins are more prominent, the crescendos are extravagantly exaggerated and the guitars are slick and controlled.</p>\n<p><em>You Were / I Was </em>is another gem of a track, carefully composed guitars swoop and shimmer, whilst <strong>Verdoes’s</strong> vocals lead the ballad along gingerly, before the song explodes abruptly into life. Sounding like a tortured lost soul, the song even steps it up another notch going into the last thirty seconds, with <strong>Marshall Verdoes’s </strong>percussion talents aggressively portrayed. Backing vocals are used to full and elegant effect, allowing the true grandeur of the tracks to be unashamedly exposed, <em>Gone Again</em> is a heart-wrenching ballad. “<em>Don’t you think, it’s time we disappeared?</em>” bemoans <strong>Benjamin Verdoes</strong>, a real unrefined symbol of delicacy. Sitting slap bang in the middle of the album, these two tracks fit impeccably and vibrantly showcase the ability these guys have; from the raw <em>You Were / I Was</em> to the bewitchingly alluring <em>Gone Again</em>.</p>\n<p>Elsewhere the <strong>Television</strong>-esque <em>Messengers </em>contains a hook more thrillingly addictive than Sky Sports News on deadline day, and album closer <em>George Clark</em> is a gently strummed sonnet, also infectiously catchy. <strong>Mt. St. Helens Vietnam Band</strong> have clearly progressed after needing their debut major label release to find their musical feet.<strong> Benjamin’s</strong> vocals are vastly improved, the compositions are broader and bolder, real evidence of their horizons growing. As for <strong>Dead Oceans</strong>, <em>Where The Messengers Meet </em>is an accomplished, prosperous record, which they can add to their ever evolving, lustrous manifest.</p>\n<p style=\"text-align: center;\">Check back in the next few days for a short interview with the band!</p>\n<p style=\"text-align: center;\"><a href=\"https://www.myspace.com/mtsthelensvietnamband\">Check Out Mt. St. Helens Vietnam Band’s Myspace!</a></p>\n","slug":"2738-review-mt-st-helens-vietnam-band-where-the-messengers-meet","category":"music","date":1283459568000,"wpid":2738,"isSticky":false,"featured_image":{"width":637,"height":320,"src":"2011/06/mtsthelensvietnamband_large.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAFAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAEH/8QAHhAAAQQCAwEAAAAAAAAAAAAAAQACAxEEBgUhQZH/xAAUAQEAAAAAAAAAAAAAAAAAAAAB/8QAGREBAAIDAAAAAAAAAAAAAAAAAQARAmHw/9oADAMBAAIRAxEAPwC7du3OQ7dJgYuW6GPGncDQBbJchaOvKFfFvT309wLQSDVoiAo7Ucm2f//Z"},"createdAt":1587295011775,"updatedAt":1588403564215,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/06/mtsthelensvietnamband_large.jpg","categories":["music","reviews"]}