{"id":"5e9c33219b6559241525dff1","artists":["5e9b692b7a1236eccfeb23d6"],"title":"Review: One Night Only – One Night Only","content":"<img class=\"alignnone\" title=\"On\" src=\"https://sphotos.</p><p>ak.fbcdn.net/hphotos-ak-snc3/hs540.snc3/30597_387409636500_7561091500_4453879_8168952_n.jpg\" alt=\"\" width=\"720\" height=\"481\" />\n<p>A few months back if you’d asked me which band I would like to banish to the distant corner of Pluto, Yorkshire 5 piece<strong> One Night Only</strong> would have been relatively high up my list. Not only was their first album as dull as Daniel Radcliffe’s acting, lead singer <strong>George Craig</strong> somehow managed to end up as the partner of the ravishing Emma Watson. So aside from besmirching charts with their turgid music, stealing my dream girl and having a first name for a surname… well they’ve done nothing wrong.</p>\n<p>So you’ll be as surprised as any to hear that I actually like <em>Say You Don’t Want It</em>; the new single from the guys. Fusing anthemic guitars with infectious synths, <strong>One Night Only</strong> appeared to have found themselves a much improved sound. Albeit, it’s nothing that hasn’t been done before, and arguably better by <strong>The Lightning Seeds</strong>, however it’s a vast improvement on the droll that polluted the charts in 2008. The sole problem I have with the song is the atrocious video, featuring Miss Hermione Granger herself, but that’s possibly just loathsome jealously on my part.</p>\n<p>After hearing<em> Say You Don’t Want It</em>, I hesitantly yet slightly optimistically decided to give their new self titled (second album being self titled, who do they think they are? <strong>Razorlight</strong>? <strong>The Libertines?</strong>) album a spin, in the hope of unearthing more pop gems. However, after one listen I knew this was unfortunately not to be, the band instantaneously return to their formulaic indie pop by numbers. The lyrics are abysmally crafted, “<em>where am I supposed to go, I’m hoping that you won’t say no</em>” on <em>Chemistry</em> is as good an example as any. If these words are the love potion he used to woo Miss Watson, maybe she’s not as clever as her Gryffindor points let on</p>\n<p>There are indie love songs aplenty, <em>Never Be The Same</em> could comfortably be a<strong> Scouting For Girls</strong> song, “<em>and with all these clouds high above you, I guess it’s going to rain</em>” purrs Craig, in a manner so saccharine it’s sickening, and that’s coming from someone with a sweet tooth.<em> Nothing Left</em> appears to have walked straight off the set of the Disney Channel, complete with sappy “uplifting” chorus and words to singalong to at the bottom of the screen. Album closer <em>Can’t Stop Now</em> uses the exhausted formula: synths + indie pop band = hit single, sorry guys, but we’re tired of it. “Aww,” I hear you snivel, “don’t pick on the nice pretty boys from <strong>One Night Only</strong>“, I’m not. They are not the only perpetrators of abominably repulsive indie pop by numbers, however this recent album shows they are setting out a good case to claim the crown to be the worst of a bad bunch.</p>\n<p>Let me not take anything away from the lead single though; it’s a future anthem in waiting, a catchy hook, meaningless but flowing lyrics and a chorus to charm the most vexatious heart. However the rest of the album is nothing worth shouting about, unless of course you are shouting to drown out this garbage that calls itself music, in which case you are forgiven. After an entire listen to this record, I can wholeheartedly say the only track that might ever feature again on my iPod is <em>Say You Don’t Want It</em>, even then, I’d be far more inclined to stick on<strong> Like You Do</strong>. Singalong with me now “<em>I’m sinking deep, I’m going under…!</em>”</p>\n<p style=\"text-align: center;\"><a href=\"https://www.myspace.com/onenightonlyonline\">Check Out One Night Only’s Myspace!</a></p>\n<p><!-- END DART (iframe) --></p>\n","slug":"2740-review-one-night-only-one-night-only","category":"music","date":1283470771000,"wpid":2740,"isSticky":false,"featured_image":{"width":188,"height":188,"src":"2011/06/30597_387409636500_7561091500_4453879_8168952_n-188x188.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAABgf/xAAjEAADAAEEAgEFAAAAAAAAAAABAgMEAAUGESEiBxIxMkFC/8QAFQEBAQAAAAAAAAAAAAAAAAAAAQL/xAAUEQEAAAAAAAAAAAAAAAAAAAAA/9oADAMBAAIRAxEAPwCa8h5PTdd4vTGyLVytvyJVwp3moSfSgezf19gfI86ZYvzVt08aSbjxU2zVQC9VyvpD069mA/QJ7PWpHxm1abzJ3o7Mwt2SxJP46SWZls4ViAGIAB1If//Z"},"createdAt":1587295009940,"updatedAt":1588403564188,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/06/30597_387409636500_7561091500_4453879_8168952_n-188x188.jpg","categories":["music","reviews"]}