{"id":"5e9c0159774c2610387e4754","title":"Exhibition Review: ‘The Pale Fox’ Chisenhale Gallery","content":"<p>What if you took all the images that have collected on your computer and created a room that was filled with them? The result may look something like <strong>Camille Henro</strong>t’s <em>The </em><i>Pale Fox,</i> showing at East London’s <strong>Chisenhale gallery</strong>.</p><p> Stepping into a pool of images, sculptures and iPads floated together by the same cobalt blue, I was taken by this buoyant mystery. How do we look at all this ‘stuff?’ The sounds that echoed through the room were mostly reverberating gongs with the occasional recorded cough. I thought at first that cough was someone in the room. I felt as if something was going to happen.</p>\n<p>The title, <i>The Pale Fox</i>, is taken from the creation story of the West African Dogon people. It is an ‘installation version’ of the film <i>Grosse Fatigue</i> presented at the 55<sup>th</sup> Venice Biennale, where Henrot was awarded the Silver Lion for most promising young artist. The film was developed during a residency Henrot undertook at the largest museum in the world, <strong>The Smithsonian</strong> in Washington DC. Henrot describes herself as having a ‘cataloguing psychosis.’ Trying to comprehend all the information that the museum held as forming a single, objective narrative would have been impossible. Dogon mythology is thought to incorporate the belief systems of several different cultures; desribed as a ‘meta-narrative.’ Henrot has taken this concept and used it as a tool for constructing and observing a body of information.</p>\n<div id=\"attachment_27491\" style=\"width: 610px\" class=\"wp-caption aligncenter\"><a href=\"https://api.crackintheroad.com/uploads/2014/03/IMG_4628.jpg\"><img aria-describedby=\"caption-attachment-27491\" class=\" wp-image-27491 \" title=\"Camille Henrot's The Pale Fox\" src=\"https://api.crackintheroad.com/images/2014/03/IMG_4628-260x173.jpg\" alt=\"IMG_4628\" width=\"600\" height=\"450\" /></a><p id=\"caption-attachment-27491\" class=\"wp-caption-text\">Camille Henrot’s The Pale Fox<span class=\"Apple-style-span\" style=\"font-size: 13px; line-height: 22px;\"><br /></span></p></div>\n<p>Other knowledge and anthropological studies are used as another body to sift our own collections of information. Is this the moment when something changes from information to knowledge? During an interview on Resonance FM, <span style=\"color: #333333; font-family: Georgia, 'Times New Roman', 'Bitstream Charter', Times, serif;\">Paul O’Kane </span>describes the revisiting of information being the moment when <em>‘..every time you take your book down from the shelf, it seems like the words in your book have had a party and moved around and found a new form.</em>’ Each time we look at something, the world has changed, so what we are looking at has changed too.<i> </i>In using creation myths as a mediation to give shape to the contents of her digital collection; her collection of fascinations, we now see that ‘the calabash and the DropBox are the same object, they are both containers.’</p>\n<p> </p>\n<div id=\"attachment_27485\" style=\"width: 610px\" class=\"wp-caption aligncenter\"><a href=\"https://api.crackintheroad.com/images/2014/03/IMG_4689.jpg\"><img aria-describedby=\"caption-attachment-27485\" class=\" wp-image-27485 \" src=\"https://api.crackintheroad.com/images/2014/03/IMG_4689-260x173.jpg\" alt=\"Camille Henrot's The Pale Fox\" width=\"600\" height=\"450\" /></a><p id=\"caption-attachment-27485\" class=\"wp-caption-text\">Camille Henrot’s The Pale Fox</p></div>\n<p>There is a toy snake which slithered across the carpet between viewers. I was wondering how it was being moved before noticing the invigilator operating a remote control. Snakes across cultural mythology are the onset of knowledge, like Henrot’s unexpected cough echoed in the room, they are the spark, the ‘bang!’ factor which sneezes everything into a new order.  I wanted to have a go with the remote control snake.  There was a toddler looking quite afraid of it but I wanted to show him otherwise. I’m not sure he was convinced as I lent my hand in the creation of Henrot’s exhibition.</p>\n<p>For further information see Chisenhale Gallery’s website <a href=\"https://www.chisenhale.org.uk/exhibitions/current_exhibition.php\">HERE</a>.</p>\n","slug":"27481-exhibition-review-pale-fox-chisenhale-gallery","category":"arts","date":1396634358000,"wpid":27481,"isSticky":false,"featured_image":{"width":4752,"height":3168,"src":"2014/03/img_4639.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAYH/8QAIBAAAgEDBAMAAAAAAAAAAAAAAQIAAwURBhIUIRMxYf/EABUBAQEAAAAAAAAAAAAAAAAAAAEE/8QAGBEAAwEBAAAAAAAAAAAAAAAAAQIDAEH/2gAMAwEAAhEDEQA/AJLQ1xsK6LvrXNKHOCvxt9Esc+PrBCnHf0TJmrZYk+zESqUwjMw7mjlgoPN//9k="},"createdAt":1587282265972,"updatedAt":1588403516931,"author":"5e9b68b27a1236eccfeb1d21","old_image":"2014/03/img_4639.jpg","categories":["arts"]}