{"id":"5e9c347b9b6559241525e22b","title":"Exhibition Review: Jenny Holzer @ The Baltic","content":"<p style=\"text-align: center;\">\n<p style=\"text-align: center;\">\n<p style=\"text-align: center;\">\n<p style=\"text-align: center;\">Jenny Holzer is perhaps one of the most prolific artists working today.</p><p> Her work has graced LED billboards in New York’s Times Square and even closer to home on t-shirts and fly posts. Her work manages to speak to a demographic beyond the typical art viewer, straying into the mass media through the very means in which she displays her work. Her exhibition now showing at the Baltic Gallery in Newcastle/Gateshead is a definitive showcase of Jenny Holzer’s text based art. Tightly constructed while dizzying in its contradictory ideas, this exhibition is a whirlwind for the senses, yet perhaps not quite as revolutionary as her work once was.<br />\nThe means of displaying the text is interesting in itself; with the words running along LED strips on both the floor and various metal constructions. This is more than simply a striking light show; the works ideology mirrors perfectly with the visual presentation of the words. The words run at a speed that only just allows the viewer to catch a glimpse of the message, thus revealing the works main ideas; censoring freedom of expression. The inability of the human brain to digest the information gives the work its’ main strength; allowing the viewer to catch certain phrases whilst never knowing the ‘truth’. As well as this, Holzer overlays more text running in the opposite direction, the words are visually and intellectually at odds with each other. The idea of contradiction becomes the very cornerstone of the smallest of the three LED constructions as Holzer beams her famous ‘truisms’ at us in the most mesmerising of ways.<br />\nThese short phrases know an ‘truisms’ were recently erected in various areas of the UK; the more right wing phrases shown in liberal areas while more left wing views were placed in areas with nationalistic tendencies. The results in some cases were violent social reactions to a pieces of writing that contradicted with the environment. Although the Baltic is an altogether more neutral and confined environment, the reaction to the ‘truisms’ is still there, yet perhaps to a subtler degree. The feeling of an imposing ideology is unquestionably unsettling, the words immortalised yet futile in their movement. The words at times are disturbing “Anger or hate can be a useful motivating force”, with a sense of totalitarianism hanging in the air, and again the medium serves the work’s sensibility; the lights dazzling and in the loosest sense of the word brainwashing the viewer.<br />\nThe final piece entitled Lustmord Table is by far the simplest of all the work, but is also the only piece that truly moves. The work produced during the Yugoslavian civil war, is by far the most affecting; comprising sets of human bones laid out in rows with engraved silver bands bearing more text. The poems that the words are taken from get under the skin in an emotional swarm as Holzer describes a particularly violent sexual assault from the victim, the perpetrator and a witness’s perspective.<br />\nHolzer’s work may not please everyone as the word’s themselves must move for the work to effect and for many they will seem anonymous and stale. What cannot be faulted though is the works perfect balance of visual and intellectual ideas; they mimic and mirror each other to perfection, but in a way that does a job and often nothing more.</p>\n<p style=\"text-align: center;\"><a href=\"https://www.balticmill.com/\">https://www.balticmill.com/</a></p>\n<p style=\"text-align: center;\"><a href=\"https://www.jennyholzer.com/\">https://www.jennyholzer.com/</a></p>\n","slug":"276-jenny-holzer-the-baltic-2","category":"arts","date":1271314514000,"wpid":276,"isSticky":false,"featured_image":{"width":633,"height":418,"src":"2010/04/holzer_baltic_012_web66.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAQH/8QAIhAAAAQEBwAAAAAAAAAAAAAAAAECBQMEEWESExQVITGx/8QAFQEBAQAAAAAAAAAAAAAAAAAAAwT/xAAaEQACAgMAAAAAAAAAAAAAAAABAgADETFB/9oADAMBAAIRAxEAPwDHpR+Z4crgiE6kqnScunom35rLjRzirnETU7gAN3Ngw3JSLWXU/9k="},"createdAt":1587295355215,"updatedAt":1588403568993,"author":"5e9b68b27a1236eccfeb1d24","old_image":"2010/04/holzer_baltic_012_web66.jpg","categories":["arts"]}