{"id":"5e9c331c9b6559241525dfe8","artists":["5e9b68ec7a1236eccfeb2005"],"title":"Review: Entrepreneurs – Uv Been Robbed (Joking, But Not) EP","content":"<img class=\"alignnone\" title=\"Entre\" src=\"https://kickkicksnare.</p><p>com/uploads/2010/07/Entrepreneurs.jpg\" alt=\"\" width=\"640\" height=\"625\" />\n<p>After Brighton based three piece <strong>Elle Milano</strong> disbanded in October 2008, seemingly out of the blue, their modest, dedicated fan base were left with numerous answered questions. Having only released their debut album four months earlier, and with a support slot for<strong> Hot Club De Paris</strong> on the cards, from an outsiders point of view, everything was going their way.</p>\n<p>Frontman<strong> Adam Crisp</strong> was quick to announce his new project; glitch pop outfit Entrepreneurs, and August saw the first officially released material from them. <em>Uv Been Robbed (Joking, But Not) </em>is an exhilarating listen, showcasing just a smidgen of what <strong>Crisp</strong> has been up to since<strong> Elle Milano’s</strong> separation. Whilst the vocals and lyrical content are in very much the same style as his previous band, that was entirely expected, it’s sound which has seen the largest revamp.<em> Bubblegunk</em> is an electro-fused dance number; funky and fresh, infectious and memorable.</p>\n<p>There’s the same sarcastic wit experienced on<strong> </strong><em>Acres of Dead Space Cadets</em>, the EP opening with the line, “<em>the earth isn’t round, the stars are not real</em>“; how we’ve missed Adam’s occasionally blank yet humorous remarks. Few comparisons can really be drawn, imagine Kele joining up with Faris Rotter, and the two of them proceeding to go on the most minding bending acid trip of their lives; this is how I envision it would sound. <em>Hunting Roger Rabbit </em>has a chorus just as fetching as anything<strong> Elle Milano</strong> ever wrote, whilst the unnerving<em> Six Severed Hates </em>is a hauntingly strange comment on modern society.<strong> Crisp’s</strong> lyrical imagery is robust and substantial, despite the bewitching music itself stuttering abnormally.</p>\n<p>It’s a more than welcome return from<strong> Crisp</strong>, former frontman of a group who never quite galvanized to fulfill their potential shown on a few tracks, and if his future output is in the same vein as<em> Uv Been Robbed (Joking, But Not)</em>, then he is sure to have a bright and animated career ahead of him.</p>\n<p style=\"text-align: center;\"><a href=\"https://entrepreneurs.bandcamp.com/album/uv-been-robbed-joking-but-not\">Download Uv Been Robbed (Joking, But Not) From Bandcamp!</a></p>\n<p style=\"text-align: center;\">Check back over the next few days with for a peculiar yet entertaining interview with Adam!</p>\n<p style=\"text-align: center;\">\n<p><script type=\"text/javascript\" src=\"https://video.unrulymedia.com/wildfire_11244048.js\"></script></p>\n","slug":"2762-review-entrepreneurs-uv-been-robbed-joking-but-not-ep","category":"music","date":1283607111000,"wpid":2762,"isSticky":false,"featured_image":{"width":188,"height":188,"src":"2011/06/entrepreneurs1-188x188.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAABgf/xAAlEAACAgEDAQkAAAAAAAAAAAABAgMEBQARIUEHEhMUIjFCYXH/xAAVAQEBAAAAAAAAAAAAAAAAAAAEBf/EABkRAAIDAQAAAAAAAAAAAAAAAAABAgMRMf/aAAwDAQACEQMRAD8ApmVkxtCrex6UsjkRYKebmrgMFDHqV5G3XYfumEGIorDGsUjCMKAo8OPgbcfHUM7Q0SnXyNmmq17McwCSxDuOm/vsRyNN8XfuNjKjNbsFjChJMh3PpH3okZZ1FC2ppLGf/9k="},"createdAt":1587295004410,"updatedAt":1588403564112,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/06/entrepreneurs1-188x188.jpg","categories":["music","reviews"]}