{"id":"5e9c33199b6559241525dfe2","artists":["5e9b68ec7a1236eccfeb2005"],"title":"Interview: Entrepreneurs","content":"<img class=\"alignnone\" title=\"ADAMCRISP\" src=\"https://2.</p><p>bp.blogspot.com/_tlB_1-PHB20/SvnU-pR4GiI/AAAAAAAAATY/k9IWygCXZ9g/s400/Entrepreneurs.jpg\" alt=\"\" width=\"400\" height=\"400\" />\n<p>After indie pop trio <strong>Elle Milano</strong> disbanded in late 2008, front man<strong> Adam Crisp</strong> was quick to announce his new project, electro-acoustic outfit <strong>Entrepreneurs</strong>. Mixing intriguing instruments, with quirky, off the cuff lyrics, it’s not a huge departure from the scratchy pop experienced on his previous band’s debut, however from the sounds of the recent EP, it’s a bold step forward.<strong><em> Crack in the Road</em></strong> caught up with <strong>Adam</strong>, who’s sarcastic wit found on many of his tracks, was greatly evident in his answers! Enjoy!</p>\n<p><em>Crack in the Road: Can you give us any more insight into the reasons behind the break up of Elle Milano? Was it purely so the band members could go their own musical ways?</em></p>\n<p><strong>Not really, it wasn’t like the usual ‘Musical Differences’ song and dance. I felt it had ran its course, didn’t like the majority of our output (still can’t listen to the album), and just realised on the whole I prefer working on my own. Ask me another day, and I could probably give a completely different set of reasons…</strong></p>\n<p><em>CitR: From the sounds of your new EP, Entrepreneurs are rather more electronic and dance influenced, would you agree with this assumption, and what would you say your main influences were both musically and otherwise?</em></p>\n<p><strong>I suppose its computer music. I wouldn’t call it electronic, electro-acoustic maybe… Most of the parts were sampled from real instruments and other really crazy things like that. I mangle and warp audio big time- what you think is a synth is probably a dead rat squealing backwards through an authentic 1970s plate reverb FX plug-in. My prime concern is to feel like I’m doing something new, I’m nowhere near yet. But making progress. I like Bill Hicks. </strong></p>\n<p><em>CitR: Where did the title for the new EP come from, and what records were you listening to over the period of time that you recorded it?</em></p>\n<p><strong>I don’t know actually. Just made it up. Something from nothing. It really does happen. Hmm, what was I listening to? Let me consult my diary; “Let The Music Play” – Shannon, “Exclusive” – Chris Brown (The album in its entirety), and some U.S. Maple.</strong></p>\n<p><em>CitR: If you had to describe your own sound to someone who had never heard your own music, what would you tell them?</em></p>\n<p><strong>“Entrepreneurs is some really NICE music that has quite a NICE beat and a tune you can hum on your way to work. Affiliating yourself with my brand of sound will make you look even cooler than smoking.” </strong></p>\n<p><em>CitR: What has been your most memorable touring moment to date (in any band)? </em></p>\n<p><strong>Easy. When I joined The Feeling onstage at Party In The Park to do a rendition of “Étude aux Chemins de Fer” by Pierre Schaeffer. Check it out on YouTube. It was one of those magical once in a lifetime things. I only wish I could’ve appreciated it more at the time. </strong></p>\n<p><em>CitR: How has the increasing usage of illegal downloading affected you, both as an artist in your own right, and as a fan? And if you could change the system, how would you improve it?</em></p>\n<p><strong>Well for me as an ‘artist’ I guess the pros and cons cancel each other out, (Loss of sales, but increased exposure etc…) I like the fact no one’s making any money from records these days, maybe it’ll weed out the careerist paper chasers eh? Maybe the kids will realise you’re better off forming a lottery syndicate than a band. As a fan, my conscience currently allows me to pillage ‘successful’ and established artist’s back catalogues, but I’ll buy music by new artists. I’m nice like that.</strong></p>\n<p><em>CitR:  What was the first record you can remember buying and truly falling in love with? </em></p>\n<p><strong>That would be “The Time” by Bros. True, it didn’t have “When Will I Be Famous” on it, but I still model my look on the cover art to this day. Its between that or “Detox” by Dr Dre. I remember buying that record like it were yesterday. </strong></p>\n<p><em>CitR: If you could have any celebrity (alive or dead) guest on a track for you, who would it be?</em></p>\n<p><strong>God. I’d encourage him (/her) to spit a freestyle clearing up all the big questions, settling all religious disputes, ya know… everything. Or he could do the Fresh Prince Of Bel-Air rap. Because, God knows everyone likes that one.  Actually no, I want Chantelle from Big Brother. </strong></p>\n<p><em>CitR: If you could be any animal, what would you choose?</em></p>\n<p><strong>Bridezilla. </strong></p>\n<p><em>CitR: Thanks very much Adam!</em></p>\n<p style=\"text-align: center;\"><a href=\"https://entrepreneurs.bandcamp.com/album/uv-been-robbed-joking-but-not\">Download Entrepreneurs New EP Uv Been Robbed (Joking, But Not)</a></p>\n<p><script src=\"https://video.unrulymedia.com/wildfire_11244048.js\" type=\"text/javascript\"></script></p>\n","slug":"2766-interview-entrepreneurs","category":"interviews","date":1283701091000,"wpid":2766,"isSticky":false,"featured_image":{"width":400,"height":400,"src":"2011/06/entrepreneurs.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAACAL/xAAjEAACAAYBBAMAAAAAAAAAAAABAgMEBQYRIQASIjFRB0Gy/8QAFQEBAQAAAAAAAAAAAAAAAAAAAAH/xAAUEQEAAAAAAAAAAAAAAAAAAAAA/9oADAMBAAIRAxEAPwCLpptJmZz5CnZ2bKVOFNx4curIzYAgqy9GDjZyD6GOIC2O626SW2xlIRJP32Dh2vodNbu9V0rzMUsB4bS+ffEVburfpgGgJWF+ByD/2Q=="},"createdAt":1587295001066,"updatedAt":1588403564060,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/06/entrepreneurs.jpg","categories":["interviews","music"]}