{"id":"5e9c330b9b6559241525dfd6","artists":["5e9b68e07a1236eccfeb1f0e"],"title":"Interview: Club Smith","content":"<p>After two EP’s and a blazing performance opening the <strong>BBC Introducing Stage </strong>at <strong>Leeds Festival </strong>(which is home turf for the band – no pressure there), <strong>Club Smith </strong>are making a very convincing case that they’re the real deal.</p><p> A four piece indie rock band, <strong>Club Smith </strong>master a raw emotionality in their lyrics that is matched by dark and progressive guitar riffs and progressive percussion. There are elements of <strong>Wild Beasts</strong>, <strong>Franz Ferdinand</strong>, <strong>The Sunshine Underground </strong>and <strong>The Cure </strong>in their tracks, with many critics commenting on the band’s ability to blend genres seamlessly. And as far as I’m concerned, they’re all outstandingly right. Each and every one of <strong>Club Smith</strong>‘s track is a winner, all buoyed by infectious hooks and sharp and mysterious vocals. <strong>Crack In The Road </strong>were fortunate enough to catch up with the band to discuss what the future holds for them.</p>\n<p><strong>CITR: </strong>If you had to cite one band/artist as a major influence upon you, who would it be and why?</p>\n<p><strong>CS: </strong>I think collectively between us it’s got to be Blur.  They were so consistently good and played around with so much stuff whilst still producing amazing pop songs every time.  There’s no better career blueprint really, they didn’t sit still but took their audience with them. “13” is a masterpiece.</p>\n<p><strong>CITR: </strong>What has been your favourite gigging experience to date?</p>\n<p><strong>CS:</strong> Leeds and Reading Festivals on the BBC Introducing stage for definite.  It was a very exciting experience and was amazing to play on the same lineup with some massive bands.  The gigs were great too, ace sound and lots of people there too.</p>\n<p><strong>CITR:</strong> You have released two EP’s, ‘The Loss’ and ‘The Process’, within short succession of one another. How were they to create and record, and how did they differ enough to be released separately?</p>\n<p><strong>CS:</strong> They were huge fun to create and record because we had so much time to write the initial songs, and then got to record them with a great couple of producers who worked really well together (James Kenosha and Jamie Ellis).  We kind of see the recordings as “demos” now because the songs are already developing further and we think we can do better.  In terms of the changes between EPs the song-writing became kind of darker I guess, and the lyrics exposed a bit more about me probably, as I was getting more confident in writing in a less guarded way about things like grief and frustration I was experiencing.   I think they differ enough to be released separately and  we released them close to each other to make a statement about what we could do…I’d rather people now saw them as a blueprint for what’s coming next…which will be to record these songs and others focusing on what we know are our best features.  It’s been an experiment in developing the band as much as an opportunity to get people’s attention.</p>\n<p><strong>CITR: </strong>Many reviews have talked about your ability as a band to ‘mix genres’. While there appear to be influences of Wild Beasts and The Sunshine Underground, how do you feel your sound is created and projected?</p>\n<p><strong>CS:</strong> I think it’s a bit of clash between a mood set by the lyrics and melody (mainly my involvement) and the rhythm and structures and arrangements that the others put to it.  It generally works well because I think we get these kind of reflective and sad themes against uplifting and energetic music.  The whole mixing genres thing, if it’s present is probably due to the different interests of band members and the amount of time we have for each other’s contributions in the song-writing process.</p>\n<p><strong>CITR: </strong>If you had to describe Club Smith in three words, what would they be?</p>\n<p><strong>CS:</strong> Thinking most days.</p>\n<p style=\"text-align: center;\"><a href=\"https://www.myspace.com/joinclubsmith\" target=\"_blank\">Club Smith On Myspace</a></p>\n<p><script src=\"https://video.unrulymedia.com/wildfire_11244048.js\" type=\"text/javascript\"></script></p>\n","slug":"2788-interview-club-smith","category":"interviews","date":1283866337000,"wpid":2788,"isSticky":false,"featured_image":{"width":550,"height":425,"src":"2010/09/club_smith_photo.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAIAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAUG/8QAIRAAAQQBAwUAAAAAAAAAAAAAAQIDBBEAEiExBRMyUWH/xAAVAQEBAAAAAAAAAAAAAAAAAAAEBf/EABoRAAICAwAAAAAAAAAAAAAAAAECAAMRITH/2gAMAwEAAhEDEQA/AMREiCRFLDbjDE+OoK7gC0oQm6IujZBKORX0bnL0aD14x2ixLllnQNBMyP41tyb494xkxbGAwNRroD2f/9k="},"createdAt":1587294987855,"updatedAt":1588403563957,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2010/09/club_smith_photo.jpg","categories":["interviews","music"]}