{"id":"5e9c0136774c2610387e4739","artists":["5e9b69577a1236eccfeb2672"],"title":"New: Tom Vek – Sherman (Animals in the Jungle)","content":"<p>702.</p><p> According to Last.fm that is the number of times I played the tracks off Vek’s 2011 album <em>Leisure Seizure. </em>It’s probably fair to say I’m a big fan already – there’s just something about his mix of melody heavy multi-instrumentalism, garage rock approach and slack jawed drawl that strikes a chord.</p>\n<p>It’s became a trope a long time ago to refer to the timescale between his debut and followup, but it’s fair to say no one saw this week’s album announcement -titled <em>Luck –</em> coming. Last year’s <strong>Nothankyou </strong>collaboration with Dirty Projectors’ Olga produced a effortlessly catchy double A side, but even that was years in the making.</p>\n<p><em>Luck</em>, we’re promised, sees Vek in more experimental form than ever. On the strength of preview track /single <strong>Sherman (Animals in the Jungle)</strong> alone, we’re not reallt able to judge whether that’s true. What we do get is an energy that was missing from the, well, leisurely <em>Leisure Seizure</em>. A driving rhythm section propels the action forward, save a brief pause, under synth loops and a jingling guitar riff.</p>\n<p>The end result is not dissimilar to <em>A Chore, </em>but shifting the focus of the track away from his ‘unique’ approach to vocals (I like them, your mileage may differ) back to the repertoire of instruments he is staggeringly proficient with might broaden his appeal this time round.</p>\n<p>His lyrics still makes no sense, mind.</p>\n<p> </p>\n<p><iframe src=\"//www.youtube.com/embed/rkC5lR7Qsng\" height=\"315\" width=\"560\" allowfullscreen=\"\" frameborder=\"0\"></iframe></p>\n","slug":"27884-new-tom-vek-sherman-animals-jungle","category":"music","date":1397200380000,"wpid":27884,"isSticky":false,"featured_image":null,"createdAt":1587282230082,"updatedAt":1588441758786,"author":"5e9b68b27a1236eccfeb1d0b","old_image":"generated/1f54f885ded081769724c54a83954be9ef3839a2.jpg","categories":["music","new"]}