{"id":"5e9c33159b6559241525dfdc","artists":["5e9b68da7a1236eccfeb1ead"],"title":"Review: Buffalo Moon – Wetsuit","content":"<img class=\"alignnone\" title=\"Buffalo Moon\" src=\"https://c1.</p><p>ac-images.myspacecdn.com/images02/74/l_a4ba04d20aa44c2abf56d3459ea225d0.jpg\" alt=\"\" width=\"600\" height=\"650\" />\n<p>The aptly titled <em>Wetsuit </em>is the new LP from dream pop five piece <strong>Buffalo Moon</strong>. Fusing English and Spanish lyrics, with provocative melodies provides for a sensual experience, taking the listener on an enchanting journey full of tambourines, Bossanova rhythms and sweet harmonies. <em>Jamba Samba</em> takes you to a tranquil Spanish town, packed with couples sitting outside enjoying a San Miguel, whilst watching elegant dancers pivot and twirl beautifully. Every now and then you hear a shout of “Hey!”, as the percussionist tosses his tambourine in the air, before catching with exact precision.</p>\n<p>Whilst there are a mix of <strong>Beach Boys</strong> influenced pop tunes, there is the odd ballad thrown in from time to time, like the voluptuous<em> Nocturnal Admissions</em>. The variation isn’t hugely extensive, however the lyrical proficiency and language alterations allow this to go forgiven. My personal favourite;<em> Walking </em>is an upbeat affair, the track flows blissfully with a playful feel to it, as lead singer Karen delivers jubilant vocal parts.</p>\n<p>The hilarious titled<em> Money, Pussy, Weed</em> is a pleasant serenade to the undying love of woman, featuring shared vocal duties and spoken word in places. “<em>The rain is on, but something’s off</em>” moans the Ecuardorian Karen, sounding almost cabaret-esque at times. Another highlight is album closer <em>Beach Boy</em>, a track that has been doing the rounds on the internet as of late, and it’s only takes one listen to hear why. With it’s chirpy tune and infectious chorus, it cements itself as comfortably one of the strongest tracks on the record. Perhaps throughout the record there is a slight overuse of the jazz sections, and the strongest tracks are those which let the vocals guide them, with the brass and swing sections fading into the background, however, there’s nothing particularly to dislike about <em>Wetsui</em>t. An uplifting, carefree summer listen.</p>\n<p style=\"text-align: center;\">Check back over the next few days for our interview with Buffalo Moon!</p>\n<p style=\"text-align: center;\"><a href=\"https://www.myspace.com/buffalomoon\">Check Out Buffalo Moon’s Myspace!</a></p>\n<p><script type=\"text/javascript\" src=\"https://video.unrulymedia.com/wildfire_11244048.js\"></script></p>\n","slug":"2792-review-buffalo-moon-wetsuit","category":"music","date":1283789122000,"wpid":2792,"isSticky":false,"featured_image":{"width":600,"height":650,"src":"2011/06/l_a4ba04d20aa44c2abf56d3459ea225d0.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAALAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAABgP/xAAkEAACAgAFAwUAAAAAAAAAAAABAgMEAAURISIGE0ESFEJx0f/EABUBAQEAAAAAAAAAAAAAAAAAAAEE/8QAHREBAAEFAAMAAAAAAAAAAAAAAQMAAhExYQSR0f/aAAwDAQACEQMRAD8ANX7eXZHNmrZXLBHV761PazAGTthtSwk0X5b+nfidAcGDe6NclrGUtLMd3eOadVZvJA8AnxiNOR3o1GZ3LTSoJOR5cT+nBC3ctR2pkS1YCq7AAStsNfvBHAFyZffyozyWWO1TG9He1//Z"},"createdAt":1587294997724,"updatedAt":1588403564009,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/06/l_a4ba04d20aa44c2abf56d3459ea225d0.jpg","categories":["music","reviews"]}