{"id":"5e9c00f8774c2610387e4703","artists":["5e9b68f27a1236eccfeb2057","5e9b693e7a1236eccfeb24e2"],"title":"Interview: Sarah P","content":"<p>Photos: Hior Chronik</p>\n<p>Up until January of this year, <strong>Sarah P</strong> was best known for her musical output as part of Greek chillwave outfit <strong>Keep Shelly In Athens</strong>.</p><p> Having only released their debut full length album, <em>At Home</em>, in the latter stages of 2013, it came as a shock to many when she announced her immediate departure from the group. Now releasing under her new alias, <strong>Fina Fisken</strong> with <a href=\"https://hiorchronik.bandcamp.com/\" target=\"_blank\">Hior Chronik</a>, Sarah had a quick chat with us to reflect on her time with Keep Shelly In Athens, the emergence of Fina Fisken and the positivity through which she is approaching the future.</p>\n<p><em>CitR: Hey Sarah, how’s it going?</em></p>\n<p><strong>S: It’s good, it’s fine here in sunny Athens. Today is a bit cloudier than the rest of the week, and not as warm thankfully, because it’s already starting to get crazily hot out here!</strong></p>\n<p><em>CitR: It seems a logical place to start would be talking about your time with Keep Shelly In Athens, and it recently coming to an end. Had that been coming for a while and was there any particular reasons behind your departure? </em></p>\n<p><strong>S: It’s been a circle, the ‘chapter one’ in my career and life if you will. It’s been a fun journey for sure, and I got to experience lovely things with Keep Shelly In Athens that otherwise I wouldn’t have seen. Keep Shelly In Athens was my life and is still a great part of my life, that doesn’t change. I’m not a part of the band anymore, but it’s still a great part of me. It was a fantastic experience that helped make up a big part of my twenties, and formed all my life for three years, but some things do not last forever.</strong></p>\n<p><iframe src=\"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/96476369&auto_play=false&hide_related=false&visual=true\" height=\"450\" width=\"100%\" frameborder=\"no\" scrolling=\"no\"></iframe></p>\n<p><em>CitR: I’d imagine there was a lot of learning done in that time, about both yourself and music.</em></p>\n<p><strong>S: Definitely. I feel that I grew up through that experience for sure. Now I feel like I’m an adult, as oppose to feeling like a teenager when I was in Keep Shelly In Athens! Now I enter adulthood and I’m all alone out there. When we started, everything was so new to me. Music, the music industry, being in a band. I’d just finished at acting school, and it was all entirely new to me – I was ‘fresh meat’. You get to learn many things, through the process.</strong></p>\n<p><em>CitR: Looking back on your time with the band, would there be any particular highlights you would pick out?</em></p>\n<p><strong>S: Whenever your record is printed and you get to hold it in your hands… it’s an amazing feeling. We got to travel around the world, we toured North America three times, and played at big festivals, it was a great opportunity that was given to KSIA and to myself.</strong></p>\n<p><em>CitR: So definitely positive feelings looking back on it?</em></p>\n<p><strong>S: At some point some things have to change for many reasons that may appear further down the line; that doesn’t mean that you erase everything and delete everything that has happened… everything that has been so special.</strong></p>\n<p><a href=\"https://api.crackintheroad.com/uploads/2014/04/1925136_1442213772686597_6418780113046072308_n.jpg\"><img class=\"aligncenter size-full wp-image-28089\" alt=\"1925136_1442213772686597_6418780113046072308_n\" src=\"https://api.crackintheroad.com/images/2014/04/1925136_1442213772686597_6418780113046072308_n.jpg\" width=\"552\" height=\"806\" srcset=\"https://api.crackintheroad.com/images/2014/04/1925136_1442213772686597_6418780113046072308_n.jpg 552w, https://api.crackintheroad.com/images/2014/04/1925136_1442213772686597_6418780113046072308_n-205x300.jpg 205w, https://api.crackintheroad.com/images/2014/04/1925136_1442213772686597_6418780113046072308_n-34x50.jpg 34w\" sizes=\"(max-width: 552px) 100vw, 552px\" /></a></p>\n<p><em>CitR: So in terms of the future and looking ahead, you’ve now got the new project, Fina Fisken, The first song was made available online a month or so ago, right? Do you feel you’re coming from a different place with the new material?</em></p>\n<p><strong>S: I’ve been in Sweden for a while, I stayed there for a while, and I’ve been listening to a lot of techno music, and was talking to Hior Chronik (the other half of Fina Fisken) and we were like ‘we should do something together, let’s make it happen’. He’s an ambient musician, and listens to a lot of deep, electronic music, and I’m a pop singer (at least up until now), so there’s clearly differences. We got together over coffee to discuss what we were going to do, and just decided to start jamming. So we got our synths, and just started playing, out of the blue, we just started making that kind of music. To be honest, in the beginning, it felt a little bit weird having to redefine myself after leaving KSIA. Initially I didn’t even want to sing on the new tracks, I just wanted to play my synths, but it came all naturally, I can’t not sing. </strong></p>\n<p><iframe src=\"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/141058734&auto_play=false&hide_related=false&visual=true\" height=\"450\" width=\"100%\" frameborder=\"no\" scrolling=\"no\"></iframe></p>\n<p><em>CitR: I’d imagine it was probably quite therapeutic and quite refreshing, to be making music with someone else, after having mainly worked for so long with the same people. Did it take away some of the pressure and expectation?</em></p>\n<p><strong>S: It was all so relaxed, and so much fun. I didn’t expect it to work so quickly and flow so naturally. What I realised is that you start making music because you have a vision, and a vision to share, and some ideas that you want to share with others. It’s possible to start thinking too deep, to get caught up with ‘likes’ on Facebook, or plays on Soundcloud. That’s not the reason that I started making music.</strong></p>\n<p><em>CitR: And are you planning on having Fina Fisken play live as well?</em></p>\n<p><strong> S: Yes, we have been thinking about that right from the start, it’s an essential part of creating music. We have been already thinking of ways to figure it out live, and make that happen. It would be so much fun. We are like little kids when we are playing with our synths, it would be great to play live as well.</strong></p>\n<p><em>CitR: And the new name, Fina Fisken. Am I right in thinking that it means, ‘Like A Fish’? Is there a personal connection there?</em></p>\n<p><strong>S: It’s a Swedish expression used when something is really good – ‘it’s SO good, it’s Fina Fisken!’. I was taught the phrase by the father of a close friend of mine. I was redefining myself, trying to figure out how I was going to do that. I got to collect new experiences out there, all the walking, and all the snow that I’m not used to seeing in Greece. I was in Gothenbourg, and it’s a lovely lovely town. A small town, but I liked that, very relaxed and the pace of life is perfect. I wanted to make a Swedish reference, because I was surrounded by great people, and the impact they’d had on me. Everything was Fina Fisken.</strong></p>\n<p><em>CitR: The new track sounds quite intense in some ways, quite bold and cinematic. It definitely feels more about a kind of build, and a general atmosphere. What I’m trying to say, is that it doesn’t feel like pop music.</em></p>\n<p><strong>S: Yes, but at the same time, the vocals and the moment that they enter the song, they’re more about the slow pace of life. It was the first sample, we do have some more tracks, and we are discussing putting them out at some point, although we both are working on our main projects. Hopefully we’ll have another lovely moment holding a physical release, feeling proud of your newly born children.</strong></p>\n<p><em>CitR: How have the experiences differed from this time round, to Keep Shelly In Athens?</em></p>\n<p><strong>S: It’s completely different. I felt like a scared girl back when Keep Shelly In Athens started. I’ve always been like a sponge, trying to get as much information as I could, and this approach has definitely helped me. Right now I’m not scared, and I have nothing to be scared of. You reach that point where you realise there is nothing to be scared of. People can say what they want; if you do what you want to do, then that’s right. That was the feeling when we put the first track out, I just called Hior and said “let’s put it out today” it wasn’t something that were planning or thinking about for days. It just happened. “Let’s do it, let’s make it happen, let’s see the first reaction.”</strong></p>\n<p><em>CitR: Have you been pretty happy with the reaction so far?</em></p>\n<p><strong>S: Yes, it’s had a really sweet reception. I’m really grateful to all the people who push the play button, and who listen to our music and share that experience with us. There’s so much information nowadays; you’re bombarded with new music every single day, and it’s really nice that people take the time to listen to ours. </strong></p>\n<p><strong>It’s difficult when you have been the face of another band, and people draw the connection between you and that band, but when you leave the band, but the band keeps going, and you are by yourself… I didn’t expect people to actually listen to new tracks of mine. Ultimately, the future is bright, and I really feel in some ways like I’m restarting and reintroducing myself. I feel like I’ve been given a second chance, I feel free to explore my own musical paths, and I’m very excited.</strong></p>\n<p><em>CitR: So I know you’ve done collaborations in the past (Solar Beats, MMOTHS). Will there be more of these in the future, or possibly a solo album?</em></p>\n<p><strong>S: Yes, definitely. Since I got back from Sweden, I started the project with Hior and I started working on my own album, but at the same time I have been doing so many collaborations, because I love interacting with other artists, and I’m really excited about them. I always welcome when I get to work with people that I really appreciate. I loved the collaborations I did with Keep Shelly In Athens, and I hope to do more.</strong></p>\n<p><em>CitR: So it’s all coming from a very positive place right now?</em></p>\n<p><strong>S: Yes, definitely. Life is too short to dwell on bad advice, and negative thoughts. It’s all about music, it’s all about having fun and giving people an experience and relationships with your music, because they have felt the same thing at some point. It’s all about feeling emotions.</strong></p>\n","slug":"27998-interview-sarah-p","category":"interviews","date":1398693640000,"wpid":27998,"isSticky":false,"featured_image":{"width":100,"height":100,"src":"2014/04/1520746_1442208696020438_5447041375935173786_n-100x100.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAABwMG/8QAJhAAAgEDAgQHAAAAAAAAAAAAAQIDBAURAAYHEyJBIzEyUWGBkf/EABQBAQAAAAAAAAAAAAAAAAAAAAP/xAAWEQEBAQAAAAAAAAAAAAAAAAABAgD/2gAMAwEAAhEDEQA/ACXZtvWsvEc9Zbay4Wul8WsSmUkhAD5ntq1Zt2plq55KG0XhaR3ZoVaEkhCekE++Ma3fCaR4dibjaJ2RsSnKnByEiwfrJ/dL8Ej8iPrb0jv8aKqRyzAm/9k="},"createdAt":1587282168995,"updatedAt":1588403516769,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2014/04/1520746_1442208696020438_5447041375935173786_n-100x100.jpg","categories":["interviews","music"]}