{"id":"5e9c33089b6559241525dfd0","artists":["5e9b68da7a1236eccfeb1ead"],"title":"Interview: Buffalo Moon","content":"<img class=\"alignnone\" title=\"BM\" src=\"https://c1.</p><p>ac-images.myspacecdn.com/images02/113/l_c57173b203394882bd9b61c957352b48.jpg\" alt=\"\" width=\"540\" height=\"720\" />\n<p>Following on from the release of their new album<em> Wetsuit</em>, <strong>Buffalo Moon</strong> are beginning to become one of the most talked about bands on the blogosphere. With an album under their belts that showcases numerous sides to the band, including their Latina influences, as well as their more contemporary inspirations,<em><strong> Crack in the Road</strong></em> caught up with the guys to find out a little about the recording of the album, the formation of the band and plenty more.</p>\n<p><em>Crack in the Road: How did Buffalo Moon come about?</em></p>\n<p><strong>Karen and Preston first wanted to start a Native American inspired band, which kind of explains the band name.  Then Karen went to California for a few weeks, and came back writing tropical music. Tropical music led to checking out Tropicalia and its relatives, and Preston called Joel over Christmas to ask if he wanted to ‘join a Bossa Nova band’ for a show he’d booked for the next week.  With non-current members on drums and bass, we played our first terrible, terrible show.  Shortly after that Jonathan started on drums (and soon Rhodes) and Sarah on bass. </strong></p>\n<p><em>CitR: For those new to your music, how would you describe the sound that you create?</em></p>\n<p><strong>Like five eye witnesses arguing about how a car accident happened.  Also, Latin influenced absurdism, hedonism, nihilism, beastiality, patterns and shapes, color schemes, and BBQ.  Also, a general disagreement about how loud we should play.  Oh, and instrumental incompetency on equipment that doesn’t really work.</strong></p>\n<p><em>CitR: What would you cite as your main influences, both musical and otherwise?</em></p>\n<p><strong>Middle School Jazz Band and Mr. Soukup.  Home recordings, Sly and The Family Stone, Sarah’s Brazil stories and the Brazilian music she brings back.  A vision Preston once had about Prince going down on all of the members of Stereolab.  Also, the beach, plus the Guitar Hero remasters of songs by the Strokes</strong></p>\n<p><em>CitR: Your music has an upbeat and summery feel to it at times, would you say this is due to the area in which you grew up in?</em></p>\n<p><strong>Don’t think you can really avoid that.  I think the beachy seed was planted because of Karen’s Cali trip – then she returned to sub-zero temperature and got all romantic about warm weather, started writing songs.  The thing is, you can have a palm tree as a houseplant in Minnesota, but it’s not going to look like it does outside in LA.  Plus the house is also gonna have  a treadmill in it, some family photos, a shitty litterbox, de-icer, maybe some Vikings memorabilia and probably an engraved wooden sign that says something like, “Live, Love, Laugh,” or maybe, “God Bless this Home.”  Plus you know the old man living there has some weird porn stashed somewhere.</strong></p>\n<p><em>CitR: How did you go about recording “Wetsuit”, did you know which tracks were to feature on the record, or did it evolve over time?</em></p>\n<p><strong>We decided to make an album as soon as we had enough songs, so all but one of them made the record (the one was Black Magic, which we decided to release on a 7″ later).  At the time we didn’t really know what we were doing (still don’t), and I’m sure we were a huge pain in the ass for Neil at New Tectonics (who is a genius).  Wetsuit ended up sounding a lot different than we anticipated, mostly because none us really knew what our sound was – like every member had a ridiculously different perspective (car accident eye-witnesses).  It was surprising to hear the songs, which were loud and sloppy (sometimes intentionally, sometimes not) live, come out so straightforwardly poppy.</strong></p>\n<p><em>CitR: On the inside of the CD release of “Wetsuit” it says “Thanks for nothing Norah Jones”, is that a joke between the group?</em></p>\n<p><strong>None of your beeswax!</strong></p>\n<p><em>CitR: What was the first record you can remember really falling in love with?</em></p>\n<p><strong>Preston: Saturday Night Fever soundtrack (particularly ‘Open Sesame’ by Kool & the Gang)<br />\nJonathan: Nu Thang by DC Talk<br />\nJoel: As a kid it was Everclear’s Sparkle & Fade, but realized I didn’t know what love was until I heard Voodoo by D’angelo.<br />\nSarah: Ziggy Stardust</strong></p>\n<p><em>CitR: Why did you make the decision to fuse English and Spanish in your songs?</em></p>\n<p><strong>Karen is a native Ecuadorian, so it wasn’t really a decision.  Although she does have a prejudice against songs that have both Spanish and English in them.  She obviously has never heard of Rico Suave.</strong></p>\n<p><em>CitR: What has been your most memorable tour moment to date?</em></p>\n<p><strong><em>The pussy steakhouse in Portland. It was called Acropolis. We ate french fries and watched Greek strippers try to dance to Modest Mouse songs.  Pretty much a combination of the best things on earth.</em></strong></p>\n<p><em>CitR: If you could have any super power, what would it be?</em></p>\n<p><strong>Will Smith</strong></p>\n<p><em>CitR: Thanks guys!</em></p>\n<p style=\"text-align: center;\"><a href=\"https://www.myspace.com/buffalomoon\">Buffalo Moon On Myspace!</a></p>\n","slug":"2804-interview-buffalo-moon","category":"interviews","date":1283948066000,"wpid":2804,"isSticky":false,"featured_image":{"width":540,"height":720,"src":"2011/06/l_c57173b203394882bd9b61c957352b48.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAANAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAABQYH/8QAKBAAAgEDAQYHAQAAAAAAAAAAAQIDBAURIQAGEhMiMRQWMkFRYXGC/8QAFQEBAQAAAAAAAAAAAAAAAAAAAQT/xAAaEQADAAMBAAAAAAAAAAAAAAABAgMAEkFh/9oADAMBAAIRAxEAPwCve7W3dVZLDSVNKDb4pAruNRwkBekA92Yj3GmSdTgqiuNxraKnqvNG5kfPjWXgmtqcxeIZw3V6tdfvbDbi8tXdK5HfB58hZx3YB84J+CTr+bAR70XaKNY0ngCoAoHhYuw/naechMsV77jRzVV25n//2Q=="},"createdAt":1587294984152,"updatedAt":1588403563900,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/06/l_c57173b203394882bd9b61c957352b48.jpg","categories":["interviews","music"]}