{"id":"5e9c33069b6559241525dfcd","artists":["5e9b69047a1236eccfeb213a"],"title":"Interview: Hot Horizons","content":"<p>Reminiscent of an acoustic <strong>Bombay Bicycle Club </strong>and containing hints of shoe gaze, <strong>Hot Horizons </strong>create a sound that is both gentle and impassioned.</p><p> Incorporating dreamy synths, beautiful guitar reverbs, and the harmonious vocals of lead singer <strong>Jake McCarthy</strong>, each track soothingly sweeps across your mind while leaving a definite musical imprint. Formed by brothers <strong>Jake </strong>and <strong>Rory McCarthy</strong>, <strong>Hot Horizons </strong>are beginning to grab the attention of many bloggers and music critics alike, and with their next single <strong>October </strong>out in (guess when), October, this is a band definitely worth watching out for. <strong>Crack In The Road </strong>were lucky enough to catch up with the band and find out a little bit more about them.</p>\n<p><strong>CITR: </strong>If you had to cite one band/artist as a major influence upon you, who would it be and why?</p>\n<p><strong>Jake:</strong> I’m a big Johnny Cash fan, but I don’t think I could say that his music or style has necessarily influenced me in my writing or the bands sound. I’d say that this was probably the case for most of the artists I listen to, you pick up little bits from everywhere and try and create your own sound out of them all.</p>\n<p><strong>Rory: </strong>Nothing influences me more than The Beatles, but again, we’ve hardly got a Merseybeat sound going. That’s my favourite part about being in a band, finding out your own sound.</p>\n<p><strong>CITR: </strong>What has been your favourite gigging experience to date?</p>\n<p><strong>J:</strong> We played with Wild Palms at Madame JoJo’s, that was a really fun show. It was one of the first couple of shows we played in London and a load of our friends came out to see us so it made for a really good crowd. The venue’s great as well, completely different from anywhere we’d played before.</p>\n<p><strong>R: </strong>Madame Jojo’s was amazing, I’d also say that playing Underage Festival was really cool, especially since we were playing on the same stage as Connan Mockasin. His is my favourite album of this year.</p>\n<p><strong>CITR:</strong> Many have described your sound as ‘synth-pop’, would you agree? Or are you not fans of music pigeon holes?</p>\n<p><strong>J:</strong> I personally wouldn’t describe it as synth pop. We do play a sort of pop and we do use synths but when I hear ‘synth pop’, I think of people like Human League or The Pet Shop Boys, bands that are really synth heavy. I’m not against people trying to put music into different genres at all, it makes things a lot easier; when you’re telling your mate about a new band, for example, you always try and relate it to someone else or a certain sound so it helps to have something to call it.</p>\n<p><strong>R:</strong> I hate it when people use overly-specific genres, you know; “Post-no-fi-bliss-wave”, but you’ve got to give some kind of label. I think people are quick to jump on the fact a band has a synth, but you can call us what you like.</p>\n<p><strong>CITR:</strong> You recorded your track ‘Spoken’ with Sam Eastgate from ‘Late Of The Pier’, reportedly with half of the time spent in a 1920’s-esque stairway. Is that typical of how Hot Horizons would go about creating and recording a track?</p>\n<p><strong>J:</strong> That recording was actually the first time we’d done anything like that. We usually record everything in Rory’s bedroom, I’m not sure how that came to be because his room is tiny, but it does have a good sound to it.</p>\n<p><strong>R: </strong>We were trying to find the best sounding rooms. I love natural sounding reverb and that staircase had an amazing sound, so we recording the drums in there and ended up sticking all the amps in there to catch that reverb on everything.</p>\n<p><strong>CITR: </strong>Can we expect an EP or a mini album in the near future?</p>\n<p><strong>J:</strong> We’re releasing the single, ‘October’, at the end of October which I’m really looking forward to.</p>\n<p><strong>R: </strong>We’re also recording a load of new stuff, hopefully to release some time early next year.</p>\n<p><strong>CITR: </strong>As brothers, would you ever double date with Swedish pop duo First Aid Kit?</p>\n<p><strong>J:</strong> Absolutely.</p>\n<p><a href=\"https://www.myspace.com/hothorizons\" target=\"_blank\">Hot Horizons Myspace</a></p>\n","slug":"2842-interview-hot-horizons","category":"interviews","date":1284077145000,"wpid":2842,"isSticky":false,"featured_image":{"width":500,"height":500,"src":"2010/09/hot-horizon.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAwQI/8QAIRAAAgIBAwUBAAAAAAAAAAAAAQIDEQASIXEEEzFRYaH/xAAVAQEBAAAAAAAAAAAAAAAAAAADBP/EABgRAQADAQAAAAAAAAAAAAAAAAEAAgMh/9oADAMBAAIRAxEAPwDPcYm7sqOoESbBh5PGNprbXp+U235h9ezLHDTEUtCjxkVn2cOuikuKcn//2Q=="},"createdAt":1587294982297,"updatedAt":1588403563873,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2010/09/hot-horizon.jpg","categories":["interviews","music"]}