{"id":"5e9c33029b6559241525dfc7","title":"Interview: We’re Only Afraid of NYC","content":"<p>Glasgow is known for producing some of the finest musical talent that has ever graced our listening ears, perhaps barring the unfortunate existence of Paolo Nutini.</p><p> Well <strong>We’re Only Afraid of NYC </strong>are no exception, with the band already gaining a big following in their home town and the attention of many prolific bloggers. Featuring heavy guitars and cryptic lyrics, <strong>We’re Only Afraid of NYC </strong>draw on many musical influences such as <strong>Death Cab For Cutie </strong>and the <strong>1990s </strong>in creating their addictive and impassioned sound. <strong>Crack In The Road </strong>caught up with the band after the release of their third EP <strong>Zero Point Three. </strong></p>\n<p><strong>CITR: </strong>If you had to cite one band/artist as a major influence upon you, who would it be and why?</p>\n<p><strong>WOAON: </strong>Tom Waits. He just suits himself, always has. He doesn’t come to you, you have to go with him.</p>\n<p><strong>CITR: </strong>What has been your favourite gigging experience to date?</p>\n<p><strong>WOAON: </strong>Reading and Leeds was an amazing experience. We played King Tuts just beforehand and that was probably the best show we have played, it was very special for us to play our favourite venue, at the top of the bill for the first time.</p>\n<p><strong>CITR: </strong>You have recently released your EP 0.3 for free download, and it has caused quite a stir in the Glasgow music scene and beyond. How was it as an experience to record the EP and to then decide to give it away free?</p>\n<p><strong>WOAON: </strong>Intense. We recorded 0.3 in four days. Knowing the scope of what we wanted to do on the record we thought it would be impossible to do in that time, but we managed it just about. Not having the time to go back over everything, smoothing it out is good. I think the record has a real atmosphere because we didn’t have the luxury of endless retakes to drain all the life out of it. We didn’t want to make a perfect record, just a record that we wanted to listen to.</p>\n<p>Once you make something you think is cool you just want people to hear it so we gave it away as a free download. Didn’t cost us anything to do it and people have been listening to it so we are happy with the outcome</p>\n<p><strong>CITR: </strong>Your lyrics appear to be underscored by a theme of storytelling, instead of the indie pop nonsense normally hurled at listeners. In what ways do you attempt to craft your lyrics?</p>\n<p><strong>WOAON: </strong>The lyrics having story and depth is something we talked about from day one in the band. To us it is freedom, you can go anywhere musically if the lyrics are the thing that anchors the songs. Some lyics are true and come from life but are mixed in with stories and fantasy. So you can put real life in there but it is so tied up in stories and lies that you can get it out there without anyone knowing. Although it’s always the music that is written first, we don’t have journals full of artistic thoughts. Once the music is done it will become obvious what the songs about, if not it doesn’t get finished</p>\n<p><strong>CITR: </strong>How much, and it what ways, were you influenced by the Scottish music scene around you?</p>\n<p><strong>WOAON: </strong>Were not really influenced by it in a direct way. we go into our practice room and disappear into our own world.  We do love a lot of Scottish band like Twilight Sad, We Were Promised Jetpacks, Monde Green, Trapped In Kansas, Copy Haho. In Scotland there’s not been a great tradition of copying what other people are doing. you just make what you want to hear. I think that’s the biggest influence the Scottish scene has had on us. It’s healthy to encourage people to say the things they want to say in the way they want to say them. If you want to hear it, then make it.</p>\n<p><strong>CITR: </strong>If you had to describe We’re only afraid of NYC in three words, what would they be?</p>\n<p><strong>WOAON: </strong>Cool Shoes Friend</p>\n<p><a href=\"https://www.myspace.com/wereonlyafraidofnyc\" target=\"_blank\">We’re Only Afraid of NYC Myspace</a></p>\n","slug":"2844-interview-were-only-afraid-of-nyc","category":"interviews","date":1284163207000,"wpid":2844,"isSticky":false,"featured_image":{"width":500,"height":500,"src":"2010/09/woaon.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAABQYH/8QAIxAAAgIBAwMFAAAAAAAAAAAAAQIDEQAEBRMSFSFBUXGRof/EABUBAQEAAAAAAAAAAAAAAAAAAAME/8QAGBEBAAMBAAAAAAAAAAAAAAAAAQASITH/2gAMAwEAAhEDEQA/ANQ2rU6iHdJkKodNxqyMRRDeov6/ce70o8FWsfGRu7SyRxw8bstk30msLSWQopLtde+SUHsa6ZP/2Q=="},"createdAt":1587294978657,"updatedAt":1588403563819,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2010/09/woaon.jpg","categories":["interviews","music"]}