{"id":"5e9c33019b6559241525dfc4","artists":["5e9b69447a1236eccfeb2529"],"title":"Interview: Sketches","content":"<p>Infectious melodies wound within shades of darkness, <strong>Sketches </strong>are more than your typical indie-pop four piece.</p><p> Originating from the fantastic music scene which is Leeds, <strong>Sketches </strong>have created a sound that stretches further than the humble surroundings they are currently playing in. On listening to <strong>Sketches </strong>you immediately hear the epic guitar riffs, urgent percussion, and powerfully harmonious vocals that dominate every track. If you’re a fan of <strong>Wild Beasts </strong>and enjoy a bit of intelligence in your music, then <strong>Sketches </strong>are a must listen. <strong>Crack In The Road </strong>caught up with the band after the release of their recent EP <strong>1 of 200</strong>.</p>\n<p><strong>CITR: </strong>If you had to cite one band/artist as a major influence upon you, who would it be and why?</p>\n<p><strong>Sketches: </strong>The Police. Everything they do is pristinely worked out and they create a lot of interest without sounding overly complex. We are drawn to how much is going on throughout their music. There is so much to listen to behind the melody without a song feeling over crowded. This is kind of what we try and accomplish in our music. The melody is the most important part of the song, but a lot can be done to support it. We are quite meticulous when it comes to other parts, but this is what we have a lot of enjoyment doing.</p>\n<p><strong>CITR: </strong>What has been your favourite gigging experience to date?</p>\n<p><strong>S: </strong>Cargo, London with The Thermals. We were lucky enough to support them on their UK tour last year and Cargo was the penultimate show. It was our first ‘real’ tour so we experienced a lot of new things. We got on so well with them and it’s crazy how close you get with people when you spend a week or so in each other’s pockets. Cargo, which is a wonderful place to play, summed up the week we had so that’s why it’s probably one of our favourites. Leeds Festival is certainly a highlight too, a childhood box is ticked for some of us having been given the opportunity to play there.</p>\n<p><strong>CITR: </strong>What brought Sketches into existence as a band?</p>\n<p><strong>S: </strong>We’ve all played music in different outfits, none of any significance apart from Luke’s old band; ‘Ready Steady Clothes’ who have incredible whit. We all met in Leeds a few years ago and ended up rehearsing in my kitchen. It took us about 3 weeks to choose a name, which has changed three times since.</p>\n<p><strong>CITR: </strong>How has the recording and release of your recent debut EP been different from your first release with Louder Than Bombs records?</p>\n<p><strong>S: </strong>Much cheaper. We did things very differently to our previous recordings. The EP was recorded in John’s basement and mixed by our good friend Joe. We’ve spent the last few months writing new material and the songs on the EP represent where and what we are up to. The set we play live has changed quite a bit over the last 6 months and we wanted to get something out there that people could take away from live shows and listen to. We are big lovers of vinyl, and our previous two singles were released on 7”. The EP on the other hand is a small release, with a limited amount of CD copies. Something people can easily take home and listen to.</p>\n<p><strong>CITR: </strong>With many drawing comparisons to Wild Beasts, would you consider them a direct influence or simply a band you appreciate?</p>\n<p><strong>S: </strong>First and foremost we are big fans of the band, and ‘Two Dancers’ was, undoubtedly, one of the seminal albums of last year. There are elements in their music that definitely have influenced us. We try to not let one band influence how we sound, especially song specifically. Taking influences from a multitude of artists is what comes naturally to us. The second you try to replicate one single artist you become a second rate version of that band, and that’s a reputation no band wants.</p>\n<p><strong>CITR: </strong>I sense a little bit of early Sunshine Underground in your music .. would you agree? Or am I just reading too much into your Leeds origin?</p>\n<p><strong>S: </strong>Collectively, we don’t know the Sunshine Undergrounds catalogue overly well. Although what we do know we like, Borders is a great song. I think we for some reason didn’t catch on when their first album was released. Sketches didn’t exist back then either. We often get comparisons to Leeds based bands; some just, some not.</p>\n<p><strong>CITR: </strong>If you had to describe Sketches in three words, what would they be?</p>\n<p><strong>S: </strong>Polite. Unfashionable. Broke.</p>\n<p><a href=\"https://www.myspace.com/sketchesband\" target=\"_blank\">Sketches Myspace</a></p>\n<p><strong> </strong></p>\n","slug":"2860-interview-sketches","category":"interviews","date":1284167669000,"wpid":2860,"isSticky":false,"featured_image":{"width":600,"height":450,"src":"2010/09/sketches.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAAAAX/xAAiEAACAQMDBQEAAAAAAAAAAAABAgMABBEFBiEHCBITMWH/xAAVAQEBAAAAAAAAAAAAAAAAAAAAAv/EABkRAAEFAAAAAAAAAAAAAAAAAAABAhEhUf/aAAwDAQACEQMRAD8Amba65bn1SWVLm5tEJYelUt/EM2V4OPgxmp173J7uivJ40h00qkjKCLfjAP6aUq3VATT/2Q=="},"createdAt":1587294977043,"updatedAt":1588403563791,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2010/09/sketches.jpg","categories":["interviews","music"]}