{"id":"5e9c32f49b6559241525dfaf","artists":["5e9b69177a1236eccfeb22bf"],"title":"Review: Luke Abbott – Holkham Drones","content":"<p>From the almost nondescript and in human sounds created by Actress in his second full length album Splazsh, to Flying Lotus’ inter-stellar menagerie of free jazz, hip hop and electronics in Cosmogramma, 2010 has already proven to be a stellar year for exciting, original and intrinsically experimental electronic music.</p><p> <strong>Luke Abbott’s</strong> recently released album <strong>Holkham Drones</strong> fits well within this mould. Clearly many hours have been spent hammering all kinds of electronic machines and analogue synths to create a warm, lo-fi and sonically majestic album.</p>\n<p>What sets Luke Abbott apart from many of this years prominent experimental music producers, is his stunning ability to create awe-inspiring melody and strong song structure. The album features many slow moving tracks, like opening two tracks <em>2nd 5th Heavy</em> and <em>Swansong</em> and the contemplative <em>More Room</em>, which build muffled percussion around beautifully arranged and delicate lo-fi synths to reach a series of similarly euphoric climaxes. In tracks <em>Whitebox</em> and <em>Hello Tazelaar</em> techno influences can be heard, however they retain that same fuzzy, softness which makes so many of this albums tracks so unusual and appealing in this often abrasive genre. </p>\n<p>This addition to <strong>James Holden</strong>‘s label <strong>Border Community</strong>, is the perfect album for any music technology nerds, but perhaps more importantly, with <strong>Holkham Drones</strong>, Luke Abbott has produced something a fresh sounding, unique, experimental album, that has melody to hold almost anyones attention. Such a feat not achieved within British electronic music in such a striking and complete way since <strong>Aphex Twin</strong>‘s <em>Richard D James Album</em> or <em>Music Has the Right To Children</em> by <strong>Boards of Canada</strong>. This is special album, from a ridiculously inventive and talented producer. Not to be ignored.</p>\n<p>9/10 </p>\n<p style=\"text-align: center;\"><a href=\"https://boomkat.com/vinyl/325389-luke-abbott-holkham-drones\">Buy Holkham Drones Here.</a></p>\n<p><script type=\"text/javascript\" src=\"https://video.unrulymedia.com/wildfire_11244048.js\"></script></p>\n","slug":"2863-review-luke-abbotts-holkham-drones","category":"music","date":1285152325000,"wpid":2863,"isSticky":false,"featured_image":{"width":700,"height":700,"src":"2010/09/luke.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAgUH/8QAIRAAAgEEAQUBAAAAAAAAAAAAAQIDAAQFERITITFCkUP/xAAVAQEBAAAAAAAAAAAAAAAAAAAEBv/EAB4RAAEDBAMAAAAAAAAAAAAAAAEAAyECBBEUUYHR/9oADAMBAAIRAxEAPwDOLXMZSSHUcBcjsOUeiPlM5a+2epY2nP23G/n7VbGoqLKyKFYMo2Bo0JL26EjAXMwAJ/Q01x0mRCq6bbX4PXmF/9k="},"createdAt":1587294964464,"updatedAt":1588403563605,"author":"5e9b68b27a1236eccfeb1d18","old_image":"2010/09/luke.jpg","categories":["music","reviews"]}