{"id":"5e9c00a7774c2610387e46af","artists":["5e9b68c77a1236eccfeb1d96"],"title":"Interview: Allie X – Pop Music’s Newest Phenom","content":"<p class=\"p1\"><span class=\"s1\">On the surface, Alexandra Hughes, aka Allie X, is a pop-singer with a predilection for realness—“Forget what I need, give me what I want and it should be fine.</p><p>” “Liberal perception, premature </span>connection. Always heresay.” “I’m your bitch. You’re my bitch.” Mixing bubblegum synth and infectious choruses without the overly optimistic themes of happily ever-after love and politically correct utopias, Allie X is a siren to whom we can relate. See, she has a knack for “cerebral pop” amply defined by its ability to hover between insightful and superficial. Sometimes you want to wear black and write poetry and sometimes you just want to dance! To top it off, she’s got a style plucked right off the streets of Soho (NYC or London) making her a total package. With only three tracks to her name, it is obvious this songstress is sitting firmly on the radar of music’s hit-makers if not already in their offices.</p>\n<p class=\"p2\">Moving from Toronto to sunshiny L.A. after signing on with a record label as a song-writer, Ms. X found a real connection with her new sonic surroundings and began pumping out pop. “What was always coming out of me was pop songs and I used to try to deny that, but with this project I just decided to go full force and explore.” Listening to her bold tracks “Catch,” “Prime” and “Bitch” it’s easy to assume that Ms. X is a fiery, sexual, take-no-shit Scorpio, but perception isn’t quite reality. “I’m a Leo…but I like Scorpios,” she says coyly. <i>Amen. </i>In truth, Allie is rather soft-spoken and delicately charming making her all the more mysterious.</p>\n<p class=\"p2\">Before packing up for California, Alexandra had been performing with friends in Toronto’s heavily indie-rock music scene that she loved listening to, but never fully connected with. “The truth is I felt the most as an outsider in Toronto actually…it’s an incredible place for music and there’s so much talent there and innovation and experimentation, but I never could really find my place.” The longer you speak to Allie X, and properly dive into her cerebral pop, a theme of identity discovery begins to crystallize in her words perhaps more subconsciously than deliberately.</p>\n<p class=\"p2\">#FeelingX, #Xsistence and #XChange are twitter hashtags that have emerged individually with each of Allie’s released tracks Catch, Prime and Bitch, respectively, which facilitate a connection with the songstress and her fans. “The message I want to put out with my work is that everyone can find their own X…I think with pop music it’s always about these idealistic things, but for me it’s all about exploring the chaos and paradox of your existence and being ok with that.” With artists like Charli XCX, and The XX you might confuse the “X” in Allie X as a mere decorative moniker, but Allie explains that “it’s kind of like that indescribable part of your life equation that you’re trying to figure out.”</p>\n<p class=\"p2\">With a message like that, Allie X could very easily become a spear-header for a rising generation; a generation saturated with the creative media circulating Tumblr and Instagram forcing younger and younger generations to find their voice amongst the shouting. Where Rihanna is chided for her appropriation of Tumblr-bred styles like “Ghetto Gothic” and “Sea Punk” there is a sense that Allie X is authentic—at the very least fluent in its workings. One need only peruse the hyper-colored graphics and blinking gifs of her Tumblr (<a href=\"https://alliexandra.com/\">here</a>) to understand.</p>\n<p class=\"p2\">It’s hard to say if Alexandra Hughes is finally coming into her own innate identity or if “Allie X” is just one persona on a long road of experiences to be had. “I feel like I’ve been 5 different people in my life and I’ll probably be 5 different more as life goes on,” she explains. I once jested that Allie X was “the weird girl with the best shoes” to which she replied  “I’ve definitely been that girl, but I’ve also been the major loser with the huge gap in my teeth that people just make fun of.” A surprisingly candid response from a now enviable girl, suggesting that she is finally (and thankfully) reaching the <em>prime of her existence.</em></p>\n<p class=\"p2\">With supremely infectious tracks and a fashion sense to match, Allie X has nowhere to go, but up, and no one to be, but a star.</p>\n<p class=\"p2\"><iframe width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/_ugUFWr8jS0?feature=oembed\" frameborder=\"0\" allowfullscreen></iframe></p>\n","slug":"28814-interview-allie-x","category":"newinterviews","date":1402674834000,"wpid":28814,"isSticky":false,"featured_image":{"width":900,"height":600,"src":"2014/06/bitch-still.gif","placeholder":"data:image/jpeg;base64, R0lGODlhCgAHAIYAAExpcck3XHAmHlsWGGYjG1MXGG0lHHEmHownLnUoGGUhGmQcGnEnHlwaGlcZFI0yJtpOcnoqIWERF0YPE0EPD3AiGzUIC2ggG2QYFokvJW4hGWodGVIMD5o3MH8kKGIdGZs0KWwhGjsJC9w5Zag3MY0vKIkgKG8hHGAZGkkQFIEqGF0aGVoXGJ0rNcMsToIrJ9kuWoMuIVEOEo4zLHEiFqctOoosIn0pJLg/VXEnH9tKZ4UuJb5DXWAfGXsnIIUlK5kvJWcjHH4gJ3IlHXwYH4YmKgAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAACH5BAUAAAAALAAAAAAKAAcAAAdIgCYiFhJEQh5FCD8kPhg4PDIsAykTNiBAOhAcBQ0rKBQONDAuCR0PGSULGiojATEzOxE5JxUhNS1DDAYHBBsfFzcvAjlBCj2BADs="},"createdAt":1587282087998,"updatedAt":1588403516529,"author":"5e9b68b27a1236eccfeb1d20","old_image":"2014/06/bitch-still.gif","categories":["newinterviews","music"]}