{"id":"5e9c00a4774c2610387e46a8","title":"Film: Galore","content":"<p class=\"p1\">Back in February I attended the Berlin Film Festival for 10 days of non-stop film geekery.</p><p> The best film I saw in that time was Galore, from Australia. Rhys Graham’s story of the entangled loves and lives of four teenagers just prior to the devastating Canberra bush fires of 2003 is a work of extraordinary resonance. The film stuck in my head to such an extent after the international premiere that I had to revisit it later in the week to assure myself that it had been that good. It was. It is. Four months on Galore is still the best thing I’ve seen this year.</p>\n<p class=\"p1\">Billie is spending the summer chilling out, partying and being young. She has the company of two people; her best friend and apparent soulmate, the free-spirited Laura, & Danny, the cute guy she is hooking up with down by the river. Life is perfect. Or it would be, if it weren’t that Danny is Laura’s boyfriend, and Laura doesn’t know what is going on. Soon arriving is Isaac, a physically imposing, smart lad who Billie’s care worker mother has brought home to stay. The presence of this outsider, combined with constant parties and the fast-approaching fires, cause tensions to rise. Then something happens that will change the course of the summer beyond anyone’s control.</p>\n<p class=\"p1\">I have never been to Australia nor experienced the devastating fires that afflict the landscape on an almost yearly basis. However these characters and situations feel at once stunningly familiar and engagingly raw. Writer and director Graham spoke about interviewing youths such as those we see here for a previous project, & discovering their concerns were less for the inferno threatening their homes and living environments, & more for their personal & social lives. Anyone near the age of the characters will be experiencing similar emotions, while anyone older will surely empathise and remember that, when growing up, first loves and losses feel like your whole world. A strength of Graham’s writing is that the characters never appear insular or narcissistic; we care for them because they are real people, with the passions, foibles and flaws we all have when we are young.</p>\n<p class=\"p1\">The two best friends are the distinctive heart of the film, which is especially pleasing on several levels. Across the world both cinema & media narratives are very welcoming to tales of troubled young men who make mistakes but work out their issues. Sadly the same space is not afforded to flawed young women. The vibrancy and humanity in Billie and Lauras’ friendship is therefore wonderful to behold; they are real young women who occasionally do things they shouldn’t do. Clearly Graham cares for his characters and story above any other matters; gender equality is never raised as an issue in the film. It is far more nuanced than that. Although love lives are a primary interest to the girls, we see them discussing and doing things outside of this sphere. And where we are used to sexual objectification of young women, here there are scenes of girls expressing their lust for fit young guys. One especially tender moment shows Laura almost overcome by her desire, both romantic and physical, for the guy stood before her. Lily Sullivan gives a sublime mix of fragility and yearning at this point.</p>\n<p class=\"p1\">Great music lifts many fine dramas & this is no exception; I have particular fondness for any film featuring Taking Back Sunday’s angst-roaring ‘Cute Without The E’. Christopher O’Young and Flynn Wheeler achieve that elusive synergy of soundtrack and score throughout. Stefan Duscio’s alluring cinematography both holds close to the actors and gives us vast Aussie vistas to create a world where boredom and a dangerous landscape are voraciously countered by the desire to hang out and have fun. The ending of the film is especially well-formed; Graham’s ability to draw a story to such an emphatic, rousing close in his first feature film suggests memorable movies to come.</p>\n<p class=\"p1\">The film is character-driven, demanding and receiving astonishing performances across the board. Toby Wallace’s Danny is a recognisable figure, caught in a situation he can’t bring himself to resolve. Aliki Matangi, in an impressive first role, gives an edge to Isaac that separates him from the suburban kids. It is, however, the two female leads who really capture our hearts. Ashleigh Cummings illustrates the different registers of Billie’s emotional turmoil as well as drawing us in to care for her. As Laura, Sullivan embodies a convincing counterpart to Billie but also a memorable young woman in her own right. Both gave me that shiver of excitement that only comes when watching immense talents who will surely illuminate our screens for years to come.</p>\n<p class=\"p1\">Making a film that so deftly balances passion for the story with great artistry is a wonderful achievement. To simultaneously give a voice to young people at such a formative time in their lives is nothing short of remarkable. At a Berlin post-screening Q&A, Graham & his team were asked about the meaning of the title, which perhaps translates awkwardly into German. I, though, know for sure what Galore will mean to me from now.</p>\n<p>The film has a June 19 release date across Australia, so all you Aussie readers get your tickets booked now. Negotiations for international release are ongoing, but for those in the UK the film will be showing on 22 & 24 June at the prestigious <a href=\"https://www.edfilmfest.org.uk/films/2014/galore\">Edinburgh International Film festival</a>. Look out for future screenings on <a href=\"https://www.facebook.com/galorethefilm\" target=\"_blank\">Facebook</a> and <a href=\"https://twitter.com/galorethemovie\" target=\"_blank\">Twitter</a>, and in the meantime watch the beautiful trailer below: <iframe src=\"//www.youtube.com/embed/iRWbh_TOLdw\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe></p>\n","slug":"28864-galore","category":"arts","date":1402952756000,"wpid":28864,"isSticky":false,"featured_image":null,"createdAt":1587282084389,"updatedAt":1587825847603,"author":"5e9b68b27a1236eccfeb1d0f","categories":["arts"]}