{"id":"5e9c32ff9b6559241525dfc1","artists":["5e9b69257a1236eccfeb2387"],"title":"Interview: Nerves","content":"<p>Remember when the late eighties rolled into the early nineties, and <strong>My Bloody Valentine </strong>had just released their debut album ‘<strong>Isn’t Anything</strong>‘ and<strong> Shoegazing </strong>was in it’s prime? No? Well neither can I.</p><p> But from snippets of memories and a lot of retrospective listening, I learnt about the awe inspiring sound of <strong>Shoegaze</strong>. For years this sound has remained underground, however Sheffield born and bred <strong>Nerves </strong>are bringing it to the furor once again, but with a modern twist. Dark and brash, their self titled EP is a creation of beautiful guitar reverb and smokey vocals that promises to be anything other than what you will have listened to lately. Fantastically refreshing,<strong> </strong>vocalist <strong>Nicky Hamer </strong>and bassist <strong>Matt Bowles</strong> agreed to give <strong>Crack In The Road </strong>an insight into <strong>Nerves.</strong></p>\n<p><strong>CITR: </strong>If you had to cite one band/artist as a major influence upon you, who would it be and why?</p>\n<p><strong>Nicky Hamer: </strong>Radiohead are quite a big one, just in terms of the songs they write and how they progressed over the years. Also Jim Reid from The Jesus and Mary Chain more recently, when you see old videos of them he’s such a cool frontman.</p>\n<p><strong>Matt Bowles: </strong>Peter Hook used to be a big influence on me, that until he decided to go about singing ‘Unknown Pleasures’. Portishead are probably my favourite band, incredibly sharp and cool.</p>\n<p><strong>CITR: </strong>What has been your favourite gigging experience to date?</p>\n<p><strong>NH:</strong> I think Leeds festival was really good, it was surprising seeing that quite a few people came to watch, also none of us really expected to be doing it when we got together.</p>\n<p><strong>MB: </strong>My personal favourite was a gig at SOYO in the week leading up to Leeds and Reading, we really went into that feeling confident with the set and it went down really well.</p>\n<p><strong>CITR: </strong>The band’s brief bio states that you’re a band doing you’re own thing and not ‘following suit and playing what is trendy at the moment’. While that is entirely respectable (and frankly, very welcome), is there anything currently about the music industry that provokes this ambition?</p>\n<p><strong>MB: </strong>That definitely suggests we’re arrogant about what we do, however I guess some experiences in the Sheffield scene have provoked us to push in a different direction as to how we go about our business.</p>\n<p><strong>NH:</strong> That was written for us, I’m not sure about in the industry but I know locally in Sheffield there’s a lot of bands who sound very similar, that’s changing now as better bands are getting noticed, but I’m guessing that wanting to not be tarred with the same brush as everyone else provokes it.</p>\n<p><strong>MB:</strong> There’s definitely some great bands in Sheffield, Mabel Love in particular are fantastic.</p>\n<p><strong>CITR: </strong>Your tracks all sound particularly atmospheric and dark, does your recording process mirror this?</p>\n<p><strong>NH:</strong> It did when we recorded ‘Running Scared’ and ‘Write Letters’ as we recorded it at Club 60 studios which is underground, the other 2 tracks were recorded in Dan’s bedroom and our practice room.</p>\n<p><strong>MB: </strong>When we recorded ‘Seams’ in Dan’s bedroom we didn’t really know was what going on, Dan was the only one who knew how to use the gear and his room was the only place we could do it. I guess you get a real sense of how raw we really were. When you compare that to ‘Write Letters’ or ‘Running Scared’ which we did with Paul Blakemen, it’s obvious to see how we’ve transferred the sound we’ve got over to a polished, professional process.</p>\n<p><strong>CITR: </strong>You’ve released some of your tracks on cassette tape; why?</p>\n<p><strong>NH:</strong> We thought it would be a fun thing to do, it’s a bit quirky I guess.</p>\n<p><strong>CITR: </strong>Your sound has been compared to Sonic Youth and My Bloody Valentine, especially due to your fantastic use of reverb. What is it about these bands that affected you as a band as individuals?</p>\n<p><strong>NH: </strong>Just some of the sounds they make, you can’t really replicate it with these bands now because some of the gear they use isn’t around any more and they used different techniques to use it. But it sort of inspires to make different noises I guess.</p>\n<p><strong>CITR: </strong>What three words would you use to sum up Nerves?</p>\n<p><strong>NH: </strong>Noisy, Grumpy, Lovely</p>\n<p><strong>MB: </strong>Oliver Leary’s Crackers</p>\n<p><a href=\"https://www.myspace.com/nervessevren\" target=\"_blank\">Nerves Myspace</a></p>\n","slug":"2897-interview-nerves","category":"interviews","date":1284245635000,"wpid":2897,"isSticky":false,"featured_image":{"width":720,"height":480,"src":"2010/09/nerves.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAYH/8QAIBAAAQMEAgMAAAAAAAAAAAAAAQIDBAAFERIGIRMxMv/EABUBAQEAAAAAAAAAAAAAAAAAAAAD/8QAFxEBAQEBAAAAAAAAAAAAAAAAAQACIf/aAAwDAQACEQMRAD8Azy3cvtdpiwFvWtt9+CltUJ0jptSvrcDGw1HRwTkCpCXf4Tkt5YjMEKWo58XvulKnlU7C/9k="},"createdAt":1587294975228,"updatedAt":1588403563765,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2010/09/nerves.jpg","categories":["interviews","music"]}