{"id":"5e9c0093774c2610387e4691","artists":["5e9b68e57a1236eccfeb1f6a"],"title":"Interview: Dawn Golden","content":"<p>Dexter Tortiorello is a music producer and maker, originally hailing from Chicago of the Northern American continent.</p><p> In the last few years he has lost his job, lived on little more than a solar powered laptop with Ableton Pro in a remote Hawaiian jungle, started two different musical projects, and now he’s reached our tiny little island for the 2014 Camden Crawl.</p>\n<p>Dexter is visiting us to promote his second full record as Dawn Golden, entitled <a title=\"Dawn Golden Still Life on SoundCloud\" href=\"https://soundcloud.com/dawn-golden/sets/dawn-golden-still-life-exclusive\" target=\"_blank\">Still Life</a>, and on this warm Friday afternoon it seems like a suitable time to mull over what might possibly one day become a milestone for the humble American.</p>\n<p><strong></p>\n<p>A first visit to the UK?</strong></p>\n<p>I actually played a show here in 2011 at Madame Jojo’s which was a lot of fun. It was a White Heat show with <a title=\"Halls on SoundCloud\" href=\"https://soundcloud.com/halls\" target=\"_blank\">Halls</a>, who is really fantastic. I think I only realised after that he’d done a load of really big shit and I really should have been opening for him in London.</p>\n<p><strong>So I read about your trip to Hawaii, was there something deliberate you were trying to do with the <a title=\"Houses on Facebook\" href=\"https://www.facebook.com/housesofficial\" target=\"_blank\">Houses</a> project there or was it a wholly personal endeavour?</strong></p>\n<p>It certainly started as a personal endeavour, as Houses only fully formed when I got home and began recording everything I had been working on out there. But the experience certainly influenced that first Houses record a lot, it was the first time I’d been off my own continent and to be in the middle of a jungle running on almost nothing was an unreal experience for me.</p>\n<p>I had been fired from my job, sitting around and quickly going into the psyche of a generally unemployed person where you get into a routine of sleeping in and then doing nothing. So I decided I didn’t want to settle into that too much. I felt it happening and had to break out of it somehow.</p>\n<p>When I came back, I found that I was in a really good head-space and wanted to make music that was a little bit more upbeat than I had before. So I did that, and immediately withdrew back into dark shit, which was when I wrote the first Dawn Golden EP (<em>Blow</em>).</p>\n<p><strong>To me your music is always striving lyrically towards a real human experience, whilst alongside that the electronic tracking and mixing adds a layer of abstraction. Is that always how you’ve approached writing music?</strong></p>\n<p>That’s definitely how I’ve always approached writing lyrics to my songs. I have a really hard time writing vague lyrics, and I’m envious of people who can write in that way, as if they’re writing about a feeling rather than an event – because it seems like people connect with it more. I just can’t write like that – I write about personal things from my life, and I’ve noticed particularly recently that it’s all very structured, almost as if I’m telling a story.</p>\n<p>In terms of music, I used to just play acoustic guitar and sing – I’d write very sad and dark songs. There’s this guy who just released a record that really reminds of the stuff I used to write but I can’t for the life of me remember his name.</p>\n<p><em>At this point Dexter rifles through his iPhone for a few moments before giving up. We decide to use the example of Josh T Pearson instead.</em></p>\n<p>I remember playing SXSW one year, and he came on after us and I think it was his first show in Austin in ten years. So this guy comes out with a big beard, crazy eyes, a guitar and these super long fingernails, and he just starts plucking away. I stood there through the whole set and I couldn’t take my eyes off him. He was crying during one of his songs, and I just thought it was one of the most engaging things I’d ever seen.</p>\n<p>But that’s what I used to try to do, though I wasn’t as good of an instrumentalist as he is, or singer for that matter.</p>\n<p><strong>Not an easy person to emulate, mind. It’s funny as you talk about writing style, I discovered your projects through a series of diaries you wrote on <a title=\"Portals Music\" href=\"https://www.portalsmusic.com/\" target=\"_blank\">Portals</a>. Did you find it easier to write on the page first, and then decide you wanted to put it to your music?</strong></p>\n<p>I think so, I went to college for a short time and went for a creative non-fiction writing degree. It was all very arts school but it’s what I wanted to do for some time. I decided to quit fairly quickly, and I began working on music almost straight after.</p>\n<p>Those Portals kids all have their own different blogs and together I think they are completely responsible for me having a music career. Dave Sutton from <a title=\"Stadiums & Shrines\" href=\"https://stadiumsandshrines.com/\" target=\"_blank\">Stadiums & Shrines</a> was the first person ever to blog about my music, which at the time was the coolest thing I’d ever seen – ‘oh my god someone I don’t know wrote about this thing I did’.</p>\n<p><strong>I think I found Portals through Awd Castles</strong>.</p>\n<p>Ah yes he has a new soundcloud blog which is unbelievable. All those kids are so dear to my heart, they’re doing something really cool and I hope one day soon they get a cult following – their writing is really good and their taste in music is impeccable.</p>\n<p><strong>Is your music intrinsically pessimistic, or is that unfair?</strong></p>\n<p>I don’t think it’s pessimistic. I think at first glance this Dawn Golden record is almost entirely dark, and there’s not a great deal of light at the end of the tunnel in terms of lyrics. But musically I try to brighten things up with synthesisers and drums. I’ve always loved bands that could do that, like <strong>The Smiths</strong> and <strong>Joy Division</strong>, where you’re dancing to a song but if you decided to listen to the lyrics you’d find it really dark.</p>\n<p><strong>What are the differences you’ve noticed going from Chicago to Los Angeles, and perhaps thinking back to your time in Hawaii – do you consider cities a stimulating environment or constraining?</strong></p>\n<p>I think both are very important. Going from Chicago to Los Angeles was very interesting, I’m still now realising how completely different those two cities are from each other. The people couldn’t be any more different, and the crazy thing about touring is being in a new city every night and seeing how different everyone is. And then you realise when you go back home that your own city has a similarly distinctive personality and atmosphere.</p>\n<p>I fucking hate Rochester, New York. The people are weird, the clubs suck. This will be going out on the internet, but it’s fine – I don’t ever want to play there again.</p>\n<p>Cities like that really make me really appreciate Chicago because there’s actually a lot of character and culture, and I find the young movements there really interesting but I’d say coming to Los Angeles I’ve realised how grounded a lot of the kids in Chicago are. As you see on the TV there a load of superficial people in LA, who would genuinely rather look the part of something than actually be doing it, because they just want to be an image, go to a bar and get laid. But still overall I think there’s more talented kids to work with in Los Angeles than Chicago – in what I want to do at least. If I wanted to make a noise band I’d probably go back to Chicago.</p>\n<p><strong>Are you sticking around for the festival?</strong></p>\n<p>I’m definitely sticking around for <strong>Dirty Beaches</strong> and I’m definitely sticking around for <strong>Atari Teenage Riot</strong> because they were one of my favourite bands growing up. I don’t know who else is playing tonight, or where. I have nothing to do tomorrow so maybe I should just head back down here.</p>\n<p><strong>You should. Thanks Dexter.</strong></p>\n<p>Dawn Golden can be found on <a title=\"Dawn Golden Facebook\" href=\"https://www.facebook.com/dawngoldenmusic\" target=\"_blank\">Facebook</a>.</p>\n","slug":"28982-interview-dawn-golden","category":"interviews","date":1404812227000,"wpid":28982,"isSticky":false,"featured_image":{"width":100,"height":100,"src":"2014/06/dawn-golden-2-100x100.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAABwMG/8QAIRAAAgEDAwUAAAAAAAAAAAAAAQIDAAQRBQYxEiFBUfD/xAAUAQEAAAAAAAAAAAAAAAAAAAAA/8QAFBEBAAAAAAAAAAAAAAAAAAAAAP/aAAwDAQACEQMRAD8AK9mNYtc3R1CURpHbO0Z5Jk4Xt94rfR69aRRrGy4ZQFI9EUTqqiPPSMgE5xVFAKgkAkjmg//Z"},"createdAt":1587282067596,"updatedAt":1588403516369,"author":"5e9b68b27a1236eccfeb1d22","old_image":"2014/06/dawn-golden-2-100x100.jpg","categories":["interviews","music"]}