{"id":"5e9c009e774c2610387e46a1","artists":["5e9b68fe7a1236eccfeb20ec"],"title":"New: Grimes – Go (ft. Blood Diamonds)","content":"<p>So here we have it, the first <strong>Grimes</strong> material in over a year.</p><p></p>\n<p>[soundcloud url=”https://api.soundcloud.com/tracks/156075705″ artist=”Grimes” title=”Go”]</p>\n<p>Warning signs abound as the rumour mill has been slowly fed the news that it was a track written for <strong>Rihanna</strong>. That <strong>Rihanna</strong> had rejected it. That blah blah.</p>\n<p>It’s not hard to see why.</p>\n<p>Regardless of personal preference, and I’d largely fall on the non-fan side of things, <strong>Rihanna</strong> and her team are not in the business of dropping tracks without a reason – particularly not one coming from the current darling of alternative-pop. They’re savvy and quick to spot a cutting edge track when they hear one.</p>\n<p>The reason this was overlooked is because it is bland, trap-derivative guff. Even if this had come out at the same time that <strong>Bauer</strong> was still riding the wave of <em>that track</em>, could you really see <strong>Rihanna’s</strong> team opting for this over <em>‘We Found Love’</em>?</p>\n<p>This is even more disappointing when compared to the constant progression <strong>Grimes</strong> has exhibited in her work. I’m not talking stylistically, we’ve previously written at length about our thoughts regarding fans’ expectations, but rather it generally feels very unconsidered.</p>\n<p><em>Visions</em> was considered a tour de force for a reason, taking the weird and wonderful musical stylings of the <strong>Grimes</strong> of old and slickly packaging it up, without losing it’s fantastical and whimsical edges. It was a demonstration of a growing mastery of her craft, even down to appreciating the utility of silence – don’t tell me your breath has never fallen flat in your throat in that momentary pause before the first note of <em>Genesis</em> kicks in?</p>\n<p>In comparison this just feels quite amateurish and bereft of personality.</p>\n<p>Now, you may be thinking this is a little harsh, but there is a glimmer of hope. So much has been made of the fact this was created for another artist, it’s doubtful that her next album will follow in the same vein. If it sees her take a shift towards straight edged pop that means she finally breaks out in to the mainstream consciousness? Hell yeah, <strong>Grimes</strong> deserves it.</p>\n<p>But this isn’t the track that will do it.</p>\n","slug":"28991-new-grimes-go-ft-blood-diamond","category":"music","date":1403849475000,"wpid":28991,"isSticky":false,"featured_image":{"width":1280,"height":800,"src":"2014/06/grimes5-john-londono-1280x800.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAGAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAAAAb/xAAfEAACAQUBAAMAAAAAAAAAAAABAgMABAURMQYHEnH/xAAVAQEBAAAAAAAAAAAAAAAAAAACA//EABkRAAIDAQAAAAAAAAAAAAAAAAECAAMREv/aAAwDAQACEQMRAD8AvLP1GKkwljf46xlS3ZVd1lUfYA91ptE96RUXefMXnIbueIYjIEI7LvUY4f2lKpQOmbY2UYJ//9k="},"createdAt":1587282078878,"updatedAt":1588403516449,"author":"5e9b68b27a1236eccfeb1d0b","old_image":"2014/06/grimes5-john-londono-1280x800.jpg","categories":["music","new"]}