{"id":"5e9c32f99b6559241525dfb8","artists":["5e9b68f87a1236eccfeb2093"],"title":"Interview: Frontiers","content":"<p>Nottingham based quartet <strong>Frontiers </strong>have already played some of Britain’s most well known festivals, including <strong>Reading & Leeds, Summer Sundae, Y-Not, </strong>and <strong>Camden Crawl, </strong>and are nearing half a million profile views on a Myspace page that is littered with positive high profile reviews.</p><p> However I wouldn’t blame you if, even after all of that, you still haven’t heard of them. This is probably in part due to the fact that when the band played <strong>Summer Sundae </strong>last year, the average age of the group was 18 and their drummer was still awaiting his GCSE results.</p>\n<p>As <strong>Jake </strong>from the band mentions in our interview, a lot of this attention was shone over the band somewhat prematurely. This meant a lot was expected from a group that was still in vital stages of its development, both in terms of their sound and their maturity. However while this may have led to some bands attempting to run before they could walk, <strong>Frontiers </strong>instead took time to develop their post-punk sound, which has influences ranging from <strong>The Cure</strong>, <strong>Interpol</strong>, and <strong>Muse</strong>. Their tracks have that Killers-esque anthem quality, and a passionate darkness that draws the listener into every riff, hook and lyric of each track. <strong>Crack In The Road </strong>caught up with <strong>Frontiers </strong>bassist and vocalist, <strong>Jake Austin</strong>.</p>\n<p><strong>CITR: </strong>If you had to cite one band/artist as a major influence upon you, who would it be and why?</p>\n<p><strong>Jake:</strong> If I had to choose one band that inspires me, I’d probably say Muse. I really got into them back in 2006 after Black Holes and Revelations came out and they performed Supermassive Black Hole on Friday Night with Jonathan Ross. That performance made me explore their other albums and after hearing Absolution, I picked up a bass guitar for the first time. Obviously they’re all incredibly talented musicians, but there was something about Chris’ bass sound and style that I couldn’t ignore.</p>\n<p>A few months later I started jamming with Charlie and Alex, then we find ourselves here now. I’ve done a lot over the last couple of years in the band, and it’s odd to think that if I hadn’t watched that performance, and listened to that music, none of this may have happened. It is really like that. Muse probably aren’t my favourite band at the moment, but as far as influencing me goes, there’s no question they’ve had a profound effect on my bass playing style. In my opinion, Chris is the best rock bassist in the world, closely followed by Colin Greenwood.</p>\n<p><strong>CITR: </strong>What has been your favourite gigging experience to date?</p>\n<p><strong>J: </strong>We’ve been fortunate to do a lot of great gigs over the past 18 months or so. In terms of an experience, the first support slot we did with We Are Scientists at the Cambridge Junction was unbelievable. Playing to a packed crowd who, despite never hearing us before, were quite responsive and respectful was incredible. And WAS are such nice people. In terms of performance, one that I particularly enjoyed was the Camden Crawl earlier this year. From our point of view, we played well, it was our first London gig, the room was absolutely rammed, even with people queuing on the stairs to get in, and the sound was excellent. All those things made it immensely enjoyable, but I think it was more the fact that we expected absolutely no-one to be there apart from a few friends and family. To play in front of such a great crowd was a pleasure, and it really gave us a boost and I think it showed. Hopefully we’ll go back with great memories and top it!</p>\n<p><strong>CITR: </strong>What brought ‘Frontiers’ as a band into existence?</p>\n<p><strong>J: </strong>Alex, Charlie and I went to the same school and we were good friends. When I heard that they had started to play a bit of music for fun, I asked to join them. Turns out they were thinking of asking me too so it worked quite nicely! We just had a passion for music and once we realised we enjoyed doing it, we really started driving at it. After a couple of drumming changes, Jonnie joined us towards the back end of 2009, and it’s been brilliant since. We’re a really tight unit at the moment and great friends so it’s a lot of fun. And Jonnie’s here to stay!</p>\n<p><strong>CITR: </strong>Your tracks have a strong ‘post punk’ sound about them, even with tinges of The Cure. Would you agree? If not, what genre do you feel you aspire to?</p>\n<p><strong>J: </strong>This is a difficult question to answer. To be honest, I don’t really read into what we sound like, or look to put ourselves around a particular genre. Obviously, we play guitar-based music and people will associate us with such tags as ‘post-punk’, which is absolutely fine, but I strongly believe in the idea that it doesn’t matter what you sound like, as long as the music you’re creating is inventive and really good, you’re heading in the right direction. Putting bands in genres is so subjective so i’ll leave it open for people to interpret where we lie.</p>\n<p><strong>CITR: </strong>You played Summer Sundae and Leeds/Reading Festival last year, following up with performances at Camden Crawl and Y-Not Festival this year. How do you find festival performances as experiences?</p>\n<p><strong>J: </strong>At the time, they’re always incredible, but it takes you a bit of time afterwards to digest the performance and analyse what really happened. Everything is always really hectic on the day, you can get nervous, and it’s all over in a flash, so you have to really enjoy the time that you are on stage. Preparation is important for all gigs, but we really put the extra time into festival performances as they can be such a springboard in gaining new fans and you have to choose an appropriate setlist for the kind of festival it is. Nevertheless, festivals really are amazing, especially the ones we’ve played at where we’ve been paying customers in the years before. That makes it that little bit more special.</p>\n<p><strong>CITR: </strong>You were tipped heavily last year by many bloggers and critics this time last year, but still no EP. What gives?</p>\n<p><strong>J: </strong>We weren’t ready, and we think we still aren’t! Last year we had a couple of high profile gigs that you’ve mentioned such as R & L and Summer Sundae, and at the time, we were no more than a young band with a few songs who were over the moon to be playing such stages. And make no mistake about it, those gigs were immensely important to us and we had the best time doing them. However, we’re a completely different band now. I looked at our setlists from last Summer and there’s only two songs we still play now. We’re older and wiser with a line-up change for the better, and I think it comes across in our music. In terms of our development as a band, those performances came really early, and in an odd way we’re fortunate that the performances seemed to impress but not impress to the point where people were bugging us to know more, as last year we just didn’t have the songs and the infrastructure as a band that’s so important in the music industry at the moment which is in complete tumoil. Looking back at the gigs at R & L, they were actually pretty bad despite the experience being phenomenal. A lot went wrong that weekend with our instruments and backline, but it all added to the experience as we learnt some valuable lessons that made us really sharpen up as a band, for the better, so it’s all relative.</p>\n<p>Charlie said to me a few weeks ago at Leeds that he wished we’d played this year instead of last year, but then I said that we learnt so much last year that gave us a kick up the arse for this year. It’s just important to do your best at the time and learn from every gig you do. Gigging experience has been critical for us, and we’re getting to a point now where we’re quite happy with the songs we have, although in another 12 months i’m sure i’ll say the same thing as in the last 12! We’re hoping for a proper release sometime in the next 6 months and more high-profile gigs next year. We’re just trying to get everything in place behind the scenes at the moment, as when you become more in the limelight, it’s very difficult to stop the rollercoaster of a process, so you have to have all the songs and infrastructure in the band in place, ready for when that happens. You rarely get more than one chance to impress and we’re trying to ensure when that comes around, we’re ready for it. But we’re really excited.</p>\n<p><strong>CITR: </strong>If you had to sum up Frontiers in three words, what would they be?</p>\n<p><strong>J: </strong>Errrrrrrrrrrrm… guitars, guitars, and… fifa?</p>\n<p><a href=\"https://www.myspace.com/frontiersofficial\" target=\"_blank\">Frontiers Myspace</a></p>\n","slug":"2912-interview-frontiers","category":"interviews","date":1284819060000,"wpid":2912,"isSticky":false,"featured_image":{"width":600,"height":368,"src":"2010/09/frontiers.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAGAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAYH/8QAIBAAAQMEAgMAAAAAAAAAAAAAAQIDBAAFESESEwYUFf/EABQBAQAAAAAAAAAAAAAAAAAAAAD/xAAUEQEAAAAAAAAAAAAAAAAAAAAA/9oADAMBAAIRAxEAPwDErT58zCtbUP4FpU60hsJk+uC5ySrZOThQI0QRUdMnGRLfe6WU9i1L4pbCQMnOABoUpQf/2Q=="},"createdAt":1587294969738,"updatedAt":1588403563682,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2010/09/frontiers.jpg","categories":["interviews","music"]}