{"id":"5e9c32fb9b6559241525dfbb","artists":["5e9b69577a1236eccfeb267f"],"title":"Interview: Toyger","content":"<p>No longer is the A66 the best thing to come out of Middlesbrough.</p><p></p>\n<p>To any sensitive Teesiders reading this article, please accept my humble apologies. However let us not focus on the perceived negativity, and instead let me introduce <strong>Toyger</strong>. Anything but the <a href=\"https://www.toygers.org/\" target=\"_blank\">‘new breed of domestic cat that is being developed to resemble a tiger’</a>, <strong>Toyger </strong>are a five piece from Middlesbrough who describe their sound as ‘experimental indie’. Having only formed 6 months ago, <strong>Toyger </strong>have already attracted the attention of regional radio and critics, and have featured in a showcase event featuring some of the North East’s finest musical talent. All very deserved praise for a band that have created a sound that is full of disjointed guitar riffs and upbeat percussion, which they somehow mould into addictive, and very lyrical, tracks. While <strong>Toyger </strong>are by no means the finished product, they are certainly on the road to becoming so.</p>\n<p><strong>CITR: </strong>If you had to cite one band/artist as a major influence upon you, who would it be and why?</p>\n<p><strong>Rory:</strong> That’s such a hard question to answer! Being a five piece band I guess we all bring different influences from the table. For example we’ve been described as a math-pop band but I didn’t really listen to math music before I joined, so I was more influenced by indie bands such as The Maccabees and Bombay Bicycle Club when we wrote our Demo E.P.</p>\n<p><strong>James: </strong>I’m really into math bands such as Tera Melos and Faraquet so our music sort of falls between the two.</p>\n<p><strong>Rory: </strong>We all listen to Foals a lot so you could maybe call them a major influence. And Tubelord. And Colour. Yeah that doesn’t really answer the question…</p>\n<p><strong>Nick: </strong>Foals are a huge influence for me, but so are bands such as Colour, Brontide and Tall ships. I would say Foals are probably the most influential throughout the band.</p>\n<p><strong>CITR: </strong>What has been your favourite gigging experience to date?</p>\n<p><strong>R:</strong> We played with Tall Ships a couple of weeks ago in Uncle Alberts in Middlesbrough – we’re already big fans of theirs and they were a great laugh, not to mention amazing live.</p>\n<p><strong>J:</strong> It was a great turn out as a lot of our mates came down to see us and we feel it was the best live performance we have given to date. Also Uncle Alberts has such a great atmosphere for live bands.</p>\n<p><strong>N: </strong>Also Tall Ships put on an awesome show and they were really nice guys so that made the gig even better.</p>\n<p><strong>R: </strong>We’ve recently started playing in Newcastle and the crowds have been great, so maybe the next time you ask us it’ll be a venue there that tops Alberts, who knows.</p>\n<p><strong>CITR: </strong>What brought Toyger together as a band in the first instance?</p>\n<p><strong>N: </strong>Me, James and Dean decided to get together for a few practices without a drummer or vocalist. We wanted to play music that was both fun and experimental. As things progressed, we got Wayne in on drums, and then eventually Rory. Having Rory and Wayne in the band improved our songwriting immensely.</p>\n<p><strong>R: </strong>I’ve been in bands with Dean since we were 14, either playing lead guitar or singing but never lead vocals on their own so it was weird when Dean asked me to be the vocalist to adjust to not having an instrument to hide behind!</p>\n<p><strong>CITR: </strong>In what ways would you consider your music to be experimental?</p>\n<p><strong>R: </strong>We try to forget about the conventions of traditional song writing.</p>\n<p><strong>N: </strong>We don’t usually follow the verse chorus verse chorus rule, especially in our newer songs. I don’t think its intentional, its just what we thought sounded better at the time, and we thought that it would be more interesting to listen to.</p>\n<p><strong>R:</strong> Yeah, we sort of let the song progress to something that sounds and feels right, instead of returning to a particular chorus or verse just to fulfill a structure. We also try to keep an open mind when we write songs, so if someone comes up with a crazy idea we’ll always try it out before we shoot them down.</p>\n<p><strong>CITR: </strong>Coming from the North East of England, how have you found it for developing and supporting your music?</p>\n<p><strong>R:</strong> There’s a lot of buzz about new bands coming from the North East and I think the main reason is because there are a lot of people who really work hard to help bands along. In our area there’s Ten Feet Tall who put on a lot of gigs at Uncle Alberts and various other venues in Middlesbrough so they’ve been a great help, especially Henry Carden who’s booked us for several gigs now. The guys at Generator in Newcastle have also been a massive help – their gigs are so well organised and they all seem hugely passionate about new music.</p>\n<p><strong>Dean: </strong>Bob Fischer from BBC Tees gives a hell of a lot of support to new bands in the North East, if he didn’t play our tracks we wouldn’t get half of the gig offers that we’ve received.</p>\n<p><strong>CITR: </strong>Operating as a relatively new band, where would you like Toyger to be this time next year?</p>\n<p><strong>R:</strong> We’ve only been together for 6 months but things have been moving pretty fast for us – I think we have to set our goals high and aim to try and get onto the bill for a few minor festivals, and possibly some introducing stages for a few major festivals as well. We’re planning on recording another 3 track E.P. by Christmas which should keep us busy.</p>\n<p><a href=\"https://www.myspace.com/toygerband\" target=\"_blank\">Toyger Myspace</a></p>\n","slug":"2916-interview-toyger","category":"interviews","date":1284768272000,"wpid":2916,"isSticky":false,"featured_image":{"width":600,"height":450,"src":"2010/09/toyger.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAQG/8QAIhAAAgEDAwUBAAAAAAAAAAAAAQIDAAQFBhETEiEiMlGB/8QAFQEBAQAAAAAAAAAAAAAAAAAAAQP/xAAXEQADAQAAAAAAAAAAAAAAAAAAAREh/9oADAMBAAIRAxEAPwCoa11FkJs7a2EkS5GGXkdOZ1VGVy/SG27qAQB9FZc5fKzEy5CCZ71/KdluRs0h9iP3elKk8G0//9k="},"createdAt":1587294971541,"updatedAt":1588403563710,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2010/09/toyger.jpg","categories":["interviews","music"]}