{"id":"5e9c32f79b6559241525dfb5","artists":["5e9b69317a1236eccfeb2449"],"title":"Interview: Polarsets","content":"<p>As <strong>Everything Everything </strong>begin to achieve their deserved mainstream success, a door has opened into the vibrant music scene of the North East.</p><p> For years anywhere north of Leeds was considered musically barren, devoid of any inspired new music and simply ignored. However in this time there has been a small and steady revolution in the North East, which some would argue <strong>The Futureheads </strong>and <strong>Maximo Park </strong>spearheaded. Having already featured North East bands such as <strong>Vinyl Jacket </strong>and <strong>Toyger </strong>(with many more to come), <strong>Crack In The Road </strong>are delighted to introduce <strong>Polarsets</strong>. A emphatic indie pop trio, <strong>Polarsets </strong>have already gained the attention of many high profile blogs and critics, and can even count <strong>Michael Eavis </strong>as one of their more famous fans. Such positive attention isn’t hard to understand when you hear the energetic blissfulness that transcends their synth laden tracks. Uplifting guitar riffs and catchy hooks combined with sharp lyrics make <strong>Polarsets </strong>incredibly addictive to listen to and will guarantee to get you dancing. <strong>Crack In The Road </strong>were lucky enough to catch up with lead vocalist <strong>Rob Howe </strong>from the band.</p>\n<p><strong>CITR: </strong>If you had to cite one band/artist as a major influence upon you, who would it be and why?</p>\n<p><strong>Rob: </strong>New Order.  They were the beginning of the dance crossover thing and the fathers of our style.  Great songs, totally orginal.  Without them there would be no Polarsets.</p>\n<p><strong>CITR: </strong>What has been your favourite gigging experience to date?</p>\n<p><strong>R: </strong>The last time we played the Cluny.  We promoted the show ourselves and had three of our favourite bands playing with us – Grandfather Birds, Let’s Buy Happiness and SS Arcadia.  It was a real lynchpin moment for us, there was just something in the air that night.  Everyone that came felt part of this scene that is developing up north and the connection between the bands and the audience was like, fucking mystical.  We’re hoping for a repeat on the 21st of October for our single launch.</p>\n<p><strong>CITR: </strong>How did Polarsets come into existence as a band?</p>\n<p><strong>R: </strong>We’ve been friends forever, we used to play in a prog rock band called The Preserves back in high school.  We’ve all lived together at various stages too and Polarsets just kind of happened very organically.</p>\n<p><strong>CITR: </strong>As a band that has originated in the North East music scene, how do you feel it has affected you as a band?</p>\n<p><strong>R: </strong>It’s like we’re right at the beginning of something.  The bands in the North East at the moment are stronger than ever and we’re a really tight knit community.  Tom Robinson at BB6 has become our national champion, making himself the first person from south of Leeds to give a toss about North East music for quite some time.  Ask us the question again in a year and we’ll give you a right answer.  For all that it’s so exciting to be at the start of something like this, it feels delicate and it’s something that needs to be looked after and nurtured.  Like a cat.</p>\n<p><strong>CITR: </strong>You have released ‘Leave Argentina’, a fantastic symphony of euphoric synths and cowbells, as a single. How was that as an experience to record and release?</p>\n<p><strong>R: </strong>Good craic all round.  It was one of those tunes that had something great about it from moment one.  It took plenty of work to get it just right but when a song has that core energy and emotion you have to go with it.  It’s why we chose it as a single and why it’s still one of the most fun tracks to play live.  It was one of the first times we had experimented with using that 90’s trance sound that is now a bit of a Polarsets staple.  We worked with some progressive house producers called ‘Trafik’ on the song and they got us listening to loads of old school trance, we loved it and we wanted that on the record.  The single release party was crazy.  Too many people showed up, we were really nervous, over excited.  Can barely remember the set to be honest.</p>\n<p><strong>CITR: </strong>Your next single, ‘Morning’, is set to be released in late October. How do you feel this track differs from your previous single?</p>\n<p><strong>R: </strong>Well it’s still plenty full of euphoric synths and cowbells (agogos).  It’s more natural and fluid than Argentina.  It was written in about forty minutes and had that same energy that Argentina had straight away.  It’s been quite a while since we put Argentina out (6 months) and we’ve grown a lot as producers and writers in that time.  It’s more mature and less brash.  Lyrically it makes much more immediate sense than Argentina.  It has this kind of tragic pop lyric on it that really cooks.  Definitely a song for the clubs and for live gigs, not so much a ‘radio single’ but we wanted to do something different and that’s what we have done.</p>\n<p><strong>CITR: </strong>If you had to describe Polarsets in three words, what would they be?</p>\n<p><strong>R: </strong>Opposing Ideas Joined</p>\n<p><a href=\"https://www.myspace.com/polarsets\" target=\"_blank\">Polarsets Myspace </a></p>\n","slug":"2919-interview-polarsets","category":"interviews","date":1284897353000,"wpid":2919,"isSticky":false,"featured_image":{"width":600,"height":435,"src":"2010/09/polarsets.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAQI/8QAHRAAAgIDAAMAAAAAAAAAAAAAAQIDBAARIQZhof/EABUBAQEAAAAAAAAAAAAAAAAAAAID/8QAFxEAAwEAAAAAAAAAAAAAAAAAAAECMf/aAAwDAQACEQMRAD8AzbXrtRvSQsizMYyjLvQIZeH6MuTxKzIiusyBWGwGHQPeMYbtzhSZT0//2Q=="},"createdAt":1587294967856,"updatedAt":1588403563655,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2010/09/polarsets.jpg","categories":["interviews","music"]}