{"id":"5e9c005f774c2610387e4658","artists":["5e9b69047a1236eccfeb215e"],"title":"New: Ikonika – Praxis","content":"<p>Sara Abdel-Hamid, A.</p><p>K.A. <strong>Ikonika</strong>, has returned with this doozy of a taster-track from her forthcoming EP, <strong><em>Position</em></strong>. The highly-charged yet weirdly reflective <em>Praxis</em> is a mesmerising trip of urban electronica, not to mention a lesson in production pacing and build-up. Its meditative, synth-laden beats develop from something quite isolated and tense-sounding at the start of the track into an engrossing, heavy sort of stupor by its end. As with many of her other releases, there’s a noticeable vein of Aphex Twin running through this one, especially with the irresistibly weird twists and turns its melody takes. The last thing we really saw from her was her 2013 second studio LP, <strong><em>Aerotropolis</em></strong>, a strong album with its own distinct flavour which was largely seen as taking her away from the aggressive and manic sounds of her debut into a noticeably more buoyant mood; but this piece suggests a shift again in tone for the upcoming ‘Position’. Whatever route(s) it decides to take us down, I’m really looking forward to hearing the full-length EP which, on the basis of this offering, promises both an engrossing and idiosyncratic end product, with some surprises that could potentially make their way in. Its date of release will be 25th August, on Hyperdub Records.</p>\n<p><iframe src=\"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/160649362&auto_play=false&hide_related=false&show_comments=true&show_user=true&show_reposts=false&visual=true\" width=\"100%\" height=\"450\" frameborder=\"no\" scrolling=\"no\"></iframe></p>\n","slug":"29324-new-ikonika-praxis","category":"music","date":1407159406000,"wpid":29324,"isSticky":false,"featured_image":null,"createdAt":1587282015250,"updatedAt":1588441755405,"author":"5e9b68b27a1236eccfeb1d4a","old_image":"generated/a6ef0c55a4e92ff2d0ab6bdfa79279c89a83f473.jpg","categories":["music","new"]}