{"id":"5e9c32f09b6559241525dfa9","title":"Review: Aloe Blacc- Good Things","content":"<p><a rel=\"attachment wp-att-2986\" href=\"https://admin.</p><p>crackintheroad.com/music/2932-review-aloe-blacc-good-things/attachment/aloe-blacc-good-things-album-cover-2\"><img class=\"aligncenter size-full wp-image-2986\" title=\"aloe-blacc-good-things-album-cover\" src=\"https://api.crackintheroad.com/uploads/2010/09/aloe-blacc-good-things-album-cover1.jpg\" alt=\"\" width=\"650\" height=\"650\" srcset=\"https://api.crackintheroad.com/images/2010/09/aloe-blacc-good-things-album-cover1.jpg 650w, https://api.crackintheroad.com/images/2010/09/aloe-blacc-good-things-album-cover1-165x165.jpg 165w, https://api.crackintheroad.com/images/2010/09/aloe-blacc-good-things-album-cover1-260x260.jpg 260w, https://api.crackintheroad.com/images/2010/09/aloe-blacc-good-things-album-cover1-640x640.jpg 640w\" sizes=\"(max-width: 650px) 100vw, 650px\" /></a></p>\n<p><strong>Aloe Blacc</strong> has created something of a time warp with his latest LP <em>Good Things</em>, a soul record that manages to sound like it was conceived decades ago while still being firmly rooted in reality. Of course the word ‘Soul’ is something that has always been associated with <strong>Blacc’s</strong> work, but perhaps not so firmly. His 2006 record <em>Shine Through</em> was essentially a hip-hop album, but contained flourishes of jazz and soul that made it so much more than ‘just a hip-hop album’, if that’s even a bad thing. With <em>Good Things</em> however his relationship with soul is a more cemented one, abandoning rapping altogether in favour a pure soul sound that still manages to sound utterly fresh.</p>\n<p>It’s perhaps easy to describe a sound as being ‘fresh’ when it’s essentially amongst a genre that hasn’t been pursued in years. This isn’t strictly true however, take <strong>Plan B</strong> or even <strong>Mark Ronson</strong>, two musicians that tried and failed to capture the belief and resilience of the genre; Blacc is by no means alone in his attempt, he’s just the only one that’s succeeding.</p>\n<p>And in these “trying times” it seems we need resilience, belief and dare I say it soul more than ever. <em>I need a dollar</em> the records opener could, with any luck, become a depression time anthem; the riff is divine and the lyrics cutting and soothing in their simplicity, “All I want is someone to help me” croons <strong>Blacc</strong>, with one of the smoothest voices around today.  While the subject matter is by no means jovial, we never get the feeling <strong>Blacc</strong> is wallowing in other’s pain. <strong>Blacc</strong> himself lost his job at the start of the depression, with his own father losing his house; this is very much something that Blacc experienced.  Bizarrely there also isn’t a hint of self-pity, in the whole record for that matter, <strong>Blacc </strong>doesn’t just “need a dollar” but wants us to “share a dollar”.  It’s that balance between idealism and facing up to the facts of a world issue that makes this record so successful.  The title tune is a great example of this, a smooth guitar based tune with flourishes of glorious brass that tells the story of the good things after a painful breakup, its positive yet utterly saddening in its ‘cast away’ quality. “Don’t you wish you would have stayed” <strong>Blacc</strong> almost shouts, this is both bitterness and happiness in their rawest state.</p>\n<p>Although <strong>Blacc</strong> persistently comments on the depression we all unfortunately now live in, it still manages never to be the stale ‘subject matter’ of the album. <em>You Make Me Smile</em> and <em>Femme Fatale </em>are two of the most perfectly personal tunes on the LP. In <em>Femme Fatale</em> the strings glide beautifully throughout the record and <em>You Make Me Smile</em> is the perfect antidote to the depression, you may have bills to pay but at least “you make me smile”. The star of the show without a doubt is <em>Momma Hold My Hand</em>, this song will make you cry whether you like it or not. The piano has a jazz time jangle; the strings manage to soar both powerfully and delicately and the story told is one of the most beautiful depictions of maternal love in recent memory.</p>\n<p>There are times in the LP where some experimentation wouldn’t go amiss, <em>Green Lights</em> and <em>Miss Fortune </em>are perhaps the biggest victims of this, but regardless those two tunes are still delights in their own right, just perhaps not up to the standards of this incredible album.</p>\n","slug":"2932-review-aloe-blacc-good-things","category":"music","date":1285350597000,"wpid":2932,"isSticky":false,"featured_image":{"width":570,"height":570,"src":"2010/09/aloe-blacc-good-things-album-cover.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAABgEF/8QAJRAAAQMBBgcAAAAAAAAAAAAAAQIDBAAFBhEhMYESExQ2QVGx/8QAFQEBAQAAAAAAAAAAAAAAAAAABQb/xAAaEQACAwEBAAAAAAAAAAAAAAABAwACIQRB/9oADAMBAAIRAxEAPwB7eFqWL4WW27JLUyGXClDSXyw8lSNFKw4cQM/egrX6e1jmRD2cXhSi3e44KfHMTluKkwAS3wAAAtX2p7pVWgzzIothM//Z"},"createdAt":1587294960785,"updatedAt":1588403563553,"author":"5e9b68b27a1236eccfeb1d24","old_image":"2010/09/aloe-blacc-good-things-album-cover.jpg","categories":["music","reviews"]}