{"id":"5e9c34779b6559241525e225","title":"Review & 5 Minutes With: The Kissaway Trail","content":"<p style=\"text-align: center;\">When you think of Danish music, what comes to mind? Unfortunately for many it will be the irritating, repetitive indie disco pop of 2008s hit band <strong>Alphabeat</strong> or maybe the diabolical, airwave hogging tunes of <strong>Aqua</strong> from way back when.</p><p> However, look a little deeper, past the collective waste of Euro Pop, and there are some real gems hiding away. Shoegaze influenced alternative outfit <strong>Mew</strong> are as good a starting point as any, as are rock duo <strong>The Raveonettes</strong>, however, this year sees the bloom of another Danish flower, in the form of dream pop band <strong>The Kissaway Trail</strong>. Their self titled debut album in 2007, showed brilliant emotional maturity and awareness, whilst also portraying a darker, more sinister side to the group. Having performed all around the world, supporting the likes of <strong>Editors</strong>, <strong>Interpol </strong>and <strong>The National</strong>, there is no doubt that they have taken influence from their headlining counterparts.</p>\n<p style=\"text-align: center;\">This year sees the return of the Danish band, with their sophomore album entitled <em>Sleep Mountain</em>, released on <strong>Bella Union Records</strong> on the 8th March. <em>Sleep Mountain</em> was produced by <strong>Peter Katis</strong>,, who it is of no coincidence, has also worked with tourmates <strong>The National</strong> and <strong>Interpol</strong>, as well as Scottish rockers <strong>The Twilight Sad</strong>. <strong>Katis </strong>has a way of really bringing the best out of band by expanding their sound to a euphoric level. The difference between the self titled debut and this years release are evident from the first track, <em>SDP</em>, an epic 6 minute opener, that will undoubtedly draw comparisons to Canada’s pride and joy <strong>Arcade Fire</strong>. The drums in particular are more pronounced than experienced on 2007’s effort, and it provides an enchanting contrast to the smoothly delivered vocals of <strong>Thomas Fagerlund</strong>. On album track <em>Philadelphia</em>, <strong>Fagerlund’s</strong> vocals are inspirational as he tells of his “<em>city in arms</em>“, and hopefully pleas that “<em>love lasts forever</em>“. <em>New Lipstick</em> is another of the albums standout tracks, as a steady drum beat explodes into a soothing harmony. The album has a real special feeling of togetherness, especially with the increased importance of the rhythm sections, which bring a new strength and ambition to the music. Whilst on first listen, the album may appear to be disheartening and filled with a foreboding bleakness, however, after a few more listens the fantastic vocals of <strong>Fagerlund</strong> begin to sink in, and the real beauty of the album is vividly exposed. <em>Whirr of Wings</em> is perhaps the most emotionally moving track on <em>Sleep Mountain</em>, in which <strong>Fagerlund</strong> almost cries “<em>the devil on your shoulder, tells the angel not to sing</em>“, yet throughout, the uplifting melodies have a way of shining a positive ray of light over the entire album. So if when you think of Danish music, you hear no more than the atrocious strain of <strong>Alphabeat </strong>or <strong>Aqua</strong>, then maybe it’s about time you gave <strong>The Kissaway Trail</strong> a chance.</p>\n<p style=\"text-align: center;\"><a href=\"https://www.mediafire.com/?zonekjnhzjm\">Download SDP</a></p>\n<p style=\"text-align: center;\"><a href=\"https://www.thekissawaytrail.com/\">Official Website</a></p>\n<p style=\"text-align: center;\"><a href=\"https://www.amazon.co.uk/Sleep-Mountain-Kissaway-Trail/dp/B00303G8UK/ref=sr_1_1?ie=UTF8&s=music&qid=1269892141&sr=8-1\">Buy Sleep Mountain</a></p>\n<p style=\"text-align: center;\">\n<p style=\"text-align: center;\"><strong>The Kissaway </strong><strong>Trail</strong> kindly agreed to answer a few questions for us:</p>\n<p style=\"text-align: center;\"><em>CITR</em>: If you were to cite one band as a major influence upon you, who would it be?</p>\n<p style=\"text-align: center;\"><strong>—Hmmm.. I think it would be Sonic Youth. It’s the only band that we all can agree on. Sonic Youth/Thurston Moore “Pscychic Hearts”</strong></p>\n<p style=\"text-align: center;\">\n<p style=\"text-align: center;\"><em>CITR:</em> How much do you think growing up in Denmark affected your music, and do you believe the increasing use of the internet to distribute music has made it easier for bands like yourselves to get your music heard?</p>\n<p style=\"text-align: center;\"><strong>—- A lot of Danish bands have some kind if darkness in their music and maybe it’s because of the lack of light and summer?? The bands that represents Denmark right now would have made it, with or without Internet. I’m not really into the Internet Music exploring. I’m more old fashioned. The Ear to Ear method and spending hours in music shops.</strong></p>\n<p style=\"text-align: center;\"><em>CITR:</em> You have supported bands such as Editors, The National and Interpol on tours, but what has been your favourite gigging experience to date?</p>\n<p style=\"text-align: center;\"><strong>— They’ve all been great so far, but one that always brings a smile to my face must be Roskilde ’07.</strong></p>\n<p style=\"text-align: center;\"><em>CITR:</em> How much pressure do you feel your record label have put upon you to produce an album which is going to sell well?</p>\n<p style=\"text-align: center;\"><strong>—- None!!!! We have the greatest label. Bella Union. We know we have to sell, to keep doing what we love the most. Playing infront of people, writing music. But we take one day a time and keeps climbing up the mountain.</strong></p>\n<p style=\"text-align: center;\"><em>CITR:</em> And finally, will you be following Denmark in this years World Cup in South Africa? If so, surely you must be fancying your chances to get through your group?</p>\n<p style=\"text-align: center;\"><strong>— Yeah of course. Shhhhhhh, but Denmark needs a lot of luck to succeed in South Africa. But again no one thought we would win in ’92.</strong></p>\n","slug":"294-5-minutes-with-the-kissaway-trail","category":"interviews","date":1271346601000,"wpid":294,"isSticky":false,"featured_image":{"width":3072,"height":2048,"src":"2010/04/the_kissaway_trail_sweden2_normal.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAMH/8QAIhAAAgAEBgMAAAAAAAAAAAAAAQIAAwQFBhESEyExQWGS/8QAFQEBAQAAAAAAAAAAAAAAAAAABQb/xAAcEQACAgIDAAAAAAAAAAAAAAABAgARA1EEIdH/2gAMAwEAAhEDEQA/AMwprfIl2l1u9qWmqHlbNJtkNrYFc2YhvHA96j1lFltdcihHwdbC68Eif2fuEImn5TBQaHd79jIwLZGp/9k="},"createdAt":1587295351514,"updatedAt":1588403568940,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2010/04/the_kissaway_trail_sweden2_normal.jpg","categories":["interviews","music","reviews"]}