{"id":"5e9c003e774c2610387e463b","artists":["5e9b69577a1236eccfeb264d"],"title":"Introducing: The Wild Reeds","content":"<p>L.</p><p>A. indie-folk outfit <strong>The Wild Reeds</strong> (Kinsey, Mack, Sharon, Nick, Jones) have now released their debut album, <strong><em>Blind and Brave</em></strong>, which is currently available to download on iTunes and <a href=\"https://thewildreeds.bandcamp.com/album/blind-and-brave\" target=\"_blank\">Bandcamp</a>. This single of the same name, which was released last month and provides a valuable sample of their sound, is a sort of paean to the visionary idealists and dreamers of the band’s home city, and I guess also a wider salute to dreamers everywhere.</p>\n<p>Luscious arpeggiated guitar chords cover the song in an initial layer of melodic backdrop, before an accompanying chorus of percussion, guitar- and banjo-led instrumentation and backing vocals join the medley. Band member Sharon fronts this vocal line, with her strong tones ringing nicely against the finely poised harmony of The Wild Reeds’ female sining trio. The refrain “Do it ’cause you love this city, ’cause you love it all”, gives some idea of the of the full-hearted and tender nature of the single, which ends on the affectionate note, “Show me how to love it all”. All together it captures something of the vibe of the ’70s Laurel Canyon music scene, and weaves it into the fabric of the band’s own indie-folk sound. The crescendo to which the song builds has noticeable strands of Arcade Fire running through it, as does the song’s outro and general instrumentation. Its video charts some of the city’s landmarks in a succession of contrasting night and day shots, following the paths and intersections of some of the people of Los Angeles with a loving eye. The clean, impressive visuals act, like the song itself, as a successful kind of low-key love letter to the sprawling metropolis from which the band hails. If you like the sound of this rousing and heartfelt number, check out their full-length LP from the sources mentioned above.</p>\n<p><iframe src=\"//player.vimeo.com/video/92788132\" width=\"500\" height=\"281\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe></p>\n","slug":"29444-introducing-wild-reeds","category":"introducing","date":1408352733000,"wpid":29444,"isSticky":false,"featured_image":null,"createdAt":1587281982647,"updatedAt":1588441754971,"author":"5e9b68b27a1236eccfeb1d4a","old_image":"generated/10ad85f8d3f6461d189dd2122feb24c7a16211f3.jpg","categories":["introducing","music"]}