{"id":"5e9c0017774c2610387e4608","artists":["5e9b69637a1236eccfeb2713"],"title":"Introducing: William Ryan Fritch","content":"<p>With this epic EP offering, composer <strong>William Ryan Fritch</strong> has given us a brilliantly singular collection of songs to help ease us into the onset of autumn, helping to breathe some warmth into those increasingly dark and cold evenings just ahead.</p><p></p>\n<p>Though, this isn’t the first substantial project for this composer, producer, and multi-instrumentalist; he’s released the sprawlingly beautiful album, <em>Leave Me Like You Found Me,</em> and an EP entitled <em>Emptied Animal</em>, as well as having contributed to Annie Silverstein’s prize-winning (<span style=\"color: #15171a;\">the Cinéfondation Selection 1st prize at Cannes 2014</span>) film, <em>Skunk</em>.</p>\n<p><iframe src=\"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/158401706&auto_play=false&hide_related=false&show_comments=true&show_user=true&show_reposts=false&visual=true\" width=\"100%\" height=\"450\" frameborder=\"no\" scrolling=\"no\"></iframe></p>\n<p>A lengthy seven-tracker, this EP’s sound does retain some elements from Fritch’s previous offerings, but at the same time has a distinct uniqueness about it. The unusual textures created by the opener <em>False</em> <em>Substance</em>‘s medley of bass, horns, woodwind, and distorted guitars, give some indication of the wide-ranging space <em>Heavy </em>will step into, as well as Fricht’s overall range as a composer. What follows on from this is an eclectic, absorbing fusion of classical and acoustic arrangements, world music, choppy, tapering post-rock guitars and the occasional hint of more ambient electronically-engineered mood palettes. <em>Order and Disorder</em>, as its title may suggest, presents some of the stark juxtapositions and unexpected combinations that coalesce to form this beautifully envisioned and realised EP. However, reducing these complex and far-reaching songs into critical excerpts can seem like something of a pointless task – you’ve basically just got to listen to Fricht’s beautiful creation and let the music speak for itself.</p>\n<p><iframe src=\"//www.youtube.com/embed/9p49csy28l4\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe></p>\n<p>Lost Tribe Sounds’ Facebook page description advises readers that this EP will particularly interest fans of Forest Swords, Swans and Do Make Say Think, and I can see where they’re coming from with these comparisons; but, really, with the emergence of a number of cross-genre experimental composers over the past few years (Peter Broderick, Nils Frahm, Ben Frost, and Laurel Halo, to name but a few), I genuinely think this slightly undersells the EP, which I’m confident would appeal to a broader audience than the one suggested here.</p>\n<p>Clearly, there’s more than just this EP to sink you’re teeth into here, but it’s probably a good starting point all the same. <em>Heavy</em> is now available to the public on <a href=\"https://losttribesound.bandcamp.com/album/heavy-ep\" target=\"_blank\">Bandcamp</a>, having been released on Lost Tribe Sound Records.</p>\n","slug":"29551-introducing-william-ryan-fritch","category":"introducing","date":1409645799000,"wpid":29551,"isSticky":false,"featured_image":{"width":1024,"height":682,"src":"2014/09/w-1024x682.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAIG/8QAHhAAAgEEAwEAAAAAAAAAAAAAAQIDAAQRIQUSUbH/xAAUAQEAAAAAAAAAAAAAAAAAAAAA/8QAFBEBAAAAAAAAAAAAAAAAAAAAAP/aAAwDAQACEQMRAD8AxXPSR28lpaLErTuyjuwBBG8aPjZ8qpOBiDt2hJOTkh9faUoP/9k="},"createdAt":1587281943475,"updatedAt":1588403515852,"author":"5e9b68b27a1236eccfeb1d4a","old_image":"2014/09/w-1024x682.jpg","categories":["introducing","music"]}