{"id":"5e9c002a774c2610387e4624","title":"Review: Green Man Festival 2014","content":"<p>“You guys have got a great festival, it’s…humane”.</p><p> The resounding and clearly genuine words uttered by the great <strong>Jeff Mangum</strong> half way through his set. On the Sunday evening no less, the last opportunity Greenman had the chance to address its populous, with clearly spoken words.<br />\nHis choice of language was perhaps far truer than even he knew. Greenman amongst other things is a fair, humane and honest sanctuary hidden within the Brecon Beacons. Simultaneously exposed to and embraced by Mount Edgecombe, a dramatic series of peaks that prove to be an almost constant distraction to anything in competition. Luckily 2k14 could put up a fight.</p>\n<p>Perhaps the very vibe of the festival could be traced to the backdrop of the peaks, although awe-inspiring, they’re also humbling. Visually they force you to understand and digest your place within the tremendous environment quickly. You can’t stand up to a mountain so you might as feel at home. And they do, all of them, (grand)/mother/father and their offspring, they come as one and they come with all the trimmings. These are festivalgoers with a clear expectation of what they want, and should have, given the ticket price. £160 or there about, but then you consider you’re likely to bringing a whole family with you…. In return Greenman is superbly organised, neatly condensed and well curated with a clear focus on sound.</p>\n<p>Friday started tentatively with <strong>Happyness</strong> and <strong>Toy</strong> and ended in an overtaking crescendo with <strong>Polica</strong>, <strong>Mac DeMarco</strong>, <strong>Caribou</strong> and <strong>Beirut</strong>; a well-made, if not entirely appropriate sandwich. A note on <strong>Caribou</strong>; after touring extensively under <strong>Daphni</strong>, <strong>Dan Snaith</strong> is finally premiering new material and it’s FUCKING GREAT, notably less organic in production, yet doesn’t lack a handmade feel. It also lends itself seamlessly to 2010’s Swim, filling his last effort with a techno fuelled new lease of life. The potential for cross over success is also huge –a great light show a band of dudes all dressed in white surely still carries weight in 2014 and beyond.</p>\n<p>Saturday morning acted as a subdued antidote to the night before and a dampening precursor to the more ambitious sounds of the impending evening. <strong>FAMY</strong> took to the Walled Garden area to a fairly muted reception. This frankly surprised me; they have this home county look and stroppy wit to their general attitude that on a better day would have struck a chord. The crowd sat in their cute little deck chairs as <strong>FAMY</strong> ripped through their debut LP. They have the tunes, a clearer focus on the strength of Bruce Yates voice and as previously mentioned, that unhampered look that will win them all over eventually.<br />\n<strong>Angel Olson</strong> followed soon after over on the main stage, an early slot complete with a sizable crowd waiting with baited breathe. The scene was set for something cosy and intimate. She delivered in buckets, but perhaps not in the way most would have expected. Her pitch perfect and almost piercing vocals, In the style of the folk/garage meld she’s made her own were contrasted with her almost obnoxious stage presence. I mean that in a very good way. Smug, self-righteous, dismissive – her tone had all of that. She doesn’t give a fuck. It was amazing. The evening saw, <strong>Fat White Family</strong>, <strong>Panda Bear</strong>, <strong>Slint</strong>, <strong>The War on Drugs</strong>, <strong>The Field</strong> and <strong>Luke Abbott</strong>. Unsurprisingly all were spectacular – most notably <strong>The War On Drugs</strong>. I finally found a time and a place for them – overlooking a mountain in wales.</p>\n<p>Sunday came with some realisations, they cumulated in the drinking of a killer mango and banana smoothie in the early hours of the morning, my eyes glazed and worn from the acid the night before; and as if to challenge my senses further a nice respectable looking man wizzes past, fresh faced on his morning jog. He might have been using one of those Nike apps; maybe his IPhone was Velcroed to his inner thigh. It’s hard to answer those questions, he moved so damn fast. This dude was like 60 and it was the Sunday morning of a 4 day festival. What gives? Or maybe nothing has to give. It’s instantly obvious to anyone who attends festivals that Greenman has a target audience and if you’re reading CITR regularly I assume it isn’t you. That sounded obnoxious, maybe it was, but it certainly wasn’t intended to be.</p>\n<p>Greenman happens to be one of the most welcoming and loving little communities I’ve ever happened across. More so than other festivals it has an aura of permanency, it might have always been there and maybe its still there now. Toddlers, strollers and Sunday morning joggers suggest ‘settled and content’ far more than my acid induced anxiety ever could. Its not that Greenman doesn’t want you, its just that she doesn’t put you first, you the 18-25 year old was no responsibility to anyone but yourself.</p>\n","slug":"29580-review-green-man-festival-2014","category":"festivals","date":1408863646000,"wpid":29580,"isSticky":false,"featured_image":null,"createdAt":1587281962769,"updatedAt":1587825845096,"author":"5e9b68b27a1236eccfeb1d24","categories":["festivals","music"]}