{"id":"5e9c32f29b6559241525dfac","artists":["5e9b69047a1236eccfeb215a"],"title":"Interview: Idiot Glee","content":"<img class=\"alignnone\" title=\"Idiot Glee\" src=\"https://c3.</p><p>ac-images.myspacecdn.com/images02/130/l_8518e059471e43c9a96f7685f97d49fa.jpg\" alt=\"\" width=\"600\" height=\"399\" />\n<p>Hailing from Kentucky, James Friley aka<strong> Idiot Glee</strong> is beginning to cause quite a stir with his 60’s pop inspired music. Whilst there’s the usual dreamy upbeat melodies, the fragile vocals and psychedelic arrangements allow the songs to become denser and more involved. From covering <strong>Bill Withers’</strong> classic <em>Ain’t No Sunshine</em>, to the release of his new 7″ <em>All Packed Up </em>on <strong>Moshi Moshi</strong><em> </em>at the start of next month, James is quite rightly receiving some much deserved coverage.</p>\n<p>Lo-fi is one of the most crowded genres at the present time, seemingly the “hip” style in 2010; it’s true<strong> Idiot Glee</strong> does contain similarities to <strong>The Antlers </strong>or <strong>Grizzly Bear</strong>, it doesn’t become bogged down in imitation. It’s Friley’s voice that elevates the music from tired and thoughtless comparisons, and gives the listener a fresh and exciting platform to stand on.<strong> Idiot Glee</strong> is intimate, effective and in parts chillingly surreal. Fresh of the back of a European tour with <strong>Women</strong>, <em><strong>Crack in the Road</strong></em> caught up with James to get a few questions answered.</p>\n<p><em>CitR: How did Idiot Glee come about?</em></p>\n<p><strong>I obsessed over Pet Sounds for a year and a half until I realized it was time to start writing pop songs, performing, actually going for it…I was in a rock band before that, but got pretty into the idea of a solo act after 5 years of it.  Plus, the local scene in Lexington inspired me, and everyone else, to constantly be writing, performing, trying new ideas, bands, etc..</strong></p>\n<p><em>CitR: In terms of inspirations, what would you describe as your greatest, both musical and otherwise?</em></p>\n<p><strong>Pet Sounds in the beginning…now it’s just discovering old albums by  Fleetwood Mac, Arthur Russell, Beatles, Beach Boys, Kinks, etc… and  again, Lexington.  Resonant Hole.</strong></p>\n<p><em>CitR: You supported Women earlier in the year on their UK tour, how was that,  and what has been your most memorable tour moment to date?</em></p>\n<p><strong>It was the best tour I’ve ever done.  We also did Germany, Holland, and I  did Sweden.  Berlin…playing with them on Black Rice in Berlin, or  them with me on Don’t Drink The Water, was the best thing ever.  The  whole night.</strong></p>\n<p><em>CitR: Where would you like to see Idiot Glee in a years time?</em></p>\n<p><strong>Still writing, recording, touring.  Maybe putting out a second album.</strong></p>\n<p><em>CitR: Your music appears to contain lyrics of a very personal nature, does  the inspiration for your songs come from real life experiences?</em></p>\n<p><strong>Yes and no.  I think sometimes you get stream of consciousness and made  up stories, although the themes probably come from real life  experiences.  But a lot of the time, yes, straight from real life.</strong></p>\n<p><em>CitR: You have received comparisons to the likes of Brian Eno and Grizzly  Bear, but if you had to describe your sound to someone who had never  heard your music, what would you tell them?</em></p>\n<p><strong>Sounds like a minimal version of the Beach Boys, modernized, or just like old pop songs…or something.  Pop music!</strong></p>\n<p><em>CitR: You have a 7″ coming out in a couple of weeks, what else can we expect from Idiot Glee over the next few months?</em></p>\n<p><strong>Good chance I’ll be back in the UK before 2011, and maybe even another single will come about.  Not sure..album in 2011, though.</strong></p>\n<p><em>CitR: If you could have any celebrity (alive or dead) join your onstage for a duet, who would it be?</em></p>\n<p><strong>Paul Simon.</strong></p>\n<p><em>CitR: If you could have any super power, what would it be?</em></p>\n<p><em>Flight.</em></p>\n<p><strong>CitR: Thanks James!</strong></p>\n<p style=\"text-align: center;\"><a href=\"https://www.myspace.com/idiotglee\">Idiot Glee On Myspace!</a></p>\n<p style=\"text-align: center;\"><a href=\"https://moshimoshi.greedbag.com/buy/all-packed-up/?tab=description\">Pre-0rder All Packed Up (Out 4th October)</a></p>\n<p><script src=\"https://video.unrulymedia.com/wildfire_11244048.js\" type=\"text/javascript\"></script></p>\n","slug":"2973-interview-idiot-glee","category":"interviews","date":1285165150000,"wpid":2973,"isSticky":false,"featured_image":{"width":600,"height":399,"src":"2011/06/l_8518e059471e43c9a96f7685f97d49fa.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAAAAb/xAAiEAABAwMDBQAAAAAAAAAAAAACAQMEAAUGERIhEzEyQWH/xAAVAQEBAAAAAAAAAAAAAAAAAAADBP/EABoRAQACAwEAAAAAAAAAAAAAAAEAAgMRMVH/2gAMAwEAAhEDEQA/AJfGYdj24+xeo/VgR3nHDNvUDVF18lHkkH0n1ai58WzNzpAM3OU20LhCAKJrtRF4TvSlHmCqB5KLnNT/2Q=="},"createdAt":1587294962626,"updatedAt":1588403563580,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/06/l_8518e059471e43c9a96f7685f97d49fa.jpg","categories":["interviews","music"]}