{"id":"5e9bfff8774c2610387e45c0","artists":["5e9b68da7a1236eccfeb1e7b"],"title":"7-INCH SECRETS: Bob Dylan – Like A Rolling Stone","content":"<p><iframe src=\"//player.</p><p>vimeo.com/video/98711741\" width=\"500\" height=\"281\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe></p>\n<p>People who collect vinyl tend to get excited by statistics and therefore live fairly solitary lives. Take this, for example: <a href=\"[https://www.tandfonline.com/doi/pdf/10.1080/09332480.2012.668464\">some guy with too much time on his hands</a> has found that 110 of The Beatles’ first 128 recorded songs were between two and three minutes in length. Popular belief would have it that the perfect single is about three minutes long. QED.</p>\n<p>Before you head to the pub to bore everyone with this knowledge, the three-minute limit was not really imposed by artistic sensibility, but by how close together you could cut the grooves into a seven inch single. Up until the mid 60s, three minutes of music was about all you could get on a side of black plastic. If your song was longer, you split it into two parts across the A and B side. And only wankers did that.</p>\n<p>But Dylan changed everything. At least his fans did. There was more than a little uproar when CBS wanted to split the full six-minutes of Like a Rolling Stone across two sides of a single. And a radio edit would never do. So, in 1965, using new “microgroove” and mastering wizardry, they created the first, perfect, six-minute single.</p>\n<p>And, so, the groundwork for the worst musical excesses of the 1970s was laid.</p>\n<p>Cracking tune, though. And that opening drum beat…</p>\n","slug":"29774-7-inch-secrets-bob-dylan-like-rolling-stone","category":"7-inch-secrets","date":1410345951000,"wpid":29774,"isSticky":false,"featured_image":{"width":1922,"height":1080,"src":"2014/09/rollinstone.png","placeholder":"data:image/jpeg;base64, iVBORw0KGgoAAAANSUhEUgAAAAoAAAAGCAIAAAB1kpiRAAAACXBIWXMAAAsTAAALEwEAmpwYAAAAxUlEQVR4nAG6AEX/AK2TffnjxNLEvNvKxMCqobCakZ6Mhod4cl5NRUU0KwCjiHX/3LLVwLJbVFsjHyRQRkeLeXSEcm1YR0BEMCYAmXpo7cCWg3RuOhwkhiodOBQSGxgeSj08KR8gMCQhAJV5ZceZfUQqMDUTFaI0KUMWFwADDg8KEyIXGSUcHQB8YVGshWl5T045Jy4AAAQiGRyKbVuBZVWDY06DYksAbFJEdV5RbkxNsX5+MSElFw8SZU5BdmJXT0A+Pi4sn2tA8rZhqDoAAAAASUVORK5CYII="},"createdAt":1587281912834,"updatedAt":1588403515198,"author":"5e9b68b27a1236eccfeb1d41","old_image":"2014/09/rollinstone.png","categories":["7-inch-secrets","music","videos"]}