{"id":"5e9c32ee9b6559241525dfa6","artists":["5e9b68f87a1236eccfeb20b8"],"title":"Interview: Ghost Animal","content":"<img class=\"alignnone\" title=\"GA\" src=\"https://c2.</p><p>ac-images.myspacecdn.com/images02/132/l_94009948d97b4147b907918172fb2c49.jpg\" alt=\"\" width=\"600\" height=\"399\" />\n<p>With dreamy lo-fi being the “in-thing” this year; chillwave is becoming a rather diluted term to use, so it’s fantastically invigorating to hear a group take inspiration from their counterparts, without becoming a monotonic carbon copy. <strong>Ghost Animal</strong>, a duo consisting of childhood friends Michael Avishay and Marissa Rowland are seemingly determined to not be labeled pretenders in what is such a rapidly expanding scene. Re-branding the genre with their own unique, heavier yet still distorted sound has allowed for them to rise above many of their peers. This year saw them release their new full length LP;  <em>Summertime In Heaven</em> which lands somewhere in between <strong>Sonic Youth</strong> and<strong> Wavves</strong>, a record drowned in distortion and reverberation, whilst being emotionally honest and appealing.<strong><em> Crack in the Road</em></strong> caught up with Michael to get a few questions answered.</p>\n<p><em>CitR: How did Ghost Animal come about?</em></p>\n<p><strong>I’ve been writing and recording music under the name “Ghost Animal” since I was fifteen or so, but at that point it was only angsty teen folk balladry, really. It wasn’t until junior year of college when I met Marisa and started listening to a lot of music I really missed out on (Pixies, My Bloody Valentine, Clash, Jesus and Mary Chain) that Ghost Animal really started to take form and shape and find its true manifestation. So I started writing and recording a whole batch of new songs, the first of which was “Vanity Affair” – I recorded that with just an acoustic guitar and a drum loop from Garageband. I was playing during this time (only a few on-campus shows and house parties) with my friend Max, but mid-way through the semester he dropped out and I needed a drummer because we had a show in a week. I was hanging out with Marisa and talking to a friend of ours. I asked him to play drums for me, but he said he was too busy. “How about Marisa?” he suggested, almost jokingly. So during that week I taught Marisa how to play drums, and that’s how Ghost Animal came to be.</strong></p>\n<p><em>CitR: In terms of inspirations, what would you cite as your main, both musically and otherwise?</em></p>\n<p><strong>Musically, it’s a pretty standard laundry list: New Order, Joy Division, Jesus and Mary Chain, My Bloody Valentine, Pixies, Nirvana, Beatles, Sonics, Stooges, Wavves. There was a period of time when I drew a lot of inspiration from early Best Coast songs – kind of proved to me that you can write really simple songs really well (I’m speaking exclusively of early Best Coast). As a personality, John Lennon remains a constant inspiration to me. I also maintain an incredible and passionate love for Virginia Woolf. But in all truth there are some essential people around me that really inspire me. Some are friends in real life, others are friends I’ve made through music and the internet. I’d be nowhere with Marisa, of course. My friend Stevie, who has a fantastic band called Youthbitch, continues to inspire me with his fuck-you punk as fuck attitude. Mat Cothran of Coma Cinema remains a serious inspiration and close friend.</strong></p>\n<p><em>CitR: If you had to describe your sound to someone who had never heard your music before, what would you tell them?</em></p>\n<p><strong>I’m always puzzled how to answer this question. Usually I just say, “Think Pixies meets Jesus and Mary Chain meets Nirvana meets My Bloody Valentine,” or something, but that sounds really assuming. I usually go with like, lo-fi grungey kind of stuff. Fuzzy garage pop. I don’tknow, I try not to sound like a prick. Usually it’s best if they listen to it themselves and make their own distinctions<em>.</em></strong></p>\n<p><em>CitR: What has been your most memorable tour moment to date?</em></p>\n<p><strong>We haven’t toured yet, we’ve only played a few shows in Portland, LA, and SF. Playing at Milk Bar in August with Teen Daze, Blackbird Blackbird, Fiveng, Kites Sail High, and Gobble Gobble was by far the best and craziest show we’ve ever played. Gobble Gobble was so intense I almost vomited. Most fun we’ve had for sure.</strong></p>\n<p><em>CitR: In terms of releases, what can we expect from Ghost Animal in the coming months?</em></p>\n<p><strong>We’ve got an album out on cassette from Orchid Tapes and Summer Time in Hell. You can download it for free and/or purchase the cassette at<a href=\"https://summertimeinhell.tumblr.com/\" target=\"_blank\"> https://summertimeinhell.tumblr.com</a> or <a href=\"https://orchidtapes.blogspot.com/\" target=\"_blank\">https://orchidtapes.blogspot.com</a>. AMDISCS is putting out an In Your Room 7″, and this great little label called Spooky Town is putting out a 7″ EP later this year called A Ceremony. The tracklisting and info and stuff is on our tumblr if you want to check it out!</strong></p>\n<p><em>CitR: Where would you like to see Ghost Animal being in a years time?</em></p>\n<p><strong>Hmm, next September. Well, Marisa has been talking about spending a year abroad in Paris, so if that happens maybe we’ll relocate to Europe for a year. If not, maybe New York? We’re not really sure right now. Ideally we’d like to have the attention of a big(ger) label, maybe get Summertime in Heaven and some of the earlier releases repressed and more widely distributed. But basically we just want to be playing as many shows as possible and having a great time.</strong></p>\n<p><em>CitR: What was the first record you can remember falling in love with?</em></p>\n<p><strong>Oh god – I’d have to say, if we’re going for earliest of early memories, probably the first or second Spice Girls album when I was about eight. Then Marshal Mathers LP by Eminem. After that strange phase, Thriller was an obsession, and then finally I discovered the Beatles. But in recent memory – since I started buying vinyl, anyway, – I’d have to say Psychocandy has been the record I consistently fall back on and the first vinyl album I really became severely attached to. That or Loveless by My Bloody Valentine. For Marisa, it was either the first Pretenders album or “Heroes” by David Bowie.</strong></p>\n<p><em>CitR: If you could have any celebrity (alive or dead) join you on stage for a duet, who would it be?</em></p>\n<p><strong>Probably Hannah Montana. Or, if we were going for something less Disney (which I’m not necessarily saying we’re going for), Nico or Debbie Harry. Marisa says Kim from Sonic Youth. I say John Lennon or Jack White. Or, fictionally, Harry Potter, just because that show would probably sell out faster than anything.</strong></p>\n<p><em>CitR: If you could be any animal, what would you be?</em></p>\n<p><strong>Marisa: A cat. And Michael would be a sloth.<br />\nMichael: Either a big flying bird or a tiger but really, in all honesty, a monkey.</strong></p>\n<p><em>CitR: Thanks very much guys!</em></p>\n<p style=\"text-align: center;\"><a href=\"https://twitter.com/ghost_animal\">Follow Ghost Animal On Twitter!</a></p>\n<p style=\"text-align: center;\"><a href=\"https://ghostanimal.bandcamp.com/\">Check Ghost Animal Out On Bandcamp!</a></p>\n<p style=\"text-align: center;\"><a href=\"https://www.myspace.com/ghostanimal\">Or Myspace!</a></p>\n<p style=\"text-align: center;\"><a href=\"https://ghostanimal.tumblr.com/\">Or Tumblr!</a></p>\n<p style=\"text-align: center;\">\n<p style=\"text-align: center;\">\n<p><script src=\"https://video.unrulymedia.com/wildfire_11244048.js\" type=\"text/javascript\"></script></p>\n","slug":"2978-interview-ghost-animal","category":"interviews","date":1285608820000,"wpid":2978,"isSticky":false,"featured_image":{"width":600,"height":399,"src":"2011/06/l_94009948d97b4147b907918172fb2c49.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAYH/8QAHxAAAgEEAwEBAAAAAAAAAAAAAQIDAAQREgUGMSFB/8QAFQEBAQAAAAAAAAAAAAAAAAAAAgP/xAAWEQEBAQAAAAAAAAAAAAAAAAABAgD/2gAMAwEAAhEDEQA/AIyz7xHyVxyLPPcqzxArGpOraAnDL4Dka5Hv0n8rM5ez3byO7RpliScUpUilXOpAN//Z"},"createdAt":1587294958945,"updatedAt":1588403563526,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/06/l_94009948d97b4147b907918172fb2c49.jpg","categories":["interviews","music"]}