{"id":"5e9bffe2774c2610387e4595","artists":["5e9b68e57a1236eccfeb1f78"],"title":"New: Death Blues – Ensemble","content":"<p>As a follow-up to the last piece I wrote on William Ryan Fritch’s EP <em>Heavy</em>, I thought it would be a good idea to point heads towards the California-based composer’s latest project with Jon Mueller of Volcano Choir.</p><p> <em>Ensemble</em>, a nine-track album of varying song lengths, is, like <em>Heavy</em>, a structurally complex, epic journey through the see-saw of life’s unpredictable and varying conditions, resulting in a hugely affirmative work.</p>\n<p><iframe src=\"//www.youtube.com/embed/xMLs-iRvlIw\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe></p>\n<p>Its second track, <em>Participant</em>, has some of the childlike joy and wide-eyed innocence of certain movie scores from recent years, the likes of <em>Beasts of the Southern Wild</em> – although this is undercut by menacing, reverb-laden guitar which lurks in the landscape’s periphery throughout <em>Ensemble</em> – while the opener’s tribal chants funnel through detectable strains from both artists’ previous oeuvres. From the mournful cries at the end of <em>Loss</em>, to the spine-tingling shrieks and shrills of the strings in <em>Unseen</em>, and the ecstatic rediscovery of life in <em>Reentry</em>, <em>Languaging</em> and <em>Obtain</em>, this record is a protracted crossing over through the material and the spiritual; a passage through life and death, and back again. There’s a real sense of triumph on the final song of the LP, <em>Onward</em>, as its slow, emphatic percussion signals the end of a striated and visceral listening experience.</p>\n<p><iframe src=\"//www.youtube.com/embed/GJQSXnkAnkY\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe></p>\n<p>The culmination of a succession of various releases, this project is more than just a purely audio experience, with <span style=\"color: #363636;\"><em>Ensemble</em> lending some of the cross-media, all-embracing scope of Fritch’s recent work, as indicated by its variety of accompanying artwork</span>. The Rhythmplex (Mueller’s personal website) page for the album goes into some detail regarding the gestation and overall nature of the work, stating:</p>\n<p>“[that the] <span style=\"color: #363636;\">project has used sound, performance, and concept to explore ideas around presence and experience. This work culminates in the release of Ensemble, an elaborate book/LP/digital release that features seven essays about our vulnerability, the rawness of our inner lives, and how we move forward in the face of it all”</span></p>\n<p>This informs the roaming, multi-faceted nature of <em>Ensemble –</em> tending at certain points towards the ineffable but always remaining rooted to its emotionally-driven centre point – as well as the appropriately maximal aesthetic of the record as a whole. Its themes are grand and ambitious, but the LP carries them off impressively and with a drive that doesn’t feel laboured, even if the subject matter sometimes is. Like any successful album and collaboration, this is a good deal more than the sum of its individual parts (relating to the input of each artist, as well as the collection of songs) and is more than well-deserving of listeners’ attentions – whether as an evening record or as a soundtrack to a walk, this is a great restorative to the dip of autumn and the first leg of the year’s declining arc. <em>Ensemble</em> was released less than a week ago, on 9th September.</p>\n<p><iframe style=\"border: 0; width: 350px; height: 470px;\" src=\"https://bandcamp.com/EmbeddedPlayer/album=54812675/size=large/bgcol=ffffff/linkcol=0687f5/tracklist=false/transparent=true/\" width=\"300\" height=\"150\" seamless=\"\"><a href=\"https://rhythmplex.bandcamp.com/album/ensemble\">Ensemble by Death Blues</a></iframe></p>\n","slug":"29828-new-death-blues-ensemble","category":"music","date":1410943280000,"wpid":29828,"isSticky":false,"featured_image":{"width":600,"height":600,"src":"2014/09/a2989960852_10-600x600.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFwAAAwEAAAAAAAAAAAAAAAAAAAMGCP/EACEQAAIBBAEFAQAAAAAAAAAAAAECAwAEBRIxBhEhIlFx/8QAFQEBAQAAAAAAAAAAAAAAAAAAAQL/xAAWEQEBAQAAAAAAAAAAAAAAAAAAARH/2gAMAwEAAhEDEQA/AM9WOP6clxayXOSuYb4pETHqpXYzauOOBH7ftTs6os8ixNtGGIVvo7+DS6KrDa//2Q=="},"createdAt":1587281890687,"updatedAt":1588403514842,"author":"5e9b68b27a1236eccfeb1d4a","old_image":"2014/09/a2989960852_10-600x600.jpg","categories":["music","new"]}