{"id":"5e9bffdd774c2610387e458b","artists":["5e9b68da7a1236eccfeb1ebf"],"title":"New: Call Super – Suzi Ecto","content":"<p>The release of <strong>Call Super’s</strong> highly awaited debut album <em>Suzi Ecto</em> is being met with widespread acclaim among the online electronica community, and deservedly so.</p><p> The UK-born, now Berlin-based Joseph Seaton has really delivered on the promise of some earlier work with the emergence of this unsettling dream sensation of a techno album, which was finally published yesterday.</p>\n<p><iframe src=\"//www.youtube.com/embed/-wbNbigFPEE\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe></p>\n<p>A glittering labyrinth of slippery signposts, feints and false turns, this record takes you on a hypnotic trip through its own self-made puzzles and plurality. And despite how immersive and absorbing the sounds of this album often can be, there is a weird, persistent sense of being external that runs through all of <em>Suzi Ecto</em>, though it’s difficult to put your finger on what exactly this is with any degree of precision.</p>\n<p><iframe src=\"//www.youtube.com/embed/jWHXLfkaLMs\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe></p>\n<p><iframe src=\"//www.youtube.com/embed/EaHw4wQhc3M\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe></p>\n<p>Structurally-speaking as well, the record has an elusive complexity which can be hard to pin down. The noticeable mood shift between <em>Sulu Sekou</em>, <em>Hoax Eye</em> and <em>Raindance</em> is evidence of just one of the many dips and twists this album takes over the course of its development. <em>Suzie Ecto</em> is full of these sorts of self-conscious movements and devices (just look at some of the song titles: <em>Dovetail</em>, <em>Hoax Eye</em>, <em>Fold Again At Last</em>). There are, in a number of tracks, some distinguishable threads of existing contemporaries (like Actress, like Vessel, like Oneohtrix Point Never…), but on the whole the LP bends these elements into shape to take on a sound and skeleton very much of its own making.</p>\n<p><iframe src=\"//www.youtube.com/embed/BtAe4-eOK78\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe></p>\n<p>With <em>Ghettoville</em>, Kassem Mosse’s <em>Workshop 19</em>, Voices From the Lake’s <em>Velo Di Maya </em>EP, <span style=\"color: #222222;\">Moiré’s</span> <em>Shelter</em>, Vessel’s <em>Punish, Honey</em>, and now this behind us, 2014 really seems to be turning into a strong year for these kinds of leftfield, experimental techno records, which probably comes as a bit of a surprise. I, for one, certainly wasn’t expecting such a number of well-wrought and progressive works of this nature at the start of the year. And, when they’re of a kind with the above mentioned titles and this highly impressive LP here, your only inclination is to lap up and return to the endlessly absorbing things, while welcoming any more of this fare yet to come.</p>\n","slug":"29874-new-call-super-suzi-ecto","category":"music","date":1411134775000,"wpid":29874,"isSticky":false,"featured_image":{"width":600,"height":440,"src":"2014/09/65849_488269664595486_23167611_n-600x440.png","placeholder":"data:image/jpeg;base64, iVBORw0KGgoAAAANSUhEUgAAAAoAAAAHCAIAAAC+zks0AAAACXBIWXMAAAsTAAALEwEAmpwYAAAA0UlEQVR4nC2OTWrCQABG5wQFVxZdiSutiKK5R+8g9ACuxSvUnRAQQbrPFboSRARxV9EGf9qgMSZEJ/PjZD4ZdP3eg0cO2w0N/BuNtUigFQAoAZGk14j5HmFhCMF1asDfvzebL4wBGJVRIqMIkj+6r89O+7159PaGagXJiYxCcAYlNXD6Hrr2B2f0WQtGeHDWCYVOf3f7Ua876LbWrmvoTWqWEHoKkKrV8qdcq+aKhWKlVLfq08nYLF4v5OL7ABzHyeTzpUbjzbJeXrO23Qcg4/gO90is033pSrYAAAAASUVORK5CYII="},"createdAt":1587281885975,"updatedAt":1588403514761,"author":"5e9b68b27a1236eccfeb1d4a","old_image":"2014/09/65849_488269664595486_23167611_n-600x440.png","categories":["music","new"]}