{"id":"5e9c32e99b6559241525df9d","artists":["5e9b69447a1236eccfeb256f"],"title":"Interview: Spring Offensive","content":"<p><a rel=\"attachment wp-att-3028\" href=\"https://admin.</p><p>crackintheroad.com/music/2989-interview-spring-offensive/attachment/spring_offensive-casual-2\"><img class=\"aligncenter size-totallysizedforever wp-image-3028\" title=\"spring_offensive-casual\" src=\"https://api.crackintheroad.com/uploads/2010/09/spring_offensive-casual1-740x493.jpg\" alt=\"\" width=\"740\" height=\"493\" /></a></p>\n<p>Oxford based post-rock inspired outfit<strong> Spring Offensive </strong>recently released their expansive 14minute epic “<em>The First Of Many Dreams About Monsters</em>“, a turbulent and moving affair, dealing with the five complex stages of the grief cycle. Featuring soaring riffs and hard-hitting yet controlled vocals, the song attracted a fair amount of deserved attention for the band, landing itself on NME’s weekly playlist, as well as being featured on this <a href=\"https://admin.crackintheroad.com/music/2808-review-spring-offensive-the-first-of-many-dreams-about-monsters\">very site</a>. Following on from this, we caught up with the guys to find out about the track, future plans and long term aspirations. Remember, the track is available to download for free <a href=\"https://drop.io/dreamsaboutmonsters\">here</a>, be sure to check it out!</p>\n<p><em>Crack in the Road: How did Spring Offensive come about?</em></p>\n<p><strong>We were all at school together, and worked out that we were all into similar things; it was a fairly easy process. We’ve been through four bassists, but we’ve had a steady line-up for a year now. Early last year, we decided to record and put something out, and it was picked up by 6 Music straight away. At that point it felt worth giving it a proper go.</strong></p>\n<p><em>CitR: In terms of inspiration, what would you cite as your main, both musically and otherwise?</em></p>\n<p><strong>People who have consistently pushed boundaries and reinvented themselves are massive influences, and whether it’s always good or hit and miss isn’t really important; people like Nick Cave, Efrim Menuck of Godspeed and A Silver Mt. Zion, Radiohead. It depends what we’re doing at the time really. For the last record, Monsters, we were listening to a lot of ‘Hospice’ by The Antlers, Anathallo and Death Cab. Now we’ve moved on to other things. It’s not that we’ve stop listening to those bands, more that they aren’t really consciously informing our writing. Influences can come from anywhere though really, without you expecting it. For instance, the idea for ‘Every Coin’ (about being forced to eat the contents of your wallet) came from a fairly throwaway line in a not particularly memorable play. You just pick certain things up every now and again.</strong></p>\n<p><em>CitR: Your fourteen minute epic single deals with many emotionally distressing yet moving issues, is the song written from personal experiences?</em></p>\n<p><strong>Not exactly. When we first came up with the idea that we wanted to write about grief, it quickly became apparent that it wasn’t something we could really do without it being incredibly false or insensitive. So we focused on that problem more than the idea of losing a child, which none of us have been through or can even imagine what that’s like. You can’t be expected to be writing about your own life all the time – it would either be too boring or too difficult – but you can certainly draw on it.</strong></p>\n<p><em>CitR: How did you go about recording The First Of Many Dreams About Monsters?</em></p>\n<p><strong>Between recording and releasing our mini-album ‘Pull Us Apart’, three long and tedious months, we felt like we really had to do something else, something quite different, which is why we started working on this. The longer we worked on it, the more ambitious and complicated it became. We desperately wanted to put it out, it felt like something we just had to do, but we had absolutely no money, having spent it all on the album. So we called in some favours and borrowed a living room and some gear for a weekend, and recorded it live on no budget. It then took two months to sort out the release. You learn pretty quickly that everything takes about twice as long as it should!</strong></p>\n<p><em>CitR: And if this is the first, is there a possibility for there to be more fantastic tracks to come in a similar<br />\nvein, or was this a one off?</em></p>\n<p><strong>Well, this project was very important to us at the time, but now things have moved on for us. We wanted it to be a sign that we could produce a different kind of song to those on ‘Pull Us Apart’, and we wanted it to be free so that as many people could hear it as possible. But now we’re working on new material. It’s hard to explain, but for us the process of writing means always making a fresh start. When you’re writing a record, all your focus is on making it as good as it can be, and you invest so much into it.</strong></p>\n<p><strong>As soon as it’s finished and out there, you basically have no involvement in it at all. It’s not really yours any more, it belongs to anyone who hears it and enjoys it. So Monsters is in the past. The new tracks have nothing to do with it. The “first of many” of the title refers to the repetitive and seemingly never- ending effect that a single idea can have on you when it consumes you entirely. We’re doing our best to avoid that!</strong></p>\n<p><em>CitR: What has been your most memorable tour moment to date?</em></p>\n<p><strong>It’s hard to say. How we measure success depends very much on the context it comes along in. For example, playing to a 100-strong crowd in London or Oxford where everyone seems to be singing your lyrics is a pretty humbling experience. But then, some nights we’ve played to 6 people who have no idea who we are. On those occasions, selling a CD or getting away without a parking ticket make you feel like you’ve achieved something.</strong></p>\n<p><em>CitR: And your most embarrassing?</em></p>\n<p><strong>Probably the time we thought we were meant to be playing with The Damned at a major local venue, only to turn up and get told we weren’t. Ed Tudor-Pole (punk singer and former Crystal Maze presenter) was sound-checking at the time, and our argument with the promoter stopped him in his tracks. The reason we were particularly upset was that we’d canceled a rehearsal last minute, and on the way the van had broken down, meaning we had to hire one. Oh, and one of us had his bike nicked en route.</strong></p>\n<p><em>CitR: Where would you like to see Spring Offensive in a year’s time?</em></p>\n<p><strong>Hopefully we’ll be working on an album and touring all over the place. It’s hard to have long-term goals though. Right now we’re just busy building momentum and working on a new EP. Once that’s done we’ll see how things stand.</strong></p>\n<p><em>CitR: If you could have any celebrity (alive or dead), join you onstage for a duet, who would it be?</em></p>\n<p><strong>Beethoven. It worked for Bill and Ted.</strong><br />\n<em><br />\nCitR: If you could be any animal, what would you be?</em><br />\n<strong><br />\nThe bat that had its head bitten off by Ozzy.</strong></p>\n<p><em>CitR: Thanks very much guys!</em></p>\n<p style=\"text-align: center;\"><a href=\"https://www.myspace.com/springoffensive\">Spring Offensive On Myspace!</a></p>\n<p style=\"text-align: center;\"><a href=\"https://drop.io/dreamsaboutmonsters\">Download The First Of Many Dreams About Monsters!</a></p>\n<p style=\"text-align: center;\">Or Stream It Below!</p>\n<p><object classid=\"clsid:d27cdb6e-ae6d-11cf-96b8-444553540000\" width=\"100%\" height=\"81\" codebase=\"https://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=6,0,40,0\"><param name=\"allowscriptaccess\" value=\"always\" /><param name=\"src\" value=\"https://player.soundcloud.com/player.swf?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F4332187%3Fsecret_token%3Ds-Ftlc1&secret_url=false\" /><embed type=\"application/x-shockwave-flash\" width=\"100%\" height=\"81\" src=\"https://player.soundcloud.com/player.swf?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F4332187%3Fsecret_token%3Ds-Ftlc1&secret_url=false\" allowscriptaccess=\"always\"></embed></object> <span><a href=\"https://soundcloud.com/springoffensive/the-first-of-many-dreams-about-monsters\">The First of Many Dreams About Monsters</a> by <a href=\"https://soundcloud.com/springoffensive\">springoffensive</a></span></p>\n<p><script src=\"https://video.unrulymedia.com/wildfire_11244048.js\" type=\"text/javascript\"></script></p>\n","slug":"2989-interview-spring-offensive","category":"interviews","date":1285783461000,"wpid":2989,"isSticky":false,"featured_image":{"width":3492,"height":2328,"src":"2010/09/spring_offensive-casual.jpg","placeholder":""},"createdAt":1587294953655,"updatedAt":1588403563448,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2010/09/spring_offensive-casual.jpg","categories":["interviews","music"]}