{"id":"5e9c32e89b6559241525df9a","title":"Review: Mt. Desolation/The Staves","content":"<p>‘I’m surprised that we’ve got so far with this, considering it was an idea born out of a drunken mess’.</p><p></p>\n<p>And so <strong>Tim Rice-Oxley </strong>explains to the crowd why he and <strong>Jesse Quinn </strong>decided to create <strong>Mt. Desolation</strong>. With both of the founding members coming from <strong>Keane</strong>, and <strong>Mt. Desolaton </strong>panned as an ‘alt-country’ outfit, I had mixed thoughts going into the gig. Housed within the wonderful decor and surroundings of Manchester’s <strong>Deaf Institute, </strong>the gig began with the Watford born female trio <strong>The Staves </strong>performing a horrendously predictable acoustic set. Compromising of three sisters, <strong>The Staves </strong>entertained the room with delightful harmonies and  guitar chords that kept the audience in a still and mesmerized silence. However while <strong>The Staves </strong>are indeed very musically talented, you wouldn’t have been blamed had you closed your eyes and thought you were listening to <strong>Laura Marling</strong>. The music industry has been flooded by female acoustic singer/songwriters and they’re all starting to mould into one melancholic mess. Perhaps with some darker lyrics and an expansion upon their current acoustic sound, <strong>The Staves </strong>will achieve the memorability they deserve.</p>\n<p>With the mood set and the room now full, I spied a man clinging onto the front of the stage with a <strong>Keane </strong>hoody on and a gaggle of menacing middle aged women that seemed dead set on stripping <strong>Tim </strong>of all his clothes. However my attention moved away from these possible groupies-to-be when <strong>Mt. Desolation </strong>took to the stage to be met by raucous applause. Immediately you could tell this was an outfit that benefited from two very experienced musicians, both in the quality of the music and the stage presence of the whole band. <strong>Tim </strong>and <strong>Jesse </strong>featured front of stage and entertained the audience with very energised performances, unleashing a sound that was full of loose drums and emphatic fiddle and banjos. A particularly memorable track, ‘<strong>Departure</strong>‘, reveled in the up tempo nature of this alt-country sound and was key in winning over my appreciation of the band. Initially the tracks had sounded somewhat generic, insofar as they appeared to rely on a preset system of musical styles that did very little to stop each track melting into the next. However I must admit that while <strong>Mt. Desolation </strong>are by no means a musical sensation, they have professionally created a sound that is both enjoyable to listen to and holds a good deal of musical integrity. This is perhaps best seen in their track ‘<strong>State of Our Affairs</strong>‘, which deviates away from the normal upbeat nature we had been used to and instead presents a calm and very atmospheric sound that would greatly appeal to fans of <strong>Elbow</strong>.</p>\n<p><strong>Mt. Desolation </strong>are due to release their self titled album on the 18th October, with reports suggesting that it features contributions by members of <strong>Noah and the Whale, Mumford & Sons, </strong>and <strong>The Killers</strong>. With these contributions we will almost certainly hear a more enhanced <strong>Mt. Desolation </strong>than the live band that performed at the <strong>Deaf Institute</strong>, and taking this into consideration I’d advise you to buy the record. This is certainly not <strong>Keane </strong>by any stretch of the imagination, however the elements that made <strong>Keane </strong>loved by so many are certainly in the band; the clear and emotional vocals, the accessible lyrics, and the ability to move from the upbeat to the melancholic are combined with an enjoyable country feel.</p>\n<p><a href=\"https://www.myspace.com/mtdesolation\" target=\"_blank\">Mt. Desolation Myspace</a></p>\n","slug":"2992-review-mt-desolationthe-staves","category":"music","date":1285860626000,"wpid":2992,"isSticky":false,"featured_image":{"width":570,"height":406,"src":"2010/09/mt.-desolation-equals-members-of-killers-keane-long-winters-mumford-and-sons.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAMH/8QAHBAAAgICAwAAAAAAAAAAAAAAAAERYQIEIjKh/8QAFAEBAAAAAAAAAAAAAAAAAAAAAP/EABQRAQAAAAAAAAAAAAAAAAAAAAD/2gAMAwEAAhEDEQA/ANv2HGL5Lrdk5tegAf/Z"},"createdAt":1587294952051,"updatedAt":1588403563422,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2010/09/mt.-desolation-equals-members-of-killers-keane-long-winters-mumford-and-sons.jpg","categories":["music","reviews"]}