{"id":"5e9c32eb9b6559241525dfa0","artists":["5e9b68ec7a1236eccfeb1ff0"],"title":"Review: Eliza Doolittle","content":"<p><a rel=\"attachment wp-att-3014\" href=\"https://admin.</p><p>crackintheroad.com/music/3010-review-eliza-doolittle/attachment/eliza\"><img class=\"alignnone size-totallysizedforever wp-image-3014\" title=\"Eliza\" src=\"https://api.crackintheroad.com/uploads/2010/09/Eliza-740x740.jpg\" alt=\"\" width=\"740\" height=\"740\" /></a></p>\n<p>Searching ‘Eliza Doolittle’ into a search engine and you are overcome with articles on sites each mentioning a certain Lily Allen, comparing styles, album artwork and almost everything else music orientated. The difference between Eliza’s début self titled album, <em>Eliza Doolittle</em>, and anything Lily has created are even greater than the numbers of pages dedicated to their ‘similarities’. Eliza’s singing is quite possibly the most natural and pure vocalist of <em>any</em> current female singer-songwriter, lyrics flow out of this girl which almost resembles a stream of consciousness narrative, sung almost without the need of thought. The only comparison, if one could even be made, of someone with which singing sounds so instinctive and ‘right’ is that of Paolo Nutini, who can also achieve a vocal effect this memorable.</p>\n<p>Eliza is the daughter of stage director John Caird and former Eurovision song contestant and actress Frances Ruffelle, so performing for her appears to be as natural as her vocals. However her career has taken its own path, focussing her music on personal experiences such as, as opposed to the more mainstream and agreeable feelings of love and commitment that are released to the world on a daily basis from other artists. Her album, <em>Eliza Doolittle</em>, is proof that personal feelings and events are the cornerstone of her music. Each song is entirely different from not only the other songs on the album, but also that of Eliza’s counterparts. She experiments with styles and instruments throughout the album, from the soul elements of <em>Pack Up</em> to the summery, acoustic <em>Mr. Medicine</em> which gives the album a very well-rounded feel which leaves the listeners guessing what is coming next. It is very apparent Eliza is very opinionated and is someone who advocates being an individual, with no better example than in <em>Nobody</em>, “The whole world is tryin’ to be somebody/ Kickin’ themselves ’bout what could’ve been”. The lyrics in this song are so soft and personal, it is almost like she is conversing with the listener with help from her colloquial language.</p>\n<p>The album has hit number 3 in the UK chart at its peak, a great achievement in a chart already saturated with female artists and there is no reason why any future release can’t hit number one, as her commitment surpasses that of most and her talent is considerably greater than her counterparts, both male and female. A must buy for anyone who wants a quirky pop album infused with other genres and styles, creating an individuality that she yearns to teach others about.</p>\n<p style=\"text-align: center;\"><a href=\"https://www.myspace.com/elizadoolittle\">Check Her Myspace Here</a></p>\n<p style=\"text-align: center;\"><a href=\"https://www.elizadoolittle.com/\">Official Site</a></p>\n<p><script src=\"https://video.unrulymedia.com/wildfire_11244048.js\" type=\"text/javascript\"></script></p>\n","slug":"3010-review-eliza-doolittle","category":"music","date":1285611566000,"wpid":3010,"isSticky":false,"featured_image":{"width":2362,"height":2362,"src":"2010/09/eliza.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFwAAAwEAAAAAAAAAAAAAAAAAAgQFBv/EACIQAAEEAgEEAwAAAAAAAAAAAAECAwQRAAUSEyExQSIzov/EABUBAQEAAAAAAAAAAAAAAAAAAAMF/8QAGBEBAAMBAAAAAAAAAAAAAAAAAQACIRH/2gAMAwEAAhEDEQA/AE9jr+WiibaVLS4zJe6bjaG/qrkbI8KugABVXeQDB0yjyVMfCj3IEY9v1gMLWYSQVKoIBAv3mddWrqL+R8n3k2tQwiHE0n//2Q=="},"createdAt":1587294955569,"updatedAt":1588403563473,"author":"5e9b68b27a1236eccfeb1d07","old_image":"2010/09/eliza.jpg","categories":["music","reviews"]}