{"id":"5e9bff92774c2610387e451d","artists":["5e9b692b7a1236eccfeb23d7"],"title":"New: OneKnown – JUST BKZ","content":"<p>Remember the Burial-esque Irish electronic pair UNKNWN covered by Crack in the Road earlier this year, following the release of their debut EP <em>Devil/BBY</em>? Well, in the wake of an unexpected run of success over the past twelve months, the duo have decided to break up and go their separate ways, owing mainly to collaborative disagreements and legal issues relating to the project.</p><p> Unencumbered by this split, though, the act’s nerve centre, Chris Hanna, has decided to push on with things under the new, tongue-in-cheek yet not entirely imaginative moniker of OneKnown, and has provided a sample of his renewed solo work with this sumptuous track.</p>\n<p>Fear not if the naming on this one is beginning to spell warning signs for you. On the evidence of this latest release, Hanna hasn’t let the rush-and-whirl of the last year or any reverberations from recent events hamper the quality of his output or production, if anything continuing to go from strength to strength with this. A trippy blaze of erratic arrangements and muffled beats, <em>JST BCZ</em> is a brain-licker of a tune that carries along some of the brooding electronic flavours lingering in the trip-hop echoes from Hanna’s earlier project. Underlined by a cascading and occasionally glitchy snyth line, the richness of detail in this track can be found in the way screeching instrumentation and elements of more subdued electronica are brought together at points where they really shouldn’t be able to. This is most clear to see at the song’s high points (around 0.55-1.30 and 2.18-2.30), and especially in the evocations of  Nosaj Thing, Lorn and Flying Lotus it hands out with a quiet confidence.</p>\n<p>Hanna’s impressive output makes up a very precious piece of Belfast’s very own Champion Sound Records. Given that a number of this site’s readers have previously voiced their appreciation for some of the other acts housed under the collective, it’s probably a good time to mention an upcoming showcase being put together by the label on 15th November at the Menagerie Bar. The event will make up a diverse, intriguing display from a number of acts on Champion Sound’s current roster, including the dark, lugubrious two-piece outfit Ghosts and low-key electronic pair <a href=\"https://api.crackintheroad.com/music/20172-new-ryan-vail-fade\" target=\"_blank\">Ryan Vail</a>. If you’re around Belfast (or Northern Ireland more generally) at the time, I’d suggest you head along and check it out.</p>\n<p>Going to avoid the cheap puns on this one, tempting as they may be.</p>\n<p>You can stream it below.</p>\n<p><iframe src=\"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/172411640&auto_play=false&hide_related=false&show_comments=true&show_user=true&show_reposts=false&visual=true\" width=\"100%\" height=\"450\" frameborder=\"no\" scrolling=\"no\"></iframe></p>\n","slug":"30134-new-oneknown-just-bcz","category":"music","date":1415223143000,"wpid":30134,"isSticky":false,"featured_image":{"width":1280,"height":800,"src":"2014/10/1537906_837218296299171_2762885539165182721_o-1280x800.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAGAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAUH/8QAIBAAAgEDBAMAAAAAAAAAAAAAAQIDAAQRBQYSIUFhgf/EABQBAQAAAAAAAAAAAAAAAAAAAAX/xAAdEQACAQQDAAAAAAAAAAAAAAABAwACESExQZHB/9oADAMBAAIRAxEAPwDFk3S9g1hawwxG2KyGUNCpZ+Q679Z+HNRm1OGJjGUclTxOEXxSlNMbXc558EEUhdOQN77M/9k="},"createdAt":1587281810421,"updatedAt":1588403514084,"author":"5e9b68b27a1236eccfeb1d4a","old_image":"2014/10/1537906_837218296299171_2762885539165182721_o-1280x800.jpg","categories":["music","new"]}