{"id":"5e9bff8d774c2610387e4511","artists":["5e9b69377a1236eccfeb2482"],"title":"New: Rat Boy – The Mixtape","content":"<p>Usually as we enter the end of a year, our minds are either focused firmly in a sense of retrospect and evaluation of albums released, or on artists and bands that have spent the year establishing themselves for the forthcoming year.</p><p> It won’t be long until we have the usual ones to watch lists, however as we stand on that particular precipice we have been stunned by the emergence of an incredibly exciting 18 year old artist from seemingly out of nowhere.</p>\n<p>Operating under the moniker Rat Boy, Jordan Cardy originally uploaded his debut mixtape a staggering 7 months ago. For a good while it existed relatively unnoticed, though after a couple of spins on BBC 6Music the awareness has increased and we’ve all started to play catch up. There is an immediate pang of Jamie T in Rat Boy’s music, though you would be very short sighted to end your understanding with such an off hand  assessment. While the comparisons to Jamie T are valid in their shared clever lyricism and raucous energy, after a few listens you begin to hear influences of British punk music, such as The Clash, along with plenty of references to a hip hop narrative in the vein of The Streets and the Beastie Boys, demonstrated through his percussive beats and the ardent use of samples to string together a series of fascinating, and at times contradictory, ideas.</p>\n<p>There is far too much to be said about Rat Boy’s debut mixtape to be covered adequately in a modest blog post, so I would encourage you to listen to the mixtape in it’s entirety below. What can be said for certain is that Rat Boy is very much one to watch as we enter into 2015, even if you don’t see him on many of the customary lists.</p>\n<p><iframe src=\"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/playlists/31224818&auto_play=false&hide_related=false&show_comments=true&show_user=true&show_reposts=false&visual=true\" width=\"100%\" height=\"450\" frameborder=\"no\" scrolling=\"no\"></iframe></p>\n","slug":"30260-new-rat-boy-mixtape","category":"introducing","date":1416225873000,"wpid":30260,"isSticky":false,"featured_image":{"width":492,"height":493,"src":"2014/11/screen-shot-2014-11-17-at-12.29.56.png","placeholder":"data:image/jpeg;base64, iVBORw0KGgoAAAANSUhEUgAAAAoAAAAKCAIAAAACUFjqAAAACXBIWXMAAAsTAAALEwEAmpwYAAABQUlEQVR4nAE2Acn+AHpPJI1cJoleI4NYI3RLInxRJGI/HW1FHoJSJH1SKACeYB6cXyaSOy+PSSlzSBeGURtqQRhjRBmEVCKANycASFlbYjU8lAw6dSA3S1NTTFRbREI+cygyZykyaTFBABhgmy47Zo0KMHwSPA5GbSxlkiNBboMPOG0UOlkvYAAfRWkXPl5fJUdvFzdSIUAvW5EeTnZyDi2FG0YmP2MAFTNOIDJRlS9enyNQnBNCIViHKT9meAwumA87Si9TABZBYikvTXUaRbMOQ3UwZFwrVTZHczZemHkTOHkhTgARL0gpMlI7HTiUED2fGk9TLVViMV8nYppDP2trHUIAFj9gK0VuiR1NfSxgWzVlJS1LRC1SISpEEzlWVjRgAChgkyZVfh1jmR5mnBdXgh9aixxfkho8WCRMcSxThEx5V4Jt3PN7AAAAAElFTkSuQmCC"},"createdAt":1587281805649,"updatedAt":1588403513974,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2014/11/screen-shot-2014-11-17-at-12.29.56.png","categories":["introducing","new","music","newnews"]}