{"id":"5e9c32e49b6559241525df94","artists":["5e9b68f87a1236eccfeb20cf"],"title":"Interview: Golden Ages","content":"<img class=\"alignnone\" title=\"GA\" src=\"https://c3.</p><p>ac-images.myspacecdn.com/images02/137/l_eddc22c23df749a8b1d7e524b6b0ce76.jpg\" alt=\"\" width=\"600\" height=\"400\" />\n<p>Having provided remixes for the likes of <strong>Surfer Blood</strong>,<strong> Ghost Animal</strong> and <strong>Millionyoung</strong>; Philadelphian artist Francis Tseng aka<strong> Golden Ages</strong> is at the forefront of the current chillwave movement. Whilst many electronic projects can become self-involved and rather plastic, <strong>Golden Ages</strong> manages to maintain a wholesome and all-encompassing sound. With the brilliant debut LP release <em>Tradition </em>already under his belt, Tseng is gearing up for his second full length record, and in anticipation of this, kindly decided to give away 3 track EP<em> Africa</em> entirely for free. Containing a cover of <strong>Toto’s</strong> 80’s classic Africa, <strong>Golden Ages </strong>has previously received comparisons to the likes of<strong> Dan Deacon</strong> and<strong> Animal Collective</strong>, a fairly impressive feat for Tseng who has only written and recorded under this moniker for a year and a half. With a second<strong> Golden Ages’s </strong>LP on the way, Francis took some time out to answer a few questions for<em><strong> Crack in the Road</strong></em>.</p>\n<p><em>CitR: How did Golden Ages come about?</em></p>\n<p><strong>I started Golden Ages  last year in my dorm at school. I neglected a lot of my schoolwork, so I  had some free time and growing up I’d always had an interest in music. I  don’t think when I started it I had any specific intentions for it, I  just wanted to create something that would outlast me. Before Golden Ages  I had some other small projects and DJ’ed a little bit but beyond that I  had never been that serious about music. Now it’s beginning to take on a  life of its own and it’s really amazing, I’m very excited about the  possibilities.</strong></p>\n<p><em>CitR: Your music has an electronic vibe to it, yet isn’t strictly limited to  the genre, what are your main inspirations both musically and otherwise?</em></p>\n<p><strong>My  background is more visually oriented; growing up I did more with design  and graphics than with music. I think a lot of the images and visual  styles I’ve come across have ended up influencing my sound. I’m very  much a supporter of the idea that the visual aspect of a music project  can be just as important as the music itself. I’m more interested in  creating a total experience rather than just an aural one. I put just as  much into making the artwork for Golden Ages as I do the actual music.</strong></p>\n<p><strong><br />\nIn terms of music inspirations, for the previous works  I drew mostly from what I was hearing at the time. I think it was just  as chillwave was getting big and as psychedelic pop was experiencing its  revival, so the sound of the first releases reflect that. But for the  new material I’m trying to cut out a different path and I’m taking from  different inspirations, although I think it will inevitably continue to  reflect some aspect of the current state of music.</strong></p>\n<p><em>CitR: Your music has been described as “glitchy” and “a treasure trove of  sounds”; how would you describe your sound to someone who had never  heard your music before?</em></p>\n<p><strong>It’s very loud and can get fuzzy and noisy, but there’s always a thread of nostalgic melody buried in there.<br />\n</strong><em><br />\nCitR: Where would you like to see Golden Ages in a years time?</em> <em> </em></p>\n<p><strong>I’d definitely like to have the live show together. Right now it’s in  its infancy but I think we could do a lot of cool things with it. Golden Ages  began as a bedroom project and I never intended for it to be played in a  live setting, but having experienced the energy of a live show I want  to transition the project into a full band with a killer live set.</strong><br />\n<em><br />\nCitR: What can we expect over the coming months in terms of releases/remixes etc?</em></p>\n<p><strong>I’m working on a new album, which I hope to have out early next year. I  have a couple remixes that I’m working on but I’m focusing all my effort  into the live show and the next album. There are also some  collaborations I’m working on with other people…it’ll be a busy year.</strong><br />\n<em><br />\nCitR: What has been your most memorable tour moment to date?</em></p>\n<p><strong>The first show as a full band, which was only very recently, was  awesome. We played with Savages and the Binary Marketing Show who were  great (it was the Savages very first show) and a lot of fun. The crowd  really dug it and it went as best as it could have…much better than  our first shows as only a two-piece.</strong></p>\n<p><em>CitR: And your most embarrassing?</em></p>\n<p><strong>The very first Golden Ages  live show was pretty terrible. It was just me and Johann (drummer) and I  hadn’t totally worked out how exactly to translate the material live. I  had things running on a sampler and a laptop and was playing bass, and I  was so nerve-wracked that I couldn’t nail the parts. To make matters  worse, I had eaten Mexican food before our set and it was in violent  disagreement with my stomach. The crowd didn’t seem very responsive and  overall it was a bummer of a show.</strong><br />\n<em><br />\nCitR: If you could have any celebrity (alive or dead), join you onstage for a duet, who would it be?</em></p>\n<p><strong>Joe Strummer, maybe. The Clash was one of my favorite bands growing up  and I’ve always wished I could see them play live. It would be amazing  to play with any member of the band, but Joe Strummer especially. </strong></p>\n<p><em>CitR: Thanks very much!</em></p>\n<p style=\"text-align: center;\"><a href=\"https://www.myspace.com/wearegoldenages\">Golden Ages On Myspace!</a></p>\n<p style=\"text-align: center;\"><a href=\"https://www.deerhaus.com/\">Check out Deerhaus collective!</a></p>\n<p style=\"text-align: center;\"><a href=\"https://www.mediafire.com/?ujnduonmd2i\">Download Africa EP</a></p>\n<p style=\"text-align: center;\">\n<p style=\"text-align: center;\">\n<p style=\"text-align: center;\">\n<p><script type=\"text/javascript\" src=\"https://video.unrulymedia.com/wildfire_11244048.js\"></script></p>\n","slug":"3031-interview-golden-ages","category":"interviews","date":1286130574000,"wpid":3031,"isSticky":false,"featured_image":{"width":600,"height":400,"src":"2011/06/l_eddc22c23df749a8b1d7e524b6b0ce76.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAAAAf/xAAeEAACAQUAAwAAAAAAAAAAAAABAgMABAURMQYUIv/EABUBAQEAAAAAAAAAAAAAAAAAAAIE/8QAGREAAwADAAAAAAAAAAAAAAAAAAECAxEx/9oADAMBAAIRAxEAPwCTImMv/Gsn68SXGVW0tIomMejGYmcSaJ5tQm9d5U7ktZY5HR1+lJU86KUorui+scuUz//Z"},"createdAt":1587294948530,"updatedAt":1588403563368,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/06/l_eddc22c23df749a8b1d7e524b6b0ce76.jpg","categories":["interviews","music"]}