{"id":"5e9c32c99b6559241525df66","artists":["5e9b69577a1236eccfeb26ab"],"title":"Interview: Unconscious Jungle","content":"<p><strong>Unconscious Jungle </strong>are a gem within the Manchester music scene, with local radio and bloggers already taking notice of this four piece ‘psychedelic folk’ band.</p><p> Full of choral harmonies, interjections of brass, and ambient synths, <strong>Unconscious Jungle </strong>have created a sound that is intriguing yet easy to listen to. Instead of forming their music around a certain genre, the band has skillfully taken elements of folk, psychedelia, funk, rock and, as they state it, 20th century dance themes. These various influences have led to their  EP release ‘Four Dances For Dancers’ to be a collection of four very distinct tracks, which are full of melancholy, romance and warming contemplation. After recent performances with <strong>Islet </strong>and at Manchester’s <strong>In The City </strong>festival, <strong>Crack In The Road </strong>caught up with the band.</p>\n<p><strong>CITR: </strong>If you have to site one band / artist that has influenced you who would it be and why?</p>\n<p><strong>Unconscious Jungle: </strong>Though it’s difficult to pick just one artist, we all love the Beach Boys. Listening to such intricate, yet perfectly performed A Capella harmonies on ‘The Pet Sounds Sessions’ really inspired us.</p>\n<p><strong>CITR: </strong>What has been your favourite gigging experience?</p>\n<p><strong>UJ: </strong>Two gigs stand out as being especially memorable. The first, at the Bitter Suite in Preston was a one and a half hour set which allowed us to play a full set of all our songs. We also really enjoyed the audiences’ waltzing along to the first live play of the “Rainbow Room Waltz” at the Attic in Manchester.</p>\n<p><strong>CITR: </strong>What brought unconscious Jungle into existence?</p>\n<p><strong>UJ: </strong>We all played together in a small funk band during our first year at University. Our cover of Herbie Hancock’s Watermelon man was, to be honest, a bit of a disaster. However, it was enough of a fun experience to make us want to form a band together and write our own songs.</p>\n<p><strong>CITR: </strong>How was Four Dances for Dancers as an experience to create and record?</p>\n<p><strong>UJ: </strong>We wanted to a record a small body of bringing old style 20<sup>th</sup> dances into a modern musical scenario. While living in house in a quiet part of Preston, we had three days to get everything recorded, finished and ready to mix. We recorded and produced everything ourselves, with our good friend Matt Gallagher helping out as an engineer. Listening to the un-mixed and un-mastered songs at five in the morning once the very last overdub was recorded felt amazing; it made the long hours instantly worth it.</p>\n<p><strong>CITR: </strong>How much do you feel Manchester and its musical history has affected your sound?</p>\n<p><strong>UJ: </strong>Our connection to Manchester really only started since coming to University here in 2007; We are all originally from different parts of the country and one’s even from across the pond in Chicago. Bands like the Smiths and the Hollies are definite influence for us though. As part of BBC Radio Manchester’s 40<sup>th</sup> Birthday, we were invited to be one of the 40 bands to a cover song of ABC’s 1982 hit ‘The Look of Love.’ (Martin Fry, the group’s lead singer, was from Stockport)</p>\n<p><strong>CITR: </strong>What is your main basis of inspiration?</p>\n<p><strong>UJ: </strong>We all write and contribute musically to the production of each song. Usually somebody writes the basis and brings the song for a jam and after a few weeks the song begins to take form. Most of the songs are about love, heartbreak or adventure. ‘Queen Bee’ is a love song written as though told through the eyes of an entomologist.</p>\n<p><strong>CITR: </strong>Three words to sum up Unconscious Jungle?</p>\n<p><strong>UJ: </strong>Feel Mike Love</p>\n<p><a href=\"https://www.myspace.com/unconscious-jungle\" target=\"_blank\">Unconscious Jungle Myspace</a></p>\n","slug":"3046-interview-unconscious-jungle","category":"interviews","date":1288113367000,"wpid":3046,"isSticky":false,"featured_image":{"width":600,"height":600,"src":"2010/10/unconscious-jungle.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAABgUH/8QAJhAAAgEDAgQHAAAAAAAAAAAAAQIDBAURAAYSEzFBFCEiMlFh8f/EABQBAQAAAAAAAAAAAAAAAAAAAAL/xAAYEQADAQEAAAAAAAAAAAAAAAAAAQIRMf/aAAwDAQACEQMRAD8A1Xdu7rPtzdNjtdfLUvJd6hlWZZyeUeZwqCB0HEcfh0zhkjjhRBUSsFULxGXJOO+dTblFGa6dyil0aQq2PNTg9PjSOjjTwkHoX2L2+tCniA54f//Z"},"createdAt":1587294921132,"updatedAt":1588403562964,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2010/10/unconscious-jungle.jpg","categories":["interviews","music"]}