{"id":"5e9c32cc9b6559241525df6c","artists":["5e9b691e7a1236eccfeb22e0"],"title":"Interview: Mammal Club","content":"<p>Having recently supported <strong>Everything Everything, Crack In The Road </strong>managed to catch up with one of our favourite groups of music purveyors, <strong>Mammal Club</strong>.</p><p></p>\n<p>After witnessing <strong>Mammal Club </strong>perform on several occasions, I am always absorbed and blown away.. The band create a sound that is wonderfully erratic, with no one track sounding the same. This of course makes it difficult to attempt to classify <strong>Mammal Club </strong>and their sound, but what a fucking relief. Too often are we presented with bands that subscribe to a certain way of doing things, and almost revel in the generic off shoot of indie that is bestowed upon them. Instead <strong>Mammal Club </strong>present their audiences with music that gains an uniqueness from the sum of all its parts. Crashing percussion and distorted vocals resonate through their sound, and once combined with their ever altering guitars and atmospheric synths<strong><span style=\"font-weight: normal;\">, an audience can be held in silence or transformed into a dancing mass. I was lucky enough to see </span>Mammal Club </strong>perform at this years <strong>In The City Festival</strong>, and as they played their fantastic set many of the ‘Music Delegates’ were ‘googling’ <strong>Mammal Club </strong>and furiously scribbling down notes. So my advice would be to catch this fantastic band before they attract more main stream attention, and you have a chance to do that tomorrow (23rd October) at the <strong>Oxjam Festival </strong>at the <strong>Cluny</strong>!</p>\n<p><strong><br />\n</strong></p>\n<p><strong>CITR:</strong> If you had to cite one band/artist as a major influence upon you, who would it be and why?</p>\n<p><strong>Wilson: </strong>I would say Abba. Because they’re amazing, but also I think the way they make ridiculously complex music sound excruciatingly simple and catchy is something that I aspire to in the music I write.</p>\n<p><strong>CITR: </strong>What has been your favourite gigging experience to date?</p>\n<p><strong>Wilson : </strong>The secret gigs we have at our lock up are my favourite gigs. It means we get to invite who we like, we get to try out new and experimental stuff, and we don’t have to pack up after… Bliss.</p>\n<p><strong>CITR: </strong>What caused the move from ‘The Eye Jab’, which even received high praise from that cheeky Irishman Colin Murray, to ‘Mammal Club’?</p>\n<p><strong>Wilson: </strong>I was writing new and better music, we had new members and a new setup… It had become something else, so It made sense to call it something else. I mean clearly I loved theeyejab as it was a band I’d been in since I was 13, and I’m glad we released “who still believe in love”, as it means there will always be record of our existence, but it was time to move on… Despite Murray’s interest… Anyway he has Match of the Day 2 now.</p>\n<p><strong>CITR: </strong>You’ve recently recorded ‘Double Double’, a track which you say is about Alan Turning. Where did the inspiration for this track come from?</p>\n<p><strong>Wilson: </strong>I think his story is a tragic, but an equally fascinating one. I tried to bring both sides together. His scientific and mathematical work was astounding, and I know it sounds twaty, but I saw a lot of beauty in the idea of how Turing saw the world. Seeing life, down to the most banal detail, as numbers, and equations was a really intriguing idea to me. It’s slightly sensationalist, and romanticised in the extent I take it to, but I just enjoyed the concept too much to not push it to it’s limits.</p>\n<p><strong>CITR: </strong>The video for ‘Double Double’ shows you recording the track in your ‘lock up’, how do you find such a minimalist space to record in?</p>\n<p><strong>Wilson: </strong>It only looks minimalist from those carefully chosen camera angles. If any of the cameras were panned even an inch in either direction you’d see it’s pretty maximalist in there. It was a place our guitarist, Adam was aware of, and as soon as it came up we snaffled it. It’s an amazing room, and great for recording drums in. It’s actually built in to one of the arches of Byker Bridge. All of our huge drum sounds that come through on the recording are due to that space. You might also be able to pick up the hiss of cars passing over head which is present in almost all of our recordings. It’s a really nice sound, that I’m never that fussed about irradicating.</p>\n<p><strong>CITR: </strong>Do you have any plans to release an EP in the near future?</p>\n<p><strong>Wilson: </strong>Yes. It’s all TBC at the moment, but yes we’re working on an EP release, which will be 4-tracks and will be released on everybodys stalking records in the not too distant future.</p>\n<p><strong>CITR: </strong>If you had to describe Mammal Club in three words, what would they be?</p>\n<p><strong>Wilson: </strong>Clever people’s music.</p>\n<p><a href=\"https://www.myspace.com/mammalclub\" target=\"_blank\">Mammal Club Myspace</a></p>\n","slug":"3048-interview-mammal-club","category":"interviews","date":1287768886000,"wpid":3048,"isSticky":false,"featured_image":{"width":600,"height":143,"src":"2010/10/mammal-club.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAACAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAMH/8QAHRAAAgIBBQAAAAAAAAAAAAAAAgMAARIiIzFRkf/EABUBAQEAAAAAAAAAAAAAAAAAAAQF/8QAGBEAAgMAAAAAAAAAAAAAAAAAAAECMUH/2gAMAwEAAhEDEQA/AM1Q1hOLJh3t1yV9ywmeNai9iJMWhZWz/9k="},"createdAt":1587294924207,"updatedAt":1588403563018,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2010/10/mammal-club.jpg","categories":["interviews","music"]}