{"id":"5e9c32e69b6559241525df97","artists":["5e9b69447a1236eccfeb252a"],"title":"Review: Skibunny – Hugs","content":"<img class=\"alignnone\" title=\"SKIBUNNY\" src=\"https://c2.</p><p>ac-images.myspacecdn.com/images01/84/l_3459ede409543e7f4a1fd0d12f3b5929.jpg\" alt=\"\" width=\"600\" height=\"521\" />\n<p>Having already caused quite a stir amongst the nightlife scene in Belfast with their weekly energetic, raucous parties, Tanya Mellote and Mark Gordon aka<strong> Skibunny</strong> are trying to take the charts by storm. Their debut album <em>Hugs</em> is an infectious journey through modern age pop music, brisk, lively and undeniably animated. Whilst there are many bands vying for the title of indie pop pioneers for this new decade, none as of yet have staked a meaningful, passionate claim for the prize.</p>\n<p>The lyrics are elementary and at times uninvolved, for example “<em>everything I said was true, and now I don’t know what to do</em>” in <em>Sun Sun Sun</em>, I’m fairly sure I wrote to that standard in first school. Perhaps a band without the same experience of contagious hooks would struggle by using such transparent lyrics, however<strong> Skibunny</strong> are able to pull it off maturely, seemingly inspired by their love of and backgrounds in the nightlife industry. It is music to dance to, straightforward and self-explanatory.</p>\n<p><em>Remember Me’s</em> riff could well have been penned by<strong> Kings Of Leon</strong>, before the Tennesse group began impersonating U2 that is. Strangely enough, elsewhere influences from a broad and varied spectrum filter through,<em> Remote Control</em> is as much<strong> Yeah Yeah Yeahs </strong>as it is <strong>Britney Spears</strong>, irresistibly incomplex pop by numbers. The drum beats are simple and sharp, the vocals delivered with precision, almost to the point of being artificial.</p>\n<p><strong>Skibunny </strong>also aren’t afraid to call in favors from close friends, with James Chapman from <strong>Maps</strong> featuring on the aforementioned<em> Remember Me</em>, and Kaori Tsuchida of <strong>The Go Team! </strong>featuring on the twee<em> All In This Together</em>. There’s nothing earth-shatteringly groundbreaking; familiar sounds and rhythms, verge on almost allowing the record to become a quagmire of mediocrity, albeit Mellote and Gordon are saved by their fantastic knowledge of a killer hook. <em>Stand Up </em>is a personal highlight, a passionate call to arms for underachievers and the humdrum of society. Echoed vocals provide another much needed dimension to the track, pushing it further than the other songs on<strong> </strong><em>Hugs</em>.</p>\n<p>In general <em>Hugs</em><strong> </strong>is a potential filled record, leaving the listener craving for the duo to take their dance fused pop music to the next level. Hearing any track from<strong> </strong><em>Hugs</em><strong> </strong>on a chaotic night-out would see me instantaneously and ungracefully cavorting my way to the dancefloor, however due to it’s child-like lyrics and effortless feel, it’s no album that requires numerous independent listens. Hopefully <strong>Skibunny</strong> can take the positives from their debut LP, and combine them with their vast experience of dance music to create accomplished and challenging future releases.</p>\n<p style=\"text-align: center;\"><a href=\"https://www.myspace.com/skibunnyclub\">Check Out Skibunny On Myspace!</a></p>\n<p style=\"text-align: center;\"><a href=\"https://www.skibunny.bigcartel.com/\">Buy Hugs!</a></p>\n<p><script type=\"text/javascript\" src=\"https://video.unrulymedia.com/wildfire_11244048.js\"></script></p>\n","slug":"3052-review-skibunny-hugs","category":"music","date":1285961336000,"wpid":3052,"isSticky":false,"featured_image":{"width":600,"height":521,"src":"2011/06/l_3459ede409543e7f4a1fd0d12f3b5929.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAJAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAABwj/xAAmEAACAQIEBQUAAAAAAAAAAAACAwEABAUREiEHEzM2UWFydrGz/8QAFQEBAQAAAAAAAAAAAAAAAAAAAAH/xAAVEQEBAAAAAAAAAAAAAAAAAAAAAf/aAAwDAQACEQMRAD8ARV8c8AUd+y6u2AlN/wAjS2waolhpLMdpKCPMPTYo2piUwWqBi5zAxghnzE1C972HjXyofzbVzo6C/bH1Ra//2Q=="},"createdAt":1587294950369,"updatedAt":1588403563394,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/06/l_3459ede409543e7f4a1fd0d12f3b5929.jpg","categories":["music","reviews"]}