{"id":"5e9c32df9b6559241525df8e","artists":["5e9b68ec7a1236eccfeb1ff2"],"title":"Interview: Ellen and the Escapades","content":"<p><a rel=\"attachment wp-att-3076\" href=\"https://admin.</p><p>crackintheroad.com/music/3073-interview-ellen-and-the-escapades/attachment/pilton-2010-2nd-2\"><img class=\"alignnone size-totallysizedforever wp-image-3076\" title=\"Pilton 2010 2nd\" src=\"https://api.crackintheroad.com/uploads/2010/10/Pilton-2010-2nd1-740x1112.jpg\" alt=\"\" width=\"740\" height=\"1112\" /></a></p>\n<p> <span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\">After winning the Emerging Talent Competition and, thus, performing at Glastonbury festival, </span></span><strong><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\">Ellen and the Escapades </span></span></strong><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\">are becoming a well established band within Britain and are showing their ambition through a UK tour starting in mid-October as well as plenty of peak air time on national radio. Their first self-titled EP, </span></span><em><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\">Ellen and the Escapades</span></span></em><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\">, is out 18</span></span><sup><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\">th</span></span></sup><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\"> of October and will no doubt prove to be a big success, and as summer is becoming a distant memory this EP will certainly bring you back to a warmer time. Although Britain is currently near saturated with alternative folk music, there will always be a gap in the market for a band with such a soft, natural sound this band produce, especially with the liberal use of different instruments and the female vocals. </span></span><em><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\">Without You</span></span></em><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\"> has more than a hint of Bob Dylan about it, with harmonica scattered throughout, but instead replace the blues with a slight folksy twist. Every song in the EP will put a smile on your face and a warm feeling in your heart. A great debut EP from a band that the rest of the country will hear about in the not to distant future.</span></span></p>\n<p><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\">Check out their tour dates across the UK during October and November, they’re live sets are a must see for any fans of Stornoway, Noah and the Whale etc. and </span></span><strong><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\">Ellen and the Escapades</span></span></strong><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\"> are easily on par with these bands, despite being relatively new to the business. </span></span></p>\n<p><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\">Ellen, Jeff, Chris, Andy and James were all nice enough to answer a few of Crack in the Road’s questions:</span></span></p>\n<p><strong><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\">CitR: Firstly, congratulations on winning the emerging talent competition, which is a highly prestigious title and gave you the opportunity to play at Glastonbury this year. Were you guys quietly confident about your chances of winning the award or did it come as a pleasant surprise?</span></span></strong></p>\n<p lang=\"en-US\"><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\">CQ- For me there was a certain amount of self believe that we were good enough to play Glastonbury, and that it if we could only pin the industry down to listen to us for 20 minutes that they would like us. But you have to have such self believe to keep doing it. And want to self release your music. I usually have a dis-liking to competitions, as comparing bands of different genres to each other is always a unfair thing to do. I never thought that we would walk away overall winners but did have the belief that we could give any of the other bands a run for their money.</span></span></p>\n<p><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\">ES-</span></span><strong><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\"> </span></span></strong><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\">Thanks very much! I don’t think any of us thought we’d definitely win, but I thought we stood a chance. We’d been playing live for a couple of years before that gig and I knew we’d be able to give a strong performance. We just weren’t sure what the other bands would be capable of, so that was the unknown…</span></span></p>\n<p><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\">JW – It was definitely a pleasant surprise. I didn’t think we would stand a chance of winning. There were some great bands on across the weekend with big sounds. We were just happy to have played the competition, because that itself was an amazing gig, and gave us the opportunity to play in front of some important folk.</span></span></p>\n<p><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\">AC- Thanks very much! I don’t think any of us really thought we were going to win, we knew we stood a good chance but there were a couple of other really good bands and being picked a favourite out of so many seemed a bit unachievable. Obviously we all had a secret hope but I think our individual reactions to the news showed how shocked we were.</span></span></p>\n<p lang=\"en-US\"><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\">JS – Thank you! Well it was definitely a surprise for all of us. We were really just grateful to make it down to the last 12 acts. There were so many good bands playing those nights that we never imagined winning the competition.</span></span></p>\n<p><strong><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\">CitR: Did you believe from the offset that the variation of country/ folk music you guys produce would be as successful and mainstream as it has become, much like a lot of other bands and artists that have come to the foreground in recent months?</span></span></strong></p>\n<p><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\">CQ- I guess everything comes round in circles. We never sat down and made a conscious decision to be this sort of band. For me it’s all about the songs rather than a specific sound. We tried not to build our sound around a gimmick or necessary trendy arrangement, but let the songs speak for themselves.</span></span></p>\n<p lang=\"en-US\"><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\">ES- To be honest we’ve always just kind of played what we want to play because that’s what we like, so I didn’t really think about it. But I guess what we create is something quite traditional in a sense, so I didn’t think it’d really ever seem dated or unpopular- But no, I didn’t quite envisage banjos being heard on prime time radio 1 now either!</span></span></p>\n<p><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\">JW – Everything becomes popular at some point. Just as fashion works its way back round in a loop, I think music does the same, particularly when concerning mainstream pop. Im glad that some great musicians are getting acknowledgement now, and this kind of music might help educate the masses on what is actually out there to be found.</span></span></p>\n<p><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\">AC- Commercial success wasn’t something I thought about when I started playing with Ellen and the guys. We were good friends and I just enjoyed developing the songs and spending time together. It’s lucky that this kind of music has taken off as it has though, we seem to have stepped up just at the right time to make the most of it.</span></span></p>\n<p><strong><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\">CitR: Reading through reams of reviews about you it is almost impossible to find any that even hint at being negative, have you found this apparent endless praise a massive plus for you or are you aware that new releases and performances have to match and even surpass this?</span></span></strong></p>\n<p><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\">CQ- I’d be lieing if I said that the praise we have been getting hasn’t had a positive impact. But it does add a certain level of pressure to keep delivering. Its good to have something to keep you focused. We still feel like we are starting down the road ahead rather than at the finishing posts. I’m quite self-critical and a perfectionist so I’m always finding things that I want to improve on.</span></span></p>\n<p lang=\"en-US\"><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\">ES- Ha, I dunno, there’s always going to be some people that like what we do and some that don’t. Pressures are always higher when you’re in the spotlight, but it makes you work harder and maybe that’s a good thing. I try not to think about it too much though…</span></span></p>\n<p> <span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\">JW – These kinds of things certainly don’t go to our head. Of course they are reassuring and help to justify why it is we do what we do. I definitely think we push ourselves all of the time, performance wise, and on recordings, and we will continue to do that.</span></span></p>\n<p><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\">AC- We definitely don’t offend anyone do we! That’s been brought up in some reviews, apparently we’re too polite ha. I think it’s easy to get hung up on what’s expected of us etc. but we’ve got to where we are now by just doing what comes naturally and it seems to be working. The more we write and play together the more our music will evolve so as long as we keep doing that consistently we should be fine. I’d much rather have good reviews than bad ones!</span></span></p>\n<p lang=\"en-US\"><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\">JS – You haven’t found any negative reviews? Haha! Well, I’ll go with that! I think we’re our own biggest critics so usually we’ll know if something hasn’t lived up to its full potential.</span></span></p>\n<p><strong><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\">CitR: How do you intend to get your name out to a wider audience in the future? Do you have any intentions of coming to Scotland in the future for example?</span></span></strong></p>\n<p><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\">CQ- I’d like to ideally play anywhere in the world that will have us. So Scotland’s certainly on the list! Up to this point we have been gaining fans through festival performances and radio play. Its great to be known through live performances as those fans really stick with you. Our UK tour in October and November will be a great chance for us to really get around England and make some more fans and friends.</span></span></p>\n<p><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\">ES-</span></span><strong><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\"> </span></span></strong><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\">We’d love to come</span></span><strong><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\"> </span></span></strong><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\">to Scotland! The plan is to try and gig as much as possible I think. And if nothing else comes of all this, then at least we’ll have visited a few new places!</span></span></p>\n<p><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\">JW – We want to tour as many places as possible, and Scotland is definitely on future horizons. I think good old fashioned touring is the best way to build a fan base, and allows you to communicate directly with your audience. It’s great being able to chat to people after gigs.</span></span></p>\n<p><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\">AC- Well our EP is being released in October so that will be available on all formats. We’ll be promoting that as much as we can by touring and doing radio sessions…all our dates are booked for this year but next year I’m sure we’ll be heading north to Scotland. We’ve thought about coming up already but it’s going to have to wait until after Christmas now.</span></span></p>\n<p lang=\"en-US\"><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\">JS – We’re slowly making our way around. We’ve recently signed with CODA (that’s our booking agent) and they’ve been getting us some great gigs across the country. Hopefully we’ll be able make our way up there in the near future.</span></span></p>\n<p><strong><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\">CitR: Bob Dylan is obviously a big influence on the band and it shows with the lyrics and style your band portrays, what is your favourite Bob Dylan song if you had to pick one?</span></span></strong></p>\n<p><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\">CQ- For me it would have to be ‘don’t think twice its alright’. Chokes me up every times I listen to it.</span></span></p>\n<p lang=\"en-US\"><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\">ES- I always answer this question differently I think- it depends on my mood you see… right now it’d have to be “It’s All Over Now, Baby Blue.” I love that scene on the “Don’t Look Back” documentary, you know where Donovan plays Bob a song called “To Sing For You”? Which is a stunning song that I love… but then Bob just comes out with “It’s All Over Now, Baby Blue” and totally blows him away. He’s a gem.</span></span></p>\n<p><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\">JW – Honestly not a big fan so im going to go with a generic one and say Subterranean Homesick Blues.</span></span></p>\n<p><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\">AC- To be honest I’m not a massive fan of Bob myself but I do like his style of writing and I think he’s had a big influence over some of my favourite artists, so therefore me as well and I respect him a lot. My favourite song would have to be ‘The Times They Are A-Changin’.</span></span></p>\n<p lang=\"en-US\"><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\">JS – I like the song “Isis”. I guess it’s just an interesting story about a young man who leaves home to go on an adventure.</span></span></p>\n<p><strong><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\">CitR: You met as a group of students and started very recently compared with other bands. How did you guys meet at college/university, was it through a music society, friends or otherwise?</span></span></strong></p>\n<p><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\">CQ- We all spent many long hour waiting around in the college bar for the next lecture to start. That’s where the friendships of the band first started. Me Jeff, James and Andy did some playing together as part of our music course for a year, so when I had started playing with Ellen they were the only guys it had to be.</span></span></p>\n<p lang=\"en-US\"><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\">ES- Yeah, we met at college. Pretty lucky really, because I randomly ended up just joining the second year of their course… it worked out well 🙂</span></span></p>\n<p><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\">JW – We were all studying pop music together and so became friends that way. A lot of us ended up playing together in ensembles there as well, so we had our friendships as well as musical bonds.</span></span></p>\n<p><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\">AC- We all met at college, most likely in the bar. Some of us played music together while we were there but it wasn’t until Ellen had been to university for a year that we started playing together as a band. It’s a good thing we stayed in touch after we left thinking about it…</span></span></p>\n<p><strong><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\">CitR: Where would you like to see yourselves in 3 years time?</span></span></strong></p>\n<p><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\">CQ- If in 3 years I can be making music that still connects with people I will be very happy.</span></span></p>\n<p lang=\"en-US\"><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\">ES- In 3 years time we might actually have some money and a van… that’d be nice haha.</span></span></p>\n<p><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\">JW – Id like to think we would be in the studio working on a second album after touring with a successful first album. Being able to support ourselves from it would be great.</span></span></p>\n<p><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\">AC- I’d like to be 3 years younger but that might be asking a lot. I’d like to be able to support myself fully from playing music so I can stop worrying about how I’m going to pay my rent. I’d also like to have seen more of the world by then. Most of my friends have been travelling at some point after they finished school but I’ve always put that aside to focus on music so I’d be happy if we could record future albums and then visit some interesting places during the tours.</span></span></p>\n<p> <span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\">JS – On T.V. Haha!</span></span></p>\n<p><strong><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\">CitR: Who are the best band/artist you have supported in the past and the best that have supported you?</span></span></strong></p>\n<p><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\">CQ- My favourite would be Paolo Nutini , Toots and the Maytals, Stornoway and first aid kit.   We have had some amazing gigs playing with the traveling band. Gary Stewart, Flowe ( Paul Thomas Saunders old band) and Harper Simon.</span></span></p>\n<p lang=\"en-US\"><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\">ES- Ahhh, there’s been loads. We recently played a gig with Paolo Nutini and Stornoway, both of whom sounded amazing. We also fairly recently were on the same bill as Harper Simon and The Blockheads- their sax player was playing 2 saxophones at once at one point! But we’ve had some great supports too: Sam Airey, Gary Stewart… I could be here forever.</span></span></p>\n<p><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\">JW-We have been very lucky to play with some great acts. Recently we were supporting Stornaway and Paolo Nutini. That was pretty unbelievable. All great guys as well. We have the Travelling Band from Manchester supporting us for our EP launch in Leeds which will be cool. They’re a great live band.</span></span></p>\n<p lang=\"en-US\"><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\">AC- We didn’t technically support him but we played the same stage as Jackson Browne at Glastonbury and got to watch him from the side of stage where we had a perfect view, it was really memorable. My favourite support act would be either Rosie Doonan from our hometown of Leeds who is very talented…or Itchy from Japan who we played with back in July. It was the most entertaining half an hour of my life watching Itchy. Think stilts, table tennis bats, typewriter songs, steel drums filled with water…was a very hard act to follow!</span></span></p>\n<p lang=\"en-US\"><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\">JS – Hmmm… I really enjoyed supporting “Alessi’s Ark”. Her voice is beautiful and she is absolutely amazing live. Some of the stuff she comes out with between songs is hilarious.</span></span></p>\n<p><strong><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\">CitR: If you could have any superpower what would it be?</span></span></strong></p>\n<p><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\">CQ- Teleportation. It would revolutionize gig transport forever, we probably spend more time on the M1 in a van than we do much else when a gig is concerned. You could play up to 3 gigs a night in different cities. Touring would never be the same again…</span></span></p>\n<p><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\">ES- Haha, errr I told myself I’d write down the first thing that came in to my head for this question… and for some reason I thought it might be cool to be able to turn things to sponge?! You know if you were about to fall, or someone wanted to throw something at you? You can’t really hurt anyone with sponge, I don’t think. I’m sure there will be a flaw in this- I haven’t thought it through much.</span></span></p>\n<p lang=\"en-US\"><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\">JW – I liked that kid on the series Heroes who could work computers just by touching them ie. He could get cash out of a machine without a card, and reschedule flights, or change the lights to green. Reckon that could all come in handy. Teleportation would be great though. Especially at the moment since it’s a right arse to get to gigs without a van.</span></span></p>\n<p><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\">AC- I’m going to have to be boring and say to fly. I’d love to be able to fly up and fall asleep in the clouds. I’ve been in a hot air balloon before and it was so quiet, almost absolute silence it was unreal. I’d probably get hit by a plane though, that wouldn’t be so peaceful…</span></span></p>\n<p lang=\"en-US\"><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\">JS – I’d love to be able to loop time like in “Groundhog Day” with Bill Murray. That way I could repeat things until I got them right. I would also be super productive and get a lot more done with my day.</span></span></p>\n<p><strong><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\">CitR: What is the most embarrassing moment you have ever had on stage?</span></span></strong></p>\n<p lang=\"en-US\"><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\">CQ- Looking back it is probably when I attempting to sing and play ‘she’s the one’ by Robbie Williams when I was 13 in a school talent concert by myself. At the time and in context it went well. But when someone digs out a video of it, I have to go and hide, its unbearable. If I remember correctly the winners were some Michael Jackson moon walk dancers, but they were amazing.</span></span></p>\n<p lang=\"en-US\"><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\">ES- Ha, there have been many occasions where I’ve put my capo on the wrong fret and started playing songs in the wrong key or forgotten words… But what I’d rather tell you about is how Chris once got really drunk and flung his foot up on top of his keyboard during a gig- that was quite embarrassing. We recently had a stage invader too, she just danced next to Jeff for a while before being removed. I don’t think anything reeeaalllly embarrassing has happened, not yet anyway!</span></span></p>\n<p lang=\"en-US\"><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\">JW- I’m going to be boring and say I’ve been lucky. Don’t think anything too bad has happened. I’ve been embarrassed by other peoples antics. Drunken Chris with a leg up on his keyboard was a good one.</span></span></p>\n<p><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\">AC- Maybe when we played in this expensive bar in Switzerland…the stage was surrounded by walls of ridiculously expensive bottles of champagnes, wines and spirits, quite a lot of it within elbow reach! Luckily none of us did the obvious but I did somehow manage to get part of the chandelier wrapped around the end of my bass. The barmaid came and took it from me, which is a shame. I would have liked it as a souvenir.</span></span></p>\n<p lang=\"en-US\"><span style=\"font-family: Arial, sans-serif;\"><span style=\"font-size: small;\">JS – Luckily we haven’t had anything too bad happen to us. I think the most embarrassing moment for me was starting a song in the wrong key, realizing, and then changing again to the wrong key before figuring out what the heck I was doing. It’s pretty hard to hide your mistakes when you’ve messed up twice within the first 30 sec of a song.</span></span></p>\n<p lang=\"en-US\"><span style=\"font-family: Arial; font-size: small;\"><a href=\"https://www.myspace.com/ellenandtheescapades\">Check out their myspace</a></span></p>\n<p lang=\"en-US\"><span style=\"font-family: Arial; font-size: small;\"><a href=\"https://ellenandtheescapades.com/\">Official Website</a></span></p>\n","slug":"3073-interview-ellen-and-the-escapades","category":"interviews","date":1286451839000,"wpid":3073,"isSticky":false,"featured_image":{"width":165,"height":248,"src":"2010/10/pilton-2010-2nd-165x248.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAQAAoDASIAAhEBAxEB/8QAFwAAAwEAAAAAAAAAAAAAAAAAAAQFBv/EACIQAAIBAgYDAQAAAAAAAAAAAAECAwQSAAUREyExBhRRYf/EABUBAQEAAAAAAAAAAAAAAAAAAAMF/8QAGREBAQADAQAAAAAAAAAAAAAAAQIAAxLh/9oADAMBAAIRAxEAPwDAV89JlYekeCeXNJqdBBPFNtxwNcQ7EA8gqSMJrD4soCn2m04uWQ6H9HHWIr51CtRVWokbT0+2wIuscsbtDp8J6wR+VZnEixwTBYUAVF2V4UdDr5iHOlkAxb2jXXuf/9k="},"createdAt":1587294943932,"updatedAt":1588403563319,"author":"5e9b68b27a1236eccfeb1d07","old_image":"2010/10/pilton-2010-2nd-165x248.jpg","categories":["interviews","music","reviews"]}