{"id":"5e9bff1a774c2610387e4406","title":"Feature: The BBC 6 Music Festival Line-Up is Problematic","content":"<p>Being from the North East, and being so heavily invested in music, particular that of an ’emerging’ nature, can occasionally be a frustrating experience.</p><p> Fewer and fewer artists deem Newcastle and the surrounding area as worthy of stopping off at on UK tours. Unless they’re arena fillers, they’re likely to favour the south of England, or indeed skip the North East entirely and head straight for Glasgow. It was partly this grievance that fuelled my delight when I found out that the BBC’s 6Music Festival 2015 would be happening in Tyneside, only its second appearance, having been colossally successful in Manchester last year.</p>\n<p>Even upon finding out the full line-up, my initial elation carried on for a few hours afterwards – the likes of festival favourites The War on Drugs, the newly reformed Sleater Kinney and the recently Mercury nominated Kate Tempest seemed like a unmissable billing. Yet there was something about the line-up that seemed rather off, and in truth it took me to thinking back to an article from <a href=\"https://www.slate.com/blogs/browbeat/2015/01/09/coachella_2015_lineup_this_year_s_brochella_festival_isn_t_any_better_for.html\" target=\"_blank\">Slate</a> a couple of weeks back for me to make the connection; an undeniable and embarrassingly obvious dominance of male performers.</p>\n<p>Sitting down earlier today and going through the entire line-up, revealed the sheer scale of the imbalance. By my estimations, there will be a staggering 110 male performers at the BBC 6Music Festival 2015, compared to 14 female performers, being out numbered almost eight to one.</p>\n<p>Just let that sink in for a second.</p>\n<p>If your initial reaction is along the lines of ‘well, a greater proportion of popular musicians are male’, essentially attempting to contend the supply and demand argument, then you are, I’m afraid, entirely missing the point. Several weeks back, I posted on <a href=\"https://www.facebook.com/crackintheroad/photos/pb.114090381951328.-2207520000.1422718358./1012807152079642/?type=1&theater\" target=\"_blank\">Facebook</a> the image taken from Slate of the Coachella line-up made up only of female fronted acts, and the several comments it did receive were horrifically worrying. Suggesting that <em>‘it’s just the way the industry is’</em> verges upon ignorant, and completely dismissive of any agency within society to aid the opportunities offered to individuals. Again, I reiterate, this is not a question of ‘will these acts sells tickets’, it runs far far deeper than that.</p>\n<p>Let us remember for a second that this is not your average ‘cram them in, booze them up, rake in the money’ 21st century music festival, which sadly seem to have become standard procedure (this sort of imbalance still wouldn’t be excusable even if it was). This is a festival organised and supported by the BBC, a corporation that most likely, YOU support; there are just as many female tax payers as there are male however as mentioned earlier, this is invariably beside the point. For them to be supporting and corroborating on this primitive concept that male performers are inherently favoured, goes beyond being disappointing. It’s quite frankly offensive.</p>\n<p>Is this really the sort of message we want to send to women? That your chances of being stood up on that stage are stacked almost 80% against you, when compared to the men around you?</p>\n<p>For a institution like the BBC to support this is immensely discouraging. One would hope that given that they presumably have fewer immediate financial concerns than your average music event, they’d deem it worthy to take some form of stand against this underlying sexism. At no point am I suggesting implementation of splits that must exist on festival line-ups, more that this continually repetitive structure is stopped being treated as the norm. I’m not even intending to hint at a boycott of these events, however to not identify, discuss and attempt to tackle these issues is failing a significant proportion of our society.</p>\n<p>And yes, it is indicative across all avenues of music. Not a single female artist features amongst the nominees for Best British Album at the Brit Awards this year, whilst the Best Group category sees 17 men nominated, compared to 1 woman (Grace Chatto, Clean Bandit). Despite often being heralded for its diversity, a <a href=\"https://infogr.am/The-history-of-headline-acts-of-Glastonbury\" target=\"_blank\">study prior</a> to 2010 found that male Glastonbury headliners outnumber women almost 20:1 (78 vs 4).</p>\n<p>So what does lie at the core? Well, it’s impossible to pin point it to a singular specific element. Too many people (read, men) are still dismissive of the music tastes of young women, and this is replicated within the dominance of men within music journalism, broadcasting, production and performance. Bjork’s recent <a href=\"https://pitchfork.com/features/interviews/9582-the-invisible-woman-a-conversation-with-bjork/\" target=\"_blank\">Pitchfork</a> interview sheds some slight on these issues.</p>\n<p>Whilst there have been positive steps taken in recent years to address this disproportion, we’re clearly still a long way off. What strikes me as a recurring theme is the refusal of festival organisers, venue bookers and promoters to bear any form of responsibility whatsoever. We cannot continue passing the buck, it’s a self-fulfilling circle that we need to break from. It’s not an issue that will change over night, it takes a concerted effort at both ends; in the grassroots stage of encouraging participation within music, and at the other end of the spectrum – showcasing female performers on the biggest stages, in front of the largest audiences.</p>\n<p>This isn’t intended purely as a slight at 6Music, and I don’t mean to do disservice to their efforts in recent years, doing a brilliant job in bringing more women to the airwaves both in the form of presenters and performers (their Christmas special ‘<a href=\"https://www.bbc.co.uk/mediacentre/latestnews/2014-6-music-christmas\" target=\"_blank\">Three Wise Women</a>‘ stands out), hence my surprise and dismay at this billing. It’s more a call to not simply consume, but to question, particularly in instances relating to public ownership and portrayal.</p>\n<p>My thoughts are perhaps incoherent, and it’s certainly time that I stopped writing and took a backseat. We’ve silenced women within music for far too long, it’s time to level the platforms.</p>\n","slug":"30778-feature-bbc-6-music-festival-line-problematic","category":"music","date":1422718796000,"wpid":30778,"isSticky":false,"featured_image":{"width":2095,"height":1283,"src":"2015/01/sk1.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAGAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAMH/8QAHhAAAQQCAwEAAAAAAAAAAAAAAQIDBAUAEQYSIVH/xAAUAQEAAAAAAAAAAAAAAAAAAAAD/8QAFxEAAwEAAAAAAAAAAAAAAAAAAQIRAP/aAAwDAQACEQMRAD8AyLh18i05FXVsiIyiGpbbKy2gBZHb0/Nnet/Mvcu1MS3nRm1Twhl9xtI6NnwKIGMYLookGZGJt3//2Q=="},"createdAt":1587281690808,"updatedAt":1588403511558,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2015/01/sk1.jpg","categories":["music"]}