{"id":"5e9c34739b6559241525e21f","title":"5 Minutes With: A Place To Bury Strangers","content":"<p style=\"text-align: center;\">\n<div class=\"mceTemp\">\n<div></div>\n</div>\n<p>Last year saw the start of a shoegaze revival, heralded by some as the beginning of the “nugaze” movment.</p><p> Whilst the music is yet to reach the dizzying greatness achieved from the late 80s to the early 90s, there has been a surge in the quality of bands taking influence from that period. At the forefront of this revival have been New York based noise rock group A Place To Bury Strangers, who released their self titled debut in 2007, whilst last year saw their sophomore record receiving well earned praise from all corners of the music industry. Listening to APTBS music, it is clear to see why <strong>Trent Reznor </strong>hand picked them to support <strong>Nine Inch Nails </strong>back in 2008. There is a real raw energy and vibrancy which resonates from their music, reembodying the spirit of shoegaze, which hasn’t been seen since the likes of My Bloody Valentine, The Jesus And Mary Chain and Ride. Whilst both their LPs so far have been well received, it is the bands live performances which really get the critics excited. <strong>APTBS</strong> recently released <em>Ego Deat</em><em>h</em> as the third single from last years fantastic <strong>Exploding Head, </strong>which is available to purchase from the links below.</p>\n<p style=\"text-align: center;\"><a href=\"https://www.aplacetoburystrangers.com/\">Official Site</a></p>\n<p style=\"text-align: center;\"><a href=\"https://www.myspace.com/aplacetoburystrangers\">Listen on myspace</a></p>\n<p style=\"text-align: center;\">Oliver from A Place To Bury Strangers generously offered to answer some questions for us.</p>\n<p style=\"text-align: center;\"><em>CITR</em>: If you had to cite one band/artist as a major influence upon you, who<br />\nwould it be?</p>\n<p style=\"text-align: center;\"><strong>I guess I would have to say Lightning Bolt, I used to go see them a<br />\nlot when I lived in Providence and they were always amazing and heavy<br />\nas fuck.</strong></p>\n<p style=\"text-align: center;\"><em>CITR:</em> What has been your favourite gigging experience to date?</p>\n<p style=\"text-align: center;\"><strong>I guess it would be SXSW when we played 9 shows in 3 days, it was just<br />\nreally crazy to play all of those shows in a row, we were scrambling<br />\nfrom show to show so fast it was non stop rock and roll.</strong></p>\n<p style=\"text-align: center;\"><em>CITR: </em>Your sound seems to reminisce back to 80s drone and early 90s<br />\nshoegaze, would you say that is true? And were there any bands in<br />\nparticular who influenced you?</p>\n<p style=\"text-align: center;\"><strong>Sure, when I first started playing guitar I was a huge fan of bands<br />\nlike the Cocteau Twins, Ride, The Cure, The Jesus and Mary Chain,<br />\nHeaven Piano Co., My Bloody Valentine, Slowdive, Chapterhouse, you<br />\nname it I was seeking out these bands.</strong></p>\n<p style=\"text-align: center;\"><em>CITR: </em>Do you have plans for any further releases in 2010?</p>\n<p style=\"text-align: center;\"><strong>We just released an Ego Death Tour EP to accompany the tours we are<br />\ndoing this year and will probably release another something like that<br />\nfor the later half of the year.</strong></p>\n<p style=\"text-align: center;\">Thanks very much to Steven for getting the questions answered, and credit goes to Andrew Youssef for the fantastic photograph.</p>\n","slug":"308-5-minutes-with-a-place-to-bury-strangers","category":"interviews","date":1271603517000,"wpid":308,"isSticky":false,"featured_image":{"width":640,"height":425,"src":"2010/04/a_place_to_bury_strangers-el_rey_theater0901.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAUH/8QAHxAAAgIDAAIDAAAAAAAAAAAAAQIDBAAFERYxIVFh/8QAFQEBAQAAAAAAAAAAAAAAAAAAAgP/xAAXEQADAQAAAAAAAAAAAAAAAAAAAREC/9oADAMBAAIRAxEAPwCB49Ur6RdfsrQXaQV69qSGMsQkDqGHCF4Sege/R+8zc0aKnjbeVSPgqIWIH5jGOsm8KH//2Q=="},"createdAt":1587295347901,"updatedAt":1588403568887,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2010/04/a_place_to_bury_strangers-el_rey_theater0901.jpg","categories":["interviews","music"]}