{"id":"5e9bfee9774c2610387e4390","title":"Feature: Where Are All The Women?","content":"<p>A couple of days ago I edited the Reading / Leeds Festival line-up, removing the acts that only feature male performers.</p><p> Nine were left. Listed, for clarity: Marmozets (Main Stage), Wolf Alice (NME / Radio 1 Stage), Hannah Wants, Cardiknox (Dance Stage), Alvvays, Little May, San Fermin, Walking on Cars (Festival Republic), Azealia Banks (BBC 1xtra Stage).</p>\n<p>Within minutes the image spread across the internet, shared thousands of times. Several hours later the story was featured on Buzzfeed, The Guardian and The Telegraph, mentioned on BBC Radio 1 and other prominent news outlets. Yet a question was raised time and time again, usually by men commenting on the image: what was I attempting to achieve?</p>\n<p>Inspired by a <a href=\"https://www.slate.com/blogs/browbeat/2015/01/09/coachella_2015_lineup_this_year_s_brochella_festival_isn_t_any_better_for.html\">Slate</a> article on the male-heavy Coachella line-up, the hope was that in viewing the image people would draw their own conclusions. The aim wasn’t to point the finger solely at Reading & Leeds Festival, but to highlight the gross inequalities that still exist within a backwards music industry, and this seemed as good a representation as any.</p>\n<div id=\"attachment_33230\" style=\"width: 1200px\" class=\"wp-caption alignnone\"><img aria-describedby=\"caption-attachment-33230\" class=\"wp-image-33230 size-full\" src=\"https://api.crackintheroad.com/uploads/2015/02/Untitled.png\" width=\"1190\" height=\"992\" srcset=\"https://api.crackintheroad.com/images/2015/02/Untitled.png 1190w, https://api.crackintheroad.com/images/2015/02/Untitled-300x250.png 300w, https://api.crackintheroad.com/images/2015/02/Untitled-768x640.png 768w, https://api.crackintheroad.com/images/2015/02/Untitled-1024x854.png 1024w, https://api.crackintheroad.com/images/2015/02/Untitled-50x42.png 50w\" sizes=\"(max-width: 1190px) 100vw, 1190px\" /><p id=\"caption-attachment-33230\" class=\"wp-caption-text\">Only 9 acts on the lineup featured at least one female performer.</p></div>\n<p>As the image spread the responses were, for the most part, encouraging – people questioning just why such line-ups have become the norm at popular music festivals. However there were many negative comments, almost always from men saying ‘what is the point / so what / who cares’. What are these men arguing for? Who are they trying to help? Their inability to differentiate their situation from the struggles of others leads to a denial of the issues at hand. They go out of their way to say how ‘annoying’ or ‘pointless’ such discussions are: it isn’t annoying or pointless for the people who aren’t represented.</p>\n<p>In light of that, I felt inclined to combat a few of the issues raised time and time again across the past forty eight hours. Hell, if you can’t be bothered to read on, then view the image again, with these four words in mind: opportunity, visibility, representation and participation.</p>\n<p><b>‘Will these acts sell tickets?’</b></p>\n<p>Yes, festivals book acts based on who they believe will sell tickets, but if the only people who they believe will sell tickets are male acts then there is a problem. It is in part up to them to change this problem by promoting and booking the many, many brilliant non-male acts out there. If they don’t, it gives room to the lie that only men make good music.</p>\n<p><b>‘This isn’t Reading and Leeds’ fault’</b></p>\n<p>This was never a question of accusing Reading & Leeds. The problem reaches beyond one festival, but one of the UK’s biggest music festivals has an enormous opportunity to address this imbalance.</p>\n<blockquote class=\"twitter-tweet\" data-width=\"500\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">@WLLMRRY SO MUCH REPRESSION,haha but seriously,all this need for fucking equality in everything does my head in, the nature of rock is male</p>\n<p>&mdash; Robert (@RobertAustin96) <a href=\"https://twitter.com/RobertAustin96/status/570552926617403392?ref_src=twsrc%5Etfw\">February 25, 2015</a></p></blockquote>\n<p><script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></p>\n<p>Too many people have claimed ‘the nature of rock is male’. People said the same about voting and politics once. ‘Female artists’ should NOT be a genre, just as ‘Male’ is NOT a genre. Men are NOT predisposed to creating better music, let alone just those that fit in with the R&L climate. Things are this inequal because we have allowed them to be; by the same merit, we can alter them.</p>\n<p><b>‘This just represents current trends.’<br />\n</b>This isn’t true. But if it were, the response would be ‘Make new trends’.</p>\n<p><b>‘These acts are shit. Women are shit at making music.’<br />\n</b>The link between these two phrases would NEVER be made with men. You don’t like The Libertines? Fine, but you would never take that to mean that men CAN’T make good music. Listen to more music made by women – you will find something you like VERY quickly.</p>\n<p><b>‘Are you suggesting that we enforce quotas?’<br />\n</b>Equal rights in theory but not practice are no use. We have not ‘solved’ the problem of gender inequality through passing laws alone; there needs to be a discussion about opportunities, access and visibility to bring about true equality. At no point have I recommended quotas for music festivals – so much of the unique identity for each event is down to the acts that are booked. Right now Reading & Leeds Festival has an identity that almost completely excludes women. I hope that bookers will be forward thinking and attempt to be progressive when compiling their line-ups. With so many artists coming from the same agencies, usually in deals that involve several acts, we must consider the role of the booking agent in these discussions. Positive action should come from all quarters.</p>\n<blockquote class=\"twitter-tweet\" data-width=\"500\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">the lack of female artists on the reading/leeds lineup isn't to do with bad booking, just not enough female artists out there atm</p>\n<p>&mdash; reece (@_reececw) <a href=\"https://twitter.com/_reececw/status/570661174792097792?ref_src=twsrc%5Etfw\">February 25, 2015</a></p></blockquote>\n<p><script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></p>\n<p>If there is a lack of female artists, we need to encourage more. Instead Reading & Leeds are happy to maintain the status quo that they believe keeps them in business. Last year, though, Leeds didn’t sell out and Reading sold far slower than usual. Customers are tired of the same old stuff. Is music the progressive business that some think? This is the industry that reacted to the internet by suing the pants off their consumer base, instead of altering methods of release and consumption.</p>\n<p><b>‘This is a cyclical pattern. There will be more women next year’<br />\n</b>No it isn’t. There will be more men playing the Reading and Leeds main stages this year than there have been women since Leeds festival began, SIXTEEN years ago. This pattern has repeated across modern music festivals since they began. Which was the year with a lack of male performers? Festivals are continually happy to bring the male has-beens (sometimes never-beens) out of the woodwork for <del datetime=\"2015-02-26T18:43:05+00:00\">one</del> <del datetime=\"2015-02-26T19:17:19+00:00\">two</del> three final victory laps, yet when it comes to building for the future, are far less proactive.</p>\n<blockquote class=\"twitter-tweet\" data-width=\"500\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">Can we remember that Paramore have headlined Reading and Leeds so they're probably not sexist</p>\n<p>&mdash; Kyle (@RealStoweG) <a href=\"https://twitter.com/RealStoweG/status/570732137462284289?ref_src=twsrc%5Etfw\">February 25, 2015</a></p></blockquote>\n<p><script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></p>\n<p>It’s fantastic that we’ve seen women taking up higher slots on festival bills over the past decade. However if you cannot see how colossally underrepresented women are across ALL cultural spheres, then you need at the very least your eyes tested. The number of men acting as if women should be grateful for allowing them access to their cultural boys club is shocking. Don’t give yourself a congratulatory pat on the back then forget all about it. There still isn’t a single music genre where women are a dominant force, or ever have been. Take pop music as an example; at last night’s Brit Awards, not a single woman was nominated in the Best Album Category. Oh, and neither was there last year.</p>\n<p><b>‘There are far more important issues within feminism’<br />\n</b>Feminism isn’t a list of causes to be ticked off. It is about ensuring women have the same space to represent themselves as men. They are being denied that in a very literal sense at music festivals (I’m aware a man’s opinion on ‘what is feminism’ is far from the most important one: we need to listen to women). We should all combat inequality wherever we are able to; this is a big problem, but one that is accessible.</p>\n<p>Comments made only last month by Melvin Benn (Festival Republic CEO) made the line-up even more disappointing:<br />\n<span style=\"color: #444444;\">“The idea that female bands are sidelined as a suggestion is just not there. The truth is that there has been an historic lack of opportunity for young women to get into bands and to be in bands, and I think that has disappeared now.” </span></p>\n<p>To so actively stand against these issues in words, yet to not follow through with actions is hugely concerning.</p>\n<p>“I don’t think there’s any young women thinking of joining a band now that think, ‘There’s no point, because I’m going to be sidelined’. I don’t think sidelining exists, but there was certainly lack of opportunity.” Why, then, have women been sidelined at one of Festival Republic’s flagship events?</p>\n<p>So what does it all boil down to? A month ago I wrote a piece on the heavily male-dominated BBC 6 Music Festival line-up, calling for those within the music industry to stop this continual passing of the buck. Mainstream media refuse to move from the status quo claiming public demand. Booking agents don’t pick up acts as they don’t have the representation within mainstream media. Festivals aren’t offered female acts / don’t see the media profile that they believe justifies the sale of tickets, so these acts don’t receive the biggest platforms on which to promote their art. The circle continues, with each blaming the other. The result of all this? Women don’t get to play.</p>\n<p>Regarding the media outlets who picked up on the adapted poster; great, the more people who see it the better. The coverage was not from all areas though. Several NME writers responded to the image on Twitter, but whilst their website managed to get a picture of Kanye on a Nandos table, they couldn’t find fifteen minutes to run a story pertaining to female representation IN THE INDUSTRY ON WHICH THEY REPORT. What do the women who read NME think about this story being ignored?</p>\n<p>As with the BBC 6 Music Festival, it’s disappointing to see BBC actively supporting a line-up where their taxpaying base is so hugely underrepresented. To other large media outlets who have refrained from reporting (perhaps due to financial / sponsorship links that exist between themselves and Festival Republic) I would say: to stay silent on these issues merely allows the status quo to continue, and nothing changes.</p>\n<p>For a major festival, attended by thousands of women every year, to fail to represent 50% of the population, to consider them not important enough to promote through music, is damningly disappointing.</p>\n<p>So what should we expect Reading & Leeds to do, if anything? A comment would be nice. Millions have seen this story and there is an undeniable interest amongst the public: are the organisers listening? I hope they’re working behind the scenes, ensuring that when the next bundle of artists are announced, there is evidence that they’re trying to counter this inequality on board.</p>\n<p>Words will only take us so far though; many, including myself, have said enough. It is actions that will make the true difference. It’s time for change.</p>\n","slug":"30998-where-are-the-women","category":"music","date":1424969764000,"wpid":30998,"isSticky":false,"featured_image":{"width":100,"height":100,"src":"2015/02/reading-100x100.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAAAwj/xAAiEAEAAQMCBwEAAAAAAAAAAAABAgARIQQTAwUSMUFSkXH/xAAVAQEBAAAAAAAAAAAAAAAAAAAAAf/EABQRAQAAAAAAAAAAAAAAAAAAAAD/2gAMAwEAAhEDEQA/AKU4b16e04EWPkcCYw2KUS3d+0fMAjp7xAd2OT9o9yfvL7RH/9k="},"createdAt":1587281641444,"updatedAt":1588403510497,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2015/02/reading-100x100.jpg","categories":["music"]}