{"id":"5e9c32da9b6559241525df85","artists":["5e9b69117a1236eccfeb2204"],"title":"Review: Kings Of Leon – Come Around Sundown","content":"<p><img class=\"alignnone\" title=\"KOL\" src=\"https://2009.</p><p>rockwerchter.be/_Resources/media_livenation_co_uk/fido/publishing/artiste/g/g/l/730x362_Kings_Of_Leon.jpg\" alt=\"\" width=\"730\" height=\"362\" />There is little left to be said about<strong> Kings Of Leon</strong>, they’ve had their highs; most notably 2007’s <em>Because Of The Times</em>, one of the finest records released in the first decade of this new millennium, however they haven’t been without their lows as well. From battling with paralyzing drug addictions and a fourth album that came close to destroying all their hard work put in previously, they’ve had tough times. With third album <em>Because Of The Times</em>, the Tennessee rockers finally seemed to be fulfilling their rarely reached potential, an LP of storming tracks that translated perfectly into an electric and engrossing live performance. Yet <em>Only By The Night</em> found the group in disarray, caught somewhere between impersonating <em>U2</em> and attempting to fashion their own brand of emotional, singalong stadium pop. Albeit their most commercially successful album to date, lead by number one single<em> Sex On Fire</em>, their was a real feeling of disillusionment.</p>\n<p>So it was tentatively that I gave<strong> Kings Of Leon’s</strong> new record,<em> Come Around Sundown</em> a listen, would they produce a reinvigorated fifth record, or would they continue producing the sort of mundane sludge that shot them to such unrewarded dizzy heights? First single <em>Radioactive</em> sees the foursome vying to return to 2007’s record, a vivacious guitar riff struts arrogantly through the entire track, backed by Caleb’s rasping vocals. Better than almost anything featured on the limp <em>Only By The Night</em>, the foursome have seemingly realized that they have never been, and never will be strong lyrically, and instead are playing to their strengths of writing relentless and appealing hooks.</p>\n<p><em>Pyro </em>finds Caleb in a dark, regretful place, lamenting “<em>everything I cherish is slowly dying or is gone</em>“, a far step from hearing him screech “<em>woaah your sex is on fire</em>” for the umpteenth time. Whilst it retains the anthemic feeling found on tracks like<em> Sex On Fire </em>and <em>Use Somebody</em>, it’s much more exciting, yet still not a patch on their most accomplished single to date;<em> Fans</em>. Elsewhere, the almost unlistenable<em> Mary</em> sounds like<strong> Band Of Horses</strong> dying a slow and painful death, sucked of all their emotional desire and aspirations.</p>\n<p>Only four tracks in, and it’s the definition of a mixed bag, although there no moments that come close to touching their career defining album<em> Because Of The Times</em>, the truth is, they’ve done it before, and they’ve done it better. Elsewhere <em>The Immortals</em> is an improvement, it’s the tracks with real drive and raw energy that allow the Kings to shine. Caleb’s intoxicated sounding voice which was always such a central core to the group, was far from utilized on <em>Only By The Night</em>, however with <em>Come Around Sundown</em> they seem to have returned to playing to their strengths.</p>\n<p>Unfortunately for <strong>Kings Of Leon</strong>, they are never going to write and record another album that so perfectly captures the essence of the band and their live performances, as well as <em>Because Of The Times</em> does. <em>Back Down South</em> treads along woefully, sounding like Brandon Flowers at his utmost dry and desperate; <strong>The Killers</strong> at their worst, and everyone knows that not a compliment. Single in the making<em> Birthday</em> is the closest the group come to sounding like their previous record, plodding along seemingly uninterested until the colossal chorus kicks in.</p>\n<p>Commercially I can’t see this, their fifth record, being anywhere near as successful as <em>Only By The Night</em>, the lack of Radio 1 friendly tracks and club songs see to that, yet the songwriting is far from exemplary. <em>Come Around Sundown</em> has it’s moments, however if you want to appreciate<strong> Kings Of Leon</strong> at their sassiest, sexiest and crudest, then look elsewhere, as even the finer tracks on here feel like watered down versions of more superior songs from previous LPs. Maybe and hopefully, the commercial “failure” of this record might just be exactly what the Followill’s need to re-invigorate their disheartened and fatigued minds.</p>\n<p><script src=\"https://video.unrulymedia.com/wildfire_11244048.js\" type=\"text/javascript\"></script></p>\n","slug":"3104-review-kings-of-leon-come-around-sundown","category":"music","date":1286641216000,"wpid":3104,"isSticky":false,"featured_image":{"width":730,"height":362,"src":"2011/06/730x362_kings_of_leon.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAFAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAIH/8QAIhAAAgECBQUAAAAAAAAAAAAAAgMBABEEBQYSMQchIkFh/8QAFAEBAAAAAAAAAAAAAAAAAAAAAP/EABQRAQAAAAAAAAAAAAAAAAAAAAD/2gAMAwEAAhEDEQA/AMZxvUjUAIMF4xqzBsea2lG4dsjaYv8AL9qpms8xaw2QbBgpktsHxf1xSlB//9k="},"createdAt":1587294938677,"updatedAt":1588403563233,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/06/730x362_kings_of_leon.jpg","categories":["music","reviews"]}