{"id":"5e9c32d39b6559241525df79","artists":["5e9b68f27a1236eccfeb201f"],"title":"Interview: Everything Everything","content":"<p>Following on from our review of <strong>Everything Everything</strong>‘s gig in Newcastle, <strong>Crack In The Road </strong>caught up with <strong>Mike</strong><strong> </strong>from the band.</p><p> In our interview we were lucky enough to have a good friend of mine <strong>Ed Eyre </strong>chipping in some very valuable questions, many thanks are owed to him!</p>\n<p>Don’t forget, you can still win a signed <strong>Everything Everything </strong>album – just visit our <a href=\"https://www.facebook.com/pages/Crack-In-The-Road/114090381951328?ref=ts\" target=\"_blank\">Facebook Page</a>.</p>\n<p><strong>CITR: </strong>Great to see you Mike, especially back in Newcastle! How was your gig at the Deaf Institute in Manchester?</p>\n<p><strong>Mike: </strong>It was really good, especially as Deaf Institute is one of our favourite venues. However we sort of get there and realised it is really small, but in a really nice intimate way. It turned out to be quite a polite gig really, and it sold out really quite quick and I think a lot of people bought tickets after they heard the album and that was really quite good. They obviously knew it and were into it, and were even quite respectful with the slower songs. It was good to play those slower songs in a smaller, quiet room.</p>\n<p>At this point, interviewer extraordinaire <strong>Ed Eyre </strong>chips in.</p>\n<p><strong>CITR: </strong>As you’ve just mentioned, a few of your songs are actually quite slow, and I’ve seen some videos on youtube where there has been a seated audience. How do you manage to achieve that balance of the upbeat and the slower tracks?</p>\n<p><strong>Mike: </strong>It’s a good challenge to have really, especially as on the album there is slower, quieter, more minimal songs, and there are the more rockier tracks. We do have trouble sometimes getting the set list together for a show and tailoring it to the venue and the audience. In fact we’ve just announced we’re doing a whole orchestra thing, where we’re arranging the album to be played with a full blown 14 piece orchestra! It’s happening Christmas time at the RNCM and Union Chapel, and we got the idea after doing something similar last year for a charity thing and thought we would try to extend it. I’m really looking forward to it as the whole process is going to be filmed, including the rehearsals.</p>\n<p><strong>CITR: </strong>That sounds fantastic, I’ll definitely be making it along! Talking about events, how was your performance on the Jools Holland show?</p>\n<p><strong>Mike: </strong>Yeah it was crazy. We were all terrified basically! I think the performance was good, but in reality all you’ve got is five bands lined up and it’s not really like a gig. It’s more like, ‘its you turn to play now!’ and as a result its a bit dry. I’m not complaining, but as I said before all our gigs seem to be slightly different and that didn’t feel like a live gig. It felt more like a showcase, and the thing about TV is that it is so unforgiving that you can’t really get away with ‘ah well the vibe was really good at the time, so it doesn’t matter if there were mistakes’, so everyone is nervous that it is good. So that takes away a bit, but the other side of that is that we hopefully presented the song accurately how it is on the album; its a tricky one. We really enjoyed it though.</p>\n<p><strong>CITR: </strong>Now that you’ve released your debut album through a major label, do you think it has, including the process of making it, manifested itself in the same way you always thought it would? Even when you were a bunch of unsigned dreamers?</p>\n<p><strong>Mike: </strong>Actually, not that much has changed! What we’ve done basically is that before we signed was release little singles through little labels and do little tours or support people. And in essence that’s what we’re doing now, except its on a slightly bigger scale! It’s not like a massive difference, as our day to day lives haven’t changed much from being unsigned to signed. It just means we’re exposed to a few more opportunities, like the Jools Holland show. Though sometimes we do forget we’re a proper band, like this our actual job now!</p>\n<p><strong>CITR: </strong>But with the early tracks making it on to the album, there have been a few tweaks, right?</p>\n<p><strong>Mike: </strong>Yeah we did rerecord Suffragette, Suffragette as the original version didn’t really fit in with the album production wise, so yeah that was a completely new recording. And in regards to my KZ, we’ve just had another mix done of it to spruce it up a little bit. Since the album was released we’ve done another mix of it for a single release for the radio. We’re all quite fidgety as a band and I think some people were attached to the old versions of songs, so we were worried people wouldn’t appreciate the new recordings. However for most people listening to Suffragette, Suffragette, it’ll be the first time they’ve heard it when they listen to it on the album. The thing about our music is that it varies from one song to the next, so we thought if it wasn’t cohesive in terms of production quality then we ran the risk of it being a disjointed mess.</p>\n<p><strong>CITR: </strong>So was the production of the debut album an ongoing process, or did you go into it with a master plan of ‘this is how it’s going to be done’?</p>\n<p><strong>Mike: </strong>I guess it was an ongoing process really. Basically what we did was keep writing songs and playing them at gigs, and the songs we felt didn’t get a good enough reaction or we weren’t happy playing live just fell by the wayside. We sort of ended up with ten songs that had stood the test of time and we wanted them in the album, and we still enjoyed playing them live which is a good test as if you look at a set list and aren’t enthused to play it then it’s probably not a good song. It was quite nice as there are three songs in the album which are quite new, and one of them we just made up in the studio and improvised bits. There were points where we even considered not having Suffragette Suffragette on the album, as we had played it at our very first gig to every gig thereafter! However it is on the album and we’re glad of it! So basically there are the tracks which have been around for yonks and those that we’ve just created spontaneously quite late in the process.</p>\n<p><strong>CITR: </strong>How much of your live performances did you want to incorporate into the songs themselves when they made the album?</p>\n<p><strong>Mike: </strong>We were definitely conscious of some songs having a more live feel, like Qwerty and Photoshop Handsome, however on other tracks we wanted more of that slick, RNB like production sound to them. It sounds awful when I say that! But that sort of production is what I’m talking about. I suppose when it’s live you know what works and what doesn’t work, such as Qwerty Fingers as it took five different versions to get to the version that is on the album now! The best way to chip away at songs is simple to play them live, as we could’ve rehearsed for three years and we would have gotten no where near as focused in terms of the songs as they are on the album.</p>\n<p><strong>CITR: </strong>It’s always good to look back after these three years of development, and I’d be very interested in knowing what you consider your worst gig to have been ..</p>\n<p><strong>Mike: </strong>Cunny’s gig! One of my mate’s, Chris Cunningham, invited us to Liverpool to play for a student election party in a pub that had a PA with two channels and the PA didn’t even work! So we tried to play without microphones and this meant we were shouting songs really, and Cunny would just come on and turn down the amp as we were too loud. I ended up having to play with brushes! Thanks Cunny – ‘Ah come to Liverpool, it’s all students at this gig! Great!’ etc etc!</p>\n<p><strong>CITR: </strong>Haha! Well looking forward, other than the orchestra shenanigans, what else do <strong>Everything Everything </strong>have planned for the near future?</p>\n<p><strong>Mike: </strong>Well we’re always writing new songs and thinking about the next album ..</p>\n<p><strong>CITR: </strong>So soon after your debut release?</p>\n<p><strong>Mike: </strong>Well a lot of the songs on Man Alive have been hanging around for a while, so kind of! It’s always good to just keep playing gigs as otherwise you’d get stale just playing the same set of songs over and over. So we want to introduce new songs to our sets as soon as possible, and in November we’re working on new stuff. John actually is going to his family home to do some demoing and then we’re all getting together and we’ll see how it goes. It’s hard really as its that whole problem of you’ve got fifteen years to write your first record and then such a short amount of time to write the second! We just want the second record to be good and I reckon it’ll be a lot more streamlined. Details to follow I guess!</p>\n<p><strong>CITR: </strong>Have you ever felt like a Rockstar yet?</p>\n<p><strong>Mike: </strong>Erm…No! I mean, there’s moments! Sometimes festivals makes you feel like a bit of a Rockstar as you see lots of people backstage and I think most people, apart from actual famous people, feel a bit like impostors! Oh and our tour of Japan made me feel a bit like a Rockstar, though we were still playing small venues it was just the fact we could go to Japan and people would know our music! I guess that’s one of the best things we do as we get to travel to so many places, even Europe is exciting as we haven’t released anything there and people still come to see us, so you’re left thinking ‘Why?! How?!’ It really does blow our minds as we’re never thinking, ‘yeah, we should be expecting a five thousand fan audience’, so it’s always a pleasant surprise. This tour has been a really nice surprise, just due to the fact people want to leave their front doors and pay to come and see us, and even sometimes sing our songs back to us! We’re all very grateful really.</p>\n<p><strong>CITR: </strong>Cheers for taking the time to talk to us Mike, and we’ll see you soon!</p>\n","slug":"3149-interview-everything-everything-2","category":"interviews","date":1287233433000,"wpid":3149,"isSticky":false,"featured_image":{"width":165,"height":107,"src":"2010/10/everythingeverything3-165x107.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAYH/8QAHxAAAgEEAwEBAAAAAAAAAAAAAQIFAAMEEQYSIRRB/8QAFQEBAQAAAAAAAAAAAAAAAAAAAwT/xAAYEQACAwAAAAAAAAAAAAAAAAAAAQIRIf/aAAwDAQACEQMRAD8AhJWEioaNieT8ijsXJxbhXEvWsd2Gm6jrtCNHSqx2D6fCKzyRb6ZDKv2Iu0lm7dZ0VeihVJJAA14NflKUEHllE8dH/9k="},"createdAt":1587294931579,"updatedAt":1588403563124,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2010/10/everythingeverything3-165x107.jpg","categories":["interviews","music"]}