{"id":"5e9c32cf9b6559241525df70","title":"Film Review: The Social Network","content":"<p><a rel=\"attachment wp-att-3177\" href=\"https://admin.</p><p>crackintheroad.com/visual/3170-review-the-social-network/attachment/social-network-photo40\"><img class=\"aligncenter size-totallysizedforever wp-image-3177\" title=\"Social Network Photo40\" src=\"https://api.crackintheroad.com/uploads/2010/10/Social-Network-Photo40-740x498.jpg\" alt=\"\" width=\"740\" height=\"498\" /></a></p>\n<p>From the opening few moments of <strong>The Social Network </strong>two things become very clear; this isn’t a film about Facebook and this is almost certainly a film written by <strong>Aaron Sorkin</strong>, as it happens you would be right on both accounts. In fact the opening scene of the film is so Sorkinian that it may even take you a few minutes to adapt to the pace of the dialogue. If anything this is almost ironically placed when compared to the subject matter, a story about the creation of what many call the greatest social invention since the telephone, Facebook. But there’s that word again, Facebook, surely this can’t be a Fincher film with a cynically and awkwardly placed Facebook sub-plot? Again it most certainly isn’t.</p>\n<p>This is again what makes the film work so well, as Sorkin said himself the film could have easily been about a particularly well made toaster, the actual ‘product’ no matter how expertly created, doesn’t really come into it. What the film is about however, and what it manages to project so expertly is power, greed, guilt, revenge and betrayal. The film follows <em>Mark Zuckerberg</em> played by <strong>Jesse Eisenberg</strong>, as he embarks on creating Facebook all from his Harvard dorm-room. Eisenberg plays him like a dream, managing to make a young man who never seems to smile or connect with anyone, believable or at the very least human. More importantly however he makes the genius that made him the world’s youngest billionaire believable.</p>\n<p>Although the film is essentially about the dispute that followed the creation, as those close to Zuckerberg, namely Cameron Winklevoss and Tyler Winklevoss (<strong>Armie Hammer</strong>), fought for a slice of the pie. <strong>Fincher</strong> still leads us to believe that <em>Zuckerberg</em> was the only person that could have; as he so eloquently states half way through the film, “if you had invented Facebook, then you would have invented Facebook.”</p>\n<p>What’s perhaps the most impressive about the Zuckerberg character is how Fincher, Sorkin and indeed Eisenberg himself manage to sustain engagement with such a socially awkward and in places repugnant character. We watch him eventually tricking his best friend Eduardo Saverin (<strong>Andrew Garfield</strong>) out of over 30% of the company and create abusive site www.facemash.com after his girlfriend leaves him at the very start of the film. Yet for some reason the draw of Zuckerberg is still there, Sorkin’s writing helps this to no end, filling the script up with one-liners that no matter how obnoxious manage to humanise him to some extent. In many ways <strong>Fincher</strong> and <strong>Sorkin’s</strong> willingness to allow us to feel for Zuckerberg is what hinders the film, with the final scene clawing back some sort of human sentiment towards the character in an ultimately unnecessary way. In other areas they’re more confident, namely through Sean Parker the creator of Napster played by <strong>Justin Timberlake</strong>, in this case there’s no directorial redemption, simply a twisted individual that no matter how unlikable is again beautifully realised and played.</p>\n<p>Ultimately <strong>The Social Network</strong> is one of the most exciting films of the year. <strong>Fincher</strong> like <strong>Nolan</strong> did only a few months ago has managed to get the masses to see a film that genuinely challenges the brain. But despite this he’s also made a film that can be seen by anyone whether your on Facebook or not, sure the website is used as a tool to define and explore this interesting young character, but even with minimal knowledge of the website a connection with the character is impossible to prevent. As I left the cinema on Friday evening the first thing I did was post a status about how good this film was, it took me a few moment to even realise a connection, it was simply a knee jerk reaction to a sudden opinion; if that doesn’t reveal the importance and relevance of this film  I don’t know what does.</p>\n","slug":"3170-review-the-social-network","category":"arts","date":1287425475000,"wpid":3170,"isSticky":false,"featured_image":{"width":1251,"height":842,"src":"2010/10/social-network-photo40.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAYH/8QAIhAAAgAFAwUAAAAAAAAAAAAAAQIAAwQFEQYHIRQiQWGS/8QAFAEBAAAAAAAAAAAAAAAAAAAAAP/EABQRAQAAAAAAAAAAAAAAAAAAAAD/2gAMAwEAAhEDEQA/AMiumt+o1VV3gSVaqk1UuZJY8diAKU9A4P0YrV3WsLKGmW6uRyMsocEA+RnPMIQH/9k="},"createdAt":1587294927584,"updatedAt":1588403563045,"author":"5e9b68b27a1236eccfeb1d24","old_image":"2010/10/social-network-photo40.jpg","categories":["arts"]}