{"id":"5e9bf96a8fb2d30d7769cc6d","title":"Interview:  Stephen Davidson of Tellison","content":"<h2 class=\"p1\" style=\"text-align: center;\"><span class=\"s1\">“We’re not giving up”</span></h2>\n<h3 class=\"p1\" style=\"text-align: center;\"><span class=\"s1\">Stephen Davidson</span></h3>\n<p class=\"p1\"><em><span class=\"s1\">Brighton 20.</p><p>09.15</span></em></p>\n<p class=\"p1\"><span class=\"s1\"><b>Tellison</b> <a href=\"https://www.independent.co.uk/arts-entertainment/music/features/tellison--hope-fading-nightly-exclusive-album-stream-10485618.html\"><span class=\"s2\">released <i>Hope Fading Nightly</i></span></a><i> </i>last week. I caught up with Stephen Davidson in the suitably sombre location of a toilet in Brighton to discuss the pain behind making the new record, how happy the band are now and how they have no plans to give up.</span></p>\n<p class=\"p1\"><strong><span class=\"s1\">The last time I spoke to you was four years ago in Southampton, a few months after the release of The Wages of Fear, so how’s it going?</span></strong></p>\n<p class=\"p1\"><span class=\"s1\"><b>“</b>Good, we’ve been through some highs and lows since we last spoke. <i>The Wages of Fear (2011)</i> didn’t really do anything in terms of getting us further ahead or getting us played on the radio, which was sort of the aim of that record. </span></p>\n<p class=\"p2\">“We were impressionable children, so we listened to these so called professionals, he says bitterly. They were older and we thought wiser, they said if we put a little bit more polish on what we were doing then things could go really well and we could be a full time band.”</p>\n<p class=\"p1\"><span class=\"s1\">“We were all young, you learn a lot and we’re a lot more comfortable in our own skin now. I think that comes across in the new record. We just went to a studio with all our own gear and figured out how to make an album from scratch. This was much more of an attempt to make the songs sound like how they sounded when we first wrote them.</span></p>\n<p class=\"p1\"><span class=\"s1\">“So much of Tellison is about growing up, because it’s a band I’ve been in since I was 13, and I’m 29 now. This record is explicitly about feelings of failure, or feelings of potential not reached and roads not travelled.”</span></p>\n<p class=\"p1\"><strong><span class=\"s1\">The songs in the new record seem to be a little bit more forthright, even aggressive in places?</span></strong></p>\n<p class=\"p1\"><span class=\"s1\"><b>“</b>There’s definite anger and disappointment, with feelings of betrayal. But I think I was feeling that way, and for me songwriting is a big cathartic process. It’s about taking that negative energy  and putting it somewhere creative and positive, rather than just stewing on it miserably, sat on the bus wanting to die. We’re not depressed people, but I do think that’s how I personally deal with that stuff. </span></p>\n<blockquote>\n<h3 class=\"p1\" style=\"text-align: left;\">“It does quite suck to be in your twenties in 2015”</h3>\n</blockquote>\n<p class=\"p1\"><span class=\"s1\">“Equally it does quite suck to be in your twenties in 2015. I was obviously naive, but I just believed it when people told me to work hard and you’d be okay. So it was grim to find out it’s not true.”</span></p>\n<p class=\"p1\"><strong><span class=\"s1\">I don’t see any of the hard stuff you have to do to keep Tellison going, but I do often see you play shows to a hundred people shouting your lyrics back at you. To me I see a successful band that’s endured – so I can’t help but wonder what  ‘success’ for Tellison would look like?</span></strong></p>\n<p class=\"p1\"><span class=\"s1\"><b>“</b>Those shows are something we’re definitely aware of, particularly in London. It’s insane, and I wouldn’t want to take anything away from that. </span></p>\n<p class=\"p1\"><span class=\"s1\">“Much of the record is about a period of time a year or two ago, where we didn’t have a third record on the horizon and I was just on my own in my bedroom, not knowing if we were going to make another album, or break up. I was working in rubbish jobs, and commuting, feeling really bad about how I’d spent my life up until that point.</span></p>\n<p class=\"p1\"><strong><span class=\"s1\">But in a way this entire problem has created this album.</span></strong></p>\n<p class=\"p1\"><span class=\"s1\"><b>“</b>I totally agree with you there, it’s really important to be aware of that. And there is an important distinction to be made with what was going on when we were writing the album and what’s going on now, because I think all of us are really happy with how it’s going.</span></p>\n<p class=\"p2\">“We’ve all figured out how to make it work with our own lives. And we used all of this pain to make fire wood to make this thing, which we’re all pleased with. Maybe we needed to get all of that out of ourselves, to be confident and happy, and realise it’s okay.</p>\n<p class=\"p1\"><span class=\"s1\">“I’m just imagining what success might look like, but maybe we’re here in fact. In lots of ways we’re doing what we set out to do.”</span></p>\n<p class=\"p1\"><strong><span class=\"s1\">There are a lot of places in the new record which feel almost like giving up, so what comes next?</span></strong></p>\n<p class=\"p1\"><span class=\"s1\"><b>“</b>As far as giving up goes, I don’t want to. I’m not planning on giving up. I’m working on another record at the moment.</span></p>\n<p class=\"p1\"><span class=\"s1\">“There was a need to put it all out there, literally apologise to the rest of the band and talk about the negative stuff we were all thinking, sitting in silence on the van back from Derby, having played to two people. Once it’s out there, it becomes more manageable, and it’s made us feel more of a team. Because we all felt like this, but we had an unspoken agreement that we would set our jaws, and carry on.”</span></p>\n<blockquote>\n<h3 class=\"p1\" style=\"text-align: right;\">“We had an unspoken agreement that we would set our jaws, and carry on.”</h3>\n</blockquote>\n<p class=\"p1\"><strong><span class=\"s1\">Having lost a friend to suicide earlier this year, I wondered if My Marengo is about someone in particular – or rhetorical?</span></strong></p>\n<p class=\"p1\"><span class=\"s1\">“It’s about one of my best friends who killed himself. It was ten years ago, and it’s taken me this long to say that inarticulate thing, because what do you say? Even now I have no idea where to even begin trying to unpick it all.</span></p>\n<p class=\"p1\"><span class=\"s1\">“It feeds back into what a lot of the record’s about, because it’s about feeling unhappy and hopeless. If you pursue that to its end point, this is one solution that people come up with. But the song pointedly rejects it, because whilst I’m so far away from understanding it, all I can talk about is what I do think and feel. And the song is my rejection of it, because I wish he hadn’t done it.”</span></p>\n<p class=\"p1\"><strong><span class=\"s1\">It’s interesting that having had so many songs that are almost giving up, that when you get to the darkest point of the record, there is a rejection of giving up.</span></strong></p>\n<p class=\"p1\"><span class=\"s1\"><b>“</b>Yes, definitely. I was thinking about this when we were making the record.”</span></p>\n<p class=\"p1\"><strong><span class=\"s1\">The first time I listened to the album I felt uncomfortable and sad, that a band I admired for putting a hopeful spin on real life experiences, had made something that felt very bleak, but the more I listen to it, the more it feels hopeful.</span></strong></p>\n<p class=\"p1\"><span class=\"s1\"><b>“</b>That’s the tension that exists in talking about misery and unhappiness, that by doing so you’re dealing with it. So it’s a fun bit of artifice, which is therapeutic for us. To speak your worst fears, and by doing so, overcome them hopefully.</span></p>\n<p class=\"p1\"><span class=\"s1\">“As a band we talk about how we’re failures, we release an album called ‘Hope Fading Nightly’ about how everything’s going wrong and we hate it all. But we released an album. It took four years, but we did it and we’re still going. The silent point is that we’re not giving up.</span></p>\n<p class=\"p1\"><span class=\"s1\">“With the title <i>Hope Fading Nightly</i>, you could read it one way and say you’re getting less and less, but also in another way it’s a recurring act, hope fades nightly, sun comes up, and you start again. That’s life really, isn’t it?”</span></p>\n","slug":"31754-interview-stephen-davidson-of-tellison","category":"interviews","date":1443418210000,"wpid":31754,"isSticky":false,"featured_image":{"width":1000,"height":665,"src":"2015/09/tellision-promos_jan-2015_slb_008.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAQH/8QAIRAAAgEEAQUBAAAAAAAAAAAAAQIDAAQFETEGBxMXIWH/xAAVAQEBAAAAAAAAAAAAAAAAAAACBP/EABcRAAMBAAAAAAAAAAAAAAAAAAABAiH/2gAMAwEAAhEDEQA/ALejO5+X9cZPMJOL24x00caxmPxLIGYEgk7Owqto/vG60K0zt5c2kM7ZW4QyorlRGvzY3rilKK0smJbeH//Z"},"createdAt":1587280234120,"updatedAt":1588403508603,"author":"5e9b68b27a1236eccfeb1d22","old_image":"2015/09/tellision-promos_jan-2015_slb_008.jpg","categories":["interviews","opinion"]}