{"id":"5e9bf9648fb2d30d7769cc5b","artists":["5e9b692b7a1236eccfeb23f0"],"title":"Interview: Overcoats","content":"<p><em><span style=\"color: #000000;\">I first met Hana Elion and JJ Mitchell AKA Overcoats during the soundcheck of our <a href=\"https://love-london.</p><p>co.uk/events/crack-in-the-road-presents/\">last London live show</a>. </span></em></p>\n<p><em>That evening I watched their magical mix of electro-folk and soul slowly seduce the crowd. Afterwards we got chatting by the bar and the duo told me of their travels from Brooklyn to Dublin then across the UK. </em></p>\n<p><em>Now November is almost here and as the leaves begin to brown, Overcoats are kicking off a <a href=\"https://twitter.com/thisisovercoats/status/659070155402645505\">US tour</a> with plans to return to the UK before the year is out. I</em><em> caught up with them to talk synchronised dancing, last suppers and life lessons.</em></p>\n<p><strong>Hey guys, so what’s been going on since you performed for us at The Old Blue Last back in September?</strong></p>\n<p>J: After the show, we headed down to Cornwall for a month. We worked on a lot of new material, did some waitressing part-time, and finished putting together our tour of the Northeast of America.</p>\n<p>H: Don’t forget the swimming – we did a lot of swimming.</p>\n<p>J: We’re excited to announce that we are now working with the folks over at Mute management so that’s been great fun getting to know them and planning the future.</p>\n<p><a href=\"https://api.crackintheroad.com/images/2015/10/12194460_10153860925885628_1709278513_o.jpg\"><img class=\"size-large wp-image-31790 aligncenter\" src=\"https://api.crackintheroad.com/images/2015/10/12194460_10153860925885628_1709278513_o-1024x680.jpg\" alt=\"Overcoats\" width=\"640\" height=\"425\" srcset=\"https://api.crackintheroad.com/images/2015/10/12194460_10153860925885628_1709278513_o-1024x680.jpg 1024w, https://api.crackintheroad.com/images/2015/10/12194460_10153860925885628_1709278513_o-300x199.jpg 300w, https://api.crackintheroad.com/images/2015/10/12194460_10153860925885628_1709278513_o-50x33.jpg 50w, https://api.crackintheroad.com/images/2015/10/12194460_10153860925885628_1709278513_o.jpg 2048w\" sizes=\"(max-width: 640px) 100vw, 640px\" /></a></p>\n<p><strong>Its been a bit of a whirlwind since 2015 for Overcoats, tell us a bit about how you came together and how you ended up spending 6 months in Ireland?</strong></p>\n<p>H: JJ and I met in university and had been singing together for years. A combination of one of the coldest New England winters either of us had ever experienced and some things that were going on in both of our personal lives prompted the idea of writing music as a coping mechanism. We started writing as a way for us to try to understand our own feelings, as well as empathise with each other’s. Both of us had written music before and been in various bands, but everything about making music changed for us when we wrote together. It was kinetic, and so so honest.</p>\n<p>J: Everything happened very quickly. Hana was working in a recording studio at the time, and so we just kept writing and recording and eventually we put the stuff online. Dublin was a way for us to get out of New York and go try and wing it somewhere new. We wrote a ton of new material and met really unforgettable people along the way.</p>\n<p>H: Also, I think we may need bad weather to write good music.</p>\n<p>J: Yes. The rain was very necessary.</p>\n<p><iframe src=\"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/212094180&color=ff5500&auto_play=false&hide_related=false&show_comments=true&show_user=true&show_reposts=false\" width=\"100%\" height=\"166\" frameborder=\"no\" scrolling=\"no\"></iframe></p>\n<p><strong>So take us through the songwriting process </strong></p>\n<p>J: Writing songs together feels really natural to us. There are a few different ways that we do it. Sometimes we work from an idea—a feeling or an experience—and we try to find the right words and the right mood to portray it. Other times we start from a short melody that one of us has been working on, or sometimes the beginnings of a verse. With The Fog, it was actually the percussion that inspired the melody and lyrics. So there have been a number of ways. Just this past week, we had to experiment with writing together from across the pond. Hana flew back to the US before me but we refused to stop working on our latest idea. About 25 emails went back and forth, with voice memos, garageband clips, and finally a full blown demo in logic. Something funky is going on with the two of us. We have exactly the same vision for the kind of sound we are trying to put out into the world. We know when something sounds right. We know when it sounds like Overcoats.</p>\n<p><strong>Cool in-sync songwriting, kind of like your dancing! Speaking of which, what’s your favourite dance move?</strong></p>\n<p>H: Oh, that’s an easy one.</p>\n<p>J: How can we explain this? It’s called “hip-frog.”</p>\n<p>H: Basically, in “Smaller Than My Mother,” the fourth track off our EP, there’s a moment towards the beginning where the beat drops. When we play the song live, we break into this move that involves moving one hip and jutting your leg out like a frog (don’t ask).</p>\n<p>J: There might be footage of this, but don’t look it up. Better to be surprised when it happens.</p>\n<p><strong>Haha, during your visit to the UK you must have come across some interesting places. What were some of your favourites?</strong></p>\n<p>J: Our favorite place that we visited was actually Saatchi Gallery in London. We were locked out of the apartment we were staying in (long story…) and we had been wandering around the city for hours. We made it to Saatchi and thought we had found heaven. Every piece of art in there…we would enter the next gallery room and both just be like “Oh my god, oh my. Oh wow.” Definitely disturbing everyone else around us. We finally had to pull ourselves away when the gallery monitors told us the gallery had closed ten minutes earlier.</p>\n<p>H: Cornwall was definitely one of my favorite places we visited, as I had never been there before. The views were breathtaking. Another great spot was this club we played in Exeter – Cavern. We met really wonderful people that night and had an absolute ball.</p>\n<p><strong>What’s next for Overcoats? Any new music planned or sneak peeks you can give us?</strong></p>\n<p>H: Lots of new music coming. We’re recording several new tracks this month and are playing a bunch of shows in and around NYC. If anyone’s New York based, we’ll be at Rockwood Music Hall on November 6th and Pianos on November 14th.</p>\n<p>J: After that, we’ll be back in London in December!</p>\n<p><strong>Favourite venue?</strong></p>\n<p>J: I’d have to say The Old Blue Last is up there on the list. The vibe there was pretty great. We also love Pete’s Candy Store in Brooklyn. The part at the back, where all the live music happens is like a train car. Im not sure if it’s actually an old train car or if it’s just modeled to look like one. Either way, it’s cute AF. It’s where we played our first ever New York gig.</p>\n<p>H: Both really good choices. I also loved the Islington, because of the intimate vibe and the really fun staff.</p>\n<p><strong>Ok, so now lets go a bit off piste, If you were on death row what would your last meal be?</strong></p>\n<p>J: Probably eggs. Not because we love eggs. It just seemed to be the only thing we ate while on tour. So many EGGS. I guess we could almost call it comfort food? Actually nevermind, I wouldn’t want an egg.</p>\n<p>H: I think we would request salt and vinegar crisps. But maybe also eggs.</p>\n<p><strong>Wow I thought my question was random but EGGS? If you could turn into any animal, what would it be and why?</strong></p>\n<p>H: Lion. I’m a leo, so…rawr.</p>\n<p>J: Meerkat. Definitely.</p>\n<p><strong>One thing you’ve learnt this year?</strong></p>\n<p>H: When traveling/touring/generally living a nomadic life, be each other’s home. That will get you through.</p>\n<p>J: Also, there’s nothing that can’t be danced off.</p>\n<p>H: It’s been a learning experience, for sure.</p>\n<p><em>If you’re on the East Coast of the US you can catch Overcoats across November, otherwise the dreamy duo are returning to UK in December. In the meantime you can keep up with the latest from Hana and JJ over on <a href=\"https://www.facebook.com/thisisovercoats/?fref=ts\">Facebook</a> & <a href=\"https://twitter.com/thisisovercoats\">Twitter</a>.</em></p>\n","slug":"31789-interview-overcoats","category":"interviews","date":1446111565000,"wpid":31789,"isSticky":false,"featured_image":{"width":1280,"height":800,"src":"2015/10/12193138_10153860925870628_1145258678_o1-1280x800.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAGAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAUH/8QAIRAAAgEDAwUAAAAAAAAAAAAAAQIDAAURBBIUISIxQVL/xAAVAQEBAAAAAAAAAAAAAAAAAAAEBf/EABwRAAEEAwEAAAAAAAAAAAAAAAEAAgMiBFFhsf/aAAwDAQACEQMRAD8AzeSeFrhx3hZOHHJpHaJtpeZjvjlP0AO0qcdPFRjdkBw0JJ94NKUSAB4txUMlxjNdn1f/2Q=="},"createdAt":1587280228250,"updatedAt":1588403508439,"author":"5e9b68b27a1236eccfeb1d40","old_image":"2015/10/12193138_10153860925870628_1145258678_o1-1280x800.jpg","categories":["interviews","new"]}