{"id":"5e9c34759b6559241525e222","title":"Interview: Cult Image","content":"<p style=\"text-align: center;\">\n<p style=\"text-align: center;\">\n<p style=\"text-align: center;\"><span style=\"color: #000000; -webkit-text-decorations-in-effect: none;\">My first encounter with the Newcastle based band Cult Image was only 2 short months ago in the dingy underground space of the Head of Steam.</p><p> Since then the band’s momentum has grown quite substantially, playing their largest date so far on the 16th of April and with their first gig in the capital only just around the corner, the band seem to be heading in the right direction. So on the sunny afternoon of their evening show at The Other Rooms, Crack in The Road sat down with the three piece to talk about their lurch into the north east music scene. A scene I might add the band completely refuse to acknowledge, as soon as the words leave my mouth Sean, Chris and Fintan shake their heads in despondence. Even if the scene was thriving it seems to me that the band would still refuse to acknowledge it; insular in both making and promoting their music the band fully admit that their music is for them, and them only. Quite a claim for a band looking to get signed, yet the charming nature of the band and the way they lovingly talk about their music suggests a large element of truth. The band are quite simply proud, “I genuinely think we don’t sound like anyone else” says Sean with a glint in his eyes. But what of the Joy Division parallel? Surely this is conscious right? Not as much as you might think, when the band explain their influences the Ian Curtis reference seems more and more arbitrary. Chris the bands guitarist’s love of The Kills, Led Zeppelin and Jimi Hendrix perhaps explains the sound better, and when going back to listen to their music the suggestion seems more and more lazy.</span></p>\n<p style=\"text-align: center;\">But regardless of post punk similarities the band’s sound still stands out, melancholic yet pulsating the band undoubtedly has something original. But where’s the bass I ask? Far from a stylistic choice the band simply “couldn’t find a good one”. Despite this Sean still smiles in agreement when I suggest that his voice is a bass in itself. The band seems to have stumbled across their sound rather than soullessly calculated it. The same can be said for their engaging live shows; Sean gazes awkwardly and shuffles uncomfortably, an act? Nope, “I don’t know where to look” he humorously chips in. But it works, and to be honest after meeting the man his demeanour makes sense. Honest about himself and his music, he sees it as a way to express “how shit his life is”, but far from a depressive he seems simply realistic; everything is said with a pinch of salt and a smirk. The way he approaches his writing may not be revolutionary but it’s strikingly personal. He almost finds it too hard to express how much it means to him, “it’s a way to shout how I’m feeling”. With six months gone by since Sean’s painful breakup it seems he still has a lot to shout about. While the music is very much for them, what Sean, Chris and Fintan all seem to agree on is their ability to take the listener on a journey, for them it’s about telling us a story. When playing live the band have the ability to appear as a unit while still pulling in different directions. Chris appears lost in his own world; Sean seems completely at odds with the world around him while Fintan oversees the dysfunction. Ironically the fact they all seem to be doing their own thing becomes the thing they all have in common, it brings them together.</p>\n<p style=\"text-align: center;\">Putting the music aside for one moment, what struck me the most about the band is their love for one another. Although Sean admits his life is far from perfect, he also made it clear while putting his arms around his two band mates that “it would be a lot worse without these guys”. The relationship is far from perfect, Chris and Sean’s interference in each others relationships  had the danger of derailing the band at one point, but the bands ability to respect and forgive one another is a charming strength in itself. They all admit that they probably wouldn’t be friends if it wasn’t for music; with Sean going on to say that the other two sometimes treat him like a “dictator”. He does seem hard to live with, but the band do it for the music and the love they have for one another, something that’s almost too adorable to ignore.</p>\n<p style=\"text-align: center;\">\n<p style=\"text-align: center;\">\n<p style=\"text-align: center;\"><a href=\"https://www.myspace.com/ignoranceinthunorf\">Cult Image’s Myspace</a></p>\n","slug":"318-cult-image","category":"interviews","date":1271598765000,"wpid":318,"isSticky":false,"featured_image":{"width":600,"height":400,"src":"2010/04/cultimagebest.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAAAAf/xAAhEAABAwQBBQAAAAAAAAAAAAABAAIFAwQREgYTITFBYf/EABQBAQAAAAAAAAAAAAAAAAAAAAP/xAAYEQADAQEAAAAAAAAAAAAAAAAAAQIRMf/aAAwDAQACEQMRAD8Amj5uBr8QdGiNLLxp6gugTsSBjU+seSp44Udjg9s/URDE5wSqdJaf/9k="},"createdAt":1587295349682,"updatedAt":1588403568912,"author":"5e9b68b27a1236eccfeb1d24","old_image":"2010/04/cultimagebest.jpg","categories":["interviews","music"]}