{"id":"5e9c32ca9b6559241525df69","title":"Review: Vinyl Jacket ‘Broken Record’","content":"<p>Much has happened in camp <strong>Vinyl Jacket </strong>since <strong>Crack In The Road </strong>first reviewed their debut 3 track EP and support performance for <strong>Hockey </strong>all those months ago.</p><p> Having gained the attention of  BBC Radio 6’s Tom Robinson, along with an ever growing fan base through local and online radio play, <strong>Vinyl Jacket </strong>are now in a serious position to launch their music to a national audience.</p>\n<p>Recently the band released their new track ‘Broken Record’, essentially as a teaser to further entice new fans and listeners. After speaking to <strong>Ben </strong>from the band, I’ve been informed that there are plans to release a further two tracks in the coming months, one of which will be accompanied by a professionally produced video. All very exciting plans for an exciting entity of music from the North East, and this excitement can be felt in their most recent release.</p>\n<p>‘Broken Record’ carries on from where the band’s first EP release left off, with an immediate injection of <strong>Holloways</strong>-esque guitars and jangly percussion rushing through energetic and simply fun crescendos. The track also contains the harmonious, choral-like vocals from the rest of the band that all <strong>Vinyl Jacket </strong>listeners should be familiar with, and it is these supporting vocals that help to bring together what is ultimately a very listenable and likable sound. Therefore this new release is certainly not experimental or a huge change in sound, though it was hardly ever going to be considering the time scale in which these tracks are being released. Rather ‘Broken Record’ can be seen as the band recognising and perusing a sound that they’re comfortable with and, frankly, very talented at creating.</p>\n<p>Listen carefully enough however, and you can see signs of promising development. The track has a much more organised feel about it, especially as the track fades in and out of distortion mimicking the sound of an actual ‘Broken Record’. While this may be seen as novel by many, and it is to an extent, it also demonstrates an advancement in production quality and confidence within the band to stray away from simply presenting the track in musical terms. This ‘organised’ element by no means suggests that the sound has in some way been restricted or reigned in, rather the listener is presented with a more focused and channeled version of <strong>Vinyl Jacket</strong>‘s sound. ‘Broken Record’, in the space of just over 200 seconds, manages to present itself as upbeat and fun, while also being able to merge into moments of romance and melancholy. It is this evident quality that promises <strong>Vinyl Jacket </strong>will continue to develop and flourish, and I cannot wait for the next two tracks to be released. In other words, be excited. Be very excited.</p>\n<div><object id=\"FlashDiv\" style=\"display: inline;\" classid=\"clsid:d27cdb6e-ae6d-11cf-96b8-444553540000\" width=\"400\" height=\"77\" codebase=\"https://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=6,0,40,0\"><param name=\"flashvars\" value=\"songId=75417206&pid=2877875395655045721\" /><param name=\"src\" value=\"https://lads.myspace.com/Embeds/SongEmbed/SongEmbed.swf\" /><param name=\"wmode\" value=\"transparent\" /><param name=\"quality\" value=\"high\" /><embed id=\"FlashDiv\" style=\"display: inline;\" type=\"application/x-shockwave-flash\" width=\"400\" height=\"77\" src=\"https://lads.myspace.com/Embeds/SongEmbed/SongEmbed.swf\" quality=\"high\" wmode=\"transparent\" flashvars=\"songId=75417206&pid=2877875395655045721\"></embed></object></div>\n<div>Find more artists like <a href=\"https://www.myspace.com/vinyljacketuk/music/albums/10-10-10-16812137?ap=1&songid=75417206\" target=\"_blank\">VINYL JACKET</a> at <a href=\"https://www.myspace.com/music\" target=\"_blank\"> Myspace Music </a></p>\n</div>\n","slug":"3202-review-vinyl-jacket-broken-record","category":"music","date":1287945325000,"wpid":3202,"isSticky":false,"featured_image":{"width":1023,"height":633,"src":"2010/10/vinyljacketa5.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAGAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAAAAb/xAAgEAABBAIBBQAAAAAAAAAAAAABAgQFEQADEgYhIkGB/8QAFQEBAQAAAAAAAAAAAAAAAAAAAgP/xAAWEQEBAQAAAAAAAAAAAAAAAAABAAL/2gAMAwEAAhEDEQA/AId1Nx8gy3pgoJs0ACTsU4XzUvh5G6Au/mT56kgFkr3MJEbVd18dqSL90SMYwZaiF//Z"},"createdAt":1587294922640,"updatedAt":1588403562991,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2010/10/vinyljacketa5.jpg","categories":["music","reviews"]}