{"id":"5e9bf9278fb2d30d7769cbbc","artists":["5e9b69377a1236eccfeb24a7"],"title":"Premiere: Richie Quake – Clarice (Feat. Jaedon Alvira)","content":"<p>Photo credit: Matt Seger</p>\n<p>Brooklyn’s <strong>Richie Quake</strong> first popped up on my radar at the tail end of 2013 with his fantastic single, <a href=\"https://www.</p><p>youtube.com/watch?v=Kfs2-HKlDaE\" target=\"_blank\">Visions</a>. Featuring one of the tightest choruses of the year, and a killer video to go with it, it marked him out as a talent to keep an eye on.</p>\n<p>With two releases last year – a one-off single and an extended EP, he’s returned with his first offering of 2016, in the form of the Silence of the Lambs inspired new single,<em> Clarice</em>. Drawing from a range of R&B and soul influences, alongside more straight up pop vibes, as well as calling in saxophonist Jaedon Alvira; it’s an engrossing and addictive listen. I doubt there’s been a more fitting ode to Jodie Foster; check it out below, alongside a short Q&A with Quake.</p>\n<p>Like this? Follow our <a href=\"https://open.spotify.com/user/crackintheroad/playlist/1UB6gJIZpmiO0H2zmSbg02\" target=\"_blank\">On Repeat Playlist</a> for a handpicked selection of the very best in new music; updated weekly.</p>\n<p><iframe src=\"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/258685749%3Fsecret_token%3Ds-yx3e6&auto_play=false&hide_related=false&show_comments=true&show_user=true&show_reposts=false&visual=true\" width=\"100%\" height=\"450\" frameborder=\"no\" scrolling=\"no\"></iframe></p>\n<p class=\"p1\"><span class=\"s1\">Whilst your music covers a pretty broad range of genres, there seems to be a fairly strong pop core in the songwriting – influence wise, where do you think this stems from?</span></p>\n<p class=\"p1\"><em><span class=\"s1\">probably stems from my love of pop music haha. I try to keep it at a balance though between pop and other stuff that I like, while making sure it says raw and true to me. </span></em></p>\n<p class=\"p1\"><span class=\"s1\">How does the creative process tend to play out for you when writing music?</span></p>\n<p class=\"p1\"><em><span class=\"s1\">Im always producing stuff all the time so I have a lot of instrumentals lying around. but when it comes to writing lyrics it’s a tougher process for me. Music comes out honest no matter what because it’s ethereal. but words will trip you up. when I have to try and verbalize all my feelings and emotions into something cohesive, its more difficult. </span></em></p>\n<p class=\"p1\"><span class=\"s1\">Clarice features a saxophone solo from Jaedon Alvira; how did this come about?</span></p>\n<p class=\"p1\"><em><span class=\"s1\">one day I realized that I needed more saxophone in my music. the saxophone has a smooth and sexual energy that I like. Jaedon is a friend of mine that I met at music school so I hit him up to see if he was down to play on the track. The next week we chilled and he layed down the part in his living room. </span></em></p>\n<p class=\"p1\"><span class=\"s1\">There’s a strong visual element behind your releases; just how important is this to you, and how crucial is the online platform with regard to expressing this extra artistic element?</span></p>\n<p class=\"p1\"><span class=\"s1\"><em>I like expressing myself in different mediums and collaborating with people so it’s chill.  but sometimes it would be nice to not have to think about all that stuff. As a musician these days, you have a lot of social media to maintain. people expect you to be just as good in every different type of media as you are in music. that’s a lot to live up to but I just try to have fun with it and make shit that I would wana experie</em>nce.</span></p>\n<p class=\"p1\"><span class=\"s1\">What does the future have in store for Richie Quake?</span></p>\n<p class=\"p1\"><em><span class=\"s1\">probably some interesting stuff that I can’t even predict. but mostly more music, more videos, an album when I’m ready. I’m just gonna keep doin my thing and whatever happens, happens. </span></em></p>\n","slug":"32142-premiere-richie-quake-clarice","category":"music","date":1460553982000,"wpid":32142,"isSticky":false,"featured_image":{"width":1280,"height":800,"src":"2016/04/roof-closeup-1280x800.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAGAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAYH/8QAIBAAAgEDBAMAAAAAAAAAAAAAAQIDAAQFBhESITFBgf/EABQBAQAAAAAAAAAAAAAAAAAAAAD/xAAUEQEAAAAAAAAAAAAAAAAAAAAA/9oADAMBAAIRAxEAPwDKcZpqLIY+OKykCPPcm1Zp15FXQE7qR6PipCWKOOV0Zm5KSp2Xrr7SlB//2Q=="},"createdAt":1587280167259,"updatedAt":1588403507062,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2016/04/roof-closeup-1280x800.jpg","categories":["music","new"]}