{"id":"5e9c32c79b6559241525df63","artists":["5e9b68f87a1236eccfeb20c5"],"title":"Review: Girls – Heartbreaker","content":"<p>In no uncertain terms, <strong>Girls</strong> are a cool band.</p><p>  In writing hazy California pop songs about surfing and pizza, long before The Drums cocked it up, Christopher Owens and JR White have written perfectly crafted ballads for the ‘sofa generation’.  By rooting their sound in 50’s rock’n’roll, with a more than casual nod to<strong> The Beach Boys</strong>, whilst juxtaposed with Owens’ awkward and honest voice, they have breathed new life into a sound usually reserved for a soundtrack to The OC.  They are a band to fall in love to, with the originally named <em>Album </em>evoking sun, sea and, vocally, <strong>The Strange Boys</strong>.</p>\n<p>The release of free single ‘<em>Heartbreaker</em>‘ is therefore superb news to anyone else preparing for a dark Northern winter, with a follow-up EP entitled <em>Broken Dreams Club </em>scheduled for the 22nd of November.  Over the trademark, sun-kissed guitar hook, Owens achingly despairs of the naivety which informed <em>Album</em>, suggesting a more mature record this time around.  Just as the chorus innocently accepts that “when I said that I loved you honey/ I knew that you would break my heart”, the opening line bemoans that “I’m not as young as I used to be”.  <strong>Girls </strong>have grown out of a simple appreciation of getting stoned and laughing, into an angsty teenager looking for acceptance, though still clinging to the inner geek that every listener has fallen for.  Whilst musically similar, the brave change in perspective is refreshing, and is a clever move after already pre-empting, and bettering, the ‘surfer rock’ comeback.</p>\n<p>By swimming against the tide and writing lo-fi, dreamy pop songs based on more than just an average haircut,<strong> Girls </strong>are standing out and showing an intent, resuscitating and rewriting a genre in need of new idols.</p>\n<p>‘<em>Heartbreaker</em>‘ is available as a free download from<a href=\"https://www.nme.com/news/girls/53552\"> here.</a></p>\n<p> </p>\n","slug":"3217-girls-heartbreaker","category":"music","date":1288193550000,"wpid":3217,"isSticky":false,"featured_image":{"width":720,"height":460,"src":"2010/10/11_mhg_girls.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAGAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAYH/8QAJBAAAQIFAgcAAAAAAAAAAAAAAgERAAMEEhQFIQYHEzFBQuH/xAAUAQEAAAAAAAAAAAAAAAAAAAAE/8QAGBEAAgMAAAAAAAAAAAAAAAAAAAERITH/2gAMAwEAAhEDEQA/AKyt41xObGnaXV08w6bHskdM1S0iRVJSF2J7UTfs0aJkF6ygbxv8hCCvEIiz/9k="},"createdAt":1587294919615,"updatedAt":1588403562940,"author":"5e9b68b27a1236eccfeb1d4c","old_image":"2010/10/11_mhg_girls.jpg","categories":["music","reviews"]}