{"id":"5e9c32c09b6559241525df56","artists":["5e9b695d7a1236eccfeb26df"],"title":"Review: Warpaint – The Fool","content":"<img class=\"alignnone\" title=\"Warpaint\" src=\"https://c2.</p><p>ac-images.myspacecdn.com/images02/147/l_44a82ab5f82b4cc6bc2f9fc56aa4c519.jpg\" alt=\"\" width=\"600\" height=\"352\" />\n<p>Gathering momentum at an astounding rate, LA’s<strong> Warpaint</strong> are destined to be one of the bands in watch out for in 2011. As well as featuring on the front cover of NME and The Fly, this week has seen the female four piece release their debut album, <em>The Fool</em>, via Rough Trade. With the LP receiving rave reviews from almost all over the board, including NME heralding it as “the greatest debut album of the year”, it was with high expectations that I decided to give the record a listen.</p>\n<p><em>Set Your Arms Down</em>, is seemingly a strange choice for album opener, a drawn out slow burner, utilizing the vocal skills of the girls. There are the obvious comparisons drawn to Mercury Prize Winners <strong>The XX</strong>, in the simple yet hypnotic guitars and extravagantly pronounced beats. It’s a melancholic tale of death and despair, odd for a group who excel in their vivid, energetic live performances. The next track, the self titled<em> Warpaint</em> sees the pace quicken, with the quartets’ vocals lurching almost awkwardly, with an exciting, contagious riff underpinning the entire track, if anything the diced vocals let this track down somewhat.</p>\n<p>The downright funkiest moment on the album is <em>Bees</em>, a dark yet anthemic tune, echoing<strong> Emily Haines’s</strong> expertly delivered vocals. Here is an example of where the lyrics allow the guitar filled body of the track to breath, exercising precise control over the entire song. Whilst <em>The Fool</em> is a pleasant enough listen, there’s a foreboding feeling of unused creativity, it’s not bringing anything new to the table, simply a melting pot of their wide ranged influences. It’s as much <strong>Yeasayer</strong> as it is <strong>Metric</strong>, as much <strong>The XX</strong> as it is <strong>The Cure</strong>, yet I can’t see myself looking back in a years time and citing <em>The Fool</em> as a landmark masterpiece in musical history.</p>\n<p>Shadows almost openly admits this, with lead vocalist<strong> Emily Kokal</strong> moaning <em>“I feel like a shadow… what did you whisper, in my ear”</em>, they’ve certainly combined various musical offerings, maybe to the point of diluting their own musical aspirations. Of the serenades, the finest is the heart-wrenching <em>Baby</em>, one of the highlights of the 9 track album, beginning with <strong>Kokal</strong> counting the song in, before praying “<em>don’t you call anyone else baby, ‘cus I’m your baby still”</em>, an ode to a lover with a wandering heart.</p>\n<p>As an album<em> The Fool</em> feels slightly drawn out, with almost every track reaching the five minute mark, not a stereotype of indie popstars. The songs which particularly engross the listener are those where the connection between the vocals and instrumental sections is harmonious, however in parts the relationship can appear strained and distanced. There is no doubt that there are reasons to get excited about <strong>Warpaint</strong>, although I’m not convinced The Fool showcases the quartets abundance of creativity as well as the girls may have yearned for.</p>\n<p style=\"text-align: center;\"><a href=\"https://www.myspace.com/worldwartour\">Check Out Warpaint On Myspace!</a><a href=\"https://www.warpaintwarpaint.com/\"></a></p>\n<p style=\"text-align: center;\"><a href=\"https://www.warpaintwarpaint.com/\">Check Out Warpaint On Their Official Site!</a></p>\n<p><script type=\"text/javascript\" src=\"https://video.unrulymedia.com/wildfire_11244048.js\"></script></p>\n","slug":"3244-review-warpaint-the-fool","category":"music","date":1288966352000,"wpid":3244,"isSticky":false,"featured_image":{"width":600,"height":352,"src":"2011/06/l_44a82ab5f82b4cc6bc2f9fc56aa4c519.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAGAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAMF/8QAIRAAAQQCAQUBAAAAAAAAAAAAAQIDBBEABgUSExUxUpH/xAAUAQEAAAAAAAAAAAAAAAAAAAAA/8QAFBEBAAAAAAAAAAAAAAAAAAAAAP/aAAwDAQACEQMRAD8AyWtsa0RqKeP4xtwSkuWe6pBSbHz7FX+5eNsuuyI7T0jz4fcQFuBtxHSFEWas3V4xgf/Z"},"createdAt":1587294912277,"updatedAt":1588403562837,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/06/l_44a82ab5f82b4cc6bc2f9fc56aa4c519.jpg","categories":["music","reviews"]}