{"id":"5e9c32c59b6559241525df60","artists":["5e9b68fe7a1236eccfeb2133"],"title":"Interview: Honour Before Glory","content":"<p><a rel=\"attachment wp-att-3269\" href=\"https://admin.</p><p>crackintheroad.com/music/3268-interview-honour-before-glory/attachment/dsc_0345\"><img class=\"alignnone size-totallysizedforever wp-image-3269\" title=\"DSC_0345\" src=\"https://api.crackintheroad.com/uploads/2010/10/DSC_0345-740x495.jpg\" alt=\"\" width=\"740\" height=\"495\" /></a></p>\n<p>Whiskas, co-founder of the highly influential record label <em>Dance to the Radio, has</em> embarked on a new solo project called <em>Honour Before Glory </em>after his previous band, <em>¡Forward, Russia!</em>, was put on hiatus. <em>Honour Before Glory </em>from the outset is an entirely new album, and will no doubt draw in new fans for Whiskas and his music. Listening to songs such as <em>Lions</em> I can’t help but draw a comparison to the instrumentals involved in the new <em>I Like Train</em>s album which is, of course, a big positive and adds a great dimension to the music as a whole. It appears that <em>Honour Before Glory</em> will not be performing many gigs in the near future so if he comes to your area, it will no doubt be a must-see show and tickets will go quickly.</p>\n<p>Whiskas himself was kind enough to answer a few questions for Crack in the Road about this new project:</p>\n<p><strong><span style=\"font-size: small;\">CitR: Dance to the Radio is a highly influential record label, or at least has been for me who first experienced real independent music after buying </span></strong><em><span style=\"font-size: small;\">What We All Want</span></em><strong><span style=\"font-size: small;\">, and from then on i decided to get into music properly… how did this concept come about and who were the first artists you worked with and what or who is your greatest success story from the label?</span></strong></p>\n<p>That’s very nice to hear that it influenced you so much. I think we just did what we did, with an attitude that anyone could do it and get involved in making stuff happen. I don’t know how that concept happened – I mean it was influenced by so much stuff out of punk and post-punk – Mute, Beggars, Rough Trade and America with SST, Touch & Go and more. But more about how the bands and scenes inspired each other and made stuff happen as opposed to starting a label, it was the end result, the label was just a way to make it happen. I’ve talked a lot about the start of the label, but with the compilations it was just a desire to get out music by a wide range of different bands, and to get them heard the most, it wasn’t about restricting the music to people who paid – we were pretty liberal with getting the music to people and not waiting for people to stumble upon it. Anyway, I could write pages on this, and that’s a snap shot at least</p>\n<p>When we first started the label, we did the first compilation (Dance To The Radio: Leeds) and alongside that worked with ¡Forward Russia! This Et Al, iLiKETRAiNS, The Lodger and Napoleon IIIrd. That was the plan. Then the label moved on and we mainly focused on 2/3 bands at a time. I guess the greatest success story has to be The Pigeon Detectives, doing what they’ve done, nearly all on their own terms. I hope they manage to take the next step as well</p>\n<p><strong>CitR: </strong><strong><span style=\"font-size: small;\">How did this new solo project, Honour Before Glory, come about and who was involved in creating it?</span></strong></p>\n<p>Honour Before Glory is really just me, and so has always existed, though I needed some songs. It came to life after too much talking, or rather thinking from me, inspired by the guys from Duels and a few other confidantes. I’d been messing about with songs and ideas since FR were in Seattle, but it took a long time to find the right direction and I guess build the confidence. Eventually I managed to get a whole chunk of studio time, and muddled my way into learning how to get the songs sounding how they did in my head.</p>\n<p><strong>CitR: </strong><strong><span style=\"font-size: small;\">How would you describe your music in three words to entice potential fans into listening?</span></strong></p>\n<p>dreamy, intriguing, broken</p>\n<p><strong>CitR: </strong><strong><span style=\"font-size: small;\">Are there any plans on expanding the amount of gigs you do or are there strict time restrictions?</span></strong></p>\n<p>Not really much plan on expanding the amount of gigs, not from what we’re doing this autumn really. It’s not just to do with time restrictions. I hope that from the new year we will be releasing music, unveiling new music, and so will play a handful of dates to coincide – so things will become a bit more focussed</p>\n<p><strong>CitR: </strong><strong><span style=\"font-size: small;\">Are there any plans for Forward Russia! In the future, or is Honour Before Glory seen as a long term prospect for you?</span></strong></p>\n<p>There are no plans for FR in the future, other than the door being open. I think it would be hard with Katie in Nottingham, and maybe by then we’ll all have moved on too much. I think everything has moved on, so I don’t know where FR would fit in to the world in general, let alone our 4 worlds. I’m sure it would be a different beast… re: Honour Before Glory, it’s not about it being a long term prospect, it’s me first and foremost, so I think it will always exist as a thing for me to do. I hope I can keep making different music through it…</p>\n<p><strong><span style=\"font-size: small;\">CitR: Can you let out any details about your release in January, what are people to expect from it?</span></strong></p>\n<p>No details as yet, I’m just trying to work things out, and see if anyone else wants to get involved to be honest. The important thing for me has been to write and record the songs, which is a different way of doing things, as only know am I really trying to work out how to get it out in to the world. As much as I love to just put it out there, I think there’s a way of doing things to give yourself a grounding, which is what I’m going to try and do next year I guess. Plus it doesn’t all fit together just quite yet, there are a few missing pieces to the jigsaw</p>\n<p>Anyway, the release will be a single, something that people have already heard I think, and I’m just trying to find a way to make it all inclusive, so people feel like they’re buying into the song and Honour Before Glory, instead of buying a digital imprint or a slab of vinyl. And then when I’ve worked that out, I need to find a way to communicate it properly. Nothing’s ever simple</p>\n<p><strong>CitR: </strong><strong><span style=\"font-size: small;\">What artists or bands would you say have influenced the music you make in Honour Before Glory the most?</span></strong></p>\n<p>As with when people asked us about Forward Russia, I’m more influenced by people’s attitudes towards making music more than the music themselves – I think it maybe manifests itself more clearly musically in some than in others. With Honour Before Glory, it’s all about seeing ideas through, outside of 4 guys with guitars, and so mainly what one guy can do. So to give you a list it’s things like: M83, TV On The Radio, Wilco, My Bloody Valentine, Beirut, LCD Soundsystem, Magnolia Electric Co, Portishead, Wolf Parade, Get Well Soon, Stars, The Wrens – as well as a lot of my friends and contemporaries (This Et Al, Duels, I LIke Trains)</p>\n<p><strong>CitR: </strong><strong><span style=\"font-size: small;\">What is the best band or artist you have supported and been supported by in the past?</span></strong></p>\n<p>Hmm, that’s tricky. It’s hard to look past Cursive in terms of bands we’ve been supported by as they’re one of the greatest bands in the world. Two tours I always remember fondly in terms of musical excellence and comradery is the tour just after our album came out with Youthmovies and The Scare – who’d never met before and ended the tour as firm friends – and also touring America with Snowden who are an amazing band – I await new material from them with baited breath.</p>\n<p>In terms of bands we have supported, that’s a toughy. We had many enjoyable jaunt with Editors & Biffy Clyro – one in particular with the former with The National was quite special and the biggest venues we’d played.</p>\n<p><strong><span style=\"font-size: small;\"><strong>CitR: </strong></span></strong><strong><span style=\"font-size: small;\">If you could have any superpower what would it be and why?</span></strong></p>\n<p>Resilience so I could cope with life</p>\n<p><strong>CitR: </strong><strong><span style=\"font-size: small;\">What is your most embarrassing moment on stage?</span></strong></p>\n<p>I don’t know about embarrassing, but I always remember a gig in Madrid where our guitar tech trip over the power to my side of the stage, unplugging it all. When he plugged it back, it was unearthed so I spent a couple of songs getting electric shocks every 10 seconds for a couple of songs until the problem was sorted. More annoying than embarrassing I guess</p>\n<p><a href=\"https://www.myspace.com/honourbeforeglory\">Check out <em>Honour Before Glory’s </em>Myspace</a></p>\n<p><a href=\"https://www.honourbeforeglory.com/\">Check out his Official Site</a></p>\n<p><script type=\"text/javascript\" src=\"https://video.unrulymedia.com/wildfire_11244048.js\"></script></p>\n","slug":"3268-interview-honour-before-glory","category":"interviews","date":1288298208000,"wpid":3268,"isSticky":false,"featured_image":{"width":3872,"height":2592,"src":"2010/10/dsc_0345.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAYH/8QAIhAAAgAEBgMAAAAAAAAAAAAAAQIAAwQxBQYHERJhFCFR/8QAFQEBAQAAAAAAAAAAAAAAAAAAAwT/xAAZEQEAAgMAAAAAAAAAAAAAAAABAAIDMWH/2gAMAwEAAhEDEQA/ALnKGntDiukRWvLtVTZM11YkMEdS3BrXsD0B8jI2ypPdiw8ZNzvxVTsOh7tCESZboHYdtE//2Q=="},"createdAt":1587294917755,"updatedAt":1588403562915,"author":"5e9b68b27a1236eccfeb1d07","old_image":"2010/10/dsc_0345.jpg","categories":["interviews","music"]}