{"id":"5e9bf86e8fb2d30d7769ca16","title":"Feature: Who’s next in line for a Nobel Prize?","content":"<p>How many songs must a man write down, before he wins a Nobel Prize? The answer my friend, is in the region of 522.</p><p></p>\n<p>In case you’ve been living under a non-rolling stone, Bob Dylan was just awarded the Nobel Prize in Literature. I’ll leave others to argue if this was the right choice (nope), deserved (nope) or just a publicity stunt (yes), because I’m more interested in what happens in the future, as far fewer people can call you out on predictions.</p>\n<p>Dylan’s award, which finds him spoken in the same breath as writers like Beckett, Hemingway and Pinter, has opened the door for a whole other group to consider in future events: musicians.</p>\n<p>Ahead of the bookies opening betting on next year’s event, we’ve got some hot tips on who might just take home the biggest prize in Literature in 2017.</p>\n<p><strong>30/1: DMX</strong></p>\n<p><iframe src=\"https://www.youtube.com/embed/ThlhSnRk21E\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe></p>\n<p>Commercial hip-hop has undergone a sea change. Where once tongue-twisting, intricate wordplay could take you to the top, artists like Future and Young Thug have heralded in a more percussive and melodic style of rapper. This style has a clear godfather and his name is DMX.</p>\n<p>Whether it’s barking like a dog or getting by on <a href=\"https://poly-graph.co/vocabulary.html\" target=\"_blank\">the bare bones of the English language</a>, DMX inspired a generation of wordsmiths to change their approach to lyricism.</p>\n<p>Just look at how he kicks off the first verse of Ruff Ryder’s Anthem with the quartet of “try”, “lie”, “why” and “die”, a scheme that makes far more sense than Dylan’s half-assed attempt to rhyme <a href=\"https://www.youtube.com/watch?v=MGxjIBEZvx0\" target=\"_blank\">“medicine” and “government”.</a></p>\n<p>The singer won the Nobel Prize “for having created new poetic expressions within the great American song tradition,” something DMX has also achieved. He’s an unpretentious poet who just wants to let you know where the party is: up in here. And for that, we should all be thankful.</p>\n<p><strong>25/1: Mike Oldfield</strong></p>\n<p><iframe src=\"https://www.youtube.com/embed/F7pBEdK4oVg\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe></p>\n<p>Dylan winning the Nobel Prize made a clear statement for the future. The world’s top literary prize is no longer about how things read, but performance. So what’s the next logical evolution? Something with no words.</p>\n<p>Think about it: if <a href=\"https://www.youtube.com/watch?v=JTEFKFiXSx4\" target=\"_blank\">John Cage’s 4′33″</a> forced academics to reconsider classical music, then wouldn’t Tubular Bells do the same for literary critics? Wouldn’t they begin to ask if we really need all these words? If they were reductive enough to believe that literary worth is tied to scrawls on some paper? Isn’t the purest piece of writing something that contains nothing at all? Yes is the answer you’re looking for. Yes. A thousand times yes.</p>\n<p>Plus, baby boomers love Bob Dylan and Mike Oldfield and what they say goes so you’d best shut up and accept this is happening okay?</p>\n<p><strong>10/1: Hot Action Cop</strong></p>\n<p><iframe src=\"https://www.youtube.com/embed/QAURo0rwt6g\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe></p>\n<p>Death and sex are the most primal human experiences and have inspired some of the greatest works known to humans. Yet, if you were to analyse the canon, there is far more quality work on the former. With the Nobel Prize in Literature now open to musicians though, the balance can be re-addressed. Pop and rock music is synonymous with sexuality, but there’s a group that stands above the rest, primed and ready to burst open the dams of repression and dowse the bone-dry world of books with a rush of raw promiscuity. Their name? Hot Action Cop.</p>\n<p>Let’s delve into their poetry:</p>\n<p><em>Do you think that I can get some? (jiggy jiggy)</em><br />\n<em> Maybe just a little finger (sticky sticky)</em></p>\n<p>Notice how the rhyming couplet has a sense of onomatopoeia, activating the senses of the reader so it almost feels as though we are personally asking if we can fingerbang a complete stranger.</p>\n<p><em>She got the power of the hoochie</em><br />\n<em> I got the fever for the flavour of the coochie</em></p>\n<p>Observe how the group insert a colloquial tone into this excerpt with the rhyme of “hoochie” and “coochie”, echoing the primal nature of this desire. On top of this this, who among us has never had a “fever for [a] flavour”, a phrase made even more powerful by alliteration.</p>\n<p><em>Oh hey hey hey hey hey hey oh pretty pretty shy whoop, whoop</em></p>\n<p>What we have here is a classic epizeuxis. Do you know who also used this technique? Shakespeare. Just check out this line from Macbeth: “O horror, horror, horror.” Case closed.</p>\n<p><strong>5/1: El Mudo</strong></p>\n<p><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/wvkHIZg_954\" frameborder=\"0\" allowfullscreen></iframe></p>\n<p>The Tower Of Babel is a biblical tale that explains the evolution of language. The story states that humanity originally spoke a universal language, but, when people tried to build a city to reach heaven, God struck, scattering them across the globe and forcing them to speak different tongues. Well, I have it on good faith that El Mudo has broken this curse and discovered humanity’s original tongue.</p>\n<p>The written word has always been bound by the language of its creation. A translation will never quite replicate the nuances and meanings of the original script, making awarding a Nobel Prize in Literature fraught with difficulties. Not any longer.</p>\n<p>Chacarron Macarron is what Gottfried Leibniz searched for in vain, while attempting to sum up human thought in mathematics. Chacarron Macarron is what L. L. Zamenhof dreamed of when he invented Esperanto. Chacarron Macarron is what John Lennon wished he wrote instead of Imagine. Chacarron Macarron is the reason El Mudo deserves a Nobel Prize in Literature.</p>\n<p><strong>3/1: U2</strong></p>\n<p><iframe src=\"https://www.youtube.com/embed/19KstSgU-c0\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe></p>\n<p>Did you ever watch the first Tomb Raider in the cinema? If so, I guess you’ll have had the same experience.</p>\n<p>The credits start rolling. You stretch slightly, then place hands on the stiff, plastic armrest, pressure spreading through your palms as you prepare to heave yourself up, but something happens. Three notes buzz on a bass, it throbs in your chest, you stop as stirs in you, then a voice, a heavenly, lilting voice, cries “EL-E-VA-TION”.</p>\n<p>“Ohhhh oh,” it goes. Then again: “Ohhhh oh oh.” Powerchords chug underneath and you say to yourself “this is it, THIS is it.” It’s as though you’ve lived life in black and white, but everything has just burst into glorious technicolor.</p>\n<p>The guitar drops out, drums skitter and you realise someone is talking to you, directly to you, telling you things you’ve always known, things you’ve felt deep down, but were unable to vocalise. “Yes,” you say, “I have lost all self-control, I have been living like a mole.” Your mouth opens in an imitation of a python and you pull all the available air down your throat to the bottom of you your lungs, holding it there for a moment before, with all the force you can muster, screaming “EX-CA-VA-TION.” A mother glances over her shoulder and quickly ushers her child out of the cinema, but you barely notice.</p>\n<p>You’re standing now, bug-eyed, mouthing wildly, sweat is trickling down the nape of your neck and your arm hair is at attention. “Tell me, talk to me” you say, “I have to know, I must know” The thirty-foot tall Bono seems to hear you, leering from the screen, he fixes you behind those sunglasses, somehow staring further into you than you thought possible, you can’t see his pupils, but you can feel them. The song seems louder than before. More intense. Apart from his voice. It sounds as though he’s whispering, lips almost tickling your earlobe, you hear every word as though they were written for you, he says “it’s like a mole, living in a hole, is digging up my soul.”</p>\n<p>The next thing you know, you’re lying down, your mother is standing above you, your hand in hers, with bloodshot, puffy eyes, she strokes your hair and tells you everything is going to be okay and you’re safe now. You’re finally safe.</p>\n","slug":"32851-feature-whos-next-line-nobel-prize","category":"editorials","date":1476456572000,"wpid":32851,"isSticky":false,"featured_image":null,"createdAt":1587279982772,"updatedAt":1588442050720,"author":"5e9b68b27a1236eccfeb1d11","old_image":"2016/10/nobelprize.jpg","categories":["editorials","music","opinion"]}