{"id":"5e9bf8638fb2d30d7769c9fb","artists":["5e9b69517a1236eccfeb25ec"],"title":"Man vs. Video: The Avalanches – Because I’m Me","content":"<p><span style=\"font-weight: 400;\">Just like Mark Morrison’s The Mack, the return of the Avalanches was something you didn’t think would actually happen.</p><p> After sixteen long years, the sample-happy Australians careened back into public view with their album </span><i><span style=\"font-weight: 400;\">Wildflower</span></i><span style=\"font-weight: 400;\">. While largely enjoyable, and aside from the occasional guest verses, there wasn’t anything radically different on show from their first effort, the seminal </span><i><span style=\"font-weight: 400;\">Since I Left You</span></i><span style=\"font-weight: 400;\">.</span></p>\n<p><span style=\"font-weight: 400;\">Now the group has released its fourth single from the album, ‘Because I’m Me’, and put out an accompanying video. So far, so normal. Yet the joy of music videos is they allow artists to visually express themselves in a way that can augment their music. It can give you a glimpse into a song, without focusing solely on the track itself, colouring your understanding of it. At times, they can also reveal an inner truth about an artist, giving the watcher a glimpse into something bigger. This is what’s happened with ‘Because I’m Me’.</span></p>\n<p><span style=\"font-weight: 400;\">Let’s start right at the beginning: the plot. A young boy, Wallace, tries to put money on a travel card, is denied this by the attendant, an older girl he is seemingly in love with named Becky. He then puts together an extended song and dance routine she ignores, all while accompanied by a brass band and a mysterious gentlemen with a toothpick, who’s hopefully not a paedophile. Eventually, this comes to a close with a giant inflatable heart bursting out his jacket and a look of derision on Becky’s face. End.</span></p>\n<p><span style=\"font-weight: 400;\">Catch it here:</span></p>\n<p><iframe src=\"https://www.youtube.com/embed/eu0KsZ_MVBc\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe></p>\n<p><span style=\"font-weight: 400;\">To get to the bottom of the video, it’s important to understand how the Avalanches make their music. Generally, they take snippets of different songs and then mould them together, creating something new, but at the same time familiar. This musical approach is adopted visually by the video’s director, Greg Brunkalla, in ‘Because I’m Me’.</span></p>\n<p><span style=\"font-weight: 400;\">Firstly, the setting. The base and propulsive element of ‘Because I’m Me’ musically is the funk-infused brass track, which is lifted from <a href=\"https://www.youtube.com/watch?v=IkJGSnRB9RM\" target=\"_blank\">a 1969 single by a Los Angeles group, Honey Cone, called ‘Want Ads’</a></span><span style=\"font-weight: 400;\">. Brunkalla then reflects the seventies in the video. You can see it in the colours. Look at the whole washed-out, but warm yellow-tinge that’s smothering everything. It couldn’t be more of this era if it was shouting at you from a burning oil drum on street corner wearing flared jeans with a bad cocaine habit holding a stiletto. This could be a coincidence, but the whole thing is eerily similar to Baz Luhrman’s recent work, The Get Down. Hell, we should probably call this whole visual effect The-Get-Down-Filter from now on.</span></p>\n<img class=\"alignnone size-medium wp-image-32915\" src=\"https://api.crackintheroad.com/images/2016/11/Get-Down-Photo-300x180.jpg\" alt=\"get-down-photo\" width=\"300\" height=\"180\" srcset=\"https://api.crackintheroad.com/images/2016/11/Get-Down-Photo-300x180.jpg 300w, https://api.crackintheroad.com/images/2016/11/Get-Down-Photo-768x461.jpg 768w, https://api.crackintheroad.com/images/2016/11/Get-Down-Photo-1024x614.jpg 1024w, https://api.crackintheroad.com/images/2016/11/Get-Down-Photo.jpg 1125w\" sizes=\"(max-width: 300px) 100vw, 300px\" />\n<p><span style=\"font-weight: 400;\">This harking back to past eras and TV shows is nothing new in music videos, with <a href=\"https://www.youtube.com/watch?v=kemivUKb4f4\" target=\"_blank\">Weezer’s ‘Buddy Holly’</a> immediately springing to mind. The trend of reaching deep inside the past like a veterinarian does a horse continues throughout ‘Because I’m Me’. Take its central themes for example: dancing and unrequited love. The former is something that has been integral to music videos since day one, playing a primary role in almost every major pop music video from the last thirty-odd years, while if the latter didn’t exist Morrissey might’ve not had much of a career. Both deeply embedded, both expected, but not much new.</span></p>\n<p><span style=\"font-weight: 400;\">Let’s zero in on the opening scene:</span></p>\n<p><iframe class=\"giphy-embed\" src=\"//giphy.com/embed/QErhfHOdsJkoE\" width=\"480\" height=\"270\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe></p>\n<p><span style=\"font-weight: 400;\">I’m sure I’ve seen a tracked shot of someone strutting in a seventies style before…</span></p>\n<p><iframe class=\"giphy-embed\" src=\"//giphy.com/embed/s7HFTDZY2FeI8\" width=\"480\" height=\"360\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe></p>\n<p><span style=\"font-weight: 400;\">Ah, of course.</span></p>\n<p><span style=\"font-weight: 400;\">This aren’t the only tropes that crop up in the video though. The underground setting is a favourite of directors, as it can be shot at any time of day, lit in any way they desire and hired for very little money compared to other spaces. One of the most famous examples of this has to be <a href=\"https://www.youtube.com/watch?v=dsUXAEzaC3Q\" target=\"_blank\">Michael Jackson’s ‘Bad</a>’.</span><span style=\"font-weight: 400;\"> The Avalanches themselves seem to have a thing for subway systems </span><a href=\"https://www.youtube.com/watch?v=bPIMfOIuEe4\"><span style=\"font-weight: 400;\">as a video for their previous single ‘Subways’</span></a><span style=\"font-weight: 400;\"> is all about a subway. Surprisingly.</span></p>\n<p><span style=\"font-weight: 400;\">Another throwback trope is the appearance of a brass band playing behind someone dancing, just like in Gwen Stefani’s ‘Hollaback Girl’. But, you know, minus all of that Harajuku Girls nonsense. </span></p>\n<p><iframe class=\"giphy-embed\" src=\"//giphy.com/embed/SS1A14pCNtLzy\" width=\"480\" height=\"360\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe></p>\n<p><span style=\"font-weight: 400;\">This is where we hit the stumbling point in ‘Because I’m Me’. All we have up to this point is a combination of tropes and a plot that has popped up in countless music videos. Yes, the video is a heartwarming, nostalgic journey, but it’s something that’s been done many times before. The question then is if there’s a reading we can take that causes this amalgamation to appear ‘new’.</span></p>\n<p><span style=\"font-weight: 400;\">The first point of call considering this is the rap verse from Camp Lo’s Sonny Cheeba. Unfortunately, doesn’t hold up as a modern reading for two main reasons:</span></p>\n<p><span style=\"font-weight: 400;\">a) Camp Lo hit peak popularity in the late nighties</span></p>\n<p><span style=\"font-weight: 400;\">b) While a rap verse on a pop track was exciting and new in the early 2000s, it’s now become the genre’s version of a guitar solo on a rock song</span></p>\n<p><span style=\"font-weight: 400;\">No joy here, but there is another part of the ‘Because I’m Me’ video that you could view as utterly modern, if you overanalyse it of course: the complete disregard for the innocence, purity and exuberance of a child.</span></p>\n<p><span style=\"font-weight: 400;\">When our main character, Wallace, approaches the window to put a dime on a travel card, he is admonished by the ticket office attendant, Becky. While this plot strand is never truly resolved (at no point is it revealed whether said Wallace managed to achieve his travel plans or exactly why Becky was unable to put that money onto the card), we do get a slice of modern nihilism here.</span></p>\n<p><span style=\"font-weight: 400;\">After complimenting Becky’s hair, Wallace tries to impress her through the seductive power of dance. Look at these moves:</span></p>\n<p><iframe class=\"giphy-embed\" src=\"//giphy.com/embed/w0a2PZ0Rrw7yo\" width=\"480\" height=\"270\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe></p>\n<p><span style=\"font-weight: 400;\">Undoubtedly, that’s impressive. If you don’t think so, I’d like to see you do better. If I’m honest, my dancing can only be described as taser-chic; a grouping of jerky, uncoordinated moves culminating in a  flailing limbs. While the above? Smooth as Vin Diesel’s scalp. Ask yourself this: how would you react to the above? A smile? An appreciative nod? Or would your expression be like this:</span></p>\n<p><iframe class=\"giphy-embed\" src=\"//giphy.com/embed/UyHKHpwR2xhrW\" width=\"480\" height=\"270\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe></p>\n<p><span style=\"font-weight: 400;\">That’s the face you make when someone sits next to you on the bus and you get a whiff of the cloying, ammonia rich scent of stale piss. That’s the face you make when a friend tells you that Milo Yiannopoulos actually has some pretty strong points. That’s the face you make when you step in dogshit. That’s probably not the face you make when a young teen shows you some fine dance moves. That is a modern, social media-tainted emotion.</span></p>\n<p><span style=\"font-weight: 400;\">We get to visit this face again when young Wallace pulls the old inflatable heart trick.</span></p>\n<p><iframe class=\"giphy-embed\" src=\"//giphy.com/embed/f7npwfuyPCL28\" width=\"480\" height=\"270\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe></p>\n<p><span style=\"font-weight: 400;\">In seriousness, this negative indifference from Becky isn’t too dissimilar from a gamut of other videos covering the old unrequited love trope. So what about the inflatable heart? You could call this a break from old music videos, where this was maybe too costly to be feasible, but instead it’s more reminiscent of when <a href=\"https://en.wikipedia.org/wiki/Pink_Floyd_pigs\" target=\"_blank\">Pink Floyd had giant inflatable pigs above live performances</a>.</span><span style=\"font-weight: 400;\"> It’s unlikely this is a direct reference to this specific event, it’s more of a proof point that even when the ‘Because I’m Me’ is trying to break with traditions of the past, it just ends up rehashing them.</span></p>\n<p><span style=\"font-weight: 400;\">In all honesty, the video for ‘Because I’m Me’ could actually work as metaphor for the Avalanches’ comeback. In the time from </span><i><span style=\"font-weight: 400;\">Since I Left You’s </span></i><span style=\"font-weight: 400;\">original success, things have changed. At the time, access to huge amounts of music was novel and the technology to splice it together was in its infancy. The Avalanches took mash-up culture and combined it with a DJ Shadow-esque approach to music making to create something truly otherworldly and, importantly, new. In the sixteen years between their debut album and </span><i><span style=\"font-weight: 400;\">Wildflower </span></i><span style=\"font-weight: 400;\">though</span><i><span style=\"font-weight: 400;\">,</span></i><span style=\"font-weight: 400;\"> music has progressed. What once was revolutionary has now become a widely heard and admired part of popular culture.</span></p>\n<p><span style=\"font-weight: 400;\">This is where the parallels lie. While both this video and </span><i><span style=\"font-weight: 400;\">Wildflower </span></i><span style=\"font-weight: 400;\">are hugely enjoyable, they lack that little bit of excitement, of genuine innovation that would mark them out as great. They have the same ingredients and make a very tasty meal, but are missing the topping that brings the whole thing together.</span></p>\n","slug":"32912-man-vs-video-avalanches-im","category":"editorials","date":1478273222000,"wpid":32912,"isSticky":false,"featured_image":null,"createdAt":1587279971147,"updatedAt":1588442050504,"author":"5e9b68b27a1236eccfeb1d11","old_image":"generated/6960f13b64bb243783bb8baad27b1214d5c2388d.jpg","categories":["editorials","music","opinion","videos"]}