{"id":"5e9c34739b6559241525e21c","title":"Film Review: The Ghost Writer","content":"<p><a href=\"https://admin.</p><p>crackintheroad.com/uploads/2010/04/theghost.jpg\"><img class=\"aligncenter size-full wp-image-331\" src=\"https://api.crackintheroad.com/wp-content/uploads/2010/04/theghost.jpg\" alt=\"\" width=\"649\" height=\"431\" srcset=\"https://api.crackintheroad.com/images/2010/04/theghost.jpg 570w, https://api.crackintheroad.com/images/2010/04/theghost-300x200.jpg 300w, https://api.crackintheroad.com/images/2010/04/theghost-494x329.jpg 494w, https://api.crackintheroad.com/images/2010/04/theghost-165x110.jpg 165w\" sizes=\"(max-width: 649px) 100vw, 649px\" /></a></p>\n<p>Roman Polanski’s latest picture The Ghost Writer could perhaps be his most personal to date, as he adapts Robert Harris’s bestseller in a way that is both gripping and understated. The subject matter itself, audaciously first explored in Robert Harris’s novel, surrounds a former Prime Minister’s fall from grace and ultimately his voluntary house arrest. Obvious parallels with Polanski’s own life aside, it will undoubtedly be the films resemblances to Tony and Cherie Blair that draw the headlines.</p>\n<p>The film however is more than a simple political satire; beneath the obvious real life references and depictions is a solid Hitchcockian style thriller that simmers under the surface before eventually showing its teeth. The film has the confidence to plod while never being too slow, allowing us to soak in the political intrigue rather than being overwhelmed. Although self-contained and subtle, there was a danger that the two central male performances could become stagnant and underwhelming, however Polanski’s ability not to over direct has actually given both the characters and the acting a level of believability. McGregor plays a ghost writer employed to write the memoirs of the soon to be disgraced former Prime Minister Adam Lang (Brosnan), after the PM’s original writer supposedly commits suicide. McGregor’s character’s underlining mediocrity is ultimately what draws us into the film; he pulls off the lonely writer with ease, with every discovery made believable while never creating a character above the situation he is in.</p>\n<p>Lang and his wife Ruth (Olivia Williams) are also engaging in their ability sink slowly into their roles. Brosnan creates a duality for Lang’s character never allowing us to understand how in control of the situation he is. Brosnan’s gentle smile’s and forced rhetoric suggest a man that is more an actor than a politician, but the role is never simply surface as Brosnan’s underlining perverseness simmers under the characters surface.</p>\n<p>The Ghost is my no means the greatest thriller ever conceived, however great pacing a sharp script and two exceptional performances from McGregor and Brosnan are undeniable. This and the film exceptional score, quietly intense atmosphere and simple washed out aesthetic, give the film a degree of class that elevates it to greatness.</p>\n<p style=\"text-align: center;\"><a href=\"https://www.youtube.com/watch?v=L_AerBW0EcI\">Watch The Trailer</a></p>\n","slug":"330-the-ghost-writer","category":"arts","date":1271609278000,"wpid":330,"isSticky":false,"featured_image":{"width":570,"height":380,"src":"2010/04/theghost.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAQH/8QAIxAAAQIFAwUAAAAAAAAAAAAAAQMFAAIEERIGITEVIjJxgf/EABQBAQAAAAAAAAAAAAAAAAAAAAL/xAAXEQEBAQEAAAAAAAAAAAAAAAABAAIS/9oADAMBAAIRAxEAPwDMWLWHW121nUpkJFCoSale5xmOBvLiLjwI++4sdK/Uzc51dEWFqJplp0TlPke2Yjc578cwhAcgy6Uv/9k="},"createdAt":1587295347209,"updatedAt":1588403568861,"author":"5e9b68b27a1236eccfeb1d24","old_image":"2010/04/theghost.jpg","categories":["arts"]}