{"id":"5e9c32c39b6559241525df5c","title":"Art Review: Damián Ortega -The Independent","content":"<p>This September <strong>Damián Ortega</strong> began a creative expedition; he aimed to create a piece of sculpture every day for a whole month.</p><p> Quite a challenge, however cynics excavated a problem relatively quickly: can the human brain, wonderfully creative or otherwise stand the test of such sustained pressure. In terms of <strong>Damián Ortega’s</strong> work at the Barbican this month, the results are mixed but exciting nonetheless.</p>\n<p><strong>Damián Ortega</strong> is one of the leading sculptors of his generation. His Barbican commission follows important solo shows at ICA Boston (2009) and Centre Pompidou (2008), White Cube (2007) and Tate Modern (2005). Again the results are mixed, but rather than drawing a line between the work it oddly draws a divide between it’s audience. The pieces are reactions to world issues taken from a newspaper every day, some create obvious visual narratives; one piece for example involves an old disheveled bicycle being piled with luggage to an unnatural height. The sense of narrative and humour is strong; some of the pieces however aren’t so obvious. A cast of an inside of a barrel and a wall surrounded by eggshells for example all involve more effort. What should be respected throughout the exhibition however is the time taken to create each piece, rather than creating an allowance for the work if anything it makes it more awe inspiring. The works are liberating in their free instant wonderfully experimental feel; this really is an artist’s exhibition in places. Still, when reading the newspaper cut outs that accompany the pieces the works become more than structural explorations or simple pieces of artistic comedy. A cigarette plane becomes a comment on global warming, the barrel cast a comment on a global tragedy; in short the success of this exhibition is down to you.</p>\n<p><a href=\"https://www.barbican.org.uk/\">Check out the Barbican’s Website</a></p>\n<p><em>Damián Ortega’s The Independent runs until the 16th of January at The Barbican.</em></p>\n","slug":"3301-damian-ortega-the-independent-the-barbican","category":"reviews","date":1288361515000,"wpid":3301,"isSticky":false,"featured_image":{"width":760,"height":457,"src":"2010/10/screen-shot-2010-10-29-at-16.08.27.png","placeholder":"data:image/jpeg;base64, iVBORw0KGgoAAAANSUhEUgAAAAoAAAAGCAIAAAB1kpiRAAAACXBIWXMAAAsTAAALEwEAmpwYAAAAw0lEQVR4nGPwcHN283B1dLLzcrXxcLYMCXKrLEmeMbV14ZyubRvnMNiaG9jbWerp6ajzMLgayBsZ65oYaelqq5ka68bFhjK4OFo6ONpYmhsGWyvH+loaGuk6Olo52pvZmeva2tkwWFubW9taWFmbhwY5+/o42tiYurvZeXs7h4b5+/p7Megb6OjoqmtrqyfGeIWHeFiYans6m/oH+CSnJSSlxjMYGOgqKskqqyhkJfuHBbtbWRh5ezv5B3hVVRW0NlcAABJDMWIZkG8yAAAAAElFTkSuQmCC"},"createdAt":1587294915571,"updatedAt":1588403562890,"author":"5e9b68b27a1236eccfeb1d24","old_image":"2010/10/screen-shot-2010-10-29-at-16.08.27.png","categories":["reviews","arts"]}