{"id":"5e9c34449b6559241525e1d3","artists":["5e9b68e07a1236eccfeb1f35"],"title":"Review: Crystal Castles – Crystal Castles","content":"<p>Crystal Castles have been epitomized as the band by which all Nu-Rave and electronic bands thereafter shall be judged by.</p><p> However to label them as such would be undermining their work, their experimental lo-fi sound coupled with shows that still manage to feel grimy and underground despite being held in sold out concert venues says a lot about the strength of their two man act.</p>\n<p>From auspicious beginnings in which a sound check by Alice became a 7″ Single, through to remixing the music of their contemporaries such as HEALTH & Klaxons; the band began to accumulate an ever increasing devoted fanbase. This in turn led to the release of the 2008 self titled Crystal Castles album, while hailed as genre defining and ushering in a whole new generation of bands and fans, the album itself was dissappointing, consisting mainly of a ramshackle repackaging of old 7″ singles and EPs giving the whole thing a disjointed imbalanced feeling.</p>\n<p>Now, more than half a decade on from their original recordings Ethan & Alice return with new material in the form of a second self titled album. Don’t be fooled by the same name however, as tracks such as ‘Vietnam’ show that Crystal Castles have moved on from there stripped down lofi sounds of yesteryear, into fuller, more ambient sounding directions. Longtime fans need fear not though as tracks such as ‘<a href=\"https://api.crackintheroad.com/uploads/2010/05/Doe-Deer.wav\">Doe Deer</a>‘ contain the familiar screaming and 8-bit abstractness of the old releases, while still managing to up the tempo another notch. ‘Year Of Silence’ manages to be, perhaps, the most unexpected song on the album. Gone are the days of Ethan sampling contemporary artists such as Van She or Death From Above 1979, here he samples Sigur Rós’ Inní mér syngur vitleysingur to great effect changing it from a mellow experience into a rather more haunting journey.</p>\n<p>Nearly two years on from their last UK tour, Crystal Castles have announced a fresh set of dates today;<br />\n* 08 Oct 2010 – Belfast, Mandela Hall<br />\n* 09 Oct 2010 – Dublin, Academy<br />\n* 11 Oct 2010 – Wolverhampton, Wulfrum Hall<br />\n* 12 Oct 2010 – Bournemouth, 02 Academy<br />\n* 15 Oct 2010 – London, Roundhouse<br />\n* 16 Oct 2010 – Bristol, Academy<br />\n* 18 Oct 2010 – Liverpool, Academy<br />\n* 19 Oct 2010 – Glasgow, ABC<br />\n* 20 Oct 2010 – Nottingham, Rock City<br />\n* 22 Oct 2010 – Manchester, Academy<br />\n* 23 Oct 2010 – Leeds, Metropolitan University<br />\n* 24 Oct 2010 – Norwich, UEA</p>\n<p>With the physical release of their second album now less than a month away, and if the Record Store Day selling out of their Doe Deer EP are anything to go by, this looks set to be a sold out tour, so get aboard the bandwagon early while there’s still room!</p>\n<p><a href=\"https://www.myspace.com/crystalcastles\">Try</a><br />\n<a href=\"https://crystalcastles.com/\">Buy</a></p>\n","slug":"333-crystal-castles","category":"music","date":1272986067000,"wpid":333,"isSticky":false,"featured_image":{"width":165,"height":165,"src":"2010/05/crystal_castles-165x165.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAABgMH/8QAIRAAAgEEAgIDAAAAAAAAAAAAAQMCBAUREgAhMUETYXH/xAAUAQEAAAAAAAAAAAAAAAAAAAAE/8QAGxEAAgIDAQAAAAAAAAAAAAAAAQIABAMRISL/2gAMAwEAAhEDEQA/AMcebpW3BT7otKaqSe5RgFCeMgSIAAyR7x3xmi0pelbTbfkLIiW4rmREsjOcbdfnAtwe436605aw06rq0LUZHWA3n4Hgci+cg5gEpAbH398JlsOG8cj1oYrCjZI1P//Z"},"createdAt":1587295300359,"updatedAt":1588403568240,"author":"5e9b68b27a1236eccfeb1d25","old_image":"2010/05/crystal_castles-165x165.jpg","categories":["music","reviews"]}