{"id":"5e9c32c29b6559241525df59","artists":["5e9b68f27a1236eccfeb201e"],"title":"Interview: Evenings","content":"<p><span style=\"color: #000000;\">Piecing together beautiful, eclectic instrumental soundscapes, <strong>Evenings</strong> contains a vivid textural quality, unlike much else around at the moment.</p><p> Fusing hazy beats with otherworldly sounds, it’s the perfect music to become fully immersed in. With the generous free download release of <em>North Dorm EP</em> earlier this year, <strong>Evenings </strong>is setting his sights upon a full length album release, as he told <em><strong>Crack in the Road </strong></em>in our interview with him.</span></p>\n<p><em><span style=\"color: #000000;\">CitR: How did Evenings come about?</span></em></p>\n<p><strong>I bought an audio interface when I was about 15 and started tinkering with a lot of bootlegged software. Back then I was mostly recording acoustic guitars or miking amps with the same crappy condenser microphone I use now. During high school I played guitar in a band called “goonies”, and towards the end we started playing instrumental Mogwai-ish stuff. Once I got to college I started doing my own thing.</strong></p>\n<p><em>CitR: In terms of inspirations, what would you site as your main, both musically and otherwise?</em></p>\n<p><strong><span style=\"color: #ff0000;\"><span style=\"color: #000000;\">I really don’t think I could put my finger on one main musical inspiration.  I think i spend the majority of my time listening to music.  I’ll tell you that I love Air and Bibio.  Generally the inspiration comes from how I’m feeling. That’s vague. But sometimes I’ll obsess over something and I just have to do something about it or I’ll freak out.</span></span></strong></p>\n<p><em>CitR: How did you go about recording your debut EP release North Dorm?</em></p>\n<p><strong>Using a laptop. A lot of it was recorded in a dorm room last winter and spring, and I finally finished it all last summer.</strong></p>\n<p><em>CitR: What can we expect from Evenings in the future, in terms of releases?</em></p>\n<p><strong>Hopefully an album eventually.  I’m going to be playing live really soon so it’s hard to get as much done as I’d like.  Being in school right now is also kind of horrible. All I ever think about is not being in school.</strong></p>\n<p><em>CitR: Why did you decide to give away your North Dorm EP for free?</em></p>\n<p><strong>Well, I know that I don’t like paying for downloads.  If I’m going to pay for something I usually want a physical copy.  No one had ever heard of me, so I figured that giving it away for free was the best way for people to actually hear the music..which is all I really care about.</strong></p>\n<p><em>CitR: What equipment do you use to create your music?</em></p>\n<p><strong>MPCs, APCs, Guitars, reel, some midi/osc controllers, interface, Macbook pro, and I sample a lot of old synths and drum machines. I have a Yamaha SK15 that I really like, I think it’s been kind of overlooked in analog synth world. Yard sales.</strong></p>\n<p><em>CitR:What was the first record you can remember falling in love with?</em></p>\n<p><strong>Stop Making Sense.</strong></p>\n<p><em>CitR: If you could create a track with any celebrity (alive or dead), who would it be?</em></p>\n<p><strong>John Malcovich, because he’s fucking crazy.</strong></p>\n<p><em>CitR: If you could have any super power, what would it be?</em></p>\n<p><strong>Ah. There are so many to choose from. Hmm. Time Travel. I wish I could go back.</strong></p>\n<p><em>CitR: Cheers Nathan!</em></p>\n<p style=\"text-align: center;\"><a href=\"https://www.myspace.com/eveningsounds\"><span style=\"color: #ff0000;\"><span style=\"color: #000000;\">Check Out Evenings on Myspace!</span></span></a></p>\n<p style=\"text-align: center;\"><span style=\"color: #ff0000;\"><span style=\"color: #000000;\"><a href=\"https://evenings.bandcamp.com/\">Free Download of North Dorm EP via Bandcamp!</a><br />\n</span></span></p>\n<p> </p>\n","slug":"3332-interview-evenings","category":"interviews","date":1288805287000,"wpid":3332,"isSticky":false,"featured_image":{"width":900,"height":342,"src":"2010/11/evenings.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAEAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAIH/8QAIhAAAQMDAwUAAAAAAAAAAAAAAQIDBAAGEQcSIQUUYZGh/8QAFQEBAQAAAAAAAAAAAAAAAAAAAgP/xAAWEQEBAQAAAAAAAAAAAAAAAAAAARH/2gAMAwEAAhEDEQA/AJ0tgt3lA6FDuByRKZclPRyVPKKghLaVAAk8cj6a0CXozavdvbROSN6sAPA458pz7pSjapj/2Q=="},"createdAt":1587294914064,"updatedAt":1588403562863,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2010/11/evenings.jpg","categories":["interviews","music"]}