{"id":"5e9c32969b6559241525df08","artists":["5e9b68da7a1236eccfeb1e9d"],"title":"Interview: British Sea Power","content":"<p><a rel=\"attachment wp-att-3355\" href=\"https://admin.</p><p>crackintheroad.com/music/3354-interview-british-sea-power/attachment/british-sea-power\"><img class=\"alignnone size-totallysizedforever wp-image-3355\" title=\"British Sea Power\" src=\"https://api.crackintheroad.com/uploads/2010/11/British-Sea-Power-740x746.jpg\" alt=\"\" width=\"740\" height=\"746\" /></a></p>\n<p>Known for their unusual gig destinations and, for anyone who reads their blogs, their immense quick-wittedness almost as much as their music which has spanned nearly a decade, <strong>British Sea Power</strong> are back again after ‘renting a house in the middle of nowhere to make music’ with a new EP, <em>Zeus</em>. <em>Do You Like Rock Music? </em>Is over two years old now and despite it reaching no. 10 in the album chart and also being nominated for the Mercury Prize the band felt no need to rush any new releases, instead focussing on creating an album not designed for chart success but as a soundtrack to a documentary. So the highly anticipated new release, a ‘Maxi’ EP as opposed to a full album has now hit the shelves with the expectation of a new album very early in 2011. The music itself is typically BSP but perhaps more complex, with highs that peak majestically and lows that plumb the ocean all of which would make a fan restless for the album release.</p>\n<p><strong>British Sea Power </strong>played an outstanding gig at The Doghouse in Dundee on 28<sup>th</sup> September, including songs from their new release and although perhaps not as eccentric as they perhaps were in their youth, what they lacked in ridiculous actions they made up for entirely in a grown-up and established performance which put across their music much better than perhaps in previous years. Luckily for CitR we managed to have a lengthy chat with the lead singer, Jan Scott Wilkinson (aka Yan) about everything BSP.</p>\n<p>Adam: From what I’ve seen of your past gigs, you usually do gigs in unusual destinations, well you’ve been on mull, is there any reason behind this or is it just coincidence? Do you like playing in smaller venues?</p>\n<p><strong>Yan: it’s the closest we can get to fitting in a holiday, mostly…</strong></p>\n<p>Josh: Which places do you find you get the best reactions?</p>\n<p><strong>Yan: Well I don’t know, it’s load of fun playing in Ireland, they go mental. It’s usually…Mondays not so good, Thursday, Friday, Saturdays are good, those kind of people go mad for it.</strong></p>\n<p>Adam: So it’s more days of the week than where you are?</p>\n<p>Noble: Yeah, except China and Japan, they just go mad for it every night.</p>\n<p><strong>Yan: Yeah we’re supporting the Manics for the next few weeks, in England, start in Glasgow so just thought we’d put on a bit of a jaunt when we start really. Played Inverness the other night.</strong></p>\n<p><strong> </strong></p>\n<p>Adam: Ironworks was it?</p>\n<p><strong>Yan: Yeah, I think they liked it, they looked a bit confused, it was a Monday so…</strong></p>\n<p><strong> </strong></p>\n<p>Josh: How did you go about recording your new album? I saw that you’ve just finished mastering.</p>\n<p><strong>Yan: Yeah we’ve just completely finished it, just over a week ago now.</strong></p>\n<p><strong> </strong></p>\n<p>Noble: We didn’t really want to go to a studio, so we bought a load of gear and rented a farmhouse, and just recorded it ourselves.</p>\n<p><strong>Yan: We went for time over technology. It was a bit DIY really, we learnt a lot, did our own recording, kept the professionals away.</strong></p>\n<p>Adam: So you’ve learnt new skills I imagine?</p>\n<p><strong>Yan: Yeah I mean it wasn’t a brand new thing, we’ve done a lot of it before, started it with B-sides and stuff, then we did a few tracks on the last album, thought we might as well just do it all you know.</strong></p>\n<p><strong> </strong></p>\n<p>Adam: You did a B-side to your single Remember Me that was a cover of I Am A Cider Drinker by The Wurzels, why The Wurzels?</p>\n<p><strong> </strong></p>\n<p><strong>Yan: It was the first record I ever got.</strong></p>\n<p><strong> </strong></p>\n<p>Adam: Yeah I know you released 1966 of them as well to correspond with the date they founded.</p>\n<p><strong>Yan: Yeah he’s a good lad, we know them from doing that. We did a gig with them to tie up doing that, they came in, gave us all flagons of cider, and then challenged us to a tug of war in the car park! Which they won, which was a bit embarrassing.</strong></p>\n<p>Adam: They must be getting on a little bit as well…</p>\n<p><strong>Yan: Yeah but they had the weight advantage…</strong></p>\n<p>Josh: What were the reasons behind recording the soundtrack album? From an outsiders point of view it seems a bit strange, after having your biggest commercial success to then do an entirely instrumental album?</p>\n<p><strong>Yan: Well we got asked by the Edinburgh film festival to do something and that kind of just happened. Then we just thought that we’d put a lot of work in to it, and it would be a shame not to see it released. It was a one-off event that spiraled out of control, it was the first thing we ever did in the farmhouse as well.</strong></p>\n<p>Josh: Do you feel like you’ve learned much from that to take to the new album?</p>\n<p><strong>Yan: Yeah with both being recorded in the farmhouse we got to try out all the new gear, much of which we used for the new record, same with recording techniques. With the soundtrack, we recorded it and liked it, then kept being offered to play it at more and more places, playing gigs we wouldn’t normally expect to, like at film festivals in Europe. It’s got it’s own life I guess. It’s a lot more relaxing than playing a rock-type gig, you sit down for it and don’t even have to look at anyone, I just play the cello mostly.</strong></p>\n<p>Adam: So after ten years do you still enjoy touring?</p>\n<p><strong>Yan: Yeah personally I still do, it’s been a while since we last did, so I feel like I’ve forgotten a lot of elements. We took a bit longer than most people thought we were going to take.</strong></p>\n<p>Adam: Did you know you were going to take such a long period of time?</p>\n<p><strong>Yan: Nah I thought it would be easy! But you put a load of lads in a farmhouse and leave them to their own devices…</strong></p>\n<p>Josh: Any big parties?</p>\n<p><strong>Yan: It wasn’t really like that… it was only me that lived there, everyone else was back in Brighton. It was fucking quietest year and a half I’ve had in my life.</strong></p>\n<p>Josh: So I take it that the Zeus EP was recorded there as well?</p>\n<p><strong>Yan: Yeah, it was songs that we liked, but didn’t quite fit into what we wanted for the album, ended up being about forty five minutes of them! More a maxi-EP than a mini-album, there’s no real common feel through them, but they didn’t really fit on the album.</strong></p>\n<p>Josh: So none of them will feature on the album?</p>\n<p><strong>Yan: Just one, one of them that my brother sings, that everyone loved so much.</strong></p>\n<p>Josh: I gave the titled track of the EP as listen, in parts it’s slightly heavier than some of your previous work.</p>\n<p><strong>Yan: It’s a funny bunch of songs, none of them really sound alike. It wasn’t meant to be like a single, just a freebie.</strong></p>\n<p>Adam: What’s your link as a band with Canvey Island?</p>\n<p><strong>Yan: Similar to when we did the soundtrack, and ends up getting it’s own life. I wrote a song about a story I’d heard about Canvey Island and the floods, then we ended up getting the football shirts and doing a gig on the pitch! The football team ended up using it as their going on track. I like this band called Dr Feelgood, there’s been a good documentary about them recently, their guitarist came and joined us for the gig on Canvey Island, and had a game of football, they slaughter was, but we were a bit drunk… and they were professional athletes…</strong></p>\n<p>Adam: A number of bands have moved to Brighton recently, including yourselves, any reasons behind that?</p>\n<p><strong>Yan: I don’t think there’s many people from Brighton who live there! I’ve never really fancied London, it’s a bit big and a bit gritty and I don’t want to get stabbed. Brighton is like a small version, but you get all kinds of people there, every other person you meet is a musician, and they are all in about ten bands. I like the sea as well.</strong></p>\n<p>Josh: There’s some quite obscure references in some of your songs, where do they come from?</p>\n<p><strong>Yan: We just collect them, a bit like magpies I guess. I like songs that include the wider world in them, rather than just writing about how you are feeling, and how you are getting on with your girlfriend.</strong></p>\n<p>Josh: Is the new album in a similar sort of vein?</p>\n<p><strong>Yan: I can’t think of any history that is in there, it’s probably a bit more surrealist sci-fi. You know, your mind is your limit, in the cottage I had three weeks where I didn’t see a human being.</strong></p>\n<p>Josh: Were the songs all written out at the farmhouse, or just recorded there?</p>\n<p><strong>Yan: Nope, they were all written there, we just decided to experiment and see what happened really.</strong></p>\n<p>Josh: Are there any songs in particular that you really enjoy playing live?</p>\n<p><strong>Yan: Most of the unusual ones, there’s some we just don’t play ‘cus the sounds are too complex to do. The rock and roll ones, Spirit of St Louis, a few others like that. Atom is good as well, the higher energy tracks.</strong></p>\n<p>Josh: So what sort of music have you been listening to at the moment?</p>\n<p><strong>Yan: Lots of Serge Gainsbourg, got everything he ever did, takes about ten hours to listen to it. I’m not really that fussed with keeping up with new music, it’s too hard really, there’s always new stuff coming out.</strong></p>\n<p>Adam: Any new bands that you would recommend?</p>\n<p><strong>Yan: Umm… there’s a band called Esben & the Witch, from Brighton who are quite good, I’m friends with the singer. I’m always surprised when you have a friend and their band actually turns out to be good.</strong></p>\n<p>Josh: So can we expect a single from the album soon?</p>\n<p><strong>Yan: I think there’s going to be a single the same day the album comes out, around the start of January.</strong></p>\n<p>Crack in the Road: Thanks very much guys, we’ll look forward to the album!</p>\n","slug":"3354-interview-british-sea-power","category":"interviews","date":1291664045000,"wpid":3354,"isSticky":false,"featured_image":{"width":1586,"height":1600,"src":"2010/11/british-sea-power.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFwAAAwEAAAAAAAAAAAAAAAAABAUHCP/EACYQAAIBAgUCBwAAAAAAAAAAAAECAwQRAAUSEzEGURQhJTJEUtH/xAAUAQEAAAAAAAAAAAAAAAAAAAAD/8QAFhEBAQEAAAAAAAAAAAAAAAAAAgAB/9oADAMBAAIRAxEAPwC0xZhAlQKYGIv9RKNXutfT2tc4PipleJGdHjZgCUYC6nscY2qJ5oOgUnhlkjn8WibiMQ2ni1+bW8sJpc6zXcf1Ou5PyH/cATKsy//Z"},"createdAt":1587294870141,"updatedAt":1588403562166,"author":"5e9b68b27a1236eccfeb1d07","old_image":"2010/11/british-sea-power.jpg","categories":["interviews","music"]}