{"id":"5e9c32bb9b6559241525df4d","title":"The Vaccines @ York Stereo 11/11/10","content":"<p>A tiny sweaty room in Gillygate, York, with barely a hundred people lucky enough to get tickets, there is a palpable sense of ‘something big’ about to happen.</p><p>  The Vaccines are THE hype band of the now, already playing Jools Holland before a release, and only videos from iPhones to be found on Youtube.  Fronted by Justin Hayward-Young, formerly troubadour Jay Jay Pistolet, the four-piece are threatening to make high waisted school trousers and beige cool, whilst bringing a swaggering arrogance back to rock music that has been sorely tempered by the emotionless, synth dance revival.</p>\n<p>First though it’s gifted to Fawn Spots to open proceedings.  As a first gig for a band with 23 fans on Facebook, it’s fair to say this is a big deal.  Whilst obviously raw, the two students from York have heads turning at the bar, as they launch into a half hour set of grungey, garage rock, with a Sonic Youth-esque industrial feel.  Brooding, angry guitars over an unrelenting Blood Red Shoes drum base, this a passionate hark back to the late 80’s, in the best possible way.  It is very early days, but Fawn Spots are not following the typical protocols to popularity; they ooze personality and originality, make mistakes, and seem to enjoy what they’re doing.  They need to hone their sound, but they’re going the right way to at least gain a few more Facebook fans.</p>\n<p>Main support Blood Oranges have been hanging round Leeds for a while now, featuring on various Dance To The Radio compilations, and with the release of debut single ‘The French Word For Love’ on Rough Trade at the end of November, it appears they are ripe and destined to be plucked for wider success.  They play twee, indie pop, but with an edge; think lyrics like “we are the competition”.  There’s no love lost here; these aren’t dancey, brilliant pop songs just for the sake of it.  Though they are indisputably dancey, brilliant pop songs.  Obvious comparisons are there- Alphabet Backwards, Los Campesinos, Belle and Sebastian- but the Leeds four piece are more than a covers band, with ‘This Isn’t About Kat’ showing a wit and conceit which is welcome in our pop age of generic innocence and naivety.  As second years at Leeds University, they sound far more accomplished than seems fair, yet remain impossibly bashful and sweet on-stage.  Catch them while you can at Nation of Shopkeepers on the 24<sup>th</sup> of November, before it’s too late.</p>\n<p>And finally, with a more than aggressive hint of weed to accompany them on, The Vaccines take to the stage at five to ten, carrying the burden of authentic rock’n’roll on their shoulders.  They do not fail to set the room on fire.  ‘Post Break-Up Sex’ is set-opener, and is a heavy, rumbling number, deceptively complex with layered guitars and lightening drums, a quickly apparent staple of the band.  ‘All In White’ is a slower, confident track, and is followed by ‘If You Wanna’; straight from a Ramones<em> Greatest Hits</em>.  It’s becoming a lazy comparison, but the intensity of Hayward-Young, and the ballsy guitars write the reviews themselves.  They are making old school punk current and credible, with the climactic hooks and ridiculously anthemic choruses making epic not a genre solely reserved for Arcade Fire.  The worry before the gig was whether The Vaccines have the tracks to support upcoming single ‘Wreckin’ Bar (Ra Ra Ra)’ and this is a qualm absolutely demolished from the first chord of the set.  At just over a minute ‘Wreckin’ Bar’ encompasses everything brilliant about rock music, down to the perfectly restrained solo.  ‘Norgaard’ is the punkiest track, with Hayward-Young escaping his guitar to berate the audience, confrontationally leaning face to face with revellers.  This is repeated in arguable highlight ‘A Lack Of Understanding’, as he howls “you’re not ready”.  How wrong he is; this scene is crying out for The Vaccines, with closer ‘Blow It Up’ an accomplished, dreamy grunge classic.</p>\n<p>With tees for a fiver and sold by the band, this is a group having to come to terms with their inevitable enormity very fast, and they won’t be playing a venue this small again.  Believe the hype.</p>\n","slug":"3370-the-vaccines-york-stereo-111110","category":"music","date":1289574974000,"wpid":3370,"isSticky":false,"featured_image":{"width":606,"height":626,"src":"2010/11/the-vaccines.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAABwT/xAAgEAACAgEFAAMAAAAAAAAAAAABAwIEBQAREiFRBiIx/8QAFAEBAAAAAAAAAAAAAAAAAAAABP/EABkRAAMAAwAAAAAAAAAAAAAAAAABEQIDBP/aAAwDAQACEQMRAD8Ao+OZBmMzCk5Tg+8AplhVzkOEZEdR9OxB2Pmn5GQXNC5Jq2CoxBhuQOtutEOHxdB6EsfRqsYeP2mmJP56RpWrJVGsqMVwERAAARHXWj6XFB3Xiqmf/9k="},"createdAt":1587294907270,"updatedAt":1588403562763,"author":"5e9b68b27a1236eccfeb1d4c","old_image":"2010/11/the-vaccines.jpg","categories":["music","reviews"]}