{"id":"5e9c32b59b6559241525df41","title":"The Day We Had A Voice","content":"<p><a rel=\"attachment wp-att-3466\" href=\"https://admin.</p><p>crackintheroad.com/life/3383-the-day-we-had-a-voice/attachment/millbank\"><img class=\"alignnone size-full wp-image-3466\" title=\"millbank\" src=\"https://api.crackintheroad.com/uploads/2010/11/millbank.jpg\" alt=\"\" width=\"700\" height=\"467\" srcset=\"https://api.crackintheroad.com/images/2010/11/millbank.jpg 700w, https://api.crackintheroad.com/images/2010/11/millbank-260x173.jpg 260w, https://api.crackintheroad.com/images/2010/11/millbank-640x426.jpg 640w, https://api.crackintheroad.com/images/2010/11/millbank-165x110.jpg 165w\" sizes=\"(max-width: 700px) 100vw, 700px\" /></a></p>\n<p>With the dust now settled on the student ‘protest’ against planned education cuts and tuition fee rises, the natural instinct is to reflect in a way that just wasn’t possible so close to the event. Other publications seemed to have a problem with being quite so fair; the <strong>Daily Mail</strong> as always brought class and ‘youth hate’ into the equation with the <strong>Guardian</strong> rather more amusingly reveling in the revolution. I might as well make three things clear from the start; I was there, I did enter the Millbank building and I largely support the actions of those involved that day.</p>\n<p>I now realise I may have alienated half my audience, after all the images that emerged after the storming of the Millbank building weren’t exactly positive in their depictions of the modern student. Reports of a fire extinguisher being thrown from the roof, police brutality and a general disregard for the intended cause only made things worse. Now while doing my best not to sound like an annoying liberal revolutionary (I’m not I promise), I still feel like the protest has been misrepresented.</p>\n<p>Let us remember that the protest started peacefully with over 50,000 students, lecturers, teachers and parents lining the streets of central London all in the name of equal opportunities; it was inspiring to watch. What wasn’t however was the various other causes that were represented on the day. As we walked passed parliament we saw peace campaigners, a group calling for a fair inquest into 9/11 and <strong>UAF</strong> all fighting for our hearts and minds. On second glance the situation seemed a lot glummer, put simply this wasn’t just about education cuts, it was a reaction stemming from a genuine frustration towards our society and a government that is turning its back on half of its country. Couple this with the raw wounds of <strong>G20</strong> and the likelihood of this being a peaceful affair was slim. There was simply no other options.</p>\n<p>The general feeling on the day was a lot more mature than the media gave it credit for, the feeling of apathy was certainly there amongst a certain few, a criticism that appears to being coming from most camps, however on a general level the youth that turned up that day simply wanted to heard. The criticism of those involved in the ‘violence’ still rings true even a week later, rather than simply condemning this apparent minority the mainstream media seems more focused on the social class of the group, asking the question ‘did they even have the right to be there’? Take the <strong>Daily Mail’s</strong> headline the following day as an example <em><a href=\"https://www.dailymail.co.uk/news/article-1328385/TUITION-FEES-PROTEST-Anarchists-cause-chaos-50k-students-streets.html\">“Hijacking of a very middle class protest”</a>,</em><em>“</em> surely this reveals the problem in a nutshell, if the ‘uneducated’ don’t have a right to fight for an education system that has failed them then what chance do we have of improving this thoroughly unfair situation? Even the inclusion of the words ‘middle-class’ to me is both mocking and elitist in equal measure, something of a habit when it comes to the <strong>Daily Mail</strong>. Why shouldn’t the middle classes not be able to fight for fairness and equality within their own country, after all we’re not all like <strong>Daily Mail </strong>readers.</p>\n<p>So what next? In many ways the riot had a danger of derailing the movement but rather it’s seriously highlighted the extreme discomfort felt by the masses toward this coalition government. More importantly it unsighted fear within the government, a fear that if the horizon is to be believed could grow in the coming months with walkouts, more protests and flash-mobs just around the corner. At long last we have a voice.</p>\n<p><object id=\"flashObj\" classid=\"clsid:d27cdb6e-ae6d-11cf-96b8-444553540000\" width=\"370\" height=\"260\" codebase=\"https://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=6,0,40,0\"><param name=\"bgcolor\" value=\"#FFFFFF\" /><param name=\"flashVars\" value=\"videoId=672280565001&playerID=69900095001&playerKey=AQ~~,AAAAAEabvr4~,Wtd2HT-p_VhJQ6tgdykx3j23oh1YN-2U&domain=embed&dynamicStreaming=true\" /><param name=\"base\" value=\"https://admin.brightcove.com\" /><param name=\"seamlesstabbing\" value=\"false\" /><param name=\"allowFullScreen\" value=\"true\" /><param name=\"swLiveConnect\" value=\"true\" /><param name=\"allowScriptAccess\" value=\"always\" /><param name=\"src\" value=\"https://c.brightcove.com/services/viewer/federated_f9?isVid=1\" /><param name=\"name\" value=\"flashObj\" /><param name=\"flashvars\" value=\"videoId=672280565001&playerID=69900095001&playerKey=AQ~~,AAAAAEabvr4~,Wtd2HT-p_VhJQ6tgdykx3j23oh1YN-2U&domain=embed&dynamicStreaming=true\" /><param name=\"allowfullscreen\" value=\"true\" /><embed id=\"flashObj\" type=\"application/x-shockwave-flash\" width=\"370\" height=\"260\" src=\"https://c.brightcove.com/services/viewer/federated_f9?isVid=1\" name=\"flashObj\" allowscriptaccess=\"always\" swliveconnect=\"true\" allowfullscreen=\"true\" seamlesstabbing=\"false\" base=\"https://admin.brightcove.com\" flashvars=\"videoId=672280565001&playerID=69900095001&playerKey=AQ~~,AAAAAEabvr4~,Wtd2HT-p_VhJQ6tgdykx3j23oh1YN-2U&domain=embed&dynamicStreaming=true\" bgcolor=\"#FFFFFF\"></embed></object></p>\n<p><em>These are the views of Joel Chima and do not represent Crack In The Road as a whole.</em></p>\n","slug":"3383-the-day-we-had-a-voice","category":"life","date":1289877144000,"wpid":3383,"isSticky":false,"featured_image":{"width":700,"height":467,"src":"2010/11/millbank.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAAAAb/xAAfEAACAQQCAwAAAAAAAAAAAAABAgMABAYRITEFEmH/xAAVAQEBAAAAAAAAAAAAAAAAAAACBP/EABsRAQACAgMAAAAAAAAAAAAAAAEAAgMhEjFh/9oADAMBAAIRAxEAPwCUs/ZsYkNvLdxtCUaOTa6ZgdElQdAd8c9/KmWy/JVYqfLXuwdcTnVKUa04GnuUOduBYNeT/9k="},"createdAt":1587294901768,"updatedAt":1588403562661,"author":"5e9b68b27a1236eccfeb1d24","old_image":"2010/11/millbank.jpg","categories":["life"]}