{"id":"5e9c32b99b6559241525df4a","title":"Sleigh Bells @ Mine, Constellations Festival, Leeds 14/11/10","content":"<p>It is about to kick off .</p><p> The stage is decorated by two microphones, one drum machine, and fourteen amps.  With a wall of eight at the back, this is not one for the faint-hearted, and from the first, terrifying chord of ‘Tell ‘Em’, the tiny room is transformed into an aural battleground for the next forty minutes.</p>\n<p>Coming off like a sexy, heavy metal Beastie Boys at times, there is something primeval about Sleigh Bells, the collective name of Alexis Krauss and Derek E Miller.  <em>Treats</em>, the debut album out in March has been touted as an album of the year, and with a reputation for raucous live shows, the New York two piece don’t fail to impress.  It’s awkward to pigeon-hole their sound, which is the best compliment you can pay a band wading through the generic indie pool of the moment, but there are certainly hints of M.I.A. and The Kills, if they’d taken the “I’m going to abuse your ear drums” chaos pop route.  Whilst on paper, Sleigh Bells could be your average noise pop duo, using old school metal riffs over a drum machine to develop a dancey, thrash sound, the live show is far more than this; it is well worth the inevitable tinitis.</p>\n<p>Whilst the opening clearly sparks the willing crowd to life, ‘Infinity Guitars’ really ignites the venue, perfectly suited to audience singing, with Krauss down on her knees to orchestrate the baying mob through the ritual.  For such an epic sound, the gig is still incredibly intimate, charisma dripping from the ceiling and willing you not to fall in love with the duo.  Latest single ‘Rill Rill’ provides brief respite with its chilled out, lullaby vibe, but is still beefed up from the single version with the drum machine threatening to drown out the vocals and give the crowd to chance to carry the track, the furore ensuing bringing Krauss to her knees again, forcing the microphone into the front row.  The beauty of the live show lies in the balance of the sound; the solitary guitar is emphasised, with the animal, falsetto vocal underlies the riff, layering the track to give an almost urban edge.  This is clearly true of ‘Riot Rhythm’ and ‘Kids’; screams punctuating the riot grrl guitars to a ridiculously brilliant level.</p>\n<p>Nothing can prepare you for the sheer wall of sound, and it is perfectly suited to the confines of Mine, turning a gig into an all-enveloping assault on the senses.  Listening to the record can’t prepare you for the frankly outrageous live element of the show.  You leave feeling like you’ve been beaten up, but in the best possible way.</p>\n","slug":"3393-sleigh-bells-constellations","category":"festivals","date":1289837885000,"wpid":3393,"isSticky":false,"featured_image":{"width":608,"height":445,"src":"2010/11/kingdom-remixes-sleigh-bells.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAQH/8QAIhAAAgIBAwQDAAAAAAAAAAAAAQIDBQQAByEGERNBIjFC/8QAFAEBAAAAAAAAAAAAAAAAAAAAAP/EABQRAQAAAAAAAAAAAAAAAAAAAAD/2gAMAwEAAhEDEQA/AITvSw6guZ6LFnesuInlmXylWxp/CVLr3AJb4r9EDj0edabQ7u0ddR12FYWUrZmNjRwzs8MrsZFUBiW/R7g8+9NNB//Z"},"createdAt":1587294905767,"updatedAt":1588403562736,"author":"5e9b68b27a1236eccfeb1d4c","old_image":"2010/11/kingdom-remixes-sleigh-bells.jpg","categories":["festivals","music","reviews"]}