{"id":"5e9bf7a98fb2d30d7769c798","title":"Interview: Tugboat Captain","content":"<p>An unwarranted amount of time has passed since I spoke to Tugboat Captain in a booth with a pole in the middle of it ahead of their show at Proud Camden this summer, however, with their new album <em>Everybody Seems To Think That I’m A Raincloud</em> out today it may be, maybe just, the opportune time to share what I have failed to share for so long.</p><p></p>\n<p>With rotating instrumentation, akin to Gorky’s Zygotic Mynci (bar any pointed reference), the self-described ‘folk orchestra of ruffians’ manages for humour to stay afloat amidst a plethora of sad, sad songs. But to peg Tugboat Captain as a comedy band, would be to mistake antics and clothes for hilarity over seriousness, and this is a very serious band, into dreaming, memeing, scheming*, Reddit threads**/ pickled eggs*** and Jean Shorts****.</p>\n<p>It has been since the release of their first LP at the beginning of this year that you can see how gigging has afforded them the opportunity to remove their sound from the bedroom: the one microphone and a laptop set-up typical of the first record, allowing it to be hijacked by onstage revelry (<em>Sloppy Giuseppe </em>: “I think [the crowd] want to see people naked playing the electric bassoon”). The second record follows on from that, it’s as if the band has come home, where the music is still ringing in their ears when their heads are laid down and their eyes shut, back at home for the night where they very much find themselves embedded in reality. That’s what you can hear, the echoing of a playfully married dichotomy between persona and present person lifted from the scraping sentimentality of the songwriting amidst the floating flotsam of cornets, banjos, accordions (<em>The Captain</em>: “and some chanting”). When speaking to them about the shift in sound from the first record to the new singles coming from the second, Tugboat Captain was keen to enlighten and expose every aspect of their process: <em>The Captain:</em> “yeah, the first album was a pretty lo-fi record, but we bought a new microphone.” Lo-fi seeming to be a common thread within indie music, the band instead view it as consequential of their process than of their sound in particular, yet adopting it as their own nonetheless rather than out of necessity.</p>\n<p>(We then spoke more, and at quite some length about lo-fi. Tugboat Captain loves lo-fi.)</p>\n<p><strong>Sloppy Giuseppe</strong>: Lo-fi means you smoke clove cigarettes when producing the album.</p>\n<p><strong>The Captain</strong>: We only have one microphone at home, so that makes it lo-fi, we record it in our house, that’s how we do it: hazy, dreamy… clove cigarettes.</p>\n<p>But [the singles released so far from the new record] do signal a change for the next record, it’ll be a bigger record</p>\n<p><strong>Sloppy Giuseppe</strong>: We have four separate sticks of different incensed incense.</p>\n<p><strong>The Captain:</strong> You can actually hear the incense on the record…</p>\n<p>So the new record won’t be more hi-fi, it’ll just be better arranged, there are bigger arrangements, the full band is involved.</p>\n<p> </p>\n<p>As in the way indie music is a spiritual bedding for self-preservation of the male ego, Tugboat Captain sidesteps associations of being a boyband (despite their heavy male to female ratio), claiming there to be “a little bit of Mrs Doubtfire in all of us”, or being part of the hollowness of nameless gig-culture: four-white-guys-with-guitars. Instead, they’ve made their somewhat cultish indie sound outward facing and warranting of an ego trip.</p>\n<p><strong>CitR: </strong>Listening to your previously released material it seems to have been rooted in principally singer-songwriter/ boy and guitar mode. How has that evolved to become the raucous six-piece that can be seen at your gigs and on the latest record?<strong>Lawrence</strong>: Well I mean, we saw The Captain busking on his own and we thought, you know what he needs? A folk-orchestra of (background yelling: “freaks”)… ruffians.</p>\n<p><strong>Sloppy Giuseppe</strong>: So we’ve now added to the mix spaghetti, electric bassoon, sitar, we’re hoping to get some smashed chocolate cake in, a Black Forest gateaux…</p>\n<p><strong>The Captain</strong>: Yeah there’s some cornet in there, there are some drums</p>\n<p><strong>Honey Glaze</strong>: An accordion</p>\n<p><strong>Boatswain Joe</strong>: And essentially what I bring to the band is a little thing I like to call The Groove. Without me on the drums, I’m afraid that Tugboat Captain would just be wandering the streets of Camden and Shoreditch and Peckham. Just singing… into the air. But then I come down with a hard kick,</p>\n<p>And snare.</p>\n<p>And everyone knows what the score is.</p>\n<p> </p>\n<p>Tugboat Captain is a collaborative band, a coincidental grouping, a cobbled together collection of friends from, they’ll say South London (although from as close to the river as you can feasibly get, take that as you will), “it started off as The Captain choosing a gig to play and just asking his friends who can make it, and people just would turn up with varying degrees of instruments, ideas, skills, clothes and just kind of go on stage and people up till now have been quite keen, on this kind of… look”.</p>\n<p>As far as DIY goes, the band has raised the term in status, funding the mastering and promotion of their latest album through Kickstarter, members seem to take it upon themselves to promote their other interests within the grounding of the band. The music videos are the product of Grimshaw Mink, who are in name Jesus Bigboy and Boatswain Joe (‘in name’ being particularly loose phrasing considering the onstage pseudonyms of the band members). As well as creating the cover art for the first record, the t-shirt design was made and hand-printed by Honey Glaze. The art DIY aesthetic has been raised from simply an art school game to serious business within the set-up of Tugboat Captain.</p>\n<p>The new record <em>Everybody Seems To Think That I’m A Raincloud </em>(for the uninitiated, Tugboat Captain are a fan of long album titles, even longer track names, but actually quite short songs), is expected to be markedly different from the first record which was released less than a year ago. They’ve got more members now and more fun clothes – although wearing less and less of them. Whereas the first album was a cathartic exercise for The Captain, lonely bedroom confessions told through lyrical musings, this new record speaks of something a little less telling. For one, Tugboat Captain is now a full band/ ensemble, and that collaboration has made its way into the new record in more ways than just sonically. There is a lot more fun to be had with the second record, songs of heartache are restricted to quick torrents of anger as opposed to the meandering lyrical prose the first record made us used to. <em>Everybody Seems To Think That I’m A Raincloud </em>also seems to straddle the gap between the intimate sounds of the first album and the onstage performances that emerged from it. It’s a product of them becoming hyper-aware of their audience, but also able to guide their audience into the sort of music they want to make and play.</p>\n<p>When discussing the short gap between releasing the first and this second record, The Captain went on to say that the “first album was made up of a lot of tracks that I’d written a long time ago, I guess it was like the amalgamation of a year’s worth of work. And we just started working on new music, and we want to put a new record out because we’ve been playing live, we sound very different now, we’re a better band, I think in general… we’ve all grown, as individuals, we’ve developed.”</p>\n<p><strong>Sloppy Giuseppe</strong>: We’ve got some tugs to our boat.</p>\n<p><strong>CitR: </strong>So how then has playing live, especially with the number of gigs you have put on in the last few months, influenced the music you make, or how you play and perform the music?</p>\n<p><strong>The Captain</strong>: I don’t think it’s changed the songwriting, it has definitely changed the arrangements, and in the way that we’re now playing with a full band, it has taken into consideration that often it doesn’t translate onto the records how rowdy the shows are, and how involved we are as a group of fans, band members, and other bands who are also involved. So I think definitely in terms of the arrangements and the recording of the new record we’ve looked at replicating that live sound a little more and involve the wider… and new, involve new fans into the raucous environment that is Tugboat Captain live.</p>\n<p><strong>CitR: </strong>Do you see the varied instruments (electric bassoon, sitar, accordion, banjo, cornet…) as key to the sound of the band, or something novel for the live shows?</p>\n<p><strong>Sloppy Giuseppe</strong>: No, no</p>\n<p>Not at all</p>\n<p><strong>The Captain</strong> It’s not like an orchestra, it’s just for fun</p>\n<p><strong>Sloppy Giuseppe</strong>: At the end if the day it’s –</p>\n<p><strong>The Captain</strong>: Novelty</p>\n<p><strong>Sloppy Giuseppe:</strong> Yes it is</p>\n<p><strong>CitR: </strong>Speaking of your live shows, everything about the music from the first album suggests it should translate to anything but the raucous performances that you put on. Has that aspect of performing been planned or has it evolved since starting to perform live and forming the whole band?</p>\n<p><strong>The Captain:</strong> I guess it happens because of the fans.</p>\n<p><strong>Sloppy Giuseppe</strong> : I think when you’re playing live you want the people to have a good time, they don’t really want to hear about breakups and heartbreaks, I think they want to see people naked playing the electric bassoon.</p>\n<p><strong>The Captain</strong>: Yeah I think everyone wants to see that.</p>\n<p><strong>CitR:</strong> The set up of your live shows, with a rotating crew of members, strikes me as being in the same vein as the collaborative nature of the Falmouth music scene (where members shift between multiple bands). Do you feel that studying in Falmouth influenced the way you now carry out your live shows?</p>\n<p><strong>The Captain:</strong> Yes, yeah, yeah. I suppose that ethic of rotating the band members and making a big group, that’s a big thing, like multiple contributors, and the shows to always be different. The plan is, if you come to a show, then the next one you come to could be a completely different one, and it could always get more exciting. Every show is a different line-up.</p>\n<p><strong> </strong><strong>CitR: </strong>So, would you say, considering the difference between them, the records you put out or your gigs are truer to the nature of the band as a whole/ sound of Tugboat Captain?</p>\n<p><strong>Honey Glaze:</strong> I feel like the band is more like a band of coincidence, which is our aesthetic. It’s like a lot of things are accidents and I feel that’s part of like, the band. We happen to have loads of instruments, and so we just use them.</p>\n<p><strong>The Captain:</strong> And it’s always exciting, as we’re constantly adding and morphing.</p>\n<p><strong>Sloppy Giuseppe</strong>: Square-wave Grieg transforms into Greensleeves, which translates into Andrew WK, and that’s just the nature of the party.</p>\n<p><strong>The Captain</strong> We just want to party hard.</p>\n<p><strong>Sloppy Giuseppe</strong>: We just want to party hard</p>\n<p>And when life’s a pizza you’ve just got to take it slice by slice.</p>\n<p><strong>Papa Issac:</strong> And you have different toppings</p>\n<p>Tugboat Captain’s new album is out now: Friday 27<sup>th</sup> October, and if you’ve managed to make your way through this article, with snippets from one of the most insightful interviews to this date, then listening to the album will be a breeze (so it’d be foolish not to). Stream it on Spotify, buy it on Bandcamp or Itunes, connect with them on Linkedin, they’ll take it all.</p>\n<p>Tugboat Captain, as of today, are on tour, so check their Facebook to see if they’re coming near you (they probably are).</p>\n<p><a href=\"https://tugboatcaptain.bandcamp.com/album/everybody-seems-to-think-that-im-a-raincloud-bonus-edition\">https://tugboatcaptain.bandcamp.com/album/everybody-seems-to-think-that-im-a-raincloud-bonus-edition</a></p>\n<p><iframe src=\"https://open.spotify.com/embed/album/0hurh5TVRozGMLapATBl5H\" width=\"300\" height=\"380\" frameborder=\"0\" allowtransparency=\"true\"></iframe></p>\n<p>*n.b. The Red Roadie</p>\n<p>**DWTWUOMO</p>\n<p>***Rider</p>\n<p>****I Love My Jeanshorts</p>\n","slug":"34020-interview-tugboat-captain","category":"interviews","date":1509049647000,"wpid":34020,"isSticky":false,"featured_image":{"width":1200,"height":1200,"src":"2017/10/tugboat-captain.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFwAAAwEAAAAAAAAAAAAAAAAAAAIDCP/EABwQAQADAAIDAAAAAAAAAAAAAAEAAxECIRIxQf/EABUBAQEAAAAAAAAAAAAAAAAAAAIE/8QAFhEBAQEAAAAAAAAAAAAAAAAAAQAR/9oADAMBAAIRAxEAPwDTTfTXZnJDTVXCV8z4GRQFdDo6geiTroSL/9k="},"createdAt":1587279785834,"updatedAt":1588403498127,"author":"5e9b68b27a1236eccfeb1d48","old_image":"2017/10/tugboat-captain.jpg","categories":["interviews"]}