{"id":"5e9c32ab9b6559241525df2f","title":"Review: ‘Tall Ships’/Coal Train","content":"<p>Formed out of the remnants of <strong>This Ain’t Vegas</strong>, <strong>Coal Train </strong>rise form the ashes as a rock infused indie-pop four piece from <strong>Sunderland</strong>.</p><p> Known primarily, or at least in musical terms, as being the city that produced <strong>The Futureheads</strong>, <strong>Coal Train </strong>have produced a sound that is entirely, and wonderfully, different from their home town counterparts.</p>\n<p>‘<strong>Building Dens</strong>‘ saw <strong>Coal Train</strong>‘s first furore into the realm of released music under their new guise, gaining a great deal of attention from many bloggers and critics alike. However with their second single release, ‘<strong>Tall Ships</strong>‘, the band has produced a track wholly more upbeat and infectious effort that details a metaphorical journey down the <strong>River Wear</strong>. The track begins rather unassumingly, until a moment of choral vocals sparks into life jangly guitars and percussion, laced with a dose of light hearted piano which immediately engages the listener. However only seconds later, the track falls back into a period of quiet rest bite, before then moving back into a flurry of instrumental joy. These fluctuations echo the sentiment of the song, as these periods of differing tempo feel like water from a river lapping against a shore, or the differing in speed of water a river encounters as it transverses through different terrain. As a result, ‘<strong>Tall Ships</strong>‘ keeps the listener engaged by allowing them to be absorbed into the journey of the track, with lead singer <strong>Richard Amundsen</strong>‘s vocals narrating throughout the course. <strong>Amundsen</strong>‘s vocals on the track are driven yet personal, with a real sense of anguish combusted with a thankful relief, and ultimately acts as the final ingredient to a track that has the jovial nature of an indie-pop tune, with the integrity and gritty nature of a rock sound.</p>\n<p>8/10</p>\n<p><a href=\"https://www.myspace.com/coooaltrain\" target=\"_blank\">Coal Train Myspace</a><br />\n<a href=\"https://www.coal-train.blogspot.com/\" target=\"_blank\"> Coal Train Blog</a></p>\n<p><a href=\"https://vimeo.com/15922600\">COAL TRAIN – Tall Ships (free digital single)</a> from <a href=\"https://vimeo.com/user4715976\">Coal Train</a> on <a href=\"https://vimeo.com\">Vimeo</a>.</p>\n","slug":"3420-review-tall-shipscoal-train","category":"music","date":1290266680000,"wpid":3420,"isSticky":false,"featured_image":{"width":600,"height":400,"src":"2010/11/coal-train.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAUG/8QAIBAAAgICAgIDAAAAAAAAAAAAAQIDBAARBiEFQRMjUf/EABQBAQAAAAAAAAAAAAAAAAAAAAP/xAAYEQADAQEAAAAAAAAAAAAAAAAAAxEBIf/aAAwDAQACEQMRAD8Aw0fILNrx00cEdeENVluBnZ2KwMxTRHs9E+8ijmHJ6IFSjfrLUr/VCvxa0i9KNa/AMYxF5aI7kP/Z"},"createdAt":1587294891323,"updatedAt":1588403562507,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2010/11/coal-train.jpg","categories":["music","reviews"]}