{"id":"5e9c32b69b6559241525df44","artists":["5e9b69447a1236eccfeb256d"],"title":"Review: Spokes","content":"<p>Finding myself in the dark, atmospheric setting of the <strong>Night & Day Cafe</strong> in Manchester’s <strong>Northern Quarter</strong>, I pulled a seat up next to the bar, mid-distance from the stage and from the door.</p><p> Perhaps the ‘arty-ness’ of the <strong>Northern Quarter </strong>had rubbed off on me, but I had even brought a copy of <strong>Simon Armitage</strong>‘s ‘<strong>Kid</strong>‘ with me to read between sets, as a distraction while bands scurried around loading and unloading kit from their vans. However, sadly, I found myself reading the book, and congratulating myself on my near positioning to the door, during the set of the first band on stage, <strong>On Screen Heroes</strong>. A 4 piece indie rock band from Birmingham were just that; immensely dull and uninspired. Repetitive and mundane lyrics, overused hooks and riffs, and incredulously forgettable. Perhaps had these lads set up shop 5 or 6 years ago they might have grabbed more attention, when it seemed that any one was capable of setting up a half decent indie band. If you are dead set on listening to <strong>On Screen Heroes</strong>, then listen to their single <strong>The Boy Who Fell in Love Ag</strong><strong>ain</strong>, which redeems itself by being somewhat catchy to listen to.</p>\n<p>4/10</p>\n<p>Only the quiet hum of polite applause roused me from my reading of <strong>Armitage</strong>, and of course the need for another <strong>Brown Ale</strong>, as <strong>Love Bites </strong>took to the stage. Styled by many as a ‘no-wave’ band, <strong>Love Bites </strong>takes the form of a multi-instrumental boy/girl duo who indulge in elements of ‘Electroclash’, ‘post-punk’, and ‘dark wave’. Without emotion nor recognition of their audience, <strong>Love Bites </strong>produced a set that was filled of synth-y goodness and regimented drum beats. What impressed me most about <strong>Love Bites </strong>was that they created a sense of understated coolness about themselves, staring dead pan out into the audience while mixing the crisp vocals of <strong>Natalie Stirling </strong>with the gritty vocals of <strong>Lee Morris</strong>. I was immediately made to feel like I should like the band, otherwise I would not be cool myself. Thankfully this seemingly massive lack of social backbone on my behalf can be excused as <strong>Love Bites </strong>support their aesthetic coolness with quality music. Absorbing yet driven, there is a great sense of mystique about <strong>Love Bites </strong>that makes you take attention to their sound. Oh, and they did a fantastic cover of <strong>Lady GaGa</strong>‘s <strong>Paparazzi</strong>, so I can safely say I’m sold to these not-so-crazy kids.</p>\n<p>6/10</p>\n<p>Back to my <strong>Armitage</strong>, I read further and guzzled another <strong>Brown Ale </strong>until a gaggle of musicians materialised on the stage. They took the form of country-folk band <strong>Samson & Delilah</strong>, who are focused around the husband and wife duo of <strong>Sam Lench </strong>and <strong>Anna Zweck</strong>. I immediately spied that <strong>Zweck </strong>was cradling a handsome looking accordion, while there were numerous fiddles and items of percussion littering the stage. Being a bit of a folkie, I immediately began to pay attention. Initially unassuming, the band played a set that ranged from quiet and haunting tracks, to the fast paced, hoedown-esque crowd pleasers. With such range one would normally expect some level of sacrifice in quality of music, which has unfortunately been a far too present sight in recent times as ‘folk inspired’ bands have sprouted all over. However with <strong>Samon & Delilah</strong>, the audience was presented with a band that was musically superb and powerful vocals that would have engaged with even the most passive listener. However despite a recent description of the band as ‘Arcade Fire after a country-folk makeover’ seeming to be somewhat an overestimation of <strong>Samson & Delilah</strong>, they are still a band worth checking out, especially as they have a new album due out in January 2011.</p>\n<p>7/10</p>\n<p>I had abandoned my prepared down time reading by this point, as <strong>Armitage </strong>was beginning to depress me with lines such as:</p>\n<p>‘Here’s how they would have rated him when they look back:</p>\n<p>sometimes he did this, sometimes he did that.’</p>\n<p>Beginning to question my own position in the relative scale of the whole universe, I was thankfully interrupted by the entrance of the headline act; <strong>Spokes.</strong></p>\n<p>Wow.</p>\n<p>From the moment <strong>Spokes </strong>began their set, I knew I was witnessing something special. There was such a fascinating level of intensity in the band’s sound, in which a track could begin calmly and carefully yet powerfully climax to a point of pleasingly orchestrated noise. A Manchester band that is helping to strip away the perception that the city, of late, can only produce generic indie bands, <strong>Spokes </strong>indulge in influences of shoe-gaze, post-rock, folk, and pop to create a sound that is both highly enjoyable to listen to, but also complex enough to provoke a genuine sense of interest in the listener. Lyrics can be sparse at times in <strong>Spokes</strong>‘ tracks, but when they are present they mimic the sentiment of the particular track superbly, with moments of sorrowful melancholy contrasted with periods of fantastically uplifting joy. What struck me the most about <strong>Spokes </strong>was the energy they purveyed on the stage, especially as when each climax began to build the band would appear to centre in the middle of the stage, as if they were all both feeding off, and drawing energy from, the musical sounds of each member in the band. Mesmerised by this stage performance, I<strong> </strong>hugely enjoyed <strong>Spokes</strong>‘ performance, and looking back during the course of the night I felt that <strong>Spokes </strong>demonstrated, in contrast to <strong>On Screen Heroes</strong>, that the future of the music we listen to will no longer rest on indie replica bands, but on adventures into the abstract and the convergence of once separated music genres. In other words, make sure to check out <strong>Spokes</strong>‘ brand new single, <strong>We Can Make It Out</strong>!</p>\n<p>9/10</p>\n<p><a href=\"https://www.myspace.com/onscreenheroes\" target=\"_blank\">On Screen Heroes Myspace</a></p>\n<p><a href=\"https://www.myspace.com/uklovebites\" target=\"_blank\">Love Bites Myspace</a></p>\n<p><a href=\"https://www.myspace.com/thesamsonanddelilahshow\" target=\"_blank\">Samson & Delilah Myspace</a></p>\n<p><a href=\"https://www.myspace.com/spokessound\" target=\"_blank\">Spokes Myspace</a></p>\n","slug":"3432-review-spokes","category":"music","date":1289870068000,"wpid":3432,"isSticky":false,"featured_image":{"width":600,"height":450,"src":"2010/11/spokes.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAQH/8QAIBAAAQQCAQUAAAAAAAAAAAAAAQACAwUEESElMUGTof/EABQBAQAAAAAAAAAAAAAAAAAAAAT/xAAWEQEBAQAAAAAAAAAAAAAAAAABABH/2gAMAwEAAhEDEQA/AMIxs6rFcGGkgkl5DpHSuBIJB8djv5wpDNW7PRo/e5EQxxZS6X//2Q=="},"createdAt":1587294902559,"updatedAt":1588403562685,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2010/11/spokes.jpg","categories":["music","reviews"]}