{"id":"5e9c32a99b6559241525df2c","artists":["5e9b68f87a1236eccfeb20c5"],"title":"Review: Girls – Broken Dreams Club EP","content":"<p><a href=\"https://admin.</p><p>crackintheroad.com/music/3465-review-girls-broken-dreams-club-ep/attachment/girls_sandy_kim1/\" rel=\"attachment wp-att-3549\"><img class=\"alignnone size-totallysizedforever wp-image-3549\" title=\"girls_sandy_kim1\" src=\"https://api.crackintheroad.com/uploads/2010/11/girls_sandy_kim1-740x557.jpg\" alt=\"\" width=\"740\" height=\"557\" /></a></p>\n<p>By now the story of <strong>Girls</strong> frontman <strong>Christopher Owens</strong> is a well known one. In many ways it would be pretentious and unjust to describe it as anything other than heartbreaking, the tale almost as destructive and painful as the aftermath. Take their debut LP ‘Album’, it was fragile, painfully honest and emotionally moving. The album managed to outpour Owens’ entire story without actually revealing the details. In short it was a dream.</p>\n<p><strong>Broken Dreams Club EP</strong> keeps that dream alive and improves in all the right places. The production is flawless, the DIY quality is still there but now even more impeccably constructed. What’s important to note is that the sound is also never contrived, simply vaster in its execution. ‘Carolina’ the last song from the EP perhaps shows this growth at it’s most refined. The lyrics plead and grovel, the guitars hum and fuzz creating an audio mist and yet the piece is still balanced in its sentiment. With Owens there is always hope.</p>\n<p>It’s the hope found within the record that makes Owens’ stories palatable. His work could never be described as accessible but the hauntingly stylish tones of the frontman allow us past the first barrier. ‘Heartbreaker’ and ‘Substance’, arguably the EP’s toughest tracks accomplish this perfectly. As always Owens to some extent is resolved in sadness, but importantly he dangles a way out to the listener “you can do anything, you can rock n’ roll”. Even if Owens doesn’t take his own advise, you still have the privilege of listening to it.</p>\n<p>It’s this balance of sentiments and ideas that makes the record so successful. The records opening track ‘Thee Oh So Protective One’ tricks us with is breezy sun-kissed exterior yet still manages to drain us. What resonates through out the music is Owens own reliance, after all “just a look could be the start”.</p>\n<p> </p>\n","slug":"3465-review-girls-broken-dreams-club-ep","category":"music","date":1290374862000,"wpid":3465,"isSticky":false,"featured_image":{"width":800,"height":603,"src":"2010/11/girls_sandy_kim1.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAIAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAQG/8QAIRAAAgEEAQUBAAAAAAAAAAAAAQIRAAMEBRIGFBUxUWH/xAAVAQEBAAAAAAAAAAAAAAAAAAACA//EABkRAAIDAQAAAAAAAAAAAAAAAAERAAIDMf/aAAwDAQACEQMRAD8Au2G61e1yMPwGb3GLd5tenI4F1mCJYQIn2fhrTW83pK3bVHbLZlAUlb4gkfPylKnhVsx7HgU//9k="},"createdAt":1587294889795,"updatedAt":1588403562480,"author":"5e9b68b27a1236eccfeb1d24","old_image":"2010/11/girls_sandy_kim1.jpg","categories":["music","reviews"]}