{"id":"5e9c32b39b6559241525df3e","artists":["5e9b68e07a1236eccfeb1f23"],"title":"Review: Constellations Festival","content":"<p>Arriving in Leeds I wasted no time in heading up to the <strong>Constellations </strong>festival HQ of the Leeds University <strong>Student Union</strong>.</p><p> Set across three rooms in the superbly designed Union, <strong>Constellations</strong>, in it’s first year of existence, boasted well known acts such as <strong>Broken Social Scene </strong>and <strong>Los Campesinos!</strong>, alongside the slightly more alternative acts of <strong>Sleigh Bells </strong>and <strong>Les Savy Fav</strong>. This somewhat eclectic line up promised to provide quality music to all types of taste, and smartly, considering it is mid-November, all under one roof.</p>\n<p>However before I immersed myself in my musical surroundings, I headed over to <strong>Leeds Student Radio </strong>for a guest appearance on the fantastic ‘<strong>Hair of the Dog</strong>‘ show. Co-presented by fellow <strong>Crack In The Road </strong>writer <strong>Will Tompsett</strong>, the show airs every Sunday from 2-3pm, and during my time on air not only did I feature some excellent Everything Everything tracks, but also took part in the hilarious feature of theirs entitled, ‘Ham, or Hamas?’. Make sure to tune in this Sunday!</p>\n<p>Below is a selection of acts that <strong>Crack In The Road </strong>witnessed throughout the day, culminating in separate articles by <strong>Will </strong>detailing <strong><a href=\"https://api.crackintheroad.com/music/3393-sleigh-bells-constellations\" target=\"_blank\">Sleigh Bells </a></strong><a href=\"https://admin.crackintheroad.com/music/3393-sleigh-bells-constellations\" target=\"_blank\">performance</a> as well as the wild <a href=\"https://admin.crackintheroad.com/music/3500-les-savy-fav-constellations\" target=\"_blank\">performance by</a><strong><a href=\"https://admin.crackintheroad.com/music/3500-les-savy-fav-constellations\" target=\"_blank\"> Les Savy Fav</a></strong>. And before you ask, in no way am I bitter that I chose to stay with <strong>Will </strong>to watch <strong>Sleigh Bells </strong>and, as a result, miss out on watching Johnny Marr play with <strong>Broken Social Scene</strong>.</p>\n<p><strong>Dog is Dead:</strong></p>\n<p>A long standing <strong>Crack In The Road </strong>favourite<strong> </strong>(we interviewed the back all the way back in May at <strong>Dot to Dot Festival</strong>), <strong>Dog is Dead </strong>performed another fantastic set in the smallest of the three venues at<strong> Constellations</strong>. Noticeably more at ease on stage, <strong>Dog is Dead </strong>performed their most recent single ‘<strong>Young</strong>‘ with a fantastically energetic yet eerie sound, however it is the choral nature of <strong>Dog is Dead </strong>that truly sets them apart. Harmonising with a powerful ease, <strong>Dog is Dead </strong>manage to manipulate this vocal clarity along with all the other aspects you would expect from an indie-pop band. However <strong>Dog is Dead </strong>manage to take the conventional layout of guitars, keyboard and drums (not too mention a cheeky saxophone too), and orchestrate them in such a way that the music is not only enjoyable to listen to, but has a depth which makes you take notice.</p>\n<p><object classid=\"clsid:d27cdb6e-ae6d-11cf-96b8-444553540000\" width=\"100%\" height=\"81\" codebase=\"https://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=6,0,40,0\"><param name=\"allowscriptaccess\" value=\"always\" /><param name=\"src\" value=\"https://player.soundcloud.com/player.swf?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F5108146&secret_url=false\" /><embed type=\"application/x-shockwave-flash\" width=\"100%\" height=\"81\" src=\"https://player.soundcloud.com/player.swf?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F5108146&secret_url=false\" allowscriptaccess=\"always\"></embed></object> <span><a href=\"https://soundcloud.com/thisisfakediy/dog-is-dead-motel\">Dog Is Dead – Motel</a> by <a href=\"https://soundcloud.com/thisisfakediy\">thisisfakediy</a></span></p>\n<p><strong>Sky Larkin:</strong></p>\n<p>Leeds indie act <strong>Sky Larkin </strong>produced a well received set by the home crowd in the largest of the three venues. Coming off the back of their recent sophomore release, ‘<strong>Kaliede</strong>‘, <strong>Sky Larkin </strong>passionately played tracks both old and new, with ‘<strong>Still Windmills</strong>‘ standing out as a particular highlight. However I must admit that I wasn’t inspired by <strong>Sky Larkin</strong>, as each track seemed to follow a particular musical formula of guitars, drums and vocals which, in my opinion, risk sounding all alike. However maybe it’s just my inability to decipher the intricacies of indie music, who knows.</p>\n<p><a href=\"https://www.myspace.com/skylarkinskylarkin\" target=\"_blank\">Sky Larkin Myspace</a></p>\n<p><strong>Gold Panda:</strong></p>\n<p>I know I said that I was excited by the prospect of such an eclectic line up, but I still can’t understand why <strong>Gold Panda </strong>was billed. A producer/DJ that creates an electronic sound that is both sooting yet jagged and warped, his somewhat minimal beats were lost in a venue filled with fans expecting to see performances by actual bands. However this by no means suggests <strong>Gold Panda</strong>‘s performance was poor, rather <strong>Gold Panda </strong>produced a set that was musically superb and engaging, even if set in the wrong atmosphere. Make sure to check out his debut album, ‘Lucky Shiner’.</p>\n<p><object classid=\"clsid:d27cdb6e-ae6d-11cf-96b8-444553540000\" width=\"100%\" height=\"81\" codebase=\"https://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=6,0,40,0\"><param name=\"allowscriptaccess\" value=\"always\" /><param name=\"src\" value=\"https://player.soundcloud.com/player.swf?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F4543070&secret_url=false\" /><embed type=\"application/x-shockwave-flash\" width=\"100%\" height=\"81\" src=\"https://player.soundcloud.com/player.swf?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F4543070&secret_url=false\" allowscriptaccess=\"always\"></embed></object> <span><a href=\"https://soundcloud.com/gold-panda/snow-taxis\">Snow & Taxis</a> by <a href=\"https://soundcloud.com/gold-panda\">Gold Panda</a></span></p>\n<p><strong>Esben and the Witch:</strong></p>\n<p>A three piece act from Brighton, <strong>Esben and the Witch </strong>have already received plaudits from several music publications and have been nominated for the  <strong>Q Award </strong>‘Next Big Thing’. Lying somewhere between indie/goth-rock and utilising electronic influences, <strong>Esben and the Witch </strong>performed a set that was shrouded in darkness and mystique, with <strong>Rachel Davies </strong>transcendental droning vocals absorbing the audience’s attention. With no drummer, <strong>Davies</strong>, with a hypnotic rhythm, banged on floor tom while surrounded by a whirlwind of warped guitars and bursts of electronic screams. Described to me as a type of ‘Epic <strong>XX</strong>‘, <strong>Esben and the Witch </strong>are a band that will excite as many people as they bore, though I imagine those they bore will be more than content to listen to the formulaic sound of <strong>Sky Larkin</strong>. A fantastic act, and I highly recommend you check out their latest single, ‘<strong>Marching Song</strong>‘.</p>\n<p><a href=\"https://www.myspace.com/esbenandthewitch\" target=\"_blank\">Esben and the Witch Myspace</a></p>\n<p><strong>Local Natives:</strong></p>\n<p>Performing one of their final few UK shows before they head off to write their second album, <strong>Local Natvies </strong>went out in style as they produced a set that entertained a packed out audience. Positioned horizontally across the stage, <strong>Local Natives </strong>demonstrated why they’ve received so much positive attention over the past year, with dreamy yet driven tracks that are soulful and upbeat in equal measure. ‘<strong>Airplanes</strong>‘, a crowd favourite, was performed with the same intensity that can be heard on the record, and it acted as a representation of a set that positively provoked a very appreciative crowd. Simply superb.</p>\n<p><a href=\"https://www.myspace.com/localnatives\" target=\"_blank\">Local Natives Myspace</a></p>\n<p><strong>The Vaccines:</strong></p>\n<p>Why is <strong>Jay-Jay Pistolet </strong>so angry? The one time folkie sounding singer/songwriter has created his latest project <strong>The Vaccines </strong>as a grunge influenced post-rock 4 piece. I initially wasn’t keen on joining in on the massive hype surrounding <strong>The Vaccines </strong>(they have already featured on the <strong>Jools Holland Show</strong>), as I felt that the sound created by <strong>Jay-Jay </strong>& co was rather simplistic and two dimensional. Guitars appear to follow very organised and unchanging patterns, with the percussion following down a similar vein. However after seeing the band perform live, I’m starting to enjoy the sound of this new London based outfit. I think it was the performance of <strong>Jay-Jay </strong>himself that aided my change in heart, despite his constant demonic facial expression throughout, as his vocal performance adds an element of enthralled emotion to an otherwise relatively simple sound. I am looking forward to <strong>The Vaccines </strong>first release, however for the mean time I suggest you make your own mind up by giving them a listen.</p>\n<p><object classid=\"clsid:d27cdb6e-ae6d-11cf-96b8-444553540000\" width=\"100%\" height=\"81\" codebase=\"https://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=6,0,40,0\"><param name=\"allowscriptaccess\" value=\"always\" /><param name=\"src\" value=\"https://player.soundcloud.com/player.swf?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F5878080&secret_url=false\" /><embed type=\"application/x-shockwave-flash\" width=\"100%\" height=\"81\" src=\"https://player.soundcloud.com/player.swf?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F5878080&secret_url=false\" allowscriptaccess=\"always\"></embed></object> <span><a href=\"https://soundcloud.com/the-vaccines/blow-it-up\">Blow It Up</a> by <a href=\"https://soundcloud.com/the-vaccines\">The Vaccines</a></span></p>\n<p>Bottom line, <strong>Constellations </strong>first year in existence was a very successful one, and should there be a repeat showcase next year, I advise you buy your tickets early.</p>\n<p><strong><br />\n</strong></p>\n<p><strong><br />\n</strong></p>\n<p><strong><br />\n</strong></p>\n","slug":"3476-review-constellations-festival","category":"festivals","date":1290018599000,"wpid":3476,"isSticky":false,"featured_image":{"width":699,"height":340,"src":"2010/11/constellations.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAFAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAAAAb/xAAeEAABAwQDAAAAAAAAAAAAAAABAAIRAwQFYQYxof/EABUBAQEAAAAAAAAAAAAAAAAAAAYH/8QAGxEAAgMAAwAAAAAAAAAAAAAAAQIAAxEEUcH/2gAMAwEAAhEDEQA/AJTN2ZdzPGXDqpcCGhjCXRTgmSII736qqNoiYIoBbJI+S5aurevTP//Z"},"createdAt":1587294899683,"updatedAt":1588403562635,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2010/11/constellations.jpg","categories":["festivals","music"]}