{"id":"5e9c32a79b6559241525df29","title":"Review: Kanye West – My Beautiful Dark Twisted Fantasy","content":"<p><a rel=\"attachment wp-att-3572\" href=\"https://admin.</p><p>crackintheroad.com/music/3479-review-kanye-west-my-beautiful-dark-twisted-fantasy/attachment/style-p30-neutral\"><img class=\"alignnone size-totallysizedforever wp-image-3572\" title=\"Style: \"P30+ Neutral\"\" src=\"https://api.crackintheroad.com/uploads/2010/11/kanye_west_w_vanderperre_7-740x489.jpg\" alt=\"\" width=\"740\" height=\"489\" /></a></p>\n<p>To say<strong> Kanye</strong> is extravagant, would be a cruel and colossal understatement. When he hasn’t been hilariously disrupting award speeches, or having his entire bottom row of team replaced with diamonds, Mr West has been piecing together his fifth album release, the epically titled<em> My Beautiful Dark Twisted Fantasy</em>. Now unless you’re a Chilean Miner and have been living underground for the last two months, you will have heard of Good Fridays, <strong>Kanye’s </strong>weekly track giveaway over at his official site. Massively generous or an excessive publicity stunt? Both I suppose, but there’s no doubting the quality of the tracks he’s gifted to us. To date there are thirteen tracks available to download for free over at kanyewest.com, totaling more than the average album. It’s glaringly obvious that<strong> Kanye</strong> is oozing with confidence in his own music, as well as having his sights set on more than mere financial success; he wants to cement his name as a hip hop legend.</p>\n<p>Taking this into account, his exaggeration and flamboyancy is understandable, however his approach to this album is rather different than in previous efforts. Instead of opting for pulling in the biggest names in the business, <strong>Kanye</strong> handpicks his own new brand of fresh entertainers; sure there’s several appearances from <strong>Jay-Z</strong>, as well as one from last years folk success story <strong>Bon Iver,</strong> but it’s the performances of the newcomers such as<strong> Nicki Minaj</strong> and <strong>Prynce Cy Hi </strong>that really catapult the album to the dizzy heights it reaches. The storming<em> Monster</em> being the best example of this;<strong> Minaj </strong>steals the track with her aggressive delivery and witty lyricism, despite confident verses from <strong>Kanye</strong> himself as well as <strong>Jay-Z</strong>.</p>\n<p><em>Dark Fantasy</em>, the albums opener is majestic and soulful, beginning with a stereotypical spoken verse from<strong> Minaj</strong>, a fitting tribute to her talents that <strong>West</strong> chose her voice to be the first heard on the record. Elsewhere the muscular <em>Power</em> showcases <strong>Kanye</strong> at his first best, intelligent and slick, completely different from the disappointment that was his third album<em> Graduation</em>. Most recent single <em>Runaway </em>came complete with a half an hour long short film, featuring many of the tracks from<em> My Beautiful Dark Twisted Fantasy</em>, and the track itself is one of the songs of the year. Whilst people questioned <strong>Kanye’s</strong> singing abilities on <em>808’s & Heartbreak</em>, his vocals are undeniably imperfect yet ideally suited to the style of <em>Runaway</em>.</p>\n<p>Album highlight<em> All of the Lights </em>comes with a minute long prelude, before <strong>Rihanna</strong> comes in over the top of a dubstep influenced beat. The next line is the most poignant of the record, “something wrong, I hold my head, MJ gone, our nigga dead”, bemoans<strong> Kanye</strong>, in remembrance of the late King of Pop. Some would argue too soon, but it appears <strong>Kanye </strong>is forging his own case to be heir to the prestigious throne.</p>\n<p>As well as drafting in some of the most sought after names in hip hop, <strong>Kanye</strong> called in <strong>Justin Vernon</strong> of<strong> Bon Iver</strong> fame to provide vocals on album closer<em> Lost In The World</em>. One of the freshest beats on the record, <strong>West </strong>also uses a <strong>Gil Scott Heron</strong> sample to close the album, a sure testament to <strong>Kanye’s</strong> confidence in his own creativity as well as the talent of those around him.</p>\n<p><em>My Beautiful Dark Twisted Fantasy </em>is arguably<strong> Kanye’s</strong> most accomplished work to date, picking up the pieces that was the emotional trainwreck of <em>808’s & Heartbreak</em>, combined with the positive experiences garnered from his first two records. Extravagant, exaggerated but all the same drenched in an unparalleled level of brilliance, <strong>Mr West’s</strong> is here to stay.</p>\n<p><script src=\"https://video.unrulymedia.com/wildfire_11244048.js\" type=\"text/javascript\"></script></p>\n","slug":"3479-review-kanye-west-my-beautiful-dark-twisted-fantasy","category":"music","date":1290429831000,"wpid":3479,"isSticky":false,"featured_image":{"width":800,"height":529,"src":"2010/11/kanye_west_w_vanderperre_7.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAYH/8QAIBAAAQQCAQUAAAAAAAAAAAAAAQIDBREABCIGFDFCUf/EABQBAQAAAAAAAAAAAAAAAAAAAAP/xAAVEQEBAAAAAAAAAAAAAAAAAAAAEf/aAAwDAQACEQMRAD8A06ZMgz1lFbDe46zC67R7tKDxK1GkpUn2uxRA415+2gbFYxhQj//Z"},"createdAt":1587294887916,"updatedAt":1588403562454,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2010/11/kanye_west_w_vanderperre_7.jpg","categories":["music","reviews"]}