{"id":"5e9c32b29b6559241525df3b","title":"Les Savy Fav @ Stylus, Constellations Festival, Leeds 14/11/10","content":"<p>A brief search online for Les Savy Fav will leave even the most ambitious gig-goer intrepid with Tim Harrington, lead singer of the New York five piece, venerated for his outrageous stage presence; undressing, singing from the crowd and asphyxiating himself are just a part of the routine.</p><p> The post-punk, indie, hardcore pastiche of sound is almost a sideshow to Harrington’s personality, and to this end, Stylus witnessed one of the great live shows of recent years.</p>\n<p>I arrived to see Harrington dressed as a vicar, berating the audience, before clambering through the already sweaty masses to climb to the top of the sound desk at the back of the arena. From here he strips down to a yellow t-shirt and the tiniest of red shorts, before throwing himself back to the throngs below to be carried again to the front, with his now iconically bald head taking the brunt of the physical attention. This was just a taster of things to come, with every song seeing him launch himself back amidst his disciples, and scaling each part of the venue, working his way to the bar, the exits, and then settling on a wall halfway through, whilst threatening to throw himself down. Les Savy Fav are effectively a backing band for Harrington’s infamous actions, with a crowd-surfing free-for-all culminating in him simulating sex with an invader, then giving him a foot massage and stealing his shoes. Cheeky. Numerous microphones are replaced, as they’re either lost in the sea of fans, or used for an impromptu swing by Harrington as the lighting rig shakes ominously and he’s launched above the crowd.</p>\n<p>The music itself is merely a conduit for Harrington’s live show, but it magnificently inspires the experience. It is deceptively complex, with the vocals barely a necessity, which is fortunate given the emphasis on audience interaction, with ‘Let’s Get Out Of Here’ coming across as a Pixies inspired rant. ‘Rock The Party’ is an aggressive, ballsy track, almost literally as Harrington’s gym shorts start to feel the strain of the vigorous workout. “We rock the party/ That rocks the body” has never been more fitting. Certainly better fitting than the shorts. Having invited everyone to kneel down and sing from the floor, this is less of a gig and more a religious experience, testified to by the evangelistic screams accompanying the opening riff to ‘Patty Lee’.</p>\n<p>Strangling himself with electrical tape, smashing glasses and spitting chewing gum into a fan’s mouth, the crowd go further than eating out of Harrington’s hand, and with their hour and a half set, Les Savy Fav ensure they’ll go down in indie folklore as one of the great live bands.</p>\n","slug":"3500-les-savy-fav-constellations","category":"festivals","date":1290022454000,"wpid":3500,"isSticky":false,"featured_image":{"width":803,"height":535,"src":"2010/11/lessavyfav1.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAUI/8QAIRAAAQMDBAMAAAAAAAAAAAAAEQABAwIFIQQGEyQxQWH/xAAUAQEAAAAAAAAAAAAAAAAAAAAA/8QAFBEBAAAAAAAAAAAAAAAAAAAAAP/aAAwDAQACEQMRAD8AzlaoNDJtm7Sz09yKqPhfJqZyfQYefpGAoKIg/9k="},"createdAt":1587294898040,"updatedAt":1588403562608,"author":"5e9b68b27a1236eccfeb1d4c","old_image":"2010/11/lessavyfav1.jpg","categories":["festivals","music","reviews"]}