{"id":"5e9c32ac9b6559241525df32","title":"Live Review: Unbunny","content":"<p><a href=\"https://admin.</p><p>crackintheroad.com/music/3511-review-unbunny/attachment/unbunny_jarid_closeup_2010/\" rel=\"attachment wp-att-3528\"><img class=\"alignnone size-totallysizedforever wp-image-3528\" title=\"Unbunny_Jarid_closeup_2010\" src=\"https://api.crackintheroad.com/uploads/2010/11/Unbunny_Jarid_closeup_2010-740x589.jpg\" alt=\"\" width=\"740\" height=\"589\" /></a></p>\n<p>Once again I find myself in the atmospheric surroundings of the <strong>Night & Day Cafe</strong>, made all the more intimate by the fact there was only around a dozen people throughout the gig. For those who have never visited <strong>Night & Day Cafe</strong>, it is styled primarily by old wooden tables and hanging stained glass light shades, giving the venue an feel of an old fashioned bar, whilst also managing to remain ‘modern’ enough to survive in the <strong>Northern Quarter</strong>. However due to stripped back, acoustic nature of <strong>Unbunny</strong>‘s set, I felt almost as if I had stumbled in to an impromptu open mic night; no pretense, no hype, just heartfelt music.</p>\n<p>Fortunately I had the company of my good friend <strong>Lucy Swinton </strong>on this occasion, and she even makes a little contribution later in this article if you can spot it. It’ll be like a music review version of <strong>Where’s Wally</strong>, but no where near as challenging or fun.</p>\n<p><strong>Onions:</strong></p>\n<p>Manchester based trio, <strong>Onions </strong>performed a set that was reminiscent of <strong>The Coral</strong>, with jangly guitars and lightly tapped percussion echoing sounds not too different from <strong>The Shins </strong>and<strong> </strong>the <strong>Super Furry Animals</strong>. A relatively lively performance that kept myself, and the few others around me engaged, <strong>Onions </strong>were light hearted, interesting and easy to listen to. However for all these positives, the end result came out as just slightly above average. Sadly there was no real dynamic to their sound and no sense of adventure in their approach, however with an album due out shortly, I’d still recommend that you give <strong>Onions</strong> a listen.</p>\n<p>6/10</p>\n<p><strong>The Jerzey Street Band:</strong></p>\n<p>You’re not <strong>Bruce Springsteen </strong>and you never will be. If only someone had told the lead singer of <strong>The Jerzey Street Band </strong>this when they first caught him humming along to the tune of ‘<strong>Dancing in the Dark</strong>‘, then I wouldn’t have had to sit through this karaoke act. Initially I was taken in by their <strong>Americana </strong>heavy sound simply as it was different, with the anthemic guitars and occasional yells of enthusiasm breathing life into the sparsely populated room. However as the band’s set slowly began to materialise, you realised that every track was, in effect, exactly the same. Don’t get me wrong, I understand that there is somewhat of a limited range of what one can do with <strong>Americana </strong>music, but the likes of <strong>Springsteen </strong>and <strong>Petty </strong>managed to make a heavily prescribed genre seem timeless and creatively limitless. Unfortunately, <strong>The Jerzey Street Band </strong>simply took painfully ‘cheesey’ lyrics and filled them with the blues influenced agony that they had heard about, not felt themselves.</p>\n<p>5/10</p>\n<p><strong>Unbunny:</strong></p>\n<p><strong>Jarid del Deo </strong>(<strong>Unbunny</strong>) took to the stage initially alone, jokingly stating that the band normally worked as a ‘7 piece’ and that several of the members had fallen ill, so he had had to do some last minute ‘rearranging’. Admittedly not the funniest of jokes, but at least it was some genuine interaction with the 12 person strong audience. Playing his first few tracks on his own with only an acoustic guitar, <strong>Jarid </strong>demonstrated the qualities that make him such a harrowing yet likeable singer/songwriter. <strong>Unbunny </strong>manage to master the feeling of when melancholy and melody meet, with <strong>Jarid</strong>‘s almost conversational vocals channeling very personal and understandable lyrics striking a chord with every person that should stumble upon one of his tracks. These sentiments could be seen even clearer when two bands members came on to support <strong>Jarid</strong>, beginning by playing the fantastic track, ‘<strong>Nothing Comes to Rest</strong>‘. Such was the intimacy of the gig that <strong>Jarid </strong>even obliged a shout out request of ‘<strong>Landslide</strong>‘ from the audience as an encore, playing an acoustic version of the track that was far more heartbreaking than that on his album ‘<strong>Moon Food</strong>‘. I think <strong>Lucy </strong>summed it up best when she said the gig, especially during <strong>Unbunny</strong>‘s set, was ‘eerily awkward’ but that ‘it worked’, and it really did as I left beaming and <strong>Lucy</strong>, new to <strong>Unbunny</strong>, left an avid fan. Unfairly unknown, I highly advise you check out the musical stylings of this fantastic band.</p>\n<p>8/10</p>\n<p><a href=\"https://www.myspace.com/unbunny\" target=\"_blank\">Unbunny Myspace</a></p>\n<p><a href=\"https://www.myspace.com/jerzeystband\" target=\"_blank\">The Jerzey Street Band</a></p>\n<p><a href=\"https://www.myspace.com/onionstheband\" target=\"_blank\">Onions</a></p>\n","slug":"3511-review-unbunny","category":"music","date":1290219330000,"wpid":3511,"isSticky":false,"featured_image":{"width":1946,"height":1551,"src":"2010/11/unbunny_jarid_closeup_2010.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAIAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAQH/8QAHxAAAgEEAgMAAAAAAAAAAAAAAQIDAAQRIQYSMTJR/8QAFAEBAAAAAAAAAAAAAAAAAAAAA//EABcRAAMBAAAAAAAAAAAAAAAAAAABAhH/2gAMAwEAAhEDEQA/AJOXvNHzG8tjd3EYvWEkaKykHsAqgE79hjXjFbdAY1hjWUB5AoDN9ONmlKKFjYlvZk//2Q=="},"createdAt":1587294892824,"updatedAt":1588403562533,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2010/11/unbunny_jarid_closeup_2010.jpg","categories":["music","reviews"]}