{"id":"5e9c329c9b6559241525df14","artists":["5e9b68f27a1236eccfeb200d"],"title":"Interview: Errors","content":"<p><a rel=\"attachment wp-att-3627\" href=\"https://admin.</p><p>crackintheroad.com/music/3519-interview-errors/attachment/errors\"><img class=\"alignnone size-full wp-image-3627\" title=\"errors\" src=\"https://api.crackintheroad.com/uploads/2010/11/errors.jpg\" alt=\"\" width=\"720\" height=\"500\" srcset=\"https://api.crackintheroad.com/images/2010/11/errors.jpg 720w, https://api.crackintheroad.com/images/2010/11/errors-260x180.jpg 260w, https://api.crackintheroad.com/images/2010/11/errors-640x444.jpg 640w, https://api.crackintheroad.com/images/2010/11/errors-165x114.jpg 165w\" sizes=\"(max-width: 720px) 100vw, 720px\" /></a></p>\n<p>One of the co-headline tours of the year saw fellow Scots Errors and The Twilight Sad take to the road together, in what would prove to be an energetic and epic partnership. Both bands having recently released their sophomore records, they were more than eager to showcase their new tracks. Putting in electrifying performances of the highest standards, they showed just why the Scottish scene is regarded by many as the strongest in the UK. Shortly before their set, Crack in the Road caught up with Simon from Errors to find out how the tour was going.</p>\n<p><strong>CitR: You make your own music and you also remix other peoples music, which is it you prefer to do?</strong></p>\n<p>Well they’re both pretty different from each other and I get pleasure out of doing both of them. Making our own music can be more emotional because there is a bunch of us working, Simon in particularly can get really passionate about something and he can come along and say it’s shit and then we’ll argue about that. With the remix thing there is less pressure because it’s not your music, obviously you want to put your own stamp on it but there is not as much pressure if you release that as your own music.</p>\n<p><strong>CitR: How do you go about remixing other music, do you hear a song that you would like to remix or do you get offered?</strong></p>\n<p>It’s a bit of both really, a lot of the remixes we have done have been friends bands of ours or bands we have met on tour, we kind of split it now as Simon or I do it but it depends on who has got in touch and he knows those guys (The Twilight Sad) more than I do but he had quite a tight schedule with it, I think he had like about a week and I think it sounded pretty good as well, we’re hoping to do that live actually on tour.</p>\n<p><strong>CitR: So which places have you found to be most enjoyable and where do you get a better reaction?</strong></p>\n<p>Glasgow and London are the two main ones, Edinburgh has never really happened for us before, it’s really close to Glasgow but people never really used to go out to see music</p>\n<p><strong>CitR: It not really got the same live music vibe as Glasgow anyway…</strong></p>\n<p>People generally come through from Glasgow to see us, they are more willing to travel…</p>\n<p><strong>CitR: What about the rest of Europe?</strong></p>\n<p>We seem to have more of a reaction in France, it think our style really works there, as they have quite a long history of electronic music definitely so I guess that’s makes it a wee bit more sympathetic to what we are doing, plus there is a huge Mogwai following there so we traveled around Europe with Mogwai and that really helped with people coming to our shows as 9 times out of 10 people had been to the Mogwai show and saw us. Germany is still to happen really, we did a tour there but there was a lot of problems with press and we didn’t really happen there which was a bit of a shiter but I think Germany should be alright as the German sounds is kinda like what we do. I think with the last album we branched out a wee bit more.</p>\n<p><strong>CitR: Do you think you learned a lot from them (Mogwai) from the beginning?</strong></p>\n<p>Yeah, I think they taught us a lot and they took us away on tour and stuff and we learned quite quickly how to act and when you’re being a nuisance and stuff like that, and they’re really friendly guys, they’re basically our mates so it was quite easy going.</p>\n<p><strong>CitR: You supported underworld a while back, what was that like?</strong></p>\n<p>Well it taught us a lot, it was our first proper tour with a band and they are a pretty fucking huge band, some of the venues we were playing at were just insane like academies and they all sold out so that was a bit of a shock, we were pretty young, like 4 or 5 years ago now. We learnt a lot about what you’re supposed to do as a support band but I don’t really know if it did anything for us because their fans are different from ours, we didn’t really get a very good reception most nights, we didn’t really sell very much merchandise.</p>\n<p><strong>CitR: Maybe it was a different frame of mind you have to be in…</strong></p>\n<p>Totally like, no offence to their audience but the people who really like them are sort of maybe now in their 30s and some of them aren’t really interested in getting into new music, they like the Trainspotting soundtrack and they maybe liked taking eccies or they used to…</p>\n<p><strong>CitR: I don’t think many of them would be in the right frame of mind at all…</strong></p>\n<p>Yeah but it was fun, it was good to be out and playing in different places.</p>\n<p><strong>CitR: Apart from the remix you might be playing on tour is there anything else you have got lined up for the rest of the dates?</strong></p>\n<p>There is a couple of songs we haven’t played that were doing on this tour but there is no brand new tracks, we’re kinda working on that. Our new album is out next year and we have got the remix album coming out this tour, it’s basically a remix of some of the tracks we have done and its available for the first time here.</p>\n<p><script src=\"https://video.unrulymedia.com/wildfire_11244048.js\" type=\"text/javascript\"></script></p>\n","slug":"3519-interview-errors","category":"interviews","date":1290788133000,"wpid":3519,"isSticky":false,"featured_image":{"width":720,"height":500,"src":"2010/11/errors.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAUG/8QAIhAAAgEDBAIDAAAAAAAAAAAAAQIDAAQRBgcSQQUTIVFh/8QAFAEBAAAAAAAAAAAAAAAAAAAAAv/EABcRAQEBAQAAAAAAAAAAAAAAAAEAAlH/2gAMAwEAAhEDEQA/AMgu4WtI/Gm3it4rZo5PaJBNyJUIBwxnGMDv97qRDu1q6KGONYbIqihQXUsxx9nl8mlKCzNPb//Z"},"createdAt":1587294876353,"updatedAt":1588403562271,"author":"5e9b68b27a1236eccfeb1d07","old_image":"2010/11/errors.jpg","categories":["interviews","music"]}