{"id":"5e9c32ae9b6559241525df35","title":"Gig Review: Veronica Falls @ Sneaky Pete’s 11/11/10","content":"<img class=\"alignnone\" title=\"VF\" src=\"https://userserve-ak.</p><p>last.fm/serve/_/40698147/Veronica+Falls.jpg\" alt=\"\" width=\"500\" height=\"345\" />\n<p><strong>Veronica Falls</strong> are a throwback; a throwback to the glory days of C86 style indie pop and the new young sound of lo-fi Scotland and its main stars in the Pastels and Orange Juice.  It is appropriate then that these latest practitioners of this well loved and much copied sound have made Edinburgh, the home of celebrated indie pop label <strong>Postcard Records</strong>, a stop off on their latest headline tour.</p>\n<p>An interesting proposition,<strong> Veronica Falls</strong> offer up both glamour and style with ramshackle trebly guitars and that atypical indie pop jangle which is in stark contrast to tonight’s support band.<strong> Cloud Nothings</strong> seem intent on bludgeoning the sparse but enthusiastic crowd crammed into this sweaty pit of a venue into submission with a set extremely low on variety but very high on tedium.  The problem is not so much that their songs are bad, more so that they only have one song – a fast paced melodic guitar pop song that they seem to continuously play for the duration of their half hour set; an interminable bore.</p>\n<p>Proving to be a far more captivating experience, <strong>Veronica Falls</strong>, the London based four piece (2 girls 2 boys) exude charm and innocence yet the band’s music is at times strikingly dark with various songs mentioning suicide and death amongst other grizzly subjects, notably “<em>Beachy Hea</em>d” and the<strong> Siouxsie and the Banshees</strong> like  “<em>Found Love In A Graveyard</em>”.</p>\n<p>Their sound is undeniably derivative, however, while the rudimentary set up and sound means the songs can sometimes drift by and not sound as powerful as you would hope, despite the lo-fi set up though the music rattles along sufficiently enough to ensure the audience never lose attention and they provide a set high on melodic indie guitar thrills, their Scottish pop for-bearers would be impressed.</p>\n<p style=\"text-align: center;\"><a href=\"https://veronicafalls.com/\">Veronica Falls Official Site!</a></p>\n<p><script type=\"text/javascript\" src=\"https://video.unrulymedia.com/wildfire_11244048.js\"></script></p>\n","slug":"3523-gig-review-veronica-falls-sneaky-petes-111110","category":"music","date":1290197722000,"wpid":3523,"isSticky":false,"featured_image":{"width":500,"height":345,"src":"2011/06/veronica+falls.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAAAAb/xAAfEAACAgICAwEAAAAAAAAAAAABAgMRAAQFBhITIUH/xAAVAQEBAAAAAAAAAAAAAAAAAAAEBf/EABkRAQADAQEAAAAAAAAAAAAAAAEAAhETIv/aAAwDAQACEQMRAD8AdT6/zu/pwvHqa00fvVp7kAZQWsDyJvxNGwL+5TTcL1xJXWXa2FkViGUJYB/RdfcYyM5xrZDXYuntVn//2Q=="},"createdAt":1587294894725,"updatedAt":1588403562557,"author":"5e9b68b27a1236eccfeb1d33","old_image":"2011/06/veronica+falls.jpg","categories":["music","reviews"]}