{"id":"5e9c32a49b6559241525df23","artists":["5e9b68f87a1236eccfeb208d"],"title":"Review: Frightened Rabbit","content":"<p>Accompanied again by my latest gigging mate, <strong>Lucy Swinton</strong>, we ventured to <strong>Manchester</strong>‘s <strong>Academy 2</strong> for a line up that resulted in an order of ‘promising’, ‘confusing’ and ‘phenomenal’.</p><p> <strong>Admiral Fallow </strong>was not a new name to us here at <strong>CITR</strong>, as we <a href=\"https://api.crackintheroad.com/music/904-review-5-minutes-with-admiral-fallow\" target=\"_blank\">interviewed the band a while back </a>shortly after they had released their debut album, <strong>Boots Met My Face</strong>, and I personally am a huge fan of the melancholic <strong>Scottish </strong>act that is <strong>Frightened Rabbit. </strong>However sandwiched between the two bands was a 4 piece from Hull (I know – but don’t give up yet), called <strong>The Neat</strong>. Having only heard snippets of information about the band, they seemed to be somewhat out of place in the line up, and while they weren’t enveloped by hearty applause, they provided an interesting twist to the night. Here are our thoughts on each of the bands.</p>\n<p><strong>Admiral Fallow:</strong></p>\n<p>A 6 piece band hailing from Scotland, <strong>Admiral Fallow </strong>produced a wonderfully climatic that excited the small number of early fans. Lead singer <strong>Louis Abbott</strong>‘s vocals are overtly Scottish, and as a result <strong>Admiral Fallow</strong>‘s tracks feel more passionately emotive in the narrative that is presented to the listener. However what truly makes <strong>Admiral Fallow</strong>‘s sound rewarding to listen to is the orchestral sound that band achieves through a plethora of instruments, all utilised in such a way that a listener can be subdued into moments of contemplation, or electrified into periods of foot stamping and general merriment. Centred at the front of the stage, the half an hour allocated to <strong>Admiral Fallow </strong>finished far too early as the band had created a real atmosphere of energised and honest music that appealed to a very appreciative audience. Make sure to check out their debut album, ‘<strong>Boots Met My Face</strong>‘, and make it to along one of their gigs as soon as you can.</p>\n<p>8/10</p>\n<p><a href=\"https://www.myspace.com/admiralfallow\" target=\"_blank\">Admiral Fallow Myspace</a></p>\n<p><strong>The Neat:</strong></p>\n<p>With what appeared to be even less of an audience that had greeted <strong>Admiral Fallow</strong>, <strong>The Neat </strong>took to the stage with an entirely different feel to that of those that had preceded them. A 4 piece from Hull, it’s not particularly easy to categorise the sound they appear to have created. Evolving somewhere from a distant punk past, there are obvious influences of <strong>Mark E. Smith</strong> through the bands snarling vocals and screeching guitars. Two tracks that stick to memory are ‘<strong>Fruits</strong>‘ and ‘<strong>In Youth Is Pleasure</strong>‘, both of which featured heavy doses of repetitive lyrics and almost indistinguishable thrashing guitars. Initially dismayed by this seemingly half arsed effort, it was the jerky dancing and warped charisma the band held that enticed me further and kept me interested. I slowly began to realise that in their deconstructed sound <strong>The Neat </strong>have harnessed their punk inspired origins and modernised their sound without losing the sudden, brutal sharpness ethos of their musical ancestors. A band that is worth 3 listens before casting judgement.</p>\n<p>7/10</p>\n<p><a href=\"https://www.myspace.com/uptheneat\" target=\"_blank\">The Neat Myspace</a></p>\n<p><strong>Frightened Rabbit:</strong></p>\n<p>As the headline act that was <strong>Frightened Rabbit </strong>entered the stage, the dynamic of the gig shifted massively as a once sparsely populated room filled to reach near capacity. As on most occasions I’ve seen <strong>Frightened Rabbit</strong>, the focus was entirely upon lead vocalist <strong>Scott Hutchinson</strong>, who regularly bantered friendly and modestly throughout the gig, at one point admitting that he could not wolf whistle, only to be met by a wave of such whistles from the audience. Playing both old and new tracks to perfection, <strong>Hutchinson </strong>& co created a powerfully melancholic atmosphere amongst the audience while still instilling them with enough revered energy to passionately sing back each track. Crashing percussion and transcendental guitars gave <strong>Frightened Rabbit </strong>a real anthemic quality to their music, and with the same whole hearted confidence that I witnessed when I saw the band open for <strong>Modest Mouse </strong>a year ago. To top it all off, in the middle of the set <strong>Hutchinson </strong>performed a fantastic solo acoustic version of ‘<strong>Poke</strong>‘ that silenced the whole room into a contemplative break amongst the otherwise raucous proceedings. A comprehensive and committed set, <strong>Frightened Rabbit </strong>are by far one of the best acts to see live.</p>\n<p>9/10</p>\n<p><a href=\"https://www.myspace.com/frightenedrabbit\" target=\"_blank\">Frightened Rabbit Myspace</a></p>\n<p>Also, please do check out this beautiful video of <strong>Frightened Rabbit</strong>‘s track, ‘<strong>The Loneliness and the Scream</strong>‘.</p>\n<p><object classid=\"clsid:d27cdb6e-ae6d-11cf-96b8-444553540000\" width=\"640\" height=\"385\" codebase=\"https://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=6,0,40,0\"><param name=\"allowFullScreen\" value=\"true\" /><param name=\"allowscriptaccess\" value=\"always\" /><param name=\"src\" value=\"https://www.youtube.com/v/X1Lf7mriehU?fs=1&hl=en_US&rel=0\" /><param name=\"allowfullscreen\" value=\"true\" /><embed type=\"application/x-shockwave-flash\" width=\"640\" height=\"385\" src=\"https://www.youtube.com/v/X1Lf7mriehU?fs=1&hl=en_US&rel=0\" allowscriptaccess=\"always\" allowfullscreen=\"true\"></embed></object></p>\n","slug":"3565-review-frightened-rabbit","category":"music","date":1290474603000,"wpid":3565,"isSticky":false,"featured_image":{"width":600,"height":399,"src":"2010/11/frightened-rabbit.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAUG/8QAHxAAAgICAgMBAAAAAAAAAAAAAQIDBAARBiEHEkGR/8QAFAEBAAAAAAAAAAAAAAAAAAAAAP/EABgRAAMBAQAAAAAAAAAAAAAAAAABAhEx/9oADAMBAAIRAxEAPwDNL5L5HLdNe7O0dVQ5fbezDUZYHro96/Mmx8nsNGrStfaQgFisigE/dYxh054M0//Z"},"createdAt":1587294884305,"updatedAt":1588403562405,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2010/11/frightened-rabbit.jpg","categories":["music","reviews"]}