{"id":"5e9c32a69b6559241525df26","artists":["5e9b68c77a1236eccfeb1d9b"],"title":"Interview: Alphabet Backwards","content":"<p><a rel=\"attachment wp-att-3591\" href=\"https://admin.</p><p>crackintheroad.com/music/3575-interview-alphabet-backwards/attachment/betuse\"><img class=\"alignnone size-full wp-image-3591\" title=\"betuse\" src=\"https://api.crackintheroad.com/uploads/2010/11/betuse.jpg\" alt=\"\" width=\"600\" height=\"480\" srcset=\"https://api.crackintheroad.com/images/2010/11/betuse.jpg 600w, https://api.crackintheroad.com/images/2010/11/betuse-260x208.jpg 260w, https://api.crackintheroad.com/images/2010/11/betuse-494x395.jpg 494w, https://api.crackintheroad.com/images/2010/11/betuse-165x132.jpg 165w\" sizes=\"(max-width: 600px) 100vw, 600px\" /></a></p>\n<p>Forming a quintessential part of the vibrant, diverse Oxford music scene, twee outfit <strong>Alphabet Backwards</strong> release their new EP today. The three track release entitled <em>The Superhero EP</em> is as good an introduction to the ambitious band as you are going to get. Tearing through the songs in under the ten minute mark, it’s indie pop at it’s very best; concise, emotive and entertaining. After myself <a href=\"https://admin.crackintheroad.com/music/3350-review-alphabet-backwards-the-superhero-ep\">reviewing</a> the EP a couple of weeks back, I was lucky enough to be able to put a few questions to the guys. Also be sure to check out their newly shot video for Blink of an Eye, my personal favourite from the EP.</p>\n<p><object classid=\"clsid:d27cdb6e-ae6d-11cf-96b8-444553540000\" width=\"640\" height=\"385\" codebase=\"https://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=6,0,40,0\"><param name=\"allowFullScreen\" value=\"true\" /><param name=\"allowscriptaccess\" value=\"always\" /><param name=\"src\" value=\"https://www.youtube.com/v/jdtGcliW70M?fs=1&hl=en_US\" /><param name=\"allowfullscreen\" value=\"true\" /><embed type=\"application/x-shockwave-flash\" width=\"640\" height=\"385\" src=\"https://www.youtube.com/v/jdtGcliW70M?fs=1&hl=en_US\" allowscriptaccess=\"always\" allowfullscreen=\"true\"></embed></object></p>\n<p><strong>Crack in the Road: How did Alphabet Backwards come about?</strong></p>\n<div><em>James – It started as one, me and grew to five. As the type of music  being made is a bit more upbeat, I certainly could not manage creating the  the toe tapping tunes live without the other four. </em></div>\n<div><strong><em><br />\n</em></strong></div>\n<div>\n<div><strong><em> </em></strong></div>\n</div>\n<div><strong>CitR: What would you cite as your main inspirations, both musically and otherwise?</strong></div>\n<div><span style=\"color: #000000;\"><br />\n</span></div>\n<div>\n<div><em>The joy of Alphabet Backwards derives from the varied influences for  each member. I would always say I am a sucker for pop music and a hook but, do  listen to a lot of genres. It is always nice getting in to Paul’s car for  practice and hearing a little Caribou or Kyte. Thankfully a love of the 80’s  between Rob and I and a joy for Graceland by Paul Simon between us all keeps us  together. </em></div>\n<div><strong><em><br />\n</em></strong></div>\n<div>\n<div><strong><em> </em></strong></div>\n<div><strong>CitR: Which cities are your favourite to play gigs in?</strong></div>\n<div><strong><br />\n</strong></div>\n</div>\n<div>\n<div><em>Oxford is obviously a mainstay for us because, as  they say, home is where the heart is – it’s great to see so many  friends and family turn up. We have been getting a good amount  of press there lately which helps to bring people to  shows, we often get to play with bands who we have ties with  which is always a pleasure. Lets not forget Truck Festival which is just always amazing. </em></div>\n<div><em><br />\n</em></div>\n<div><em><em>I love Manchester a lot as a city but, feel we have found a second  home in Brixton thanks to James Ketchell. He is a promoter for a night called  Backstreets which I believe is named after something to do with  Springsteen. Him and I do not agree on Springsteen. His only redeeming  feature is that he has Steve Van Zandt in his band. So, Springsteen is only cool  by proxy!</em></em></div>\n<div><em><em><br />\n</em></em></div>\n<div><em> </em></div>\n<div><em>Also can’t forget Cardiff and the Zoopop guys… got to adore that  Welsh capital – we were honoured to play a slot at SWN festival this year  where we got to see an incredible amount of new music talent, and wander  round as many Cardiff venues as we could!</em><span style=\"font-family: Calibri;\"><em> </em></span></div>\n<div><strong><span style=\"font-family: Calibri;\"><em><br />\n</em></span></strong></div>\n</div>\n<div><strong>CitR: What has been your most embarrassing tour moment    to date?</strong></div>\n<div><strong><br />\n</strong></div>\n</div>\n<div><em>I guess I have fallen over on stage and we have all received our fair share of parking tickets, but I do not believe that these can really be classed as embarrassing. I can tell you about the best moment of this year? We were at Weyfest which is a festival that closes down at around the midnight mark, however this year we stumbled across a rogue chicken rotisserie playing funk music past the curfew. There was about 30 of us essentially just dancing to funk music around the rotating chicken, until the feds came and shut it down. We then all wandered back to the tents before having a moment with laughter followed by tears because of laughter…. When will innuendos stop being funny?</em></div>\n<div><strong><em><br />\n</em></strong></div>\n<div><strong>CitR: How did you go about recording the Superhero EP?</strong></div>\n<div><strong><br />\n</strong></div>\n<div><em>Recording the Superhero Ep was an absolute delight. We spent few days where we rehearse at The Coldrooms in Cumnor with Rob from ‘A Silent Film’. He produced it for us and brought our musical vision to life. It was a really laid back affair. Recorded most of it live then just a bit of tinkering here and there – easy as ABC!… or should we say ZYX? We really just wanted to make it sound bright and energetic, but with the warmth of our live sound. Anyway, to cut the story short – Rob did all the hard work, we made the tea and paid him in cake.</em></div>\n<div><strong><em><br />\n</em></strong></div>\n<div><strong>CitR: The songs seems to contain very personal lyrics, almost autobiographical, would you say much of your inspiration comes from real life events?</strong></div>\n<div><em><br />\n</em></div>\n<div><em>I would agree. Most lyrics come from a very personal place. I write in train of thought, so i guess it is just easier to be completely personal as the words will then come a lot easier. It has been purely coincidental but the three tracks in order actually tell the story of my last relationship, from the meeting to the realisation that it is all over. But, at the same time I am a pretty positive person or maybe just lazy and can’t be bothered with faff so, I try to maintain a sense of happiness and understanding within the lyrics. Two sides to every story and whatnot.</em></div>\n<div><strong><br />\n</strong></div>\n<div><strong>CitR: After the upcoming release of the Superhero EP, do you have any further plans for releases?</strong></div>\n<div><strong><br />\n</strong></div>\n<div>\n<p><em>Currently we are discussing maybe a single every two months next year – certainly these discussions are in there very early stages but it would be nice. We enjoy writing, and it seems a shame not to try to unleash whatever we feel deserves the light of day. Currently there’s quite a few ideas in the bag, we are looking to record a brand new track called ‘Plastic’ very early 2011. This will be interesting for us as it will be our first unsigned release, after leaving our little record label home in a bid to take the bull by the horns and look for a new direction. A clean slate, if you will – D.I.Y. for now.</em></p>\n<p><strong>CitR: What was the first record you can remember truly falling in love with?</strong></p>\n<p><em>Always a tough question, from my childhood I remember the first Kylie album and the Chess soundtrack but, I’m not sure you could say I completely fell in love with these records. If you mean album then probably “This Is Hardcore” by Pulp. I think by that point I was old enough to know what love and a quality record felt and sounded like.</em></p>\n<div><strong><em><br />\n</em></strong></div>\n<div><strong>CitR: And a couple less serious… your new EP is titled Superhero, who is the  ultimate superhero?</strong></div>\n</div>\n<div><em><br />\n</em></div>\n<div><em>Probably Superman as he could probably defeat all the others. Spiderman could potentially catch him in his web but, the assumption would be that superman could out run him. Batman is just a rich kid with no actual powers but a pretty face and “chicks love the car”. I believe that quote will show the last batman i watched contained Val Kilmer. Val Kilmer? When was he last relevant… Buzz Lightyear is just an action figure. Wolverine is not even a match as Superman could bend the titanium. Clam Man is pretty awesome but, still don’t think he could beat Superman as he is just a clam with human legs so, I am gonna stick with Superman.</em></div>\n<div><em><br />\n</em></div>\n<div>\n<p><strong>CitR: And if you could have any super power of your own, what would it be?</strong></p>\n<p><em> I would love the ability to live both sides of a decision for a while to see which one works out better. Selfish hey! But I think it would surprise you though how many people would actually be villains, like using invisibility to rob banks… a superhero has got to make a living somehow, we cant all be off saving the planet, too many cooks and all that.</em></p>\n<p style=\"text-align: center;\"><a href=\"https://www.myspace.com/alphabetbackwards\">Alphabet Backwards on Myspace!</a></p>\n</div>\n<div><span style=\"font-family: Calibri;\"><em><br />\n</em></span></div>\n","slug":"3575-interview-alphabet-backwards","category":"interviews","date":1290446524000,"wpid":3575,"isSticky":false,"featured_image":{"width":600,"height":480,"src":"2010/11/betuse.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAIAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAEH/8QAIBAAAgMAAgEFAAAAAAAAAAAAAQQCAxEABQYSEyFRYf/EABUBAQEAAAAAAAAAAAAAAAAAAAME/8QAGREBAQEAAwAAAAAAAAAAAAAAAQIAAxFB/9oADAMBAAIRAxEAPwDOOi836pxhFZNerpFF1K6yqB7kb7wdsmNGRJz1An5iQPvkbdcbbuYU87ZC905WViyeSESdGgEAHPzjjk1cUi+5ZTpKB3//2Q=="},"createdAt":1587294886112,"updatedAt":1588403562429,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2010/11/betuse.jpg","categories":["interviews","music"]}