{"id":"5e9c329e9b6559241525df17","artists":["5e9b68c77a1236eccfeb1d6f"],"title":"Review: Adrian Roye & The Exiles – Telephones & Traffic Lights EP","content":"<p><a rel=\"attachment wp-att-3621\" href=\"https://admin.</p><p>crackintheroad.com/music/3589-review-adrian-roye-the-exiles-telephones-traffic-lights-ep/attachment/screenshotcrack\"><img class=\"alignnone size-totallysizedforever wp-image-3621\" title=\"screenshotcrack\" src=\"https://api.crackintheroad.com/uploads/2010/11/screenshotcrack-740x431.png\" alt=\"\" width=\"740\" height=\"431\" /></a></p>\n<p>After any “indie” band penetrate the mainstream, there is always an influx of similar, over-hyped, copycat artists who attempt to follow in their footsteps. Whether they existed before said penetration or in numerous cases, that they have simply ridden on the back of the wave generated by a like band receiving mainstream recognition. This is very much true in the case of <strong>Mumford & Sons</strong>, having released one of the largest selling albums of 2010, received national radio play as well as having played all the major festivals over the UK, they are clearly a band at the top of their game. I mean, you know you’ve made it when you get name-dropped by musical connoisseur David Cameron, right?… Right?</p>\n<p>All my prejudices against Mumford & Sons aside, I have been astounded by the number of idealistic groups that have sprung up, working on the assumption that sticking a violin and a cello into your music will suddenly make it otherworldly and all the more worthy to listen to. So I cautiously approach any artist who has been tarnished with the “pop-folk” label, in this incidence, said artist was none other than London based quartet<strong> Adrian Roye & The Exiles</strong>. Having heard nothing by the group before, I started with debut single “<em>The Only Poster Child</em>“, a rousing three minute affair, debating the trials and tribulations of growing up in a community ravaged with racism, violence and intolerance of youth. The first impressions were extremely promising, sure there are the dreaded pop folk tendencies, but lead singer Adrian Roye’s elegant and soothing voice hastily covers those cracks up.</p>\n<p>The groups newest release and debut EP titled <em>Telephones & Traffic Lights</em> only set to further compound my confidence in <strong>Adrian Roye & The Exiles</strong>. The bitter <em>Valentines </em>showcases a darker, more elusive side to the band, enhanced by Simon Lewis’s melancholic cello, whilst Roye’s lyrics recall the searing pain of losing an adored lover. The self-titled track and EP opener is lightly comparable to <strong>Newton Faulkner</strong> at his utmost, (but rarely reached brilliant) however unlike the despicable dread locked tawny hippie, the textures and layers embedded in the song allow it to breath gracefully. My personal favourite, <em>Whatcha Gonna Do With My Heart</em>, is a stirring but all the same enjoyable affair, Roye’s voice injecting pure, unfiltered emotion into the track. Having already garnered an avid and devoted fan-base in their hometown, <strong>Adrian Roye & The Exiles</strong> will be looking to embrace 2011 with open arms, allowing them to take their soulful, majestic music to a greater audience.</p>\n<p style=\"text-align: center;\"><a href=\"https://www.adrianroyemusic.com/\">Adrian Roye & The Exiles Official Site!</a></p>\n<p><script src=\"https://video.unrulymedia.com/wildfire_11244048.js\" type=\"text/javascript\"></script></p>\n","slug":"3589-review-adrian-roye-the-exiles-telephones-traffic-lights-ep","category":"music","date":1290642222000,"wpid":3589,"isSticky":false,"featured_image":{"width":680,"height":510,"src":"2010/11/8063_full.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAAAAX/xAAhEAABAwMEAwAAAAAAAAAAAAACAQMEAAURBgcSEyEykf/EABUBAQEAAAAAAAAAAAAAAAAAAAED/8QAGBEAAwEBAAAAAAAAAAAAAAAAAAERIQL/2gAMAwEAAhEDEQA/AIlg17fpGmLlNk3a4PC1PciAyTyl0pwUgPkvksYVPlWo2+t3jx2mXIzhm2CARd+MqiYVfWlKl2swa6f/2Q=="},"createdAt":1587294878151,"updatedAt":1588403562296,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2010/11/8063_full.jpg","categories":["music","reviews"]}