{"id":"5e9c32a19b6559241525df1d","title":"Real Britannia","content":"<p><a rel=\"attachment wp-att-3609\" href=\"https://admin.</p><p>crackintheroad.com/life/3598-real-britannia/attachment/cricket-the-ashes-2009-npower-fifth-test-england-v-australia-day-four-the-brit-oval\"><img class=\"alignnone size-totallysizedforever wp-image-3609\" title=\"Cricket - The Ashes 2009 - npower Fifth Test - England v Australia - Day Four - The Brit Oval\" src=\"https://api.crackintheroad.com/uploads/2010/11/CRICKET-England-147_172-740x581.jpg\" alt=\"\" width=\"740\" height=\"581\" /></a></p>\n<p>1978/79 – The Winter of discontent. 2010/2011 – The Winter of extremist ascent? It is without question we live in a time of unbridled cynicism. Firstly, the Casino bankers drop us into a financial crisis deeper than a Chilean mineshaft. Then, students siege the Millbank building in central London, depicting a clearly disillusioned and downtrodden youth. Finally, the insult to an already gaping injury, our darling Jack Duckworth is cruelly carted off our television screens.</p>\n<p>In all seriousness, Caviar Cameron may yet live to lament the decision to put a proverbial cap in the ass of the working class student. However, that is an argument for another article. The right wing has also followed suit in voicing its dissatisfaction at the current economic, political and social climate of ‘Broke Britain’. Indoctrinating the latest wave of Lacoste clad lethargic lowlife across the Tinpot towns of Britain, the EDL, as ever, continues to sustain its sterling job of ‘defending’ our England.</p>\n<p>Fortunately, this empire wasn’t built on fascist propaganda, quite the contrary. Nor was it erected by millionaire footballers, performing a ‘Bukkake’, on any budding Kerry Katona they find to participate in such a sanctified ritual; or the bankers funding such frivolity for that matter. No good sirs, this realm was built on willow and cork.</p>\n<p>An old Spanish proverb, or Harvey Dent, depending on your predilection, once said ‘The night is darkest before the dawn’. In times of seemingly infinite depression, it is often advised, in the medical profession, for a patient to craft themselves a positive imagery of the future. To articulate myself in Orwellian philosophy, ‘What is happiness but the near future?’</p>\n<p>So, peering around a sick soaked kitchen/ lounge area, laden with sweaty adolescents, a broken Velux window and an impending fine off a landlord, involving bathtubs and a nightclub roof, I, akin to many in Britain, am in dire need of a little positive Zen. Enter the Ashes stage right.</p>\n<p>The modestly sized urn, contested between the bitter sporting rivals of England and Australia since the 19th century, will bask in warmer climes than the Lords trophy cabinet this winter. As the 66th duel between Strauss and Ponting commences. A sport all too readily written off as jingoistic brouhaha by many, Cricket, I hasten to remind its sceptics, can be traced back to solid Tudor roots in the 16th century.</p>\n<p>It is a game of convoluted rules, mind boggling jargon and contrary to popular belief, an athletic level of physicality and a chess player’s degree of strategy; despite George Best’s claims that it was ‘The only sport you can get fat whilst playing’. Only a man of pious cricket faith could elucidate the magnitude of ‘6 Jaffa’s in the corridor of uncertainty ‘or a ‘slog into cow corner’. Given the archetypal aspersions surrounding ‘The National Sports’ players within the Premier and Football leagues, it is refreshing to see that Cricketers in this country are seldom reported to be partaking in 14 hour coke fuelled sex binges at their captain’s house.</p>\n<p>Although it is not a game wholly exempt from controversy. With the topical betting scandal in Pakistan, gang influence within the Sub-continent and, of course, the passing of Preston’s prodigal son, Mr Flintoff, through professional ranks this decade, Cricket has had its moments of disrepute. Though, there is an undeniably assured purity in the event of any Ashes series, which is now infrequency in the money obsessed epoch of 21st century sport. The expectant air cradling this latest series is, also, more pragmatic than that which culminated in the despondent disappointment of last summer’s Football World Cup. The opening venue in Brisbane, known as ‘The Gabbattoir’ for its barbarous atmosphere, despite the high octane rivalry, will see fans freely mix and drink together, without a hint of trouble; though the jocular ‘sledging’ will be at a premium.</p>\n<p>Living in a country so preoccupied with the self serving continuation of social disparity, Cricket can offer many of the disenchanted citizens a much needed respite this winter. The Ashes will once again serve up its eternally endearing ingredients of drama, scintillating sport and above all else, an unparalleled combination of competition and respect.</p>\n","slug":"3598-real-britannia","category":"life","date":1290550926000,"wpid":3598,"isSticky":false,"featured_image":{"width":4000,"height":3142,"src":"2010/11/cricket-england-147_172.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAIAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAIG/8QAIxAAAgECBAcAAAAAAAAAAAAAAQIDAAQFESEiEhMlMmFxgf/EABUBAQEAAAAAAAAAAAAAAAAAAAMF/8QAGBEAAwEBAAAAAAAAAAAAAAAAAQIDADH/2gAMAwEAAhEDEQA/AM+DiyWscl3fo9vOqqFVSBwa6r73DzlVxYwvKTqsx2jttwB81pShooHNRlVm6d//2Q=="},"createdAt":1587294881798,"updatedAt":1588403562352,"author":"5e9b68b27a1236eccfeb1d42","old_image":"2010/11/cricket-england-147_172.jpg","categories":["life"]}