{"id":"5e9c34709b6559241525e218","title":"5 Minutes With: Egyptian Hip Hop","content":"<p style=\"text-align: center;\">Quirky, original, outlandish.</p><p> Egyptian Hip Hop are one of the most exciting bands of the year, despite only having recently released their debut single. Having already received coverage from all areas of the press, including NME to The Guardian, the volcanic cloud of hype which is gathering behind them is enough to rival even that of Iceland. With a whole plethora of upcoming gigs, ranging from Rome to Amsterdam to Glastonbury, Egyptian Hip Hop are one band not to miss this summer.</p>\n<p style=\"text-align: center;\">Egyptian Hip Hop kindly agreed to answer a few questions for us, (for more information on the legendary potted plan,t check out their myspace blog!).</p>\n<p style=\"text-align: center;\"><em>CITR: </em>If you had to cite one band as a major musical influence on you, who would it be?</p>\n<p style=\"text-align: center;\"><strong>If it had to correlate with the whole band i’d probably say Talking Heads.</strong></p>\n<p style=\"text-align: center;\"><em>CITR: </em>What has been your favourite gigging experience to date?</p>\n<p style=\"text-align: center;\"><strong>Hmmm maybe our single launch in Manchester, all our friends and our friends bands came down to play and party. It was beautiful.</strong></p>\n<p style=\"text-align: center;\"><em>CITR:</em> Can you give us any clue when your debut album will be released?</p>\n<p style=\"text-align: center;\"><strong>Hopefully early next year, but that’s just me guessing because we haven’t even started to write it yet.</strong></p>\n<p style=\"text-align: center;\"><em>CITR: </em>How is the potted plant doing?</p>\n<p style=\"text-align: center;\"><strong>It’s doing mighty fine, it currently resides in Alex’s bedroom i think.</strong></p>\n<p style=\"text-align: center;\"><em>CITR:</em> Do you have any intentions to adopt any other vegetation in the near future?</p>\n<p style=\"text-align: center;\"><strong>Maybe a couple of Plastic palm trees maybe, who knows.</strong></p>\n<p style=\"text-align: center;\"><em>CITR: </em>Do you agree with the majority of the critics, that since the plant joined you have undoubtedly become a better band?</p>\n<p style=\"text-align: center;\"><strong>Completely, He’s made of plastic so we can always rely on him to show up. We always make sure he’s turned up loud in all of our monitors.</strong></p>\n<p style=\"text-align: center;\"><em>CITR: </em>Messi or Ronaldo?</p>\n<p style=\"text-align: center;\"><strong>I couldn’t care less if I tried I’m afraid.</strong></p>\n<p style=\"text-align: center;\"><em>CITR: </em>Mac or PC?</p>\n<p style=\"text-align: center;\"><strong>Pac.</strong></p>\n<p style=\"text-align: center;\"><em>CITR: </em>If you could be any animal (or plant) what would you be, and why?</p>\n<p style=\"text-align: center;\"><strong>Probably a Clant. A Plant Cat.</strong></p>\n<p style=\"text-align: center;\"><a href=\"https://www.myspace.com/egyptianhiphop\">Listen on Myspace</a></p>\n","slug":"360-5-minutes-with-egyptian-hip-hop","category":"interviews","date":1271672870000,"wpid":360,"isSticky":false,"featured_image":null,"createdAt":1587295344265,"updatedAt":1587825939088,"author":"5e9b68b27a1236eccfeb1d27","categories":["interviews","music"]}