{"id":"5e9c32909b6559241525deff","artists":["5e9b693e7a1236eccfeb2507"],"title":"Review: Shad – TSOL","content":"<img class=\"alignnone\" title=\"SHAD\" src=\"https://hunt.</p><p>fm/images/guests/shadk.jpg\" alt=\"\" width=\"600\" height=\"594\" />\n<p>If you’ve been an avid follower of this blog since it’s initiation you may recall a post way back in early April concerning a certain Ontario based rapper by the name of Shad. Criminally overlooked by many, especially in the UK, his intelligent, witty lyricism, combined with an exceptional understand of sampling and mixing, has seen him named in many lists of top Canadian rappers. Earlier in the year saw Shad return with his third official full length album, the mysteriously titled TSOL. Despite his humorous cynicism and cutting wit, Shad can’t be accused of not taking his music seriously, having previously touched on subjects such as the Rwandan Genocide and other personal issues.</p>\n<p>Viewing several interviews with Shad, it becomes evident that he must be immensely bored of answering the obvious and ill-considered question; “what does TSOL mean?”. Upon first reading of the album titled, I immediately assumed it was a reference to the TV show Lost, with the title spelled backwards. Upon listening to the album, my suspicions were further raised by the inclusion of the line; “I get so lost, lost as Matthew Fox”. However, through experiencing the record I began to realise that the meaning of the title didn’t matter, the message is in the music and lyrics, any hidden truths uncovered are all down to the listeners discretion.</p>\n<p>The entire record flows with ease, an attribute only achieved by someone who is convinced of their own talents, but completely modest about it. Weeks before TSOL’s release, Shad dropped a teaser on his site, in the form of a clip from album track Yaa I Get It, tongue in cheek and fast paced, opening with the satirical line “maybe I’m not big ‘cus I don’t blog or twitter…it’s not like I’m bitter:, intelligent and cutting, whilst being admirable self-aware. It’s not hard to see my recent single Rose Garden was chosen for release, by far the most accessible and instantaneously catchy. Sampled female vocals provide a welcome contrast to Shad’s coolly delivered verses, his lyrical proficiency is a joy to listen to, thought-provoking yet entertaining.</p>\n<p>Elsewhere on the album, DJ TLO’s production is immaculate, especially on highlight Telephone, again using a female sample, there’s touches of Kanye, but it’s not as unashamedly brash or arrogant. Self-realism is where Shad excels, honesty and integrity allow his lyrics to really connect with the listener, such as on “At The Same Time”, a moving ode to numerous wrong in the world. He’s certainly mature from his previous record, without straying from his original roots or inspirations, this is considered rap music at it’s utmost best.</p>\n<p><script type=\"text/javascript\" src=\"https://video.unrulymedia.com/wildfire_11244048.js\"></script></p>\n","slug":"3653-review-shad-tsol","category":"music","date":1291842123000,"wpid":3653,"isSticky":false,"featured_image":{"width":600,"height":594,"src":"2011/06/shadk.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAABgL/xAAiEAABAwQBBQEAAAAAAAAAAAABAgMEAAUREiEGIkFRcTH/xAAVAQEBAAAAAAAAAAAAAAAAAAAEBf/EABsRAAICAwEAAAAAAAAAAAAAAAERAAIDBDET/9oADAMBAAIRAxEAPwC7Pb5d46iekO3iW3CJkl1Lb7m7WiylOE511Pkn1imdvhzRAjBuap1AaTqtTisqGByefNEZ8WOzOBZYabJlKSShAGQXCoj5tz95pypCdj2j99UHzNS3K2Tfym1gON8E/9k="},"createdAt":1587294864939,"updatedAt":1588403562084,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/06/shadk.jpg","categories":["music","reviews"]}