{"id":"5e9c32949b6559241525df05","artists":["5e9b68da7a1236eccfeb1e8c"],"title":"Review: Boy & Bear","content":"<p>Walking into Manchester’s fantastic <strong>Night & Day Cafe</strong>, I was met with a packed out room that was bustling with excitement and anticipation.</p><p> The Australian folk outfit <strong>Boy & Bear </strong>appear to have massed quite a large and enthused following since they were first seen supporting <strong>Laura Marling </strong>several months back. A bottle of finest Newcastle Brown in hand, and my colleague for the night <strong>Jonny Hudspith </strong>perched up to the bar with me, <strong>Andrew Davie </strong>took to the stage.</p>\n<p><strong>Andrew Davie:</strong></p>\n<p>The ex-lead man from <strong>Cherbourg</strong>, <strong>Andrew Davie </strong>certainly fitted the folky theme of tonight’s proceedings, but perhaps his solo nature would be lost amongst the swathes of <strong>Boy & Bear </strong>fans? Answer: absolutely not. Quiet yet powerful, <strong>Andrew Davie </strong>produced a set that grabbed the attention of many in the audience. His tracks are very personal, regularly referencing himself and other figures or characters, providing a window of intimacy that instantly absorbs your attention. It is <strong>Davie</strong>‘s lyrics that separate him from the countless others who consider themselves ‘singer/songwriters’, as within his tracks the lyrics portray a sense of painful questioning that is soothed by an endearing resilience while remaining personal enough to become accessible for an audience to appreciate. However credit must also be attributed to <strong>Davie</strong>‘s vocals, which have tinges of <strong>Conor Oberst </strong>and <strong>Bon Iver</strong> in them, as while much of his tracks’ content express pain and hurt, <strong>Davie</strong>‘s vocals portray a feeling of innocent naivety that softens yet empowers each track. Particular highlights in his set were ‘<strong>Elysium</strong>‘ and ‘<strong>Dangerous Thoughts</strong>‘, and while <strong>Davie </strong>is yet to officially release any of his solo material, I recommend you check out this fantastic artist post haste.</p>\n<p>8/10</p>\n<p><strong>Lupen Crook:</strong></p>\n<p>Moving away from the quiet atmosphere of <strong>Andrew Davie</strong>, <strong>Lupen Crook </strong>& co took to the stage with a clear exuberance. Reported by many as producing a ‘twisted take on folk music’, <strong>Lupen Crook </strong>produced a set that was lively and entertaining. <strong>Lupen</strong>‘s vocals are not too dissimilar to a slightly calmer <strong>Frank Turner</strong>, however they contain the same spirit and energy that <strong>Turner</strong> manages to encapsulate in his tracks. This mixed with erratic clangs of percussion and jangly guitars, <strong>Lupen Crook </strong>certainly provided the audience with a sharp contrast to the music that was to act as the night’s finale. However <strong>Lupen </strong>only received a mild reception from an audience that appeared to initially be interested and excited about his twisted folk, but then quite readily descended back into their own batches of small talk. A good performance that sadly still leaves the question unanswered as to why <strong>Lupen Crook </strong>hasn’t made more of a name for himself.</p>\n<p>7/10</p>\n<p><strong>Boy & Bear:</strong></p>\n<p>With an immediate charisma and charm, <strong>Boy & Bear </strong>produced a flawless and engaging set that left no fan wanting. Sparked by their earlier appearance<strong> </strong>supporting <strong>Laura Marling</strong>, people quite oddly compared the band to <strong>Mumford & Sons</strong>. Now while the band do play folk inspired music, and are known to wear their fair share of tweed, it is here that the comparison to <strong>Mumford </strong>& co should end. While the band do centre around a central figure of <strong>Dave Hosking</strong>, I would be more tempted to compare the band’s sound to that of <strong>Local Natives</strong>. The music is of course far more acoustic than that of <strong>Local Natives</strong>, <strong>Boy & Bear </strong>include that same dreamy yet empowered sound that floods the music of <strong>Local Natives</strong>. Choral vocals layered throughout music which is buoyed by reverb-y guitars and centralised percussion is a common feature between the two bands and, as a result, gives <strong>Boy & Bear </strong>the charm of a folk band whilst creating the musical integrity of further reaching genres. However regardless of the debate of musical comparisons, <strong>Boy & Bear </strong>have managed to create a refreshing sound that is catchy enough to dance to and interesting enough to hold your attention. The band have recently released their EP ‘<strong>With Emperor Antarctica</strong>‘, which I highly recommend you purchase as soon as you can, with ‘<strong>Rabbit Song</strong>‘ and ‘<strong>Mexican Mavis</strong>‘ being particular highlights.</p>\n<p>9/10</p>\n<p><a href=\"https://www.myspace.com/boyandbearmusic\" target=\"_blank\">Boy & Bear Myspace</a></p>\n<p><a href=\"https://www.myspace.com/andrewdavie\" target=\"_blank\">Andrew Davie Myspace</a></p>\n<p><a href=\"https://www.myspace.com/lupencrook\" target=\"_blank\">Lupen Crook Myspace</a></p>\n","slug":"3655-review-boy-bear","category":"music","date":1291765460000,"wpid":3655,"isSticky":false,"featured_image":{"width":718,"height":720,"src":"2010/12/boy-and-bear.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAABQH/xAAlEAABAwQBAgcAAAAAAAAAAAABAgMEAAURIRITQQYUFiJCgaH/xAAVAQEBAAAAAAAAAAAAAAAAAAAAAv/EABkRAAIDAQAAAAAAAAAAAAAAAAABAgMRQf/aAAwDAQACEQMRAD8AGmx75cICZDTXUYAy8skJIV3GQD239io1Z55aQS9aweI0WVa/KY8LzZXoa+I8y/wCG/b1DjYTnVGsyXyy2S85niPkaKO6W6oLh//Z"},"createdAt":1587294868370,"updatedAt":1588403562141,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2010/12/boy-and-bear.jpg","categories":["music","reviews"]}