{"id":"5e9c32839b6559241525deea","title":"An Alternative Christmas","content":"<p>I’ll be honest, I do love Christmas.</p><p>  I have a lot of time for Wham and Mariah Carey, and I am already excited for the multiple viewings of Home Alone and Elf in a week or so.  However, there are only so many times you can listen to Chris Rea before biting your own hands off, and Band Aid has the unfortunate side effect of inducing a death rage, so it is brilliant that this year some genuinely decent alternative Christmas songs have been released.  Moshi Moshi have released <em>A Christmas Gift For You Ep</em>,  Target are offering <em>The Christmas Gig</em> for free, whilst The Futureheads have celebrated that ‘Christmas Was Better In The 80s’.</p>\n<p>Moshi Moshi have long been heralded as the kings of breaking alternative music, and this EP features the best of dreamy, acoustic talent that the label has to offer, with Slow Club and James Yuill putting their spin on instantly recognisable favourites, but the undoubted highlight is <a href=\"https://www.youtube.com/watch?v=HtS9FiZw9NE\">Summer Camp’s version of ‘Christmas Wrapping’. </a>Perfectly suited to Elizabeth Sankey’s voice, over minimalist drums and the pre-requisite chimes, this cover builds as Jeremy Warmsley joins the chorus, with the distorted vocals and vague electronica making an indisputably cheesey hit both relevant and endearing.  As a track it achieves the impossible; both embraces the original to the extent that it is self-consciously cheeky, but stamps enough personality on the song to be achingly cool and fun.</p>\n<p>Next, to the department store Target, who have released an inspired compilation of free Christmas songs entitled <a href=\"https://www.target.com/Free-Holiday-Music/b?ie=UTF8&node=2492229011\"> <em> The Christmas Gig</em></a> , featuring some fresh new shoegaze Amercian stuff, mixed with a couple of Christmas crooners by Little Isidore and Little Jackie, and then Blackalicious.. Just because.  The stand out track though is Best Coast and Wavves collaboration on ‘Something For You’, replete with sleigh bells galore.  It is simply a nice, comfortable, lo-fi ode to the festive season, with duel vocals by Bethany Cosentino and Nathan Williams; the fact that they’re currently dating explains the innocent, yet inclusive chemistry between the pair.  It is a genuinely good song, exclusive of any seasonal motive, and is a bitch for getting stuck in your head, with the harmonised falsetto of the two giving the track a 60s, Beach Boys edge, perfect for keeping warm in the snow.</p>\n<p>Finally, The Futureheads have released a fantastically original and yet oddly familiar Christmas single- <a href=\"https://www.youtube.com/watch?v=SHNpS-pnH-M\">‘Christmas Was Better In The 80s’.</a> It has acapella carolling, hallelujahs and a singalong chorus.  You could literally not ask for more; there is even an introductory piano accompaniment, before the classic rock guitar hook kicks in.  This isn’t a song that relaxes, the melody is consistently altered to encapsulate the traits that the band feel a Christmas hit should have, and as a result sounds like every festive song you’ve ever enjoyed, but with a geordie twist.</p>\n","slug":"3663-an-alternative-christmas","category":"music","date":1292343147000,"wpid":3663,"isSticky":false,"featured_image":{"width":404,"height":305,"src":"2010/12/summercamp.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAIAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAQG/8QAHhAAAgEEAwEAAAAAAAAAAAAAAQMCAAQFEQYSIUH/xAAUAQEAAAAAAAAAAAAAAAAAAAAF/8QAFxEBAQEBAAAAAAAAAAAAAAAAAQIAEf/aAAwDAQACEQMRAD8Ah4zyvOLu77H45Ebh0md/JEShBZPYknY0Y6FbVHOMBcJW4scosiJmB0THY3o+/KUoq7ZDmXiCjrv/2Q=="},"createdAt":1587294851751,"updatedAt":1588403561901,"author":"5e9b68b27a1236eccfeb1d4c","old_image":"2010/12/summercamp.jpg","categories":["music","reviews"]}