{"id":"5e9c32929b6559241525df02","artists":["5e9b690a7a1236eccfeb21bd"],"title":"Review: Johnny Flynn and the Sussex Wit","content":"<p>Wonderfully positioned in the intimate surroundings of Manchester’s <strong>Club Academy</strong>, I prepared myself for an evening of folkie goodness with the legend, nay demi-God, that is <strong>Johnny Flynn</strong>.</p><p> Now if you thought that was a bit strong, then you should have witnessed the countless 16-18 year old girls that littered the audience, in a constant stare of lustful awe as their singer/songwriter of a heartthrob serenaded them (in their minds, individually) with his beautiful tracks. However, before <strong>Johnny </strong>worked his magic I again propped myself up against a miscellaneous surface with a bottle of Brown Ale (I need to vary what I drink, even if only to seem slightly less sad to you all), and prepared myself for the evening’s warm up acts.</p>\n<p><strong>James Mathe:</strong></p>\n<p>As one of the sacred members of <strong>Johnny</strong>‘s <strong>Sussex Wit</strong>, it is difficult for me to criticise <strong>James Mathe</strong>‘s opening performance but frankly it was tearfully boring bordering on the pathetic. <strong>Mathe </strong>appeared to simply vary between playing dull guitar chords or generically melancholic piano, with which both he’d accompany with his whiney and forgettable vocals that centered around the most pitiful subjects. There was no imagination or style about <strong>Mathe</strong>‘s performance, and while he received some applause from members of the audience either familiar with his position in the <strong>Sussex Wit</strong> or the lights had dazzled not only their sight but their hearing, his performance seemed to occur and pass without notice. To give <strong>Mathe </strong>some credit, his tracks recorded are more instrumental and styled differently than what I witnessed in Manchester, however I still found them just as forgettable and vague.</p>\n<p>4/10</p>\n<p><strong>Melodica, Melody and Me:</strong></p>\n<p>This delightful folk 6 piece from London was reduced to a 4 piece for reasons I’m not still not clear about, however their presence following <strong>Mathe </strong>felt like the soothing, warming sensation one feels while drinking a cup of tea after an awful taste. Playful guitars, a seemingly ever present ukelele, and vocals not too dissimilar to that of <strong>Noah and The Whale </strong>create a sound that is surprisingly endearing. Very much a light hearted affair, <strong>Melodica, Melody and Me </strong>performed with a fun and modest energy that was present throughout their set which appealed to a very receptive audience. Initially, perhaps scarred by <strong>Mathe</strong>‘s performance, I felt that <strong>MMM</strong>‘s sound was so delicate and intricate that it too would risk being forgettable, however on reflection it is this intricacy and care to detail that <strong>MMM </strong>channel their sound through that makes them a very fun and enjoyable catchy band. Make sure to buy their debut EP ‘<strong>Piece Me Back Together</strong>‘ on <strong>Everyone’s Stalking Records</strong>.</p>\n<p>7/10</p>\n<p><strong>Johnny Flynn and the Sussex Wit:</strong></p>\n<p><strong><span style=\"font-weight: normal;\">Entering the stage to a raucous reception, it was time to cue the shouts and declarations of the afore mentioned 16-18 year old girls of their undying love for </span>Johnny</strong>, which was thankfully tempered by the sarcastic (or maybe not?) mimicking of these declarations by a low-voiced 20 something man. Bursting straight into his set, <strong>Johnny </strong>& co performed expertly in every aspect that could be asked of a band. Delightfully, and awkwardly, charming throughout, <strong>Johnny Flynn </strong>is evidently a fantastic musician that can produce beautiful instrumental orchestration while crafting both narrative and metaphorical lyrics that have a transcendental resonance about them. Each track, ranging from the old to the new, was played with the correct tone, sentiment and energy that guided a hypnotised audience from the calm and quiet of ‘<strong>The Water</strong>‘ to the ho-down nature of ‘<strong>Tickle Me Pink</strong>‘. A particular highlight was <strong>Johnny </strong>& co’s rendition of ‘<strong>Hong Kong Cemetery</strong>‘, which saw the audience obediently respond to <strong>Johnny</strong>‘s request of ‘bopping’ to the track. Surreal yet satisfying, <strong>Johnny </strong>plays to his audience with real emotion and honesty that is becoming of the nature of the sound he produces. If you are yet to listen to this fantastic folk artist, then I would recommend listening to his back catalogue in a chronological order. This is so as ‘<strong>A Larum</strong>‘ through to the bridge that is the ‘<strong>Sweet William EP</strong>‘ and the present final destination of ‘<strong>Been Listening</strong>‘ demonstrates a real development and range in <strong>Johnny Flynn</strong>‘s sound, and without listening to it all you will miss out on fascinating insights into the man and his music.</p>\n<p>9/10</p>\n<p><a href=\"https://www.myspace.com/johnnyflynn\" target=\"_blank\">Johnny Flynn Myspace</a></p>\n<p><a href=\"https://www.myspace.com/mmmelodic\" target=\"_blank\">Melodica, Melody and Me Myspace</a></p>\n<p><a href=\"https://www.myspace.com/jamesmathe\" target=\"_blank\">James Mathe Myspace</a></p>\n<p><strong><br />\n</strong></p>\n","slug":"3689-review-johnny-flynn-and-the-sussex-wit","category":"music","date":1291777984000,"wpid":3689,"isSticky":false,"featured_image":{"width":600,"height":450,"src":"2010/12/johnny-flynn.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAUH/8QAIBAAAQMEAgMAAAAAAAAAAAAAAwECEQAEBRITIQYiQf/EABUBAQEAAAAAAAAAAAAAAAAAAAED/8QAGBEAAwEBAAAAAAAAAAAAAAAAAAEREiH/2gAMAwEAAhEDEQA/AIQ8i8TctjzZMrrYVyoghJto4e0Iq9LC9TCR2tZ5e+PZNbw/GwKM5Ha+/wAmlKMKRcIn/9k="},"createdAt":1587294866728,"updatedAt":1588403562114,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2010/12/johnny-flynn.jpg","categories":["music","reviews"]}