{"id":"5e9c32889b6559241525def0","title":"Review: Villagers/Alessi’s Ark","content":"<p style=\"text-align: left;\">Venturing outside of my now native Manchester, I travelled to Leeds and the fantastic <strong>Cockpit </strong>venue to see the Mercury Award nominated band <strong>Villagers</strong>.</p><p> <strong>Conor O’Brien </strong>is not a new face around <strong>Crack In The Road</strong>, rather he kindly agreed to an interview, which you can read <a href=\"https://api.crackintheroad.com/music/972-5-minutes-with-villagers\" target=\"_blank\">here</a>, many months ago, before much of his now established fame had even began to stir. However with the band’s debut album release ‘<strong>Becoming A Jackal</strong>‘ reaching astronomical heights of universal popularity, I couldn’t resist the chance to see if the magic and mystery of the album could be seen and heard in a live performance. If you are somewhat of a serial follower of my reviews, you’ll be glad to know that I chose not to have a bottle of <strong>Brown Ale </strong>on this occasion, however if you’re not a serial follower then you should be.</p>\n<p style=\"text-align: left;\"><strong>Alessi’s Ark:</strong></p>\n<p style=\"text-align: left;\">Arriving just in time to witness <strong>Alessi’s </strong>set, after a geriatric bus driver confused occasional ice on the road as a muddy field filled with land mines, I settled into the quiet (well, when the trains weren’t passing overhead) and atmospheric surroundings of the <strong>Cockpit</strong>. <strong>Alessi’s Ark </strong>is the creation of <strong>Alessi Laurent-Marke</strong>, who released her first record at the age of 17, ‘<strong>Bedroom Bound EP’</strong>, shortly before attracting the attention of major labels and well known folk inspired bands. <strong>Alessi’s </strong>set was very much a stripped down affair, accompanied simply by her multi-instrumental sidekick, <strong>Marcus</strong>. Strangely endearing, the lack of any pomp or pretense matched <strong>Alessi</strong>‘s very quiet and calm music stylings while she entertained the audience with her deliberately awkward charm between tracks. However, thankfully, <strong>Alessi </strong>has created a sound that is distinctly different from the many other female London singer/songwriters that seem to think that attempting to emulate <strong>Laura Marling </strong>is sufficiently creative. Fairy tale in it’s nature, <strong>Alessi</strong>‘s sound requires a listeners careful attention to fully pick up on the delicate and intricate nature of her tender guitars and the melodies infused within her vocals. For many <strong>Alessi’s Ark </strong>will sail right by them without notice, however for those willing to wait for her to pass, they will be greatly rewarded by this young woman’s talent.</p>\n<p style=\"text-align: left;\">8/10</p>\n<p style=\"text-align: left;\"><strong>Villagers:</strong></p>\n<p style=\"text-align: left;\">Taking to the stage by himself, <strong>Conor O’Brien </strong>instantly gained the crowd’s attention, to the point of seeming hypnoses, as he performed a solo acoustic version of the haunting track ‘<strong>27 Strangers</strong>‘. However there was no risk of a premature saddened mood, as <strong>Conor </strong>first joked that his band mates, on their arrival on the stage, that they had been talking throughout his whole track, before proceeding to hug them all in a gesture of forgiveness. Audience now thoroughly engaged, <strong>Conor </strong>& co began one of the best sets that I have witnessed this year. Thoroughly personal and intimate, the first thing I notice within <strong>Conor</strong>‘s style is the exaggeration he places on the sounds of words, with every syllable and letter sound given pride of place within a lyric. This emphasis completely pronounces <strong>Conor</strong>‘s lyrics and not only makes you listen, but makes you actually want to listen to the story or images that are contained within the song. Moving seamlessly between the intense and the sedate, <strong>Villagers </strong>are expertly able to manipulate their sound from subtle melodies to ravenously emotional percussion and vocals. Through this process <strong>Villagers </strong>performed a set that was filled with a hugely impressive musical integrity that not only entertained the audience, but could also be wholly appreciated simply for it’s musical genius, separate from the live entity that the audience was presented with. Ending in the same vein that he had begun, <strong>Conor </strong>performed an encore with the band and a particularly moving solo acoustic track of ‘<strong>Cecilia</strong>‘ that, through the track’s simplicity, displayed how complex and fascinting <strong>Villagers </strong>really are.</p>\n<p style=\"text-align: left;\">10/10</p>\n<p style=\"text-align: left;\"><a href=\"https://www.myspace.com/alessisark\" target=\"_blank\">Alessi’s Ark Myspace</a></p>\n<p style=\"text-align: left;\"><a href=\"https://www.myspace.com/wearevillagers\">Villager’s Myspace</a></p>\n<p style=\"text-align: left;\">\n","slug":"3717-review-villagersalessis-ark","category":"music","date":1292196323000,"wpid":3717,"isSticky":false,"featured_image":{"width":470,"height":300,"src":"2010/12/villagers.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAGAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAAAAX/xAAkEAABAgUCBwAAAAAAAAAAAAABAgMABAUhIgYREhQWMjNCgf/EABUBAQEAAAAAAAAAAAAAAAAAAAID/8QAFBEBAAAAAAAAAAAAAAAAAAAAAP/aAAwDAQACEQMRAD8AqzNQbHWi+YqBTLL7S55M+K98bYY+sWqXLPPUyUcGoau2FsoUEBCFBO6Rbcnc/YQgKP/Z"},"createdAt":1587294856344,"updatedAt":1588403561953,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2010/12/villagers.jpg","categories":["music","reviews"]}