{"id":"5e9c328a9b6559241525def3","artists":["5e9b694b7a1236eccfeb25d5"],"title":"Interview: Teenage Reverb","content":"<p><a rel=\"attachment wp-att-3730\" href=\"https://admin.</p><p>crackintheroad.com/music/3728-interview-teenage-reverb/attachment/mek12\"><img class=\"alignnone size-fullheader wp-image-3730\" title=\"mek12\" src=\"https://api.crackintheroad.com/uploads/2010/12/mek12-300x199.jpg\" alt=\"\" width=\"300\" height=\"199\" /></a></p>\n<p>This year has seen somewhat of a shoegaze revival, albeit molded and coerced into a genre entirely of it’s own. Picking up the baton where the nu-gaze movement left of, the aptly named chillwave scene has rapidly expanded, through the mediums of blogs and bandcamp. Much of it’s success has been due to the ease of production, with many artists creating and slicing up tunes in their own basements or bedrooms, with these tracks then instantaneously being placed on the world wide web, for anyone’s listening pleasure. One of the rising stars of this relatively new genre is sixteen year old Joseph Zucco, or<strong> Teenage Reverb </strong>as he is widely known. His first record, <em>Isolation Tape Night</em> was released earlier this year to a phenomenal reception, particularly from various blogs like ourselves. <em><strong>Crack in the Road </strong></em>were lucky enough to catch up with Joseph and find out more about his influences, aspirations and far more.</p>\n<div><em>CitR: How did Teenage Reverb come about?</em></div>\n<div><em><br />\n</em></div>\n<p><strong> I’d always struggled to record my own music. Once I got over hearing my  own voice on a song, it became much easier and productive of a project. I  started recording demos around February of 2009. </strong></p>\n<p><em>What would you cite as your main inspirations, both musically and otherwise?</em></p>\n<p><em></em><strong>Atlas Sound, Deerhunter, Beach Boys, Animal Collective, My Bloody  Valentine, The Field, Fleetwood Mac, and Neil Young are most of my sonic  and styling inspiration. Human interaction, experiences, some nature,  and self-conflict are examples of some of my writing material. </strong></p>\n<div><em>You’ve fairly recently released Isolation Tape Night, how did that come about, and how did you go about recording it?</em></div>\n<div><em><br />\n</em></div>\n<p><strong>All  of the recording for that EP took place in my basement for most of the  month of May. Serious recording and writing was all relatively new to me  so most of the songs were written and composed in but a few days or  less.</strong></p>\n<div><em>Much  of your music has been self-produced as well as recorded with limited  resources, would you say this aids the sound you are aiming for, or is  it purely due to a  financial restraint?</em></div>\n<div><em><br />\n</em></div>\n<p><strong> When I was in the process of planning how I was to go about recording  any of the songs, all I was listening to was Weird Era Cont. by  Deerhunter. I imagined that the gear they used to record that, although  probably ten times better than mine, was somewhat close to my setup. I  really dig that roomy drum sound so I tried to mimic what Deerhunter has  on that record.</strong></p>\n<div><em>What can we expect in the way of future releases from you over the coming months?</em></div>\n<div><em><br />\n</em></div>\n<p><strong>I have nothing planned for the rest of 2010 but I will definitely have a string of singles and collaborations for 2011.</strong></p>\n<div><em>Where would you like to see Teenage Reverb in a years time?</em></div>\n<div><em><br />\n</em></div>\n<p><strong> I plan to attend college for the next four years and see where that takes me.</strong></p>\n<div><em>What was the first record you can remember falling in love with?</em></div>\n<div><em><br />\n</em></div>\n<p><strong>Cryptograms by Deerhunter or maybe even In Rainbows from Radiohead.</strong></p>\n<p><em>What has been your most memorable gigging experience to date?</em></p>\n<p><strong>I’ve actually only played one show. It was a lot of fun and relieving, so it was definitely memorable.</strong></p>\n<p><em>If you could be any animal, what would you be?</em></p>\n<p><strong>Can I list several?: Dog, sloth, cat, whale, and shar<em>k.</em></strong></p>\n<div><em>If you could have any super power, what would it be?</em></div>\n<div><em><br />\n</em></div>\n<p><strong>Definitely time travel. Or anything Dr. Manhattan can do.</strong></p>\n<p><em>Thanks very much Joe, best of luck!</em></p>\n<p style=\"text-align: center;\"><a href=\"https://www.myspace.com/teenagereverb\">Myspace</a></p>\n<p style=\"text-align: center;\"><a href=\"https://teenagereverb.bandcamp.com/\">Bandcamp</a></p>\n<p style=\"text-align: center;\"><a href=\"https://teenagereverb.blogspot.com\">Blog</a></p>\n<p style=\"text-align: center;\"><a href=\"https://soundcloud.com/teenage-reverb\">Soundcloud</a></p>\n<p style=\"text-align: center;\"><a href=\"https://www.twitter.com/teenagereverb\">Twitter</a></p>\n<p style=\"text-align: center;\"><a href=\"https://teenagereverb.tumblr.com\">Tumblr</a></p>\n","slug":"3728-interview-teenage-reverb","category":"interviews","date":1292030732000,"wpid":3728,"isSticky":false,"featured_image":{"width":1780,"height":1186,"src":"2010/12/mek12.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAAAAb/xAAeEAACAgEFAQAAAAAAAAAAAAABAgMRAAQFBiFR0f/EABUBAQEAAAAAAAAAAAAAAAAAAAME/8QAHREAAgEEAwAAAAAAAAAAAAAAAQMAAgQRQRIhsf/aAAwDAQACEQMRAD8AnOXQSjkG7GCVwX1TFg1UO+qyRbQbkGNvHd+j5jGQJu2hNHeh5FFqvnUcbn//2Q=="},"createdAt":1587294858241,"updatedAt":1588403561979,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2010/12/mek12.jpg","categories":["interviews","music"]}