{"id":"5e9c32809b6559241525dee6","title":"A Brief History of the Christmas Number 1 – The 1950’s","content":"<p>Looking back at over 50 years of Christmas Number 1’s, it’s hard to define one discernible pattern.</p><p> Glancing over a collection of songs that range from the fantastic to the awful, the melancholic to the nonsensical, I am initially left wondering why we’re so hung up on what track happens to be the best selling over the Christmas period. It all used to strike me as painfully commercial and materialistic, as crazed shoppers would hurry through the isles of HMV or Virgin record stores desperately searching for a copy of the ‘Christmas Number 1’ believing it to be a holy grail of gifts, a gift that no one could possibly not like. How many Christmases must have been ruined by over eager mothers demanding their children to play, on repeat, the new single they’d been given for Christmas. I imagined major record labels cackling with delight as they worked as evil puppeteers, navigating people’s opinions and ‘musical tastes’ into buying into their concocted plan of the Christmas Number 1, to which they’d then sit back and reap the benefits. However over the course of researching this article, I began to realise that there may be more to this phenomena than just seedy economic gain.</p>\n<p>In the first part of this series of articles, I shall look back at the Christmas Number 1’s of the 1950s.</p>\n<p>With the creation of the Official Singles Chart in 1952, so was born our fascination with the Christmas Number 1. The first person to achieve this prestigious honour was the late great <strong>Al Martino </strong>with his song <strong>Here In My Heart</strong>. A pop song that was well and truly ingrained in the Crooner phase of the time, <strong>Here In My Heart </strong>is a surprisingly upbeat beginning for our journey through the Christmas Number 1’s. The track was a huge hit at the time, retaining the number 1 spot for a whopping 9 weeks, which is not so hard to believe when you go back in time and give this song a listen. A full brass band meets the emphatically powerful vocals of <strong>Martino</strong>, who bellows out melodramatic lyrics that were typical of the style of the time period. Obviously out dated to our modern day tastes, but that’s not what is important. When you listen to this first ever Christmas Number 1, you hear a song that would have genuinely been universally popular. Falling in the early stages of development of the main stream music industry, <strong>Here In My Heart </strong>represents a Christmas Number 1 that is musically well constructed, warming, accessible and, well, simply a song. As we progress through our time traveling journeys, we may struggle to attach these descriptions to many more of the Christmas Number 1’s.</p>\n<p>Next year saw <strong>Frankie Laine</strong>‘s <strong>Answer Me </strong>retain the Number 1 spot for 8 weeks, and it is a track which largely follows the same style of <strong>Martino</strong>, though a wholly more understated affair. A pretty boring Number 1 as we’ll soon discover, as in 1954 <strong>Winifred Atwell</strong>‘s suitably named ragtime piano track <strong>Let’s Have Another Party </strong>stormed to the Christmas Number 1. Entirely without vocals, <strong>Let’s Have Another Party </strong>marked a temporary change from the Crooner classics that had preceded it. Upbeat and horrendously jovial, <strong>Let’s Have Another Party </strong>was the first of many Christmas Number 1’s that could be seen to retain its lofty position for the simple fact it was a bit of fun and in many ways was a bit of nonsense. However this break from the Crooner stylings of the 50’s was swiftly ended the following year when <strong>Dickie Valentine</strong>‘s <strong>Christmas Alphabet </strong>took to the throne of the Christmas Number 1. Sadly it is also at this point do we see the first evidence that someone in an element of power had cottoned on to the real promise of huge profits of a Christmas Number 1 – the fact the song is about Christmas. Listening to <strong>Valentine</strong>‘s track confirms all my suspicions that this track had been engineered simply for the Christmas market, and to cleverly appeal to people’s stereotypical imaginations of Christmas. While this was a trend that would inevitably continue, it did make me stop to think about Christmas as a whole. Where do we get our vivid imaginations of a typical Christmas? Of course Christmas has been described in novels and other works of fiction for hundreds of years, but <strong>Christmas Alphabet </strong>is the first recognised Christmas Number 1 that actually appeals to these images and shamelessly reinforces them. <strong>Valentine</strong>‘s lyrics cover all the key concepts of our illusionary thoughts of Christmas, and while he once mentions families, they all revolve around material objects. To this day we become hyper focused creations of material goods at Christmas, but by looking at this Christmas Number 1 we’re presented with a wonderful insight into how that even more than 50 years on, our concept of Christmas has not changed that dramatically.</p>\n<p>Come 1956 and we have our first Christmas Number 1 created by a convicted prisoner, who originally thought of the song whilst walking in the yard of his prison. How very Christmassey I hear you cry. Of course you’ll all remember it as well, <strong>Johnnie Ray</strong>‘s classic version of the 1952 track <strong>Just Walkin’ In The Rain</strong>, not to be confused with the lesser popular track <strong>Singing in the Rain</strong>. Admittedly a move away from the conceited Christmas track, <strong>Walkin’ In The Rain </strong>still has a Christmas feel about it. Maybe it’s due to the years of inadvertent conditioning I suffered when the ‘Best of Christmas Hits’ was played when I was a child, however on the whole this track is mellow but ultimately one of the less exciting Christmas Number 1’s. Come 1957, the fifth year anniversary for the Christmas Number 1, we are presented with a track many of us would be familiar with, but not for it’s original performer. <strong>Harry Belafonte</strong>‘s performance of <strong>Jester Hairston</strong>‘s track <strong>Mary’s Boy Child </strong>is more commonly known as a Christmas Number 1 performed by <strong>Boney M</strong>, but this original marks the first wholly religious Christmas Number 1. Contrasting sharply with the first Christmas Number 1 which was about ‘Christmas’, <strong>Valentine</strong>‘s highly materialistic track, <strong>Mary’s Boy Child </strong>is one of the most sedated and contemplative Christmas Number 1s to enter the records, and the first to seemingly have a lasting impression on a listening population. Viewed by many as a Christmas Carol due to its religious focus, it’s fascinating to see this marked change of preference from the Christmas Number 1 which focused on the personal emotions of lost love, and instead recited biblical images of peace and harmony. Again the Christmas Number 1 can give us a fantastic insight into the feeling of that particular time period, as 1957 marked a year in America (all Christmas Number 1’s came out of America at this time it seems) where Cold War Tensions began to rise as America was on the back foot of a developing Space race while only being months away from a sharp and painful economic recession. It may well be that <strong>Mary’s Boy Child </strong>reflects a sombre mood, and a temporary respite from the focus on the self.</p>\n<p>As we approach the end the 1950’s, the Christmas Number 1 as a period of reflection has gone and has been replaced with <strong>Conway Twitty</strong>‘s <strong>It’s Only Make Believe</strong>. A return to the focus that seems to infiltrate most Christmas Number 1’s of the 1950’s of lost love, or that of the damned romantic man that lusts for a love that is unobtainable. Strangely likable and listenable, <strong>Twitty</strong>‘s track is one of the first to bare the hallmarks of more modern Christmas Number 1’s, with it’s more intimate vocals and music, straying away from the overwhelming nature of the big band Crooners. However it is its repetitive nature and relatively simple musical outlay that marks it’s true Christmas Number 1 nature. Moving on from Twitty’s only number 1, we reach the final Christmas Number 1 of the 1950’s in the form of <strong>Emile Ford & The Checkmates</strong> performance of <strong>What Do You Want To Make Those Eyes At Me For? </strong>Perhaps the most significant of the 1950’s Christmas Number 1’s, <strong>Emile Ford</strong>‘s venture into this crazy new genre ‘Rock n Roll’ was to shape music for the following decade and beyond. Within the period of 10 years, the 1950’s Christmas Number 1’s have demonstrated a massive change in musical genres and, equally as important, the styles of music that a majority of people were listening to. Ironically <strong>Emile Ford</strong>‘s track was reportedly written some 43 years prior to their performance of it, but it’s status as a Christmas Number 1 marked a transition from the 1950’s which would have ever lasting consequences on what was required to become a Christmas Number 1.</p>\n<p>I have created a Spotify playlist with all of these tracks on, should you want to listen to what many of your parents and/or grandparents would have been raving on about all those years ago.</p>\n<p><a href=\"https://open.spotify.com/user/bennyboy2010/playlist/0jniGBZaqBDzuWvlbIgc8j\">1950’s Christmas/Crack In The Road</a></p>\n<p><a href=\"spotify:user:bennyboy2010:playlist:0jniGBZaqBDzuWvlbIgc8j\">1950’s Christmas/Crack In The Road</a></p>\n","slug":"3807-a-brief-history-of-the-christmas-number-1-the-1950s","category":"life","date":1292548123000,"wpid":3807,"isSticky":false,"featured_image":{"width":640,"height":481,"src":"2010/12/1950s.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAIAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAQG/8QAIhAAAQMEAQUBAAAAAAAAAAAAAQIFEgADBBEHEyEiMVGR/8QAFAEBAAAAAAAAAAAAAAAAAAAAAP/EABQRAQAAAAAAAAAAAAAAAAAAAAD/2gAMAwEAAhEDEQA/AIkcuMio20sjkdAg3VZflPZHodoyJP5Wna+T8BbZiKtNWR0zZQUyvAnURrZ+0pQf/9k="},"createdAt":1587294848610,"updatedAt":1588403561876,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2010/12/1950s.jpg","categories":["life","music","opinion","reviews"]}