{"id":"5e9c327e9b6559241525dee3","title":"A Brief History of the Christmas Number 1 – The 1960’s","content":"<p>So we enter the next decade of our journey into the phenomenon which is the Christmas Number 1.</p><p> The 1960’s marked a distinct change in the direction of the development of the world, with the Cold War, pardon the pun, heating up, and political activism sprouting and blossoming in an ever more empowered youth. With these exciting times came an exciting new musical genre, Rock & Roll. We saw evidence of this new genre toward the end of the 50’s, however it was to take the world, and the Christmas Number 1’s, by storm, though perhaps not as early as many may have thought.</p>\n<p>This said, the first Christmas Number 1 of the 1960’s would also introduce us to the musical heavyweight (even I can’t decide whether I mean this or not); <strong>Cliff Richard</strong>. This <strong>Cliff Richard</strong>, while still sickly sweet, was the <strong>Cliff Richard </strong>that had not yet decided to express his religious beliefs quite so reverently and had the backing of <strong>The Shadows</strong>. His 1960 Christmas Number 1 <strong>I love you</strong>, while not by any means the sort of Rock & Roll we have become accustomed to, laid down a great deal of the template to which many artists would follow. Jangly guitars and raucous percussion replaced the orchestrated nature of many of the hits in the 50’s, while <strong>Cliff Richard </strong>is arguably the first ‘heartthrob’ we’ve encountered during our Christmas Number 1’s. A short and very whimsical track, <strong>I Love You </strong>demonstrates that love has always been a big seller over the Christmas period, and more importantly that the Christmas Number 1 had very much been a track that was easy listening. This sense of easy listening, a track that could act as an audio cotton wool of warmth and protection, carried on in our 1961 Christmas Number 1 <strong>Moon River </strong>performed by <strong>Danny Williams</strong>. Made famous by <strong>Audrey Hepburn </strong>in <strong>Breakfast At Tiffany</strong>‘s, it was the South African singer <strong>Danny Williams </strong>to win over the favour of Britain’s listening ears. He was such a hit that he was nicknamed ‘Britain’s <strong>Johnny Mathis</strong>‘ due to his smooth and stylish ballad style, a style not too dissimilar from a young <strong>Cliff Richard</strong>. Gone are the epic vocals of <strong>Martino </strong>and in come the quieter, more intimate vocals, demonstrating that many people had begun to view music as a far more personal experience. Unfortunately <strong>Williams</strong>‘ and <strong>Richard</strong>‘s efforts only lasted a pitiful two weeks at Christmas Number 1, and while our next Christmas Number 1 faired only slightly better with 3 weeks, I doubt that it was of any real concern to him.</p>\n<p>The winter of 1962 brought to Britain ‘The Big Freeze’, in which there were no frostless nights until March the following year, and there were snow drifts up to 20 feet over South East England (A period not really mentioned during our own current ‘Snow Disaster’). Perhaps with some sense of irony, the people of Britain chose their Christmas Number 1 as a two fingered salute to the weather. <strong>Elvis Presley</strong>‘s <strong>Return To Sender </strong>peaked at Number 1 over Christmas in Britain for 3 weeks, and very much asserted the fact that our Christmas Number 1’s would be dominated by Rock & Roll for the coming years. Again, yet another track about forlorn love which remains upbeat and catchy, the British public had certainly decided exactly the sort of track they wanted to hear in their front rooms come Christmas morn. Sadly <strong>Return to Sender </strong>was a track that was released in a period that saw the marked decline of <strong>Elvis</strong>, but his Christmas Number 1 provided a track that was certainly, and thankfully, demonstrated a shift in taste that demanded a Christmas Number 1 which was entertaining and interesting than a simple ballad.</p>\n<p>Now, I’m not sure if you have noticed the massive photo at the start of this article, but it is at this point you’re somewhat rewarded for having to look at Ringo Starr’s not-so-pretty-or-talented mug. 1963 saw the beginning of one of <strong>The Beatles </strong>many records, and in this case it was 3 consecutive Christmas Number 1’s. No other artist or band has ever come near this achingly prestigious achievement, and such a feat is a fantastic insight into the true extent of ‘Beatlemania’. <strong>I Want To</strong><strong> Hold Your Hand</strong><strong> </strong>was a massive hit on both sides of the Atlantic, and marked a huge change in musical tastes amongst the listening public. Gone were the timid outreaches into Rock & Roll, and instead <strong>The Beatles </strong>fully embraced brash guitars and soaring melodies with lyrics that were crafted with a great level of genius in terms of popular admiration. Everyone could listen to <strong>The Beatles </strong>and gleam something from it, and most importantly their first Christmas Number 1 was by no means the audio cotton wool that had preceded it. Instead Christmas Day would have been a far more upbeat and inspired affair, and as such the direction of the decade was changed. A great feeling of willing submission combusted into high level questioning and the youth moved into a reactive movement. Sadly we can still see how early the conceited nature of our Christmas Number 1’s become ingrained, as <strong>I Want To</strong><strong> Hold Your Hand</strong><strong> </strong>was a track written upon request of <strong>The Beatles</strong>‘ manager as to stir up interest and a fan base in America, as their previous singles had been a flop across the pond. Seemingly a sad but inevitable truth.</p>\n<p>The following year <strong>The Beatles </strong>return to the Number 1 spot with their track <strong>I Feel Fine</strong>. A distinct change in sound from <strong>I Want To</strong><strong> Hold Your Hand</strong>, it demonstrated not only that <strong>The Beatles </strong>were a musically evolving entity, but that the British public were in such a hypnoses with these cheeky Scousers that no other band of the period could shift them from that treasured winter Number 1 spot. Still a very accessible and entertaining track, <strong>The Beatles </strong>had fantastically managed to withdraw the trend of forlorn love in Christmas Number 1’s and replace it with a very active and optimistic love, meaning that Christmas no longer had to be a time of quiet and peace, but instead could be celebratory and simply fun. In many ways<strong> The Beatles </strong>were the first band to truly understand, or at least those that made money from them, the value of a Christmas Number 1. 1965 saw <strong>The Beatles </strong>capture the Number 1 spot again with their single <strong>Day Tripper</strong>, which was strategically released on the 3rd of December. A world away from their first Christmas Number 1 in terms of sound, <strong>The Beatles </strong>demonstrated that they had changed for good what a Christmas Number 1 meant. Beatlemaina had completely  enveloped audiences on both sides of the Atlantic and the Christmas Number 1 as a result was explicitly demonstrated as an ingenious tool as to perpetuate this interest and the financial gains many were to make from it. However we cannot take too much away from this achievement as for a period of time the Christmas Number 1 was graced with truly great songs, though for some 1966 would top the past three years.</p>\n<p>That’s right, our favourite Welshman <strong>Tom Jones </strong>broke the control of <strong>The Beatles </strong>with his 1966 Christmas Number 1 <strong>Green Green Grass of Home</strong>. Not only had the English appeared to have reclaimed the creation of the Christmas Number 1, but the Welsh had got in on the act too. A country song originally written and performed a year prior to <strong>Jones</strong>‘ rendition, the <strong>Green Green Grass of Home </strong>presents us with a slight conundrum. For three years prior the Number 1 had been dominated by young and surging tracks, whereas <strong>Jones</strong>‘ track presents a lapse back into the audio cotton wool many would have been familiar with in the 50’s. Perhaps exhausted by the energy <strong>The Beatles </strong>had vested into Christmas, many people decided to stray back into a calm comfort zone with <strong>Jones</strong>‘ fantastically uplifting yet relaxed track. However what I believe sounds like a more realistic answer is that the only single <strong>The Beatles </strong>released that year from their fantastic <strong>Revolver </strong>album, was <strong>Yellow Submarine </strong>and it was released in August. Had their single been released at the start of December, there is no doubt in my mind that <strong>Tom Jones </strong>would have missed out on his Christmas claim to fame. More evidence of this can be seen in <strong>The Beatles </strong>return to the Christmas Number 1 spot in 1967 with their infamous track <strong>Hello, Goodbye</strong>. Another change in sound from their previous efforts, with this track portraying the more spiritual mystique <strong>The Beatles </strong>were developing in to, the fact this track was released at the end of November essentially guaranteed the band their Christmas Number 1 spot. Fittingly, this was the last Christmas Number 1 <strong>The Beatles </strong>would ever achieve, as the band began to disintegrate and <strong>Lennon </strong>became more and more disillusioned with what was surrounding him. However there is no denying that even with this slightly slower Christmas Number 1, <strong>The Beatles </strong>had changed perceptions of audiences across the world of what could grace our ears over Christmas.</p>\n<p>Come 1968 and I encountered one of the more obscure Christmas Number 1’s that had ever made the cut. <strong>The Scaffold </strong>(no I had never heard of them either) topped the Christmas chart for 3 weeks with their performance of <strong>Lily The Pink</strong>. By all accounts a surprise Number 1 even in its hay day, <strong>The Scaffold </strong>contained <strong>Paul McCartney</strong>‘s brother, <strong>Mike McCartney</strong>, and the band were primarily a comic music trio. Achieving moderate success over their existence, they did sign to several major labels, <strong>The Scaffold </strong>achieved this particular success with the help of a young <strong>Elton John </strong>and <strong>Graham Nash</strong>. <strong>Lily The Pink </strong>itself was an already established folk song, but with <strong>The Scaffold</strong>‘s lyrical changes they managed to create a cheeky and humourous version that struck a chord with the British public. What’s most interesting about <strong>Lily The Pink </strong>is that it was the first of many Christmas Number 1’s which would reach it’s lofty heights not simply for it’s musical content, or a cult of personality, rather it’s pure light hearted nature. In many ways it can be seen as a communal sigh of relief from the crazy heights <strong>Beatlemaina </strong>reached, and most importantly it demonstrated that you didn’t need to be an international superstar, a heartthrob of a vocalist or even very talented to achieve a Christmas Number 1. To this day we still feel the consequences, both good and bad, of <strong>The Scaffold</strong>‘s achievement.</p>\n<p>Reaching our final year of the 60’s, one of the few Australians to capture even a small part of the British imagination provided another surprise Christmas Number 1. That’s right, <strong>Rolf Harris</strong>‘ rendition of the 1902 track <strong>Two Little Boys</strong> reached the Number 1 spot and managed to stay there for a staggering 6 weeks. A truly awful track, in which <strong>Harris </strong>warbles American Civil War inspired lyrics over a generic brass brand. However who am I to comment, when <strong>Margaret Thatcher </strong>told <strong>BBC Radio Blackburn </strong>ten years later that it was one of her all time favourite songs. <strong>Thatcher</strong>‘s insightful music critique aside, <strong>Two Little Boys </strong>followed on from <strong>The Scaffold</strong>‘s <strong>Lily The Pink</strong>, insofar as the British public’s enjoyment of the ‘marching brass band’ sound, in which images and sounds of bravery in war came to represent a great deal of Christmas. A more famous example of this was <strong>Jona Lewie</strong>‘s <strong>Stop the Cavalry</strong> which was to come later, but perhaps it was the sense of resilience that these tracks presented that won the hearts, and wallets, of many. This phenomenon isn’t particularly new, as it can be seen in the classic Christmas Carol <strong>Little Drummer Boy</strong>, but it does suggest a sense of retreat from the massive change <strong>Beatlemania </strong>had caused.</p>\n<p>The 1960’s was perhaps the most eventful year of Christmas Number 1’s. Beginning with the mellow nature of <strong>Cliff Richard</strong>, moving on to the chaotic musical revolt of <strong>Beatlemania</strong>, to the slowing end in which Christmas Number 1’s opened the flood gates to likeable yet farcical tracks. However most strikingly the 60’s was only the decade not to include any tracks that were explicitly about Christmas, religious or otherwise. This last fact is open to many avenues of speculation, but in many ways the 60’s acted as a microcosm of what the Christmas Number 1 can materlise as, and subsequently mean. The calm, the warming, the raucous, the life changing, and even the painfully pathetic, though always popular.</p>\n<p>Check out my spotify playlist for the 60’s Christmas Number 1’s. However I must apologise as while <strong>The Beatles </strong>have released their music to iTunes, they have yet to do so on Spotify. Therefore you’ve got a delightful tribute band filling the void!</p>\n<p><a href=\"https://open.spotify.com/user/bennyboy2010/playlist/7bg97RPBRU2seBhGgvwfdB\">1960’s Christmas/Crack In The Road</a></p>\n<p><a href=\"spotify:user:bennyboy2010:playlist:7bg97RPBRU2seBhGgvwfdB\">1960’s Christmas/Crack In The Road</a></p>\n","slug":"3825-a-brief-history-of-the-christmas-number-1-the-1960s","category":"life","date":1292694034000,"wpid":3825,"isSticky":false,"featured_image":{"width":800,"height":600,"src":"2010/12/the-beatles.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAIAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAUH/8QAIRAAAQMDBAMAAAAAAAAAAAAAAQIDBAAFBhESITITIkH/xAAUAQEAAAAAAAAAAAAAAAAAAAAA/8QAFBEBAAAAAAAAAAAAAAAAAAAAAP/aAAwDAQACEQMRAD8AlR28ow5Ee4WoOQ5902QlDghhTZ3FLh29ueqRoCFA8CtbYzS9xmW2HpPldaSELcUpAKyBoSfX7SlB/9k="},"createdAt":1587294846173,"updatedAt":1588403561851,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2010/12/the-beatles.jpg","categories":["life","music","opinion","reviews"]}