{"id":"5e9c346e9b6559241525e215","title":"5 Minutes With: The Chapman Family","content":"<p style=\"text-align: left;\"><em>Crack In The Road</em> caught up with North East post-punk rockers and former NME ones to watch, <strong>The Chapman Family </strong>during the recording of their highly anticipated debut album.</p><p> From pretending to be the heirs of John Lennon’s killer, to baiting thousands of Geordies whilst on stage in Newcastle, there is one thing evident about the group of lads from Stockton: they have a brilliant, albeit occasionally misunderstood sense of humour. Having previously performed at Glastonbury as well as supporting the likes of <strong>We Are Scientists</strong>, <strong>Future of The Left</strong> and <strong>La Roux</strong>, they are one of the most respected and brightest talents around at the moment. <strong>Kingsley Chapman</strong>, lead vocalist and guitarist from the band, kindly agreed to answer some questions for us which included him blaming the Icelandic volcanic eruption on Cristiano Ronaldo as well as telling us how painfully upsetting using a Mac is. We hope you’ll agree that his dry sense of humour comes across fantastically.</p>\n<p style=\"text-align: left;\"><em>CITR: </em>If you had to cite one artist/band as a major influence on you, who would it be?</p>\n<p style=\"text-align: left;\"><strong>Can’t really pinpoint one band but all that late 1990s nu-metal rubbish like Limp Biscuit[sic] and Linkin Park influenced me in ways you couldn’t possibly imagine. It all basically made me question as to whether there was something better out there, music can’t all be this bad surely – and if there wasn’t anything else then I had better get my act together and try it myself. Nu-metal and ska-punk are the main two genres that have influenced my likes and dislikes in music. They’re very much in the “dislike” category.</strong></p>\n<p style=\"text-align: left;\"><em>CITR: </em>What has been your favourite gigging experience to date?</p>\n<p style=\"text-align: left;\"><strong>Probably the Evolution Festival in Newcastle last year where I “accidentally” encouraged 3000 geordies to throw whatever they wanted to onto the stage. I’d made a few choice remarks about Newcastle United’s relegation battle and the inevitable happened. We had sandwiches, plastic bottles, sweets, socks, stones and even money thrown at us. It was all pretty funny. I didn’t consider the safety of the other members of the band however and forgot that as I was casually dodging bottles and cans at the front of the stage our drummer Phil was rooted firmly to the spot. Oops.</strong></p>\n<p style=\"text-align: left;\"><em>CITR: </em>You grew up in Middlesbrough, how did you find it and how much do you think it affected your music?</p>\n<p style=\"text-align: left;\"><strong>Stockton-on-Tees actually! It affects me and the music just as much as the city of Newcastle affects a band like Detroit Social Club – or Sunderland for Frankie and the Heartstrings. If you spend so so so long in a single place I don’t think you can fail to not be influenced by it. I’m very proud of my town and the north east and it always sickens me when I hear a local band and they sound like they could be from London or America and they’re singing about things that just don’t happen here. I like honesty in music, I’m not very escapist – I have no concept of summery feel good music – I am a stereotypical miserable glass half empty northerner. Sorry. I remember going down to London for the first time with the band in 2007 and feeling like an outsider – a tourist even – it felt like we had been dropped in a different universe.</strong></p>\n<p style=\"text-align: left;\"><em>CITR: </em>What are your thoughts on the Digital Economy Bill? Do you think it is a positive move for the music industry as a whole? Do you think it will make it harder for bands like yourselves to get heard?</p>\n<p style=\"text-align: left;\"><strong>Can’t really give you a little answer on this so I’ll give you my cut out and keep thoughts : the music industry is well and truely fucked. […in “business” terms anyway. But that doesn’t have to mean the end of people making music, infact it should become a ridiculously creative period. Hopefully it’ll get rid of people who think that they want a “career” in music as they didn’t get that job on CBBC that they wanted or they see it as a stop gap before they go into an acting career. Kill all stage-school pop stars in other words. In theory the only people left making music should be the people who feel that they physically and mentally can’t do anything else. For instance, Pixie Lott could easily get a job in TopShop or something but I can’t really imagine Keith Richards behind a checkout or taking up a career as an estate agent. I think I veered from the point a bit there.]</strong></p>\n<p style=\"text-align: left;\"><em>CITR: </em>How is the recording of the album coming along?</p>\n<p style=\"text-align: left;\"><strong>Steadily. Most of it is finished but we’re just trying to find the availability and time (and money) to finish the job. With a bit of luck it’ll be finished in a month or so and released in September. But in the past three years of doing this thing we haven’t exactly had the most luck in the world so I don’t expect a big chunk of it to come along any time soon.</strong></p>\n<p style=\"text-align: left;\"><em>CITR: </em>Ronaldo or Messi?</p>\n<p style=\"text-align: left;\"><strong>Messi. I have nothing major against Cristiano Ronaldo other than that I genuinely believe him to be the spawn of Satan and that he’s been sent to this world to destroy us. He probably made that volcano erupt in Iceland because Real Madrid didn’t get to the quarter finals of the Champions League, the bloody spoilsport. Never before has a man been so beautifully and perfectly in love with himself, he’s just an arse. Juninho is the greatest footballer that ever lived anyway, everyone knows that.</strong></p>\n<p style=\"text-align: left;\"><em>CITR:</em> If you could chose to be any animal, what would you be?</p>\n<p style=\"text-align: left;\"><strong>One of those monkeys that steals purses and wallets on the rock of Gibraltar.</strong></p>\n<p style=\"text-align: left;\"><em>CITR</em>: Are you a Mac or a PC?</p>\n<p style=\"text-align: left;\"><strong>PC. I’ve used Macs a few times but because I’m so set in my ways with Windows I always end up crying because I can’t work out how to copy and paste.</strong></p>\n<p style=\"text-align: left;\">Watch out for the upcoming debut album from The Chapman Family, as well as checking out their music at the link below.</p>\n<p style=\"text-align: left;\"><a href=\"https://www.myspace.com/thechapmanfamily\">Myspace</a></p>\n","slug":"383-5-minutes-with-the-chapman-family","category":"interviews","date":1271775666000,"wpid":383,"isSticky":false,"featured_image":{"width":165,"height":165,"src":"2010/04/the-chapman-family-165x165.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFAABAAAAAAAAAAAAAAAAAAAABv/EACQQAAIBAwMDBQAAAAAAAAAAAAECAwQFEQAGEgcTFCExYoKx/8QAFAEBAAAAAAAAAAAAAAAAAAAAAP/EABQRAQAAAAAAAAAAAAAAAAAAAAD/2gAMAwEAAhEDEQA/AFm1+pW9qpWjvENoSZbvT0zdtWyKcs/cOM+4CqM/LOit965b/p73cILdZbbLRR1EiQSeNM/OMMQp5A4ORj1GktwA4r9f0aHyVdSkjKlRMqqSAA5AA0H/2Q=="},"createdAt":1587295342613,"updatedAt":1588403568808,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2010/04/the-chapman-family-165x165.jpg","categories":["interviews","music"]}