{"id":"5e9c327b9b6559241525dee0","title":"A Brief History of the Christmas Number 1 – The 1970’s","content":"<p>Leaving the 60’s firmly behind us, we move into the afterglow which is now commonly known as the 1970’s.</p><p> Gone were many of the hippies, dampened was the initial optimism of the youth, and in return the 1970’s welcomed Margaret Thatcher into the political realm and cast a sad economic shadow across the whole nation. Would this be reflected in the Christmas Number 1’s? Would Rolf Harris picked up from where he left off and influence another decade of Christmas Number 1’s? Or would we be spared such torture? In a decade of uncertainty, in Christmas Number 1’s we observe and judge.</p>\n<p>The first Christmas Number 1 of the 70’s was achieved by the second, and somewhat lesser known, Welshmen to grace the record books. <strong>Dave Edmunds</strong>‘ rendition of the 50’s classic, <strong>I Hear You Knocking </strong>held on to the coveted Number 1 spot for a whopping 6 weeks and was welcome change from the travesty which so cruelly ended the 60’s Christmas Number 1’s. A rock-y blues effort, <strong>I Hear You Knocking </strong>had achieved good success in America when originally released by <strong>Smiley Lewis</strong>, though <strong>Edmunds </strong>effort received a label of recommendation few others tracks have ever achieved when<strong> John Lennon </strong>stated it was his favourite new recording. Bestowed with this honour, <strong>Edmunds</strong>‘ Number 1 proved a stark contrast to the Number 1’s that had preceded him. Emphatic syncopation and distorted vocals, fused with an Americana sound that to many people would sound like anything other than ‘Christmas’, <strong>I Hear You Knocking </strong>did however contain a level of a attitude which had become a mainstay in many 60’s Christmas Number 1’s. A relatively simple yet addictive track, something which will become a common trend in Christmas Number 1’s to date, <strong>I Hear You Knocking </strong>kick started a very mix matched decade of Christmas Number 1’s.</p>\n<p>Having already witnessed the first few attempts of comic Christmas Number 1’s, it wasn’t until 1971 that the listening Christmas audience were given a truly fantastic track by the great <strong>Benny Hill</strong>. <strong>Ernie (The Fastest Milkman in the West) </strong>is an innuendo laden story detailing the rivalry between Ernie, a milkman, with Ted, a bread delivery man, who both vie for the heart of a widow named <strong>Sue</strong>. Very smartly and wittily put together, <strong>Hill</strong>‘s track was of course aided to success by the popularity of his accompanying comic TV show, however I think it’s important we treat the track as a separate entity. For many years the Christmas Number 1 was a track that had a story, a story that many people could, to some degree, associate temselves with. With <strong>Ernie</strong>, <strong>Hill </strong>had managed to pick upon relatively mundane jobs and situations within the every day lives of people and expertly satirise them to an extent which was amusing but not demeaning. More over, <strong>Hill </strong>was smart enough to use a Wild West theme that would have still been very popular with people, a classic example being <strong>Who Shot Liberty Valance</strong>, and transform it into a very likable and listenable track. However while the musical structure was a play upon a seasoned stereotype, it was the universal listenability of his lyrics which allowed <strong>Ernie </strong>to become Number 1. All his innuendoes were subtle and his subject matter seemingly innocent, therefore parents would have been able to play the track in the company of their children without concern. Playing upon heartbreak and bravery while infusing a wonderful comic element into the song, <strong>Hill</strong>‘s track in many ways is what I’d call an ideal Christmas Number 1.</p>\n<p>From genius to the utterly annoying, the 1972 Christmas Number presented us with the 70’s answer to <strong>Justin Bieber</strong>; <strong>Jimmy Osmond</strong>. The key difference being there were far fewer teenage lesbians trying to replicate his hair cut. <strong>Long Haired Lover From Liverpool </strong>stormed to the Christmas Number 1 spot, with <strong>The Osmond Family </strong>providing the music and background vocals to the whiney, high pitched vocals of the youngest child <strong>Jimmy</strong>, whom they thrust forward hoping to play upon his ‘cute’ element. Sadly, the listening British audience of 1972 were wholeheartedly taken in by this awfully cheesy concoction. However more than just being horrendously painful to listen to, <strong>Osmond</strong>‘s number 1 demonstrates a vital part of the development of the Christmas Number 1. For one of the first ever occasions, the ‘novel’ and ‘nonsensical’ Christmas Number 1 hadn’t been created by the song itself, but rather the people singing. <strong>Jimmy Osmond </strong>was considered by many as wholesome, cute, and, most importantly,  interesting due to being American. That’s right, people were excited about the fact this cute 9 year old and his singing family were linking their native America to the city of Liverpool. While we will no doubt cover more horrific Christmas Number 1’s, this stands out as one of the worst. I am dissapointed in every single person who bought this. Shame on you.</p>\n<p>In roaring style, the listening public of 1973 made up for their awful error the previous year by promoting to Christmas Number 1 perhaps the most enduring Christmas song ever created. <strong>Slade</strong>‘s <strong>Merry Xmas Everyone </strong>is one of the most significant Christmas Number 1’s history for being the first Number 1 explicitly about Christmas yet still remaining a good musical entity. It also proved that you didn’t have to be good looking to achieve the Christmas title either (sorry Nobby). Wonderfully anthemic, upbeat and optimistic, <strong>Slade </strong>provided a Christmas Number 1 which guaranteed to get you into the Christmas spirit with it’s rock-y guitars and marching percussion. Emphasising the family elements of Christmas in a jovially cheeky approach, <strong>Slade </strong>created a Christmas Number 1 that, while toying with typical stereotypes, did not attempt to hark back to past Christmas Number 1’s or images, both stylistically and lyrically. Instead we were finally graced with a Christmas Number 1 that promoted looking, moving, thinking, and acting forward, in which Christmas Day could be a day of celebration and community. However as Christmas Number 1’s always tend to do, <strong>Slade</strong>‘s effort was completely contrasted with the 1974 Christmas Number 1 <strong>Lonely This Christmas </strong>by the Glam Rock quartet <strong>Mud</strong>. Often erroneously attributed to <strong>Elvis Presley</strong>,<strong> </strong>the slow and mellow nature of this Number 1 is a tribute to the audio cotton candy of previous Christmas Number 1’s, where a lovelorn story was what every one wanted to listen to. However it is important to note that for the second year in a row it was a track explicitly about Christmas that made the number 1 spot, therefore concreting the idea that this genre didn’t simply have to be a one off novel track, rather you could use well respected musical genres to create genuine Christmas messages. Perhaps had this popped up in the 60’s I would have been slightly  more scathing, but I’m still hurting after the <strong>Osmond </strong>track, so this number 1 is a good’un in my books.</p>\n<p>1975. Christmas Number 1. <strong>Queen</strong>. <strong>Bohemian Rhapsody</strong>. It had taken 5 years, but the 70’s had finally managed to promote one of the best songs in history to it’s rightful place as a Christmas Number 1. I’m not going to go in to detail about the track itself as you will have all heard it, and if you haven’t then you shouldn’t be reading this blog, but rarely will a Christmas Number 1 ever again be as truly genius as this <strong>Queen </strong>classic. One of the few occasions it seems that a Christmas Number 1 was selected purely on it’s musical merit, I would quite gladly have <strong>Bohemian Rhapsody </strong>blasting out as I opened my presents and ate my copious about of Turkey. However obviously a bit thrown by a Christmas Number 1 that had not been about Christmas, or audio cotton candy, the listening British public reverted to their old ways and in 1976 brought <strong>Johnny Mathis</strong>‘ <strong>When a Child is Born </strong>to the Christmas Number 1 slot for a pitiful 3 weeks. While considered by many as a classic Christmas Number 1, <strong>Mathis</strong>‘ effort is simply another track that plays upon loose Christian imagery to play up to the typical ‘warming’ music that many though, and were correct in thinking, would sell over Christmas. Preaching about world peace in the most pathetic terms. ‘<strong>it must come true, sometime, somehow</strong>‘, <strong>Mathis</strong>‘ work is definitely a product of it’s time as I highly doubt you’d be able to get away with the lyric ‘<strong>black, white, yellow, who knows?</strong>‘ in many modern classics. However as we attempt to take a purely objective view of the Christmas Number 1’s, <strong>Mathis</strong>‘ Number 1 demonstrates the fickle nature of the Christmas Number 1. The 70’s was steadily becoming the decade in which the ‘Christmas’ Christmas Number 1’s was developing it’s first strong foundations.</p>\n<p>I really wish that I could be one of those Englishmen who hated the sound of bagpipes, simply so I could act genuinely outraged that the 1977 Christmas Number 1 contained the noise of their shocking shrill, however I’d be lying. Rather, I actually quite like them, so I have a bit of a soft spot for this Christmas Number 1, <strong>Wings</strong>‘ <strong>Mull of Kintyre</strong>. <strong>McCartney </strong>had yet again managed to get into the Christmas Number 1’s, however now in the guise of his ever changing <strong>Wings</strong>, which primarily focused around himself and his wife, <strong>Linda</strong>. A track detailing an admiration of the beauty of the Scotish highlands, <strong>Mull of Kintyre </strong>is a relatively boring song that is only saved by <strong>McCartney</strong>‘s distinct and engaging vocals that turn the track into a rather spiritual yet accessible musical entity. Somehow <strong>Mull of Kintyre </strong>even managed to retain it’s Number 1 spot for a staggering 9 weeks, which perhaps suggests a musical drought which to this day has never been reported upon. However it is interesting to note that <strong>Mull of Kintyre</strong>, like several other 70’s Christmas Number 1’s, has a very communal feel to it, insofar as an ability for everyone to be able to appreciate and join in to the track itself. Approaching the end of the 70’s, we are revisited by a Christmas Number 1 that had first made an appearance in the 50’s; <strong>Mary’s Boy Child</strong>. Although on this occasion it was the disco group <strong>Boney M </strong>that reworked this classic into a irritatingly likable track that was baptist in it’s declaration of Jesus and ‘The Lord’, while mixing this with bursts of tambourine and bells to create a Christmas song you could dance to. To many this Christmas Number 1 will simply be a glorified ringtone, but it demonstrated yet again that the Christmas Number 1 is a track that you simply could not predict. Rather, it was a position held by what ever was, to borrow a more modern term, ‘trending’ at that particular time. And it is for this very reason why the Christmas Number 1 is such a valuable tool in looking back not only in to the history of music, but in to social and cultural history.</p>\n<p>For the first time in our tour through the Christmas Number 1’s of the past, this decade ended it’s Christmas Number 1’s with a fantastic and enduring track. <strong>Pink Floyd</strong>‘s <strong>Another Brick In The Wall (Part 2) </strong>reigned supreme for 5 weeks and provided a final twist to a decade of completely random Christmas Number 1’s. The 70’s had been a tumultuous decade, full of political unrest and economic woes, therefore the Christmas Number 1’s can aide our ability to identify the common feeling of the time. In the same decade we had gone from the sheer optimism and cheer of <strong>Slade</strong> to the empowered yet dark voice of <strong>Floyd</strong>‘s effort, in which teachers, and presumably the wider government, are criticised for being over controlling and domineering in their approach. Bursting with awe inspiring guitar riffs, <strong>Pink Floyd </strong>are one of the few efforts, including that of <strong>Queen</strong>‘s, that can be considered truly great songs that were made Christmas Number 1 for simply that reason. They were by no means a track designed simply to sell as a <strong>Christmas Number 1</strong>, rather they were brought to prominence simply by their own musical merit. I know that this could sound a bit like common sense, but as we work closer to the 80’s and 90’s, such tracks became harder to find as the music industry realises the true economic potential of the Christmas Number 1, and the truly awful shit that most people would be able to buy, and maybe even listen to. However in terms of the 70’s, the Christmas Number 1 had gone through perhaps it’s most evolutionary phase, in which there had been the comic, the festive, the genius and the awful had all featured.</p>\n<p>Yet again I have put together a play list, but the might <strong>Pink Floyd</strong> have yet to agree to Spotify, so a live performance will have to suffice.</p>\n<p><a href=\"https://open.spotify.com/user/bennyboy2010/playlist/1wEF9uWMAX3purvXjms9bv\">1970’s Christmas/Crack In The Road</a></p>\n<p><a href=\"spotify:user:bennyboy2010:playlist:1wEF9uWMAX3purvXjms9bv\">1970’s Christmas/Crack In The Road</a></p>\n","slug":"3840-a-brief-history-of-the-christmas-number-1-the-1970s","category":"life","date":1292899663000,"wpid":3840,"isSticky":false,"featured_image":{"width":1024,"height":768,"src":"2010/12/slade.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAIAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAUH/8QAHRAAAgIDAQEBAAAAAAAAAAAAAQIDBAAFERIhIv/EABQBAQAAAAAAAAAAAAAAAAAAAAP/xAAXEQEBAQEAAAAAAAAAAAAAAAABAgAh/9oADAMBAAIRAxEAPwCBRoNd01ehPU2claRVsGSc+ZUnP1wpb4VHnp4CD3M5ta+aCzNEumsSBHKh2tDrcPOn9YxgzSLmvoc3/9k="},"createdAt":1587294843449,"updatedAt":1588403561824,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2010/12/slade.jpg","categories":["life","music","opinion","reviews"]}