{"id":"5e9c32789b6559241525dedd","artists":["5e9b693e7a1236eccfeb2507"],"title":"Interview: Shad","content":"<img class=\"alignnone\" title=\"Shad\" src=\"https://sphotos.</p><p>ak.fbcdn.net/hphotos-ak-snc4/hs1337.snc4/162909_485139569804_500714804_5731482_3593907_n.jpg\" alt=\"\" width=\"720\" height=\"480\" />\n<p>A recent surge in the quality of the Canadian hip hop scene, has resulted in increased coverage for many of the standout artists. Known for intelligent lyricism and a expert understanding of rhyme patterns and flows, it’s due time that the scene began to receive more commercial exposure. Shad is not a new name to CitR, having featured in one of our first articles way back in April, as well as a comprehensive review of his critically acclaimed third album TSOL, therefore we were delighted when we were given the opportunity to have a quick chat with the rapper before his Edinburgh gig supporting The Herbaliser.</p>\n<p>CitR: Hey Shad, how’s the tour being going so far?</p>\n<p><strong>Shad: Yeah it’s been cool, this is our first time here, so everything is brand new. Every show you run into people that have been aware of your music on the internet, or something like that. That’s always cool to see on the otherside of the world… it’s cool as well!</strong></p>\n<p>CitR: How did you manage to sort coming over to the UK?</p>\n<p><strong>Shad: Well we booked some shows in Germany and one in Paris, and while we were over here we wanted to do some shows in the UK too.</strong></p>\n<p>CitR: Do you find the crowds here have been reacting any different to crowds back home?</p>\n<p><strong>Shad: Yeah, I mean I don’t know if it’s a difference from back home, but I guess it’s the kind of music that people listen to over here. In Canada we are a bit better known, whereas here we are opening and playing to brand new fans for the most part.</strong></p>\n<p>CitR: Yeah it allows you to start on a completely fresh playing field.</p>\n<p><strong>Shad: It’s almost like a return to how we started in Canada, so yeah it’s different in that sense.</strong></p>\n<p>CitR: How were the dates in London?</p>\n<p><strong> Shad: Awesome, we played a little room called the Jazz Café, which was really intimate, this is a lot bigger, different vibe here, no barricades in front of the stage there.</strong></p>\n<p>CitR: Do you find it easier over here than when you tour Canada and North America?</p>\n<p><strong>Shad: Canada is different to tour ‘cus we’re doing our own shows and people already know our music and are already fans, that’s a lot of fun to interact with those people. In that sense it’s very different, even in Canda just knowing the towns and venues is easier.</strong></p>\n<p>CitR: Any mentionable highs or lows of the tour so far?</p>\n<p><strong> Shad: Yesterday there was this weird dude in Birmingham, I mean there were highs of that show, there were some people there who were long time fans that came out. It was a smallish show, maybe fifty or sixty people, so I got off the stage and was rapping in the crowd. Then this one dude comes up whilst I’m doing a song, and he’s just dancing, probably o something, and then he was talking to me in the middle of the song, saying “Is Herbaliser coming on?” and I was like “Yeah man they’re coming on”, then he was like “Do you promise? Do you promise?” So G had to go up to him and tell him that I was performing, and say that we could talk about it later (laughs). And he was dancing around later in big circles around the dancefloor. Oh and the hotel yesterday was like this kind of creepy old building, TLO was getting really creeped out, taking mirrors down off the walls.</strong></p>\n<p>CitR: Do you have any pre-gig rituals?</p>\n<p><strong>Shad: Not really, I don’t like to eat before I go on stage, just ‘cus I don’t like to feel all full off of ribs, or something like that.</strong></p>\n<p>CitR: But you’re keeping the mirror up in here?</p>\n<p><strong>TLO: Yeah this one is ok, just that other place had a weird vibe to it, it was haunted man.</strong></p>\n<p><strong>Shad: Have you seen the movie The Others? It kind of felt like that, mixed with The Shining. Yeah but other than that it’s been pretty cool, but it’s cold…</strong></p>\n<p>CitR: The title of the third album, you must be fed up of people asking, so I won’t do that, but I always thought it was LOST backwards?</p>\n<p><strong>Shad: Yeah that’s one interpretation I really like, because a bulk of the time that you are lost, you don’t know that you are. It takes a looking in the mirror type of situation to realize that you are lost.</strong></p>\n<p>CitR: Are you a fan of the show?</p>\n<p><strong>Shad: That show creeped me out, I liked it, but most TV shows I watch, I’ll watch many episodes in a row, I couldn’t do that with Lost. I’d watch three then I’d be like “I can’t watch any more of this in a row”. I’d go outside and I felt I couldn’t interact with people. I respect the show though, it’s a groundbreaking show.</strong></p>\n<p>CitR: Any other projects in the works at the moment?</p>\n<p><strong>Shad: We just did an iTunes live session a couple of weeks ago, so that should be out soon. It’s got some new verses here and there, we remixed some stuff and threw some old stuff in. I just did some songs with Dallas Green, one new track and a remix.</strong></p>\n<p>CitR: And the verse on the Cadence Weapon track?</p>\n<p><strong>Shad: Yeah I did a verse on his new mixtape, which was fun. I’m pretty much always recording for someone, so who knows when it comes out, I don’t know myself, half of it doesn’t get released.</strong></p>\n<p>CitR: Do you get any recording done on tour?</p>\n<p><strong>Shad: Nah not at all, I get a lot done at home.</strong></p>\n<p>CitR: What sort of stuff have you been listening to recently?</p>\n<p><strong>Shad: I got this great Curtis Mayfield live album that I’ve been listening to quite a bit recently, old Mary J Blige, the new Kanye…</strong></p>\n<p>CitR: What do you make of it?</p>\n<p><strong>Shad: It’s really good, yeah (laughs).</strong></p>\n<p>CitR: So if Kanye asked your for a verse…?</p>\n<p><strong>Shad: Oh yeah (laughs), he’d probably fly me to Hawaii.</strong></p>\n<p>CitR: A lot of your lyrics and stage presence and performance see you joking around, but you also seem to have a serious side, and discuss important topics, have you ever tried to stay away from the commercial side of rap?</p>\n<p><strong>Shad: Yeah I think that you have to try and remember why it is that you do what you do, and keep doing it for the right reasons, and create a space that you love. I don’t think it’s too much like a big climatic moment where you turn down a huge contract, it’s more just an everyday decision to think about why it is you do what you do. You have to evaluate decisions I guess, am I doing this because I care, or to make money? Each decision is individual.</strong></p>\n<p>CitR: Did you have to make many sacrifices whilst you were at university in order to pursue a hip hop career?</p>\n<p><strong>Shad: Yeah but it was always fun, I did what I had to do, I played a lot with some friends, and would have late nights than would have school really early in the morning. There were definitely some exams where I was sweating it, maybe scraping by on a mark here and there, it never felt like a sacrifice, I wanted to do both. In a lot of ways I think it helped with school, I wasn’t really in love with what I was doing in school, so having other stuff that I liked doing allowed me to put my nose to the grind with school stuff as well.</strong></p>\n<p>CitR: How haveve you been spending your spare time in the UK?</p>\n<p><strong>Shad: Sleeping… literally. We caught up a bit on time difference, but I’ve still been having an hours sleep here and there. We walked around a bit in London, in Soho neighborhood, and I have a cousin that lives there who we hung out with a bit. Got to see friends more than sights I guess, Bristol we got there too late to see anything, and Birmingham we were too freaked out to see anything. (laughs). Hopefully we’ll get to see some stuff in the morning.</strong></p>\n<p>CitR: Yeah we saw a photo of you napping on TLO’s facebook…</p>\n<p><strong>Shad: I can fall asleep in pretty much any moving vehicle. I’m just conditioned to, trains, cars, planes…</strong></p>\n<p>CitR: I saw you’re living on the West Coast now, what brought you to Vancouver?</p>\n<p><strong>Shad: I was going to school part time, been there three years now, it’s very different from Toronto. When I’m off tour it’s great to be in a place with fresh air and mountains.</strong></p>\n<p>CitR: Have you found a difference in the music scene on the West Coast?</p>\n<p><strong>Shad: In Vancouver I think a lot more of my friends are musicians, I have friends in Toronto that I grew up with, but in Vancouver a lot of people that I know just happen to be musicians. The music scene in Vancouver is a lot smaller, I really respect the bands that, ‘cus they work hard, it’s not like touring the UK, you can travel the whole place in a day, some bands travel for two days without playing a gig.</strong></p>\n<p>CitR: How often do you get put on the spot to freestyle?</p>\n<p><strong>Shad: Not that much actually, maybe if I’m hanging around some younger cats that love to freestyle, they’re just on the grind all the time.</strong></p>\n<p>CitR: Is that how it all started for you?</p>\n<p><strong>Shad: Yeah I was 14, 15, we’d be at a house party, and someone would be like “Shad spit something”. You know, it was fun in that kind of environment. When you’re just starting out your friends are excited if you can do it at all. You learn more, you listen more, and listen differently. I remember being in high school and the first time you hear Eminem or Common, and you’re like “Wow, that guy is next level”. Then you try to understand what it is that they are doing.</strong></p>\n<p>CitR: Have you ever had a fan try to freestyle battle you?</p>\n<p><strong>Shad: We were talking about that yesterday actually! There was actually one guy in Victoria, at Lucky, who was yelling from the crowd “I’ll battle you, I’ll battle you” and I was just like “I’m performing right now, it’s a concert it’s not going to happen”.</strong></p>\n<p>CitR: So how do you go about writing?</p>\n<p><strong>Shad: Well I guess the writing process comes out of freestyling, then you craft it into something and make it a bit better, usually it’s when your mind is loose, in the shower or bed, a few lines will start to stick together, then I’ll write them down.</strong></p>\n<p>CitR: Are you the kind of guy who writes everything down?</p>\n<p><strong>Shad: I try to, if I think I have a really good idea, then I try to. I feel like “if I can’t remember it then it’s not that good”.</strong></p>\n<p>CitR: The track Reservoir Poetry, is that where that comes from?</p>\n<p><strong>Shad: Yeah that was all so train of thought-ish. I can write without a beat nowadays, so I don’t always need a tempo to write to. More intelligent, double entendre stuff works better at a slower tempo, allowing the word to breathe, but faster stuff can also work better.</strong></p>\n<p>CitR: Ya I Get It seems like that sort of idea…</p>\n<p><strong>Shad: Yeah, some of the stuff in that sounds cool because the rhymes are fast.</strong></p>\n<p>CitR: What is the favourite music video that you have shot?</p>\n<p><strong>Shad: Rose Garden was fun, all my videos have been fun to do, it’s not much work for me! Everybody else is working except for me, which is the best!</strong></p>\n<p>CitR: How choreographed was Rose Garden?</p>\n<p><strong>Shad: Yeah, it took about ten takes, but all done in one shot, that’s probably the most work I’ve ever done for a video. Old Prince Still Lives At Home was fun, just ‘cus we were geeking out the whole time. We’d do a shot, then take a look and be like “yeahhh that’s sick!”. I didn’t prepare for it at all, but it was great. Everybody who had been working on it hadn’t seen what everyone else had done, it was the first time the ideas came together. It was our first time seeing quite a bit of the stuff, like the costumes and the paintings.</strong></p>\n<p>CitR: So in your opinion, who at the moment is eating microphones?</p>\n<p><strong>Shad: Jay Electronica, Lupe, I’d say those are the best. I saw an interview with Jay Electronica, he seems like a real interesting personality, the way he articulates his ideas is really abstract and obtuse. Almost every answer he gave I was like “I don’t fully understand what you are saying”.</strong></p>\n<p>CitR: So is a fourth album in the works?</p>\n<p><strong>Shad: I mean I’ve got quite a bit of stuff written down, but I couldn’t say when it’ll get recorded. I’ve never recorded in the same place twice.</strong></p>\n<p>CitR: So how did you hook up with Mike Tompkins?</p>\n<p><strong>Shad: He recorded the Old Prince, I actually did a verse on his new track. We worked the whole summer on the album, he’s just been down working with Timbaland for a month.</strong></p>\n<p>CitR: Can you tell us a bit more about the making of The Single?</p>\n<p><strong>Shad: We were just wasting time in the studio, that was during a time we were making the Old Prince, we spent a whole day doing that, when we should have been doing the album.</strong></p>\n<p>CitR: Cheers Shad! Best of luck for the rest of the tour!</p>\n","slug":"3868-interview-shad","category":"interviews","date":1292944045000,"wpid":3868,"isSticky":false,"featured_image":{"width":720,"height":480,"src":"2011/06/162909_485139569804_500714804_5731482_3593907_n.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAAAAX/xAAjEAACAQIEBwAAAAAAAAAAAAABAgMAEQQFITEHCBITIkFh/8QAFAEBAAAAAAAAAAAAAAAAAAAABf/EABwRAAEEAwEAAAAAAAAAAAAAAAIAAwQxAQVhEf/aAAwDAQACEQMRAD8AhQ8To5EGcyYZIJoog8kSRK3dD6JGWsD0qwJ31vtVwcwGS28sDmAb2AFtf5rSlAjqozl4rqYkSTbLweL/2Q=="},"createdAt":1587294840954,"updatedAt":1588403561798,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/06/162909_485139569804_500714804_5731482_3593907_n.jpg","categories":["interviews","music"]}