{"id":"5e9c32749b6559241525ded4","artists":["5e9b69177a1236eccfeb2279"],"title":"Interview: Liam Bailey","content":"<p><a rel=\"attachment wp-att-3912\" href=\"https://admin.</p><p>crackintheroad.com/music/3911-interview-liam-bailey/attachment/liam-bailey\"><img class=\"alignnone size-totallysizedforever wp-image-3912\" title=\"Liam Bailey\" src=\"https://api.crackintheroad.com/uploads/2010/12/LIAM-AWH-00373-small2-740x554.jpg\" alt=\"\" width=\"740\" height=\"554\" /></a></p>\n<p>After standing outside Edinburgh’s HMV Picture House in the pouring rain I am beckoned by a man emerging from a nearby pub and I follow. It was Liam Bailey’s tour manager and as I enter the pub Liam’s striking hair and appearance is the first thing I notice, surrounded by family and friends. We sit down and chat about everything from music to steaks. The gig itself started off slowly by a substandard performance from the opening act, whose name was drowned out by rudimentary Dubstep during the first track. Once this expired however, on came Liam Bailey, guitar in hand, looking slightly out of place as he was surrounded by pilled up Dub and R’n’B fans. He soon silenced his potential critics. Blasting out really quality soul music alongside his talented band it really was a relief after half an hour questioning why I had travelled to Edinburgh. Liam bounded around on stage, appearing to sing to every individual in the venue. It was amazing to see passion as raw as this. Liam’s slot in this gig was due to his upcoming single release with headliners Chase and Status called Blind Faith and no doubt the contrast between his voice, charisma and style and Chase and Status’ ability to turn any song into a real event will please both soul fans and Dubstep fans alike. Although this is an article about Liam Bailey, the performance of Chase and Status was also mindblowing. Their use of lighting, videos and other effects made this gig truly memorable, inviting special guests out for nearly every song to perform with them, to the delight of the crowd.</p>\n<p>This is what CitR and Liam Bailey managed to discuss before the gig:</p>\n<p><strong>CitR: We’ll start off with some of the usual questions, who would you say was a great influence on your style of music?</strong></p>\n<p>I like all sorts of old soul, reggae and blues stuff all the way through to modern rock and roll, just any fucking good music basically. Anything from Jeff Buckley to Rage Against the Machine but my main influences I would say were Bob Marley, Oasis and The Beatles.</p>\n<p><strong>CitR: What tours have you been on in the past, or is this your first major one?</strong></p>\n<p>Yeah, this is my first big tour, but its great to have it with Chase and Status, its bangin! I love it, love their stuff too; Dubstep and Drum and Bass is quality. I am enjoying the travelling and the lifestyle too.</p>\n<p><strong>CitR: Who is the best band/artist you have supported and been supported by?</strong></p>\n<p>I have supported the likes of Damian Marley which was a great experience, but also a great artist called Marques Toliver I supported before too. I have been supported by Nottingham based First Blood who is really worth listening too.</p>\n<p><strong>CitR: Where can you see yourself in 3 years time?</strong></p>\n<p>Too be honest with you I cant see past a month with the ways things are going at the minute but in three years I would like food in my fridge, lekkey on and to have some good people around me like my family and friends.</p>\n<p><strong>CitR:</strong> <strong>How did you come up with the idea of your Ezine (his online magazine about himself)?</strong></p>\n<p>Well it was something to give to fans, both online and paper copies at gigs as to begin with I didn’t have shit to give to anyone, even when they asked. So a few weeks ago after struggling for ideas I came up with this; I mean its not Morrissey-esque, its just what I like to listen to, and to be interesting to look at and some inspirational stuff.</p>\n<p><strong>CitR: What is the most embarrassing moment on stage?</strong></p>\n<p>Nothing I don’t think, I am fairly well composed on stage which is good I reckon!</p>\n<p><strong>CitR: IF you could have any superpower what would it be?</strong></p>\n<p>Invisibility without a doubt, but I would have to have all my clothes to be invisible too so I could slide in and out of places.</p>\n<p><strong>CitR: How do you order steak when in a restaurant?</strong></p>\n<p>If I were in a nice restaurant I would order a well done steak as the quality of the meat would still come through even if it was cooked for a long time, but <strong>*</strong>looks around* in a place like this I would order it medium as the quality of the meat would not necessarily be as good and might be tough if cooked too long.</p>\n<p><a href=\"https://www.liambaileymusic.co.uk/\">Liam Bailey Official</a></p>\n<p><a href=\"https://www.myspace.com/liambaileyuk\">Liam Bailey Myspace</a></p>\n<p><script src=\"https://video.unrulymedia.com/wildfire_11244048.js\" type=\"text/javascript\"></script></p>\n","slug":"3911-interview-liam-bailey","category":"interviews","date":1293724730000,"wpid":3911,"isSticky":false,"featured_image":{"width":2362,"height":1771,"src":"2010/12/liam-awh-00373-small2.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAYH/8QAIxAAAQIFAwUAAAAAAAAAAAAAAQIDAAQFBhEHEiETIiMxgv/EABUBAQEAAAAAAAAAAAAAAAAAAAEC/8QAGBEAAwEBAAAAAAAAAAAAAAAAAAECESH/2gAMAwEAAhEDEQA/ANZ1urrlvMUadE5OyrXXKSuWVgJOUncpOe4Y3DHPBMUjd/2062lxFSyhYCh4HfR+YQi5hNaLreH/2Q=="},"createdAt":1587294836024,"updatedAt":1588403561723,"author":"5e9b68b27a1236eccfeb1d07","old_image":"2010/12/liam-awh-00373-small2.jpg","categories":["interviews","music","reviews"]}