{"id":"5e9c34649b6559241525e209","title":"Review & 5 Minutes With: Raised By Swans","content":"<p style=\"text-align: center;\">The Canadian music scene is one which has seen a revival in the last five or six years, and at this moment in time, is arguably the strongest and most exciting it has ever been.</p><p> Whilst many people will be able to name you the more commercially successful bands such as<strong> Arcade Fire</strong> and <strong>Tokyo Police Club</strong>, there are just as many amazing bands who have gone somewhat under the radar as well. In the last few weeks on this website we have brought you articles on <strong>Japandroids</strong>, <strong>Godspeed You Black Emperor!</strong> and <strong>Shad K</strong>, all of whom are Canadian born and bred. <strong>Raised By Swans</strong> are the latest in what is hopefully a long list of Canadian bands to feature on this website. Their second full length album entitled <strong>No Ghostless Place</strong> was released on January 11 of this year and is available to purchase from the links below the article.</p>\n<p style=\"text-align: center;\"><strong>No Ghostless Place</strong> is a moving, atmospheric journey through the catacombs of haunting vocal melodies and tenderly plucked guitars. <em>We Were Never Young</em> opens the album in a deliberately delicate style, with the stunning vocals leading the song affectionately along. Next track <em>Hail Of Arrows </em>is a more upbeat affair, in which lead singer <strong>Eric Howden</strong> optimistically proclaims <em>“it’s hard, to lay arms down, in the arms of the one, who lays you bare”</em>. Throughout the first listen of the album, the delicate and compassionate vocals of Howden seem to lead many of the songs, a few listens on however and the nature of the harsh drumbeats and eerie yet fascinating guitar combine perfectly to provide each and every track with a real fragility. These are songs which work because of the multiple layers on which they are formed upon, most notably on <strong>Easier </strong>where the layered vocals set a fitting scene for the rest of the instruments. Imagine a<strong> Jim Adkins </strong>fronted <strong>Explosions In The Sky</strong>, and you begin to realise the level on which the lush vocals entwine with the expertly composed melodies, leaving the listener trapped in a web of emotional devastation and ardent wonder. The untarnished form that each of the songs are delivered in really begins to drag the listener into the music, the ghosts are not the type you see in children’s fairytales, nor in decrepit desolate shacks, but more the  agonising memories of squandered loves. <strong>The Waiting’s Over </strong>is a chilling ode to the future in which we may be blindly be leading ourselves into,<em> “where once slept a sinking continent, now there is nothing more” </em>yearns<strong> Howden</strong> nostalgically. His love of <strong>Brian Wilson’s </strong>vocals (mentioned in the interview) is clearly evident, both in delivery and subject matter. They are despondent and regretful to a point, whilst leaving the listener at the entrance to a tunnel of aspiration, allowing them to make their own future decisions. <strong>Old Fires</strong> is another beautiful example of the densely layered vocal harmonies, and serves as a real testament to both the elegance and charm which Raised By Swans possess. Standout track and six minute epic<strong> The Past  Is The Prey</strong> is a guilt soaked lullaby to an absent partner.  In the opinion of many, last years <em>Hospice</em> by <strong>Antlers</strong> was the bewitching, captivating masterpiece of the year, and whilst only a few months into this year, it would not be too forthcoming to suggest that the formidable, breathtaking <em>No Ghostless Place </em>could well steal their crown.</p>\n<p style=\"text-align: center;\">Eric Howden from Raised By Swans agreed to answer a few questions for us.</p>\n<p style=\"text-align: center;\"><em>CITR: </em>If you had to cite one band/artist as a major influence upon you, who would it be?</p>\n<p style=\"text-align: center;\"><strong>There are too many to list, but I can certainly pinpoint one of the first.  When I was a child I fell in love with </strong><em><strong>Pet Sounds</strong></em><strong> by The Beach Boys.  I used to sit by the speakers in our living room and marvel at the beauty of the vocal harmonies, the layers of strange and fascinating sounds, and above all the lovely vulnerability behind most of the songs, even the upbeat ones (not that I really had a clue about the sorts of things Brian Wilson was singing about at the time; I was more preoccupied with things like Tintin and eating popsicles than the kind of heartbreak and loneliness that he was going through). </strong><em><strong>Pet Sounds</strong></em><strong> was the first album I’d heard that stood as an experience from start to finish, not just a jumble of seemingly disconnected songs.  Although our music doesn’t really sound anything like that album (besides my clear love of falsetto), it’s the quality of that album, and how much was put into it – the melodies and arrangements and attention to sounds and odd little intimate details – that has stuck with me all these years.</strong></p>\n<p style=\"text-align: center;\"><em>CITR: </em>What has been your favourite gigging experience to date?</p>\n<p style=\"text-align: center;\"><strong>There isn’t one that stands out, but there’s a type.  It’s the tiny clubs where everyone is attentive and warm, it’s packed but not in a horrible suffocating way, pints are being passed overhead, there’s some conversation between us and the audience, and the night feels like it could go on forever without ever feeling any less perfect.  I could probably live quite happily in some sort of time loop, like </strong><em><strong>Groundhog Day</strong></em><strong>, if only a show like that was part of the twenty-four hours being repeated.</strong></p>\n<p style=\"text-align: center;\"><em>CITR: </em>Do you have any plans to come over to Europe in the future?</p>\n<p style=\"text-align: center;\"><strong>Absolutely.  The ‘plans’ are thus far limited to giddy conversations over drinks, as we’re doing all of our own booking and publicity right now (besides some pro bono help from a very kind ex-publicist here in Canada, here and there) and would have to assemble a tour ourselves from scratch.  But that’s our next focus, as we’d love (understatement of the century) to get over to Europe to play.</strong></p>\n<h1 style=\"text-align: center;\"><a href=\"www.raisedbyswans.com\">Official Site</a></h1>\n<h1 style=\"text-align: center;\"><a href=\"www.myspace.com/raisedbyswans\">Myspace</a></h1>\n<h1 style=\"text-align: center;\"><a href=\"https://www.facebook.com/pages/raised-by-swans/116803841666760?ref=ts\">Facebook</a></h1>\n<p style=\"text-align: center;\"><strong><br />\n</strong></p>\n","slug":"393-5-minutes-with-raised-by-swans","category":"interviews","date":1272022626000,"wpid":393,"isSticky":false,"featured_image":{"width":1800,"height":1079,"src":"2010/04/rbs_live_photo_lr-1.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAGAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAYH/8QAIhAAAQMEAAcAAAAAAAAAAAAAAQIDBAAGESEFEhMxQVFx/8QAFQEBAQAAAAAAAAAAAAAAAAAAAwT/xAAZEQADAAMAAAAAAAAAAAAAAAAAAQIDITH/2gAMAwEAAhEDEQA/AMHl281wC4o8d/pzkqjB8pcSQnJRsaPgnR+VJSmwzJdaxnkWU9/RxSlHDb6UZ5U6R//Z"},"createdAt":1587295332172,"updatedAt":1588403568704,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2010/04/rbs_live_photo_lr-1.jpg","categories":["interviews","music","reviews"]}