{"id":"5e9c326d9b6559241525dec8","artists":["5e9b69447a1236eccfeb254d"],"title":"Interview: Solar Bears","content":"<p><a rel=\"attachment wp-att-3978\" href=\"https://admin.</p><p>crackintheroad.com/music/3969-interview-solar-bears/attachment/ziq270_solar_bears-1\"><img class=\"alignnone size-650home wp-image-3978\" title=\"ZIQ270_Solar_Bears (1)\" src=\"https://api.crackintheroad.com/uploads/2011/01/ZIQ270_Solar_Bears-1-650x453.jpg\" alt=\"\" width=\"650\" height=\"453\" /></a>Seemingly appearing out of nowhere, Irish duo Solar Bears began to cause a stir towards the latter part of last year, gaining rave reviews from the likes of NME and FACT Magazine, even squeezing into several end of year lists. Combining eclectic influences, with an expert knowledge of materializing beats, Solar Bears create intense and immersing post-rock esque music. There’s an angelic tint to their synth heavy, other worldly debut album She Was Coloured In, released on Planet Mu Records. CitR were lucky enough to catch up with one half of the duo, John to get a few key questions answered.</p>\n<p><em>CitR: How did Solar Bears come about?</em><strong><br />\n</strong></p>\n<p><strong>We met at Pulse Sound college and met up years later to work on a single  track. Things went from there because we were really content with the  initial experience.</strong></p>\n<div><em>What would you describe as your main influences, both musical and otherwise?</em></div>\n<div><strong>Death in Vegas and Primal Scream. Rian is obsessed with Aphex Twin as well as film music like Morricone and Delerue.</strong></div>\n<div><em>How would you go about describing your sound, to someone who had never heard your music before?</em></div>\n<div><strong>A cross of electronica, folk, indie, shoegaze, post rock and hip hop. We get compared to different bands constantly.</strong></div>\n<div><em>How  did you go about recording She Was Coloured In, was it a straight  forward process with a clear idea of which tracks would feature on the  record, or did it come together as you went along?</em></p>\n</div>\n<p><strong> It came together as we went along. The label really helped us organize  and filter what we had at a certain point. We were all satisfied with  the collection of tracks after the sessions but we were still nervous  about an actual release which is natural.</strong></p>\n<div><em>What has been your most embarrassing live gigging moment?</em><br />\n<strong> </strong></div>\n<div><strong>We have yet to play live. That is what we will be focusing on this year. Our first gig is at Rough Trade Records this month.</strong><em> </em></div>\n<div><em>Have you got any plans for 2011 in the way of releases or tours?</em><br />\n<strong> </strong></div>\n<div><strong>Definitely touring. We have been approached by different people about  getting more music out. Writing is something we want to return to when  we can as well as doing more remixes for other artists.</strong></div>\n<div><em>Where would you like to see Solar Bears in a years time?</em></div>\n<div><strong>Hopefully still producing music we are proud of and creating in some other ways.</strong></div>\n<div><em>What was the first record you can remember falling in love with?</em></div>\n<div><strong>Post by Bjork. I bought it on cassette and played Hyperballad on repeat for days on end.</strong></div>\n<div><em>If you could have any superpower, what would it be?</em></div>\n<div><strong>X-Ray vision for obvious reasons.</strong></div>\n<div><em>Cheers John!</em></div>\n<div>Check back for our review of She Was Coloured In over the next few days!</div>\n<div><a href=\"https://www.myspace.com/solarbears\">Solar Bears on Myspace!</a></div>\n","slug":"3969-interview-solar-bears","category":"interviews","date":1294334255000,"wpid":3969,"isSticky":false,"featured_image":{"width":900,"height":628,"src":"2011/01/ziq270_solar_bears-1.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAQG/8QAIBAAAQMEAgMAAAAAAAAAAAAAAQIDEQAEBRIUISIxYf/EABUBAQEAAAAAAAAAAAAAAAAAAAQG/8QAHREBAAEDBQAAAAAAAAAAAAAAAQIAAxEEEzGywf/aAAwDAQACEQMRAD8Agxl3YoxGFQlpwoLBUSDHmo6rnr1AERWEu3rXlPapOu6o6+0pV7oo7c7qPL60eQNq0BjA9pV//9k="},"createdAt":1587294829333,"updatedAt":1588403561620,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/01/ziq270_solar_bears-1.jpg","categories":["interviews","music"]}