{"id":"5e9c326b9b6559241525dec5","artists":["5e9b68f87a1236eccfeb2084"],"title":"One to watch: Free Blood","content":"<p>It might seem odd to tip a band who have been around since 2003 as ‘ones to watch’, particularly when their first compilation of singles was released in 2008, but Free Blood are looking set to get huge.</p><p> Trust us.</p>\n<p>Self-named as the soundtrack for parties gone awry, this is music to fuel awkward sexual dalliances, desperate yelled misunderstandings on the dance floor, toilets over-flowing with the night’s collective regurgitation, lonesome midnight ramblings, hair-brained (possibly illegal) parlour games, sound systems fried by heat and spillages and back garden bonfires. For the first four years of their life, Free Blood were an entirely live act, most notably playing solely in New York (apart from one stint in Japan) and generally appearing without warning at parties across the state.</p>\n<p>Many of you might have heard of their music in the past, particularly around the time of ‘The Singles’ in 2008, their only compilation to date, which brought them a small amount of exposure. It’s now though, as we start 2011, that they are looking to explode in to the wider concious, with their blend of electronic dance-punk ‘Never Hear Surf Music Again’ soundtracking the intro to Danny Boyle’s latest film ‘127Hours’. Check that out below, and keep your eye out for their other material which has been sadly overlooked by many up to now.</p>\n<p>Download: <a href=\"https://api.crackintheroad.com/uploads/2011/01/01%20-%20Never%20Hear%20Surf%20Music%20Again.mp3\">Free Blood – Never Hear Surf Music Again</a></p>\n","slug":"3981-one-to-watch-free-blood","category":"music","date":1294407015000,"wpid":3981,"isSticky":false,"featured_image":{"width":3264,"height":2448,"src":"2011/01/free+blood+p1010834.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAIAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAIG/8QAHxAAAgICAgMBAAAAAAAAAAAAAQIDEQAEBQYSE2EU/8QAFQEBAQAAAAAAAAAAAAAAAAAAAAH/xAAYEQEAAwEAAAAAAAAAAAAAAAABAAIDQf/aAAwDAQACEQMRAD8AxnGdq2IOvQRzPuyR+cc+qvu8/wAsSiiKqjQF/cra7jzU+zNKnESujuWDNrsSwJuz9xjI51eQ2Z//2Q=="},"createdAt":1587294827766,"updatedAt":1588403561594,"author":"5e9b68b27a1236eccfeb1d0b","old_image":"2011/01/free+blood+p1010834.jpg","categories":["music"]}