{"id":"5e9c32679b6559241525debc","title":"Glastonbury Emerging Talent Competition","content":"<p>Firstly I’d like to wish every one a very Happy New Year for 2011, and that it wasn’t too much of an anti climax.</p><p> I think that’s the problem about New Year, so much concentrated energy and feeling is put into a couple of days and then it all just seems to fizzle out, leaving us to trudge through the remaining months of winter. However there is always one thing that keeps me going through the start of a new year; the prospect of Festival Season. That’s right, while summer may seem a while off yet, you<strong> </strong>can already start planning, and generally getting excited about, all the festivals you’re going to and the line ups that may or may not transfer from rumour to fact.</p>\n<p>Each year <strong>Glastonbury </strong>hosts an <strong>Emerging Talent Competition </strong>in which blogger judges are asked to listen to hundreds of unsigned artists which enter the competition, and to compile a shortlist of their chosen bands to progress to the next round in which judges such as <strong>Michael Eavis </strong>will whittle the list down further. This is a fantastic opportunity for many bands, and has provided previous winners such as <strong>Stornoway, The Subways </strong>and last years winners, <strong>Ellen & The Escapades </strong>with a great deal of attention and critical acclaim. This year I have been given the opportunity to represent <strong>Crack In The Road </strong>on the judging panel, and I can’t wait to hear all the new music from bands eager to play at one of the best festivals in the world.</p>\n<p>You can find out more information about the competition <a href=\"https://www.glastonburyfestivals.co.uk/information/performing-etc/2011-etc\" target=\"_blank\">here</a>.</p>\n<p><strong>NOTE FOR ENTRANTS: </strong>If you would like to be considered for an article, then please send an email to site@crackintheroad.com, with Glasto Emerging in the title, and from there all emails will be forwarded on to the correct people. Also, it helps if you can include mp3s or links to download, as we don’t sit at our computers all day listening to soundcloud links (honestly!). Thank you and good luck.</p>\n","slug":"3997-glastonbury-emerging-talent-competition","category":"festivals","date":1294661055000,"wpid":3997,"isSticky":false,"featured_image":{"width":1024,"height":672,"src":"2011/01/glastonbury.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAIF/8QAIBAAAgICAQUBAAAAAAAAAAAAAQIDEQAEQQYSExQhkf/EABUBAQEAAAAAAAAAAAAAAAAAAAQF/8QAHBEAAgICAwAAAAAAAAAAAAAAAQMAAgQRBYHw/9oADAMBAAIRAxEAPwDJc67TRLq6tqZPEsgIHc9fQQeL5vKk6a2ndm9Jlsk0F1zX7jGRn8i1Z0APdxCsal9kz//Z"},"createdAt":1587294823150,"updatedAt":1588403561516,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2011/01/glastonbury.jpg","categories":["festivals","music"]}