{"id":"5e9c34ab9b6559241525e27c","title":"Sarah Jaffe","content":"<p><a href=\"https://blogs.</p><p>dallasobserver.com/dc9/jaffe.jpg\" onblur=\"try {parent.deselectBloggerImageGracefully();} catch(e) {}\"><img style=\"margin: 0pt 10px 10px 0pt; float: left; cursor: pointer; width: 209px; height: 314px;\" src=\"https://blogs.dallasobserver.com/dc9/jaffe.jpg\" border=\"0\" alt=\"\" /></a></p>\n<div style=\"text-align: center;\">Sarah Jaffe is a 24 year old singer-songwriter from Texas who creates deeply emotional and personal folk music. Taking her inspirations from Fleetwood Mac, Bjork, Radiohead and Grizzly Bear, to name a few, her debut album <span style=\"font-weight: bold;\">Suburban Nature</span> is released in Spring 2010.</p>\n<p>This is one of my favourite albums from this year so far, and has certainly been one of my most played. Every single one of her songs is injected with a venom so personal, I’ve been close to tears at times. I’d compare her to the likes of Laura Marling, Belle & Sebastian and Slow Club, so if you are a fan of any of them, I cannot recommend Jaffe highly enough. Only four minutes into her album, and she is reminiscing of a failed attempt at reconciliation with a lover, with her fragile voice skipping from crack to crack. <span style=\"font-style: italic;\">“How can someone who wants to be loved, hate it when they are loved at all?”</span> she cries on <span style=\"font-weight: bold;\">Better Than Nothing</span>, only to justify later in the song that she <span style=\"font-style: italic;\">“feels something, that’s better than nothing”</span>. However, the standout track of the album, is undoubtedly <span style=\"font-weight: bold;\">Clementine</span>, a song so perfectly constructed that it demands repeated listens. Unfortunately for Jaffe, this album has gone largely under the radar so far, and I can only hope she soon reaps the rewards she deserves. Albeit, not a perfect album, just like any relationship, there are the ungainly stumbles, especially in the latter half of the album with <span style=\"font-weight: bold;\">Luv</span> being the most obvious example, with the ever so almost cliched use of spelling words out. However, it is a thoroughly enjoyable listen, and is worthy of it’s position as one of my favourites from 2010 so far. In an age of popstars who rise to fame from covering others folk songs, it is refreshing to hear a singer with such power and vigour as well as songwriting ability. To say <span style=\"font-weight: bold;\">Suburban Nature</span> sums up a tumultuous relationship would be a gross understatement, this album is a relationship between the listener and Jaffe, with all the awkward smiles, gentle kisses and piercing tears that come with it.</p>\n<p><a href=\"https://www.mediafire.com/?zjmzt2ylomu\">Black Hoax Lie</a><br />\n<a href=\"https://www.mediafire.com/?jnynxhmzwzk\">Clementine</a></p>\n<p><a href=\"https://www.sarahjaffe.com/\">https://www.sarahjaffe.com/</a></p>\n</div>\n","slug":"4-sarah-jaffe","category":"music","date":1270150560000,"wpid":4,"isSticky":false,"featured_image":{"width":188,"height":188,"src":"2011/06/jaffe-188x188.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFwAAAwEAAAAAAAAAAAAAAAAABAYHCP/EACQQAAICAAYABwAAAAAAAAAAAAECAwQABQYREmEHFCEiMUGB/8QAFAEBAAAAAAAAAAAAAAAAAAAABP/EABoRAAICAwAAAAAAAAAAAAAAAAABEVECAxP/2gAMAwEAAhEDEQA/AHjxcmsRzWvI3TXnqQVpKipaaIq5c8iEHtcseK7N0B3RY6+YsimY5eZCAWKMeO/3t1jOeppZJ840m00jyM0o5FyST8H137AP5g2a3ZErgWJgAxAAc4M9kObE8lkkqP/Z"},"createdAt":1587295403023,"updatedAt":1588403569699,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/06/jaffe-188x188.jpg","categories":["music"]}