{"id":"5e9c32589b6559241525deaf","title":"Review: Justin Townes Earle (Manchester)","content":"<p>Arriving at the<strong> Deaf Institute </strong>with the company of <strong>Simon Doyle</strong>, we walked to the bar to order the two pints of tap water that are always preceded by the judgmental grimace of the barman.</p><p> Thirst quenched and our pockets still threadbare, we sat down in the top right corner of the elevated seating area, tucked away to witness the country stylings of <strong>Justin Townes Earle</strong>. Son of the infamous rock/country artist <strong>Steve Earle, Justin </strong>received an <strong>Americana Music Award </strong>for <strong>Emerging Artist of the Year </strong>in 2009 after releasing 3 albums which had steadily gained more and more critical acclaim amongst the country fans and critics alike. However it is with his latest effort, <strong>Harlem River Blues</strong>, that <strong>Justin </strong>has truly harnessed a country sound that is invigorating to listen to, as his obvious influences of the blues and rock galvanise the often painful emotions that flood through his tracks. With positive reviews from <strong>Rolling Stone </strong>and many National Newspapers, I was thoroughly excited to see whether <strong>Justin </strong>could do his country sound justice this side of the pond</p>\n<p><strong>James Walbourne:</strong></p>\n<p>Presumably after waiting for a decent sized crowd to build up, <strong>James Walbourne</strong>, and what I can only hope was a session musician that was asked to play the Double Bass for the first time in his life, unassumingly took to the stage. If that name is ringing an annoying bell, then I’ll put you out of your misery and confirm that he is indeed the guitarist from the <strong>Pretenders</strong>. Strikingly different from the <strong>Pretenders</strong>, <strong>Walbourne</strong>‘s latest solo effort is distinctly country, but British country. Don’t be worried, the idea of such a genre didn’t settle too easily on me either.</p>\n<p>Enjoyably energetic throughout, <strong>Walbourne </strong>ventured through a set of the refreshing and the pleasantly odd. ‘<strong>Northern Heights</strong>‘ is perhaps the best example of <strong>Walbourne</strong>‘s take on the typical country sound, while making sure it doesn’t become stagnant in all the stereotypes that exist around country music. Guitars and tempo typical of the genre were transformed into something with a more modern sound, which rested very much on it’s own standing rather than sounding like karaoke country. There were moments where it felt like <strong>Walbourne </strong>fell back on to the boringly stereotypical ‘<strong>Songbird</strong>‘ being one of these, however on the whole <strong>Walbourne </strong>avoided such pitfalls. The real surprise came with tracks such as ‘<strong>Cocaine Eyes</strong>‘ and ‘<strong>BBC</strong>‘ which retained the Americana feel while also being undeniably British. This ‘British-ness’ came through <strong>Walbourne</strong>‘s vocals, but it was also present in the attitude of the tracks, something only done justice by listening to them.</p>\n<p>While <strong>Walbourne</strong> & co suffered without the presence of percussion, I was surprised by not only how much I enjoyed their music, but by the fact I would listen to it outside of the gig. With many other country inspired artists entering the fray of the mainstream, Walbourne could be one of those to rid country music of the nasty stereotypes many associate it with.</p>\n<p>7/10</p>\n<p><strong>Justin Townes Earle:</strong></p>\n<p>His charisma was instantly identifiable as he took to the stage, with a cool swagger that made you pay attention. Breaking straight in to his set, <strong>Justin</strong>‘s Southern tenor demonstrated why this artist had gathered so much critical acclaim in his home land. Strong yet intimate, raw yet emotionally refined, <strong>Justin</strong>‘s vocals were reminiscent of the country stylings of <strong>Ryan Adams </strong>while echoing a power similar to that of <strong>Springsteen</strong>. However these can be seen simply as influences, as <strong>Justin</strong>‘s vocals were very much his own and as a result formed an important part of his charm. From the beginning it was clear to see that by no means was <strong>Justin </strong>attempting to emulate or perpetuate country stereotypes.</p>\n<p>Between tracks <strong>Justin </strong>would digress in to brief stories, always addressing the audience as ‘Ladies and Gentlemen’, about himself and his experiences which had inspired the tracks he was performing. Making light of his history of serious drug and alcohol abuse, this only served as to emphasize the authenticity of not only his songs but of his own being, as an artist and a person. Country inspired music has always been something which deals with very personal issues in a romantically melancholic fashion, and in many ways <strong>Justin </strong>is navigating his own path down this style. A highlight from these stories was an exchange with an audience member of a woman in <strong>Justin</strong>‘s past:</p>\n<p><strong>Justin</strong>: She was real trash man.</p>\n<p><strong>Audience Member</strong>: Trailer Trash?</p>\n<p><strong>Justin</strong>: No no, much worse than that. At least Trailer Trash has somewhere to live!</p>\n<p>Shortly after this interchange <strong>Justin </strong>indulged the audience in a real Blues classic that was inspiring to watch, and which demonstrated the raw origins from which his own sound was born.</p>\n<p>Working through his most recent albums, particular tracks that stood out were ‘<strong>Wanderin’</strong>, ‘<strong>Move over Moma</strong>‘, and ‘<strong>They Killed John Henry</strong>‘. All undeniably country influenced, but all unique at the same time. What’s more, <strong>Justin </strong>managed to project dramatic shifts in tempo and mood between songs superbly with only himself and his guitar on the stage, which only made his performance that much more impressive.</p>\n<p>While <strong>Justin Townes Earle </strong>won’t be for everyone, his country and blues influenced music stands as a real revival of a long neglected genre. Avoiding all of the comic stereotypes, <strong>Justin </strong>has managed to take the personal and intimate sounds of country and blues, and form them in to his own sound which is full of integrity and very listenable.</p>\n<p>9/10</p>\n<p><object classid=\"clsid:d27cdb6e-ae6d-11cf-96b8-444553540000\" width=\"100%\" height=\"81\" codebase=\"https://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=6,0,40,0\"><param name=\"allowscriptaccess\" value=\"always\" /><param name=\"src\" value=\"https://player.soundcloud.com/player.swf?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F8790655\" /><embed type=\"application/x-shockwave-flash\" width=\"100%\" height=\"81\" src=\"https://player.soundcloud.com/player.swf?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F8790655\" allowscriptaccess=\"always\"></embed></object> <span><a href=\"https://soundcloud.com/stayloose/justin-townes-earle-rogers-park\">Justin Townes Earle – Rogers Park</a> by <a href=\"https://soundcloud.com/stayloose\">Stayloose</a></span></p>\n<p><strong><a href=\"https://www.myspace.com/jameswalbourne\" target=\"_blank\">James Walbourne Myspace</a></strong></p>\n<p><strong><a href=\"https://www.myspace.com/justintownesearle\" target=\"_blank\">Justin Townes Earle Myspace</a></strong></p>\n","slug":"4018-review-justin-townes-earle","category":"music","date":1295265410000,"wpid":4018,"isSticky":false,"featured_image":{"width":720,"height":428,"src":"2011/01/justin-townes-earle.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAGAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAAAAb/xAAiEAABAwMDBQAAAAAAAAAAAAACAQMRAAQFBgcSEyExcaH/xAAVAQEBAAAAAAAAAAAAAAAAAAABA//EABgRAAMBAQAAAAAAAAAAAAAAAAABEQIh/9oADAMBAAIRAxEAPwCM280s1msdkScJsRVrppIyol2JCT1H2oy8sRYu32k4kjZkE+JhYpSpzlBabcZ//9k="},"createdAt":1587294808994,"updatedAt":1588403561412,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2011/01/justin-townes-earle.jpg","categories":["music","reviews"]}