{"id":"5e9c32499b6559241525de96","artists":["5e9b695d7a1236eccfeb2703"],"title":"Review: White Lies – Ritual","content":"<p>Debut albums are always difficult to follow up, especially when the critical response for your introductory record was so phenomenally positive.</p><p> Whilst To Lose My Life, the debut record from London melancholic trio White Lies was almost entirely reworked versions of old tracks, that didn’t prevent it from being somberly engaging. New record Ritual, released earlier this month has been kept completely under wraps, with few live performances, and only one single from the record, the brilliant Bigger Than Us.</p>\n<p>In recent interviews the trio have spoken of their longing to become the largest group in the world, modeling themselves upon Tennessee rockers Kings of Leon. Far from the ambitions previously shown by former outfit, Fear of Flying, however with a sound as expansive and epic as White Lies, you can’t blame them for believing that they can appeal to the masses. With economic and social unrest tending to go hand in hand with the mood of music produced, it’s no surprise that the current trend for new music is melancholic, synth heavy and irrefutably dark, and White Lies are no exception.</p>\n<p>So with so little previously heard about this record, listening to it for the first time meant giving the band almost an entirely clean slate upon which to impress, a rare occurrence in a time when music ends up on the internet seemingly before it is even finished. Album opener Is Love appears to be fairly standard White Lies, gloomy and atmospheric, lacking any real lyrical quality. However, mid-way through the track, blaring synths take over, in almost laughable Limp Bizkit fashion, why they felt this brash step necessary is completely beyond me.</p>\n<p>Strangers continues in a similar style, with keyboards commanding the track onwards and upwards, it’s epic, but lacks any real passion or drive, ending up sounding like Editors disappointing third album, contrived and strangely plastic. Whilst there was no doubting the fact White Lies couldn’t have made another To Lose My Life…, it seems bizarre that they have chosen to divert their music in this, electronic direction. Recent rumours have linked them to recording with coiffed songstress La Roux, in which case this new direction would be entirely in line with her monotonous dance music.</p>\n<p>Elsewhere the fantastic lead single Bigger Than Us, along with it’s brilliantly bizarre video, has to go down as false advertising. There’s little that reaches that standard, let alone touching the highs of To Lose My Life.., the cryptic Turn The Bells is the closest the trio come to emulating their debut record. Although, one can’t help but feel that Harry’s lyrics, which have never excelled, are disastrously poor, causing what is otherwise sound songwriting, to suffer hugely.</p>\n<p>Where the group will go from here is unknown, and like their previous work, will be shrouded in morose mist, yet Ritual possibly tries a little too hard to cement their somber influences. Far from as exciting, sinister or engaging as To Lose My Life…, Ritual will have to go down as a disappointment for me.</p>\n","slug":"4026-review-white-lies-ritual","category":"music","date":1296325997000,"wpid":4026,"isSticky":false,"featured_image":{"width":165,"height":165,"src":"2011/01/white-lies-165x165.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFwAAAwEAAAAAAAAAAAAAAAAAAgQFB//EACMQAAIBAwQCAwEAAAAAAAAAAAECAwQRIQAFEiIGcRMUMWH/xAAUAQEAAAAAAAAAAAAAAAAAAAAD/8QAGBEBAAMBAAAAAAAAAAAAAAAAAQARITH/2gAMAwEAAhEDEQA/AMB23aqZ/HHmqgI3kqBGshHJuQGQtvxewvf+W0Vf439SuqKZZOYhkaMPjtY2vj1pap6R0ar1X4A1hjPXPvVXcpZG3GqZpHLGVySWNzk6AsXYrScn/9k="},"createdAt":1587294793364,"updatedAt":1588403561209,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/01/white-lies-165x165.jpg","categories":["music","reviews"]}