{"id":"5e9c32649b6559241525deb6","title":"Review: Klaxons – Landmarks of Lunacy","content":"<p><a rel=\"attachment wp-att-4036\" href=\"https://admin.</p><p>crackintheroad.com/?attachment_id=4036\"><img class=\"alignnone\" title=\"Klaxons\" src=\"https://nd01.jxs.cz/118/052/7b1a3eef03_10081701_o2.jpg\" alt=\"\" width=\"800\" height=\"621\" /></a></p>\n<p>Everybody likes free stuff, and Klaxons’ ‘Landmarks of Lunacy’ EP should be no exception. Released on Christmas Day as a gift to fans, it’s a glimpse of the psychedelic direction the band initially wanted to take prior to being forced to bow to their label. Although what was eventually produced, 2010’s ‘Surfing the Void’, is a strong album in itself, ‘Landmarks of Lunacy’ is Klaxons at their best.</p>\n<p>First things first – with regards to this EP, throw out everything you think you know about Klaxons. This isn’t the chart-friendly rave of ‘Myths of the Near Future’, or the hardcore space-rock of ‘Surfing the Void’. ‘Landmarks of Lunacy’ is slow and raw. There are no explosive guitar riffs or lightning quick vocals. Instead, these are replaced by haunting melodies and much slower, mellower vocals than Klaxons fans may be used to. In respect of this complete departure from the norm, it’s probably best to approach this EP as something entirely different – expect classic Klaxons, and you’ll be disappointed.</p>\n<p>Impressively, Klaxons seem to have conjured up a flawless EP. Indeed, in creating ‘Landmarks of Lunacy’, the band has compiled the best of many songs they created in their post-‘Myths’ days. The incredibly catchy ‘Silver Forest’, and the echoed, haunting ‘Ivy Leaves’ stand out, but it’s the 7-minute epic ‘Marble Fields’ that triumphs – this track is one of the best the band have ever delivered, beginning with a fantastic piano riff and rising to a crescendo of madness and noise. So fear not, Klaxons fans – this may be a different direction, but the band is as insane as ever.</p>\n<p>Lyrically, Klaxons have always been rather strange – their previous two albums have been completely full of borderline mad non-sequiturs. However, with this EP, it seems they’ve descended into complete gibberish. ‘Wildeflowers’, in particular, stands out – (<em>Programmed: the co-ordinates/Mirrored down there in the dip/Refraction triggers/Now a take of wildeflowers</em>). This isn’t necessarily a bad thing, but if you’re looking for deep, meaningful, and beautifully written lyrical ballads, this is not the place for you. Of course, there are occasional moments of genius – (<em>And never trouble trouble ‘till the trouble troubles you</em>), and hearing these words on record is always good for a laugh, whether it’s intended or not.</p>\n<p>So the question is, is ‘Landmarks of Lunacy’ better than their previous albums? Short answer: yes. It represents what the band wanted to do – what it could have done, had it stood up to the executives. ‘Surfing the Void’ may be a decent effort, but it has one or two very poor tracks on it and it’s a sad realisation to think that we could have had an entire album of this instead. So download this EP (it is free, after all), listen to it, love it, and pray that Klaxons turn around, bring back old producer James Ford, and realise that psychedelia is their future.</p>\n","slug":"4035-review-klaxons-landmarks-of-lunacy","category":"music","date":1295112104000,"wpid":4035,"isSticky":false,"featured_image":{"width":800,"height":621,"src":"2011/06/7b1a3eef03_10081701_o2.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAIAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAYH/8QAIBAAAQIHAAMAAAAAAAAAAAAAAQMEAAIFBhESIVFSgf/EABQBAQAAAAAAAAAAAAAAAAAAAAP/xAAYEQEBAQEBAAAAAAAAAAAAAAABAgARQf/aAAwDAQACEQMRAD8AyeqOHtBtukSvKeumu4nWKBcZl2TOmk2uO46O+DE8bnAJBnqGR6uwB8BHIQh7U9yVSPN//9k="},"createdAt":1587294820027,"updatedAt":1588403561465,"author":"5e9b68b27a1236eccfeb1d16","old_image":"2011/06/7b1a3eef03_10081701_o2.jpg","categories":["music","reviews"]}