{"id":"5e9c324b9b6559241525de99","artists":["5e9b69517a1236eccfeb261c"],"title":"Interview: The Luyas","content":"<p><img class=\"alignnone\" title=\"Luyas\" src=\"https://www.</p><p>rokbun.com/uploads/2009/09/2.jpg\" alt=\"\" width=\"900\" height=\"506\" />With only a few weeks to go until the release of their highly anticipated sophomore record, Too Beautiful To Work, excitement is gradually building around The Luyas. As well as it being their first release on Canadian based label Dead Oceans, the album will feature tracks produced with the help of Final Fantasy, or Owen Pallet as he is now better known. Their unconventional pop inspired sound has seen them recently featured on Pitchfork, where the title track from the upcoming album has been made available as a free download. We were honoured to catch up with The Luyas, and find out more about the album, and what 2011 may have in store for the band.</p>\n<p><em>CitR: How did The Luyas come about?</em></p>\n<p><strong>The Luyas  started like most bands start, I guess.  We met and became fond of each  other and started doing our thing.  Over time it’s become stronger and  more fun and the music is better.  I’ve never felt so good about people in my life.</strong></p>\n<p><em>CitR: What would you cite as the main influences behind your band, both musically and otherwise?</em></p>\n<p><strong>The original idea was to make a band that didn’t  have any rules.  Then we started writing songs and that sort of changed  a bit.  I guess we’re influenced by artists mitigating pop music by  giving themselves permissions to diverge sonically.  There are bands  that we love, and I could tell you what they are, but I don’t really  think of them as influences per ce.  I’m kind of most influenced by what  I ate for breakfast and whether or not I got enough  sleep/exercise/love/adventure.  Within the Luyas each Luya is influenced by all the other Luyas and that’s what makes us The Luyas.   I imagine that our favourite groups  probably operate kind of  similarly, by working off of each others’ impulses as opposed to  anything else.  I’m a fan of lots of music but fandom hasn’t really  written me any songs I’m afraid.  I’ve tried a few odes to this band and  odes to that singer, but nothing’s going to make me Bob Dylan, so I’d  better be Jessie Stein.</strong></p>\n<p><em>CitR: You recently worked with Owen Pallet, how did that come about, and can you give us any insight into the tracks he helped on?</em></p>\n<p><strong>Owen is an old dear friend.  We lived together when he was starting  Final Fantasy and I was starting a much less notable project that was my  rock and roll education back in the early 2000s.  He helped us with string and woodwind arrangements.  There are little splashes of Owen  all over the  record.  I’m sure you’ll be able to pick them out.  We took what he did  with all these incredible classical players and kind of put it through  all these old effects, but you can still hear him in all his Owen-y  glory. It’s wonderful to have such talented and kind and hilarious  friends.  He’s got a mind like a trap, and is generally just a force.   I’ve learned tons from him about all kinds of things. </strong></p>\n<p><em>CitR: What has been your most memorable gigging experience to date?</em></p>\n<p><strong>Oh I don’t know, playing in Boston and Philly with the Antlers a few weeks ago was pretty amazing.  They have the best fans.</strong></p>\n<p><em>CitR: And your most embarrassing?</em></p>\n<p><strong>Nothing particularly embarrassing has happened on stage besides  sometimes not playing as well as we could have on a bad day.  Yet.</strong></p>\n<p>CitR: <em>Your next album, Too Beautiful to Work comes out in February, how was the recording process of this record?</em></p>\n<p><strong>Recording this record  was great but it took a long time and we’re so happy it’s finally going  to be coming out.  We recorded it at this great studio in Toronto called  6 Nassau with Jeff McMurrich, who is a friend and probably the best record maker in Canada.  To me anyways.  We wrote a lot of the record in the studio and got really broke and drank lots of coffee and played lots of wall ball.  We were the first session in this awesome new space so we got all the ghosts out on our record.  The room is so big and live and we got to do lots of parts of the recording live off the  floor.  Jeff loves to make things sound trippy and so do we.  It was  really fun.  I can’t wait to do it again only I really want to go on  tour so I’ll probably have to wait a while, huh.</strong></p>\n<p><em>CitR: Have you got any New Years Resolutions?</em></p>\n<p><strong>Yes – to swear less – I have a sailor’s mouth that I got hanging around  at a barn a lot as a kid.  I don’t want to stop, but I could use a  little intensifier diversity.  It’s so fucking important to respect your  words.  Otherwise you end up looking like a fucking douche and wishing  you were dead.  Also, I hope to learn how to do a hand stand this year.   I like up-side-down-ness.</strong></p>\n<p><em>CitR: If you could be any animal, what would you be?</em></p>\n<p><strong>A horse.  I’ve always been a horse.  I have a dream where I die and am  cremated and fed to a horse to insure that I become horse via digestion,  as I am an atheist and I do not believe in reincarnation (sorry Nina  Simone). </strong></p>\n<p>Thanks very much guys! Watch out for Too Beautiful To Work, coming out 22 February 2011, and keep checking back over the next few days for our review!</p>\n<p><a rel=\"attachment wp-att-4201\" href=\"https://api.crackintheroad.com/music/4069-interview-the-luyas/attachment/the-luyas-too-beautiful-to-work\">The Luyas – Too Beautiful to Work</a></p>\n","slug":"4069-interview-the-luyas","category":"interviews","date":1296321814000,"wpid":4069,"isSticky":false,"featured_image":{"width":900,"height":506,"src":"2011/06/21.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAGAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAYH/8QAHxAAAgEEAwEBAAAAAAAAAAAAAQIDAAQFEQYhURIx/8QAFAEBAAAAAAAAAAAAAAAAAAAAAP/EABQRAQAAAAAAAAAAAAAAAAAAAAD/2gAMAwEAAhEDEQA/AMOxXJcJi8ZNYXvGbW/uJAQ1zM+2X6TTEEAHe9Eed+1OyZWNpGKJKqEkhdr0PPylKD//2Q=="},"createdAt":1587294795199,"updatedAt":1588403561235,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/06/21.jpg","categories":["interviews","music"]}