{"id":"5e9c32569b6559241525deac","title":"Interview & Review: Delta Maid (Manchester)","content":"<p>Accompanied again by the wonderful company of <strong>Simon Doyle</strong>, we perched against a ledge to watch the Liverpudlian country/blues artist, <strong>Delta Maid</strong>.</p><p> Having recently supported <strong>Seth Lakeman</strong> on his nationwide tour, <strong>Delta Maid </strong>has already been gaining a significant amount of positive attention from fans and critics alike.  On the 16<sup>th</sup> January, and the night prior, she had the somewhat daunting task of supporting <strong>The Coral </strong>in their highly anticipated acoustic shows.  With only herself and her guitar on stage, <strong>Delta Maid </strong>played a thoroughly enjoyable set of country and blues inspired tracks. Of late there have been several female artists, such as Lissie and Caitlin Rose, who have brought country inspired music to the forefront of many people’s musical attention, and <strong>Delta Maid </strong>looks set to carry that trend on. <strong>Delta Maid </strong>managed to capture the soulful nature that the blues demands so well that you would have been forgiven for thinking she was from the Deep South of America rather than the city of Liverpool. Between tracks <strong>Delta </strong>would introduce each track and what inspired it’s creation, and while no one else in the venue was involved in the stories behind the tracks, <strong>Delta </strong>managed to create an intimate window that allowed the audience to see in to the emotions being portrayed.  Charming as a solo performer, I think that <strong>Delta Maid </strong>will only go from strength to strength with the release of her debut album ‘<strong>Outside Looking In</strong>’ and the accompaniment of a full band.</p>\n<p>8/10</p>\n<p><strong>CITR: </strong>How did you find last night playing with <strong>The Coral</strong>?:</p>\n<p><strong>Delta Maid: </strong>It was really good! I’ve just come off the back of the <strong>Seth Lakeman</strong> tour and that was a very folky audience, so the crowd felt a bit different, but different in a good way. It’s a learning curve and I think you’ve got to penetrate harder with the likes of an indie crowd, especially when it’s just me with my guitar.</p>\n<p><strong>CITR: </strong>Do you think you won over any <strong>Coral</strong> fans?</p>\n<p><strong>DM: </strong>I’d like to think so! I mean, they’re of course expecting<strong> The Coral</strong> and I’m just the support, but if you can win over any fans then that’s fantastic.</p>\n<p><strong>CITR: </strong>Which artist has influenced you the most and why?</p>\n<p><strong>DM: </strong>It was probably an artist called <strong>Rory Block</strong>. She was the first person who introduced me, not personally, but through her music to <strong>Delta Blues</strong>, which has been a massive part of why I’m doing music now. She’s a phenomenal guitarist and it was very inspiring to see a female musician play the blues unbelievably well.</p>\n<p><strong>CITR: </strong>Which of your gigs has been your favourite and why?</p>\n<p><strong>DM:</strong> That’s a hard one actually! It was probably supporting <strong>Martha Wainwright</strong>. I’ve always listened to her music and got a lot of respect for her, and just being in her company and presence was good enough for me! You learn a lot from artists like that.  She was so friendly and had a lot of time for you, so in that respect it was good too.</p>\n<p><strong>CITR: </strong>Of late we’ve had female artists such as <strong>Lissie</strong> and <strong>Caitlin Rose</strong> bring country inspired music to the mainstream. Do you think people are ready for a country revolution?</p>\n<p><strong>DM:</strong> I don’t know, but I hope so! Like you say, the likes of <strong>Lissie</strong> and <strong>Caitlin Rose</strong> have done so well and people have been generally receptive to them, but I keep seeing stuff about me saying that I’m ‘unfashionable’! Not in a derogatory way, but what I’m doing is a little ‘unfashionable’ really. I always thought that when I was growing up listening to country music that it was unfashionable anyway, as when I was in school none of my friends ever listened to it, so I never really told anyone I was in to it. My mum and dad knew, but I was aware that it definitely wasn’t mainstream from a young age.</p>\n<p>Sometimes I think people consider ‘country’ a dirty word. But I like to stress that my music isn’t strictly country and blues, even thought they might be structured and influenced by those genres. A lot of the songs on the album crossover, and I’m trying to be a bit more modern. Well, I’d like to say I’m being ‘old fashioned’ but in a good way.</p>\n<p><strong>CITR: </strong>How was the process in recording your EP? Was it a relatively down to earth affair?</p>\n<p><strong>DM:</strong> It was. I think the EP served as a stepping stone to the album which was good because the whole thing behind the EP was to show my roots and to show where I’ve come from. So we recorded it in <strong>Toe Rag</strong>, and it was great as it was so organic, insofar as you’d just go in and you’d just sit there with your musicians and play yours songs without any over dubs. It was great as you’d be going back to the roots of what you do</p>\n<p><strong>CITR: </strong>Had you had those songs for a quite a while, just waiting to be released?</p>\n<p><strong>DM:</strong> There were three of my own songs on there that I’d had for ages and there were two blues covers. The covers were there to serve the purpose of just emphasizing where I’ve come from and what I’m about!</p>\n<p><strong>CITR: </strong>How do you write songs?</p>\n<p><strong>DM: </strong>I write purely through my own experiences. I tend to write on emotions, but sometimes I write about the things I’ve seen around me, so not just necessarily me crying in my bed! It’s all from me, and the music itself is inspired by the country and blues greats that I admire.</p>\n<p><strong>CITR: </strong>Will the album follow down the same vein of the EP?</p>\n<p><strong>DM: </strong>Well we tried to keep the process similar, even though it wasn’t done in the same studio. Even though it’s more embellished in terms of musicianship, and a lot more going on in general, we still tried to go about it in an organic way. A lot of it was done live, but the sound is a bit more developed.</p>\n<p><strong>CITR: </strong>How was it moving from it being just you and your guitar to a full band?</p>\n<p><strong>DM:</strong> It was a bit odd at first, but I really enjoy it. Most of the album songs I think would work with just me and a guitar, but there are some of them which I think would only work with a full band as you need that drum beat for the up tempo tracks. I’ve been playing with a bit of a band now and again, so hopefully once we’re promoting the album  it’ll be a bit of both as I wouldn’t like to neglect the roots of me and I’d still like to keep up the solo thing.</p>\n<p><strong>CITR: </strong>From my in depth research (last.fm bio), it says your first gig was at a charity event your mum organized .. ?</p>\n<p><strong>DM: </strong>That’s right! I was working at the time, and even thought I’ve always played music at that time I wasn’t pursuing it professionally at all. My mum was in a bit of a pickle as she needed someone to start off this charity night so she asked me, so I nervously said yeah so she’d get the ball rolling for it. But I didn’t really play as it wasn’t really performance standard, I just messed about on the guitar a little bit playing a couple of blues covers really! I asked my brother to play with me  but he got RSI (Repetitive Strain Injury) as he plays guitar a lot, though he’s alright now! But yeah, from that first gig I got the bug for it that much that I knew I had to keep it up, but if I was going to do that I knew I’d have to learn how to play the guitar properly.</p>\n<p>I’ve always kept my singing up from a young age, so when my mum and dad went out I’d always sing! The last time I probably performed before the charity gig was in a school performance to be honest. Though I always kept listening to the country records, so my love of the music didn’t stop. I think I did try writing my own stuff when I was 17, but nothing ever came until I turned 19/20 then it all started to come flooding and I thought I could actually give this a go.</p>\n<p><strong>CITR: </strong>You’re playing at <strong>Gary Barlow’</strong>s birthday gig next week, are you excited?</p>\n<p><strong>DM: </strong>Yeah, very excited!</p>\n<p><strong>CITR: </strong>A bit nervous?</p>\n<p><strong>DM: </strong>Yes, very much so! Especially since it’s for his birthday! I’m looking forward to it as it’s with a band, so I’m going to do a very up tempo set to try to create a party atmosphere really.</p>\n<p><strong>CITR: </strong>Your debut album was originally due out in Febuary, but now it’s an April release. Was that a label choice or did you want to work on the material a bit more?</p>\n<p><strong>DM: </strong>No, I think it was more a label choice as the video got pushed back, so the logistics were altered. However I’ve been dying to get the album out there, so it’s a bit frustrating that it’s not coming out earlier!</p>\n<p><strong>CITR: </strong>How have you found working with your first major label?</p>\n<p><strong>DM: </strong>I think I’ve been very fortunate to have a label at all! I always used to think, please God, if I ever get signed it’ll be on an independent label, because I never thought I’d get a major label interested! However they’ve been really flexible, though they do direct you to some degree, as that’s their business. They’re always listening to my ideas and I never feel pressured; my image is my own. I mean if they told me to wear a mini skirt .. well, you must know what I’m like by now!</p>\n<p><strong>CITR: </strong>So where were you discovered to lead on to all of this?</p>\n<p><strong>DM: </strong>I was discovered by my fantastic A&R lady in Manchester through MySpace! She came to one of my first early gigs, probably about 6 months after that first charity gig. Initially she signed me to the publishing company, so that meant they gave me time to develop the tracks, so it didn’t feel pressurized when it came to signing to the label as I already had the songs ready to record.</p>\n<p><strong>CITR: </strong>How receptive was the audience to your sound in Liverpool?</p>\n<p><strong>DM: </strong>Well I haven’t gigged loads in Liverpool, but I think there are a lot of people in Liverpool who are very receptive to country blues; there’s quite a big underground folky scene. I was never really a part of it until recently, because they asked me to be part of certain gigs. I think a lot of this scene comes from the Celtic connection Liverpool has, so it’s not an entirely alien sound. Liverpool is a hard crowd to please, but I still love playing there.</p>\n<p><strong>CITR: </strong>How did you initially deal with the levels of expectancy? Especially as it would have just been you and your guitar on stage.</p>\n<p><strong>DM: </strong>It took a bit of time  because you  are completely exposed, but that’s all I’ve ever known! I’ve heard people say that once you start playing with a band that you’ll be terrified to go back to playing solo, but I’d like to think I’d never ever be like that. Obviously at first I was terrified, and I still get a bit nervous as everyone’s looking at you and you’ve got to deal with it.</p>\n<p><strong>CITR: </strong>Has anything embarrassed ever happened on stage?</p>\n<p><strong>DM: </strong>I think I’ve snapped a string, but it didn’t come off completely, however I’m just waiting for that to happen!  You’ve got to have your spare guitar ready and that, and you’ll be thinking of a million and one things at the same time.</p>\n<p><strong>CITR: </strong>What plans are in store for <strong>Delta Maid</strong> over the summer?</p>\n<p><strong>DM:</strong> Hopefully a shed load of festivals!</p>\n<p><strong>CITR: </strong>Do you have a favourite festival?</p>\n<p><strong>DM: </strong>I really love<strong> Latitude</strong>. But I feel terrible, as I’ve not been to <strong>Glastonbury</strong> yet!  So I’m still holding my breath on that one.</p>\n<p><strong>CITR: </strong>If you had to sum up <strong>Delta Maid </strong>in three words, what would they be?</p>\n<p><strong>DM: </strong>It’s kind of hard doing that as you don’t want to come across big headed! I’d like to say raw, honest, and acoustic. I think acoustic encompasses me a lot because of the <strong>Rory Block</strong> connection, and I look at all the similar great artists and just look at their Martin guitars and think, that’s acoustic!</p>\n<p>Thank you Delta Maid!</p>\n<p><strong><a href=\"https://www.myspace.com/deltamaid\" target=\"_blank\">Delta Maid Myspace</a></strong></p>\n","slug":"4114-interview-review-delta-maid-manchester","category":"interviews","date":1295372279000,"wpid":4114,"isSticky":false,"featured_image":{"width":1024,"height":683,"src":"2011/01/delta-maid.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAYH/8QAHxAAAgEEAgMAAAAAAAAAAAAAAQIAAwQFEhETUmGh/8QAFAEBAAAAAAAAAAAAAAAAAAAAA//EABoRAAICAwAAAAAAAAAAAAAAAAABAhIhIjH/2gAMAwEAAhEDEQA/AMGxeYDY+4s0BSqoFU1dQzOoUDT0CTzJLpfx+xEFavA8lbp//9k="},"createdAt":1587294806641,"updatedAt":1588403561388,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2011/01/delta-maid.jpg","categories":["interviews","music","reviews"]}