{"id":"5e9c32559b6559241525dea9","artists":["5e9b68f87a1236eccfeb20cb"],"title":"Live Review: Glasvegas","content":"<p><a rel=\"attachment wp-att-4124\" href=\"https://admin.</p><p>crackintheroad.com/music/4123-live-review-glasvegas/attachment/alba_gv_dec2010\"><img class=\"alignnone size-900wide wp-image-4124\" title=\"Alba_gv_dec2010\" src=\"https://api.crackintheroad.com/uploads/2011/01/Alba_gv_dec2010-900x304.jpg\" alt=\"\" width=\"900\" height=\"304\" /></a></p>\n<p> For the first time in what felt like an eternity, Glasvegas are back. New songs, new drummer and what appears to be a new start. I stood in the typically quiet and somewhat distracted Orkney crowd and questioned to myself why they chose this place to start their tour. My initial thought was maybe to get ‘match fit’ again, until they appeared on stage and blew the real Glasvegas fans away; about a third of the crowd. Undeterred by the lack of crowd response they took the risky approach of playing new songs for the lions share of the set, and on the whole the songs were delivered exceptionally well. However, the most recognisable songs from their debut album, most notably <em>Flowers and Football Tops</em> and <em>Daddy’s Gone, </em>were delivered with the passion that only a band glad to be back in front of audiences could achieve. It was also the first gig with their new drummer, Jonna Löfgren, who impressed from the very beginning; not necessarily hard considering her predecessor. Standing throughout the set, she certainly added a new element to the band; both in her youthful, stylish looks and the obvious rapport she has built up with the rest of the band in such a short period of time.</p>\n<p>Although there was no encore, which perhaps is to be expected after such a long time away from live performances as well as the somewhat lacklustre crowd, but what I saw was enough to move me more than I have done at any previous gig. Stories were told through the lyrics and clear emotion was seen beyond the now infamous sunglasses worn by frontman James Allan, who took every opportunity to chat to the audience, thanking them for their support. This was no typical thanks however, it was clear that he was being genuine; a complete contrast to nearly all gigs I have been to in the past. It was as if he knew that they had something to prove again after a comparatively long time away from the public eye.</p>\n<p>Overall, an exceptional performance from a band who intend to recapture their former, albeit previously short-lived, glory and to make a real mark on the music scene of 2011 in much the same way as they had done in 2008-9.</p>\n","slug":"4123-live-review-glasvegas","category":"music","date":1295392435000,"wpid":4123,"isSticky":false,"featured_image":{"width":2782,"height":941,"src":"2011/01/alba_gv_dec2010.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAADAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAAAAb/xAAkEAABAgUCBwAAAAAAAAAAAAABAgMABAUGBxEhEhMlMUFRwf/EABQBAQAAAAAAAAAAAAAAAAAAAAD/xAAUEQEAAAAAAAAAAAAAAAAAAAAA/9oADAMBAAIRAxEAPwCVxndldn7tqLc7U330MU9bzaXCCELHCoEbeCoketYjW8jXdy09emzsO5B+QhAf/9k="},"createdAt":1587294805088,"updatedAt":1588403561363,"author":"5e9b68b27a1236eccfeb1d07","old_image":"2011/01/alba_gv_dec2010.jpg","categories":["music","reviews"]}