{"id":"5e9c32529b6559241525dea3","artists":["5e9b68e07a1236eccfeb1f08"],"title":"Interview: Cloud Nothings","content":"<p><img class=\"alignnone\" title=\"Cloud Nothings\" src=\"https://www.</p><p>nyctaper.com/uploads/2010/07/cloudnothings.jpg\" alt=\"\" width=\"620\" height=\"465\" />Sure to be one to watch in 2011, Dylan Baldi, or Cloud Nothings as he is better known is making a raucous start to the year. Despite the group technically being a four piece when they perform live, all the instruments on record are performed by Dylan himself, showcasing his immense talent and preference to do everything his own way. With his debut “proper” out earlier this month on Carpark Records, Crack in the Road caught up with Dylan to find out more about the record, his aspirations and plans for the rest of the year.</p>\n<p><em>How did Cloud Nothings come about?</em></p>\n<p><strong>Cloud Nothings started when I was in my  first year of college. On breaks from school I would go home and record  music, and one day I decided to make a Myspace page and make up a “fake”  band (since it was just me). I chose the name Cloud Nothings, added a couple of blogs as friends on Myspace, and everything took off from there.</strong></p>\n<p><em>What would you cite as your main influences, both musically and otherwise?</em></p>\n<p><strong>My main musical influences are definitely bands like Husker Du, The  Replacements, and Archers Of Loaf. Otherwise, the city of Cleveland is  definitely an influence on my music…there isn’t too much else to do  other than play music, so it’s kind of why I started playing in the  first place.</strong></p>\n<p><em>How would you describe your sound in your own words?</em></p>\n<p><strong>Punk-pop.</strong></p>\n<p><em>What plans do you have for releases and tours in 2011?</em></p>\n<p><strong>There’s a new Cloud Nothings album coming out on  January 25th on Carpark Records, and we’ll be touring with Toro Y Moi  in March and playing some festivals more towards the summer.</strong></p>\n<p><em>Other sites have described your music as “having a snarl” and “being  vicious”, would you agree with this, and where does this anger come  from?</em></p>\n<p><strong>I don’t really think there’s too much anger in my music, no. To me it  sounds upbeat and fun rather than angry. I make music because it’s fun  for me, not because I have anger issues I can’t get out any other way.</strong></p>\n<p><em>What was the first album you can remember falling in love with?</em></p>\n<p><strong>They Might Be Giants’ first record.</strong></p>\n<p><a href=\"https://www.myspace.com/cloudnothings\">Cloud Nothings on Myspace!</a></p>\n","slug":"4170-interview-cloud-nothings","category":"interviews","date":1296063690000,"wpid":4170,"isSticky":false,"featured_image":{"width":620,"height":465,"src":"2011/06/cloudnothings.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAIAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAYH/8QAIhAAAQMDBAMBAAAAAAAAAAAAAQIDBAAREgUGITETFEEi/8QAFQEBAQAAAAAAAAAAAAAAAAAABAX/xAAbEQABBAMAAAAAAAAAAAAAAAACAAEDEgQhMf/aAAwDAQACEQMRAD8AxnRtuRHtotrlyGi4H1OqTYJ8dkXCcucgofo26CTUVI1GZ7DtpKyMjyg4p7+D4KUoUD3MrKnli0cYU11f/9k="},"createdAt":1587294802012,"updatedAt":1588403561311,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/06/cloudnothings.jpg","categories":["interviews","music"]}