{"id":"5e9c32509b6559241525dea0","title":"Review: Twin Shadow (Manchester)","content":"<p>Accompanied by <strong>Ben</strong> (of Crack in the Road fame) we positioned ourselves in the lofty heights of the seating area of Mancester’s ‘<strong>Deaf Institute</strong>’ ready for the night’s entertainment.</p><p> Our first good sign followed shortly; the projector, which I have never seen used before, was on.</p>\n<p><strong>Weird Era</strong>:</p>\n<p>First thing’s first, if you recognise this name, it’s probably because of <strong>Deerhunter</strong>’s album ‘Weird Era Cont.’, a seemingly positive omen. Although there were some interesting guitar riffs and drumbeats seeping through to our seats, the vocals didn’t quite make it to us, and it became increasingly difficult to hear anything other than noise. This was the first ‘wall of sound’ gig I have been to in a long while, and not in the <strong>Phil Spektor</strong> sense, more in the ‘brick wall of sound’ sense. It was hard to really focus on any of the intricacies amidst the frantic strumming. Accompanying this was a projection of what I think was an episode of ‘The Two Coreys’, perhaps an homage to times past, which kind of fitted the scene, and managed to highlight the drummer and lead guitarist nicely, but left the lead singer completely in the dark. Literally, I could hardly see him. All was not lost; the band did manage to keep their energy levels up to an impressive degree even with the rather lacklustre crowd (myself included).</p>\n<p>5/10</p>\n<p><strong>Chad Valley</strong>:</p>\n<p>A short while later, the solitary <strong>Hugo Manuel</strong> (one sixth of the band <strong>Jonquil</strong>) took to the stage and began to crowd please with his 80s beats and vocals, persuading the audience that they should in fact, pay attention. <strong>Manuel</strong> himself was more than willing to chat with the audience, being at once charming, modest and funny, a feat undeniably more difficult without the support of a band behind you. Certain movements within songs were not entirely convincing and came across as a little abrupt, but there were moments of great sampling and interesting falsetto vocals; in short <strong>Manuel</strong> managed to create a good, upbeat atmosphere. Unfortunately, there wasn’t quite enough variation from song to song to entirely maintain the crowd’s attention, and by the end of the set there was a little chattering going on below. In a nutshell, these songs are great as separate entities, but all together they seem just that little bit too similar to hear in quick succession.</p>\n<p>7/10</p>\n<p><strong>Twin Shadow</strong>:</p>\n<p><strong>Twin Shadow</strong> were rather late starters, arriving on stage at 9.45, and before they had even started playing, I was impressed. Although I am biased, (I love the album dearly) they each had such exceptional hair; facial and otherwise, that one couldn’t help but adore them. It was, therefore, no surprise when I read that front man <strong>George Lewis Jr.</strong> is the son of a hairdresser.</p>\n<p>Opening the set with the words “We’ve been waiting 11 years to play here” put a lot of gravitas on the performance to come, but endeared them to us, so much so that from this moment I was enchanted (perhaps a little prematurely). Luckily the opener, a rather quick and energetic rendition of <strong>‘Shooting Holes’</strong> convinced me that I wasn’t wrong. The request to ‘please leave us alone when we’re dancing’ (from the song <strong>‘When We’re Dancing’</strong>, surprisingly) was sung with such force and sincerity, and was accompanied by such bone-movingly funky bass lines and synths that one lady who had previously been sitting in front of us felt compelled to get up into the aisle and dance, that’s right, completely on her own. It was after this point that I heard someone murmur that it was amazing how sometimes a headline act could make their support seem so amateur, a more than justified comment in this case. Not only were <strong>Twin Shadow </strong>musically focussed and precise, but the enjoyment they garnered from their own music was beautifully obvious. Perhaps this is a testament to their dedication, the years they’ve been waiting for this, or maybe it is just because this was the second stop on their tour. Whatever it was, it created a fantastic tone for the entirety of their set. They even managed to pull of a risky move, stopping halfway through their set with <strong>Lewis</strong> asking if he could have two minutes to fix his guitar and “make the sound just right”. Even this was met with adored expletives (“of course you can, we f—ing love you”). The pockets of jubilation from the crowd were evident from our vantage point too, with fans screaming the lyrics into each other’s faces in favourites such as <strong>‘At My Heels’</strong> and <strong>‘Castles in the Snow’</strong>. <strong>Twin Shadow’s</strong> music may not convince everyone on CD (even though it is produced by Grizzly Bear’s Chris Taylor… just saying), but live, their dedication and enjoyment really leaks into their music, which is infectious and entirely convincing.</p>\n<p>9/10</p>\n<p>Thanks to Anna ‘Blacky’ Savage for this wonderful review!</p>\n","slug":"4176-review-twin-shadow","category":"music","date":1296152669000,"wpid":4176,"isSticky":false,"featured_image":{"width":608,"height":471,"src":"2011/01/twin-shadow.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAIAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAAAAb/xAAgEAABAwQDAQEAAAAAAAAAAAABAgMRAAQFEgYHIRMx/8QAFAEBAAAAAAAAAAAAAAAAAAAAAP/EABQRAQAAAAAAAAAAAAAAAAAAAAD/2gAMAwEAAhEDEQA/AKZ7lSLPsDH8px9m4xjLi3eRknnE6rvEbJ+ahqSFFsAxIHkiTPl7b9nYF9ht2LxO6QrUtgxImP2lKD//2Q=="},"createdAt":1587294800064,"updatedAt":1588403561285,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2011/01/twin-shadow.jpg","categories":["music","reviews"]}