{"id":"5e9c324d9b6559241525de9c","artists":["5e9b69517a1236eccfeb25ee"],"title":"Live Review: The Bang","content":"<p><a rel=\"attachment wp-att-4214\" href=\"https://admin.</p><p>crackintheroad.com/music/4192-live-review-the-bang/attachment/thebang\"><img class=\"alignnone size-650home wp-image-4214\" title=\"thebang\" src=\"https://api.crackintheroad.com/uploads/2011/01/thebang-650x433.jpg\" alt=\"\" width=\"650\" height=\"433\" /></a></p>\n<p>After winning Dundee’s Battle of the Band competition in late 2010, The Bang are poised to attempt to replicate the success of past winners Make Sparks and are going the right way to achieve this; by willing to both support any touring band that become available and also begin to headline shows across Tayside with support from other local bands. After seeing them perform only a handful of times I found it intriguing that I managed to sing along to the lyrics of their older songs, with their song Qwerty standing out above the rest. Their set as a whole justified mine and the other judges decision when they were named winners several months ago, and now with an ever increasing fan base, they are hopefully set to record and release a debut sometime in the near future as well as go on to impress more people as they carry on playing in gigs throughout Scotland.</p>\n<p>I generally see new bands performing covers as a weakness, primarily because it is nearly impossible to replicate the song to the standard of the original artist however half way through the set Dexter’s music venue erupted with the shouts of “I’m on Fireee……”. Now I am not the biggest Kasabian fan, on the contrary perhaps, but the overall experience of the song would make even Tom Meighan’s mother double check. It was played effortlessly and with confidence from all members of the group and made the night truly memorable for the people that may have see this band for the first time. Overall, a great gig and a band well worth listening to so please find below their myspace.</p>\n<p><a href=\"https://www.myspace.com/thebanguk\">The Bang’s Myspace is available here</a></p>\n","slug":"4192-live-review-the-bang","category":"music","date":1296318093000,"wpid":4192,"isSticky":false,"featured_image":null,"createdAt":1587294797048,"updatedAt":1587825930917,"author":"5e9b68b27a1236eccfeb1d07","categories":["music","reviews"]}