{"id":"5e9c34969b6559241525e25a","title":"Introducing: Anais Mitchell","content":"<p>A folk opera: sounds like as bad an idea as starting Silvestre up against Messi does it not? Well not in this case; Hadestown is the epic self proclaimed “folk opera” from Vermont based singer songwriter <strong>Anais Mitchell</strong>.</p><p> Telling the Greek myth of Orpheus, the album features some fantastic singers, <strong>Justin Vernon (Bon Iver), Ani Difranco, Ben Knox Miller (The Low Anthem), Greg Brown</strong> and <strong>The Haden Triplets,</strong> as well as <strong>Mitchell</strong> herself, it is clear there is no shortage of talent. With each singer assigned a role in the story, the listener really becomes involved in the tale of Orpheus’s and I would love to experience the record performed live. <strong>Vernon’s</strong> voice is undoubtedly a highlight of the album, however the contrast in voices works brilliantly, with <strong>Brown</strong> being the perfect choice for the part of Hades. I would find it almost impossible to choose a song to upload from this album as it works so well as a whole piece, so instead I will just recommend that you go out and buy it (or download it if you are that way inclined). If you are not familiar with the myth of Orpheus, then that is even more reason to give this album a spin, as it will certainly appear in my albums of the year list.</p>\n<div style=\"text-align: center;\"><a href=\"https://www.anaismitchell.com/\">https://www.anaismitchell.com/</a></div>\n","slug":"42-anais-mitchell","category":"music","date":1270651800000,"wpid":42,"isSticky":false,"featured_image":{"width":165,"height":92,"src":"2010/04/anais_mitchell-165x92.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAGAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAYH/8QAHxAAAQMEAwEAAAAAAAAAAAAAAQACAwUGESESMWFx/8QAFQEBAQAAAAAAAAAAAAAAAAAAAwT/xAAXEQEBAQEAAAAAAAAAAAAAAAABAAIx/9oADAMBAAIRAxEAPwDMrQs+GsWtVKjLMGyxhjYhxzxzIG57G8/deqEOiQe0RT57NsAL/9k="},"createdAt":1587295382583,"updatedAt":1588403569379,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2010/04/anais_mitchell-165x92.jpg","categories":["music"]}