{"id":"5e9c31ff9b6559241525de13","artists":["5e9b69317a1236eccfeb2406"],"title":"Review: Pandit – Eternity Spin","content":"<p><img class=\"alignnone\" title=\"Pandit\" src=\"https://userserve-ak.</p><p>last.fm/serve/500/54057655/Pandit+albumcovercopyweb1.jpg\" alt=\"\" width=\"500\" height=\"505\" />Nowadays it’s increasingly common for artists to record and produce entire records in the confines of their bedrooms, basements or out-houses. With the declining cost of equipment, accessibility of production programs and general growth of knowledge allowing for easier and more personal methods of creating music. In Lance Smith’s case, he chose to take his alter-ego Pandit into a studio to record and lay down tracks for his debut album, however many of his primary efforts as a musician, were originally spawned in the bedroom.</p>\n<p>Whilst last year saw lo-fi inspired pop music taking over the blogosphere, 2011 is set to see many of last years hyped acts drop their debut full length records. Pandit will release Eternity Spin towards the end of February via Lefse Records, and after hearing numerous demo’s, I was more than excited to give a listen to his upcoming release.</p>\n<p>Album opener Pack Your Bags was a bloggers favourite towards the later stages of last year, and it’s plainly obvious to see why. It’s unflinchingly honest lyricism, combined with it’s heartfelt, touching video, brilliantly set the tone for the rest of Eternity Spin. Delicate yet versatile rays emanate as Lance almost weeps “I’m not the kind that you want to bet on, but I’ll love you always it’s true”. Sitting here after experiencing comfortably the most demanding, emotionally turbulent period of my life, it’s relatively reassuring to find solace in a track of such elegance and artistry.</p>\n<p>From the off it’s clear that these are a collection of tracks composed with delicate intricacy, truthful outwardly genuine. Skivvies is another fantastic example of this, a reverb laden song, based around the repeated vocal refrain “share with me your dreams, share with me your life”. Optimistic or depressing, you decide. At times the instrumental sections are sublimely orchestrated, seas of static completely immerse the listener in the world that Pandit creates.</p>\n<p>Elsewhere on the record, there’s a guest appearance from UK producer Star Slinger who laid down some of the percussion on We Reach Out. A static filled opening gives way to soft echoed vocals, there’s repeated melodies bubbling beautifully under the surface, yearning to be discovered. It’s impossible to listen to Eternity Spin and come away with one set opinion, there’s a treasure trove of sounds to be explored, whether you enjoy it or not.</p>\n<p>Perfectly summarised by the majestic Kodiak, the albums standout track, Smith’s moving vocals strike deep as he weeps “it’s hard to be, just another one of your men”. It’s love at it’s utmost reassuring but brutally destructive, and frankly, it’s never sounded so magnificent.</p>\n<p><iframe title=\"YouTube video player\" width=\"640\" height=\"390\" src=\"https://www.youtube.com/embed/7tLZ-XyE-Xc?rel=0\" frameborder=\"0\" allowfullscreen></iframe></p>\n<p><a href=\"https://lefserecords.bigcartel.com/product/pandit-eternity-spin-cd\">Buy Eternity Spin</a></p>\n","slug":"4213-review-pandit-eternity-spin","category":"music","date":1298304203000,"wpid":4213,"isSticky":false,"featured_image":{"width":500,"height":505,"src":"2011/06/pandit+albumcovercopyweb1.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAABgQH/8QAJBAAAgEDAwMFAAAAAAAAAAAAAQIEAwURAAYhEiJBExQWMXH/xAAVAQEBAAAAAAAAAAAAAAAAAAABAv/EABgRAAMBAQAAAAAAAAAAAAAAAAABAhEh/9oADAMBAAIRAxEAPwDO7Dsu1XbZF3lCuq3q3MWB9QkuDjCFSOT2np6c569GPhu5Bw0cqR9hqgBH6PGqrJMkx95yhHkVqQ94X7HK9yrkHjyCODo/WmSnrVGeTWZmYkk1CSTnU1T3EK4f/9k="},"createdAt":1587294719867,"updatedAt":1588403560099,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/06/pandit+albumcovercopyweb1.jpg","categories":["music","reviews"]}