{"id":"5e9c32479b6559241525de93","title":"Review: Friends of Manchester Festival","content":"<p>Walking slightly ahead of the scheduled student and union protest march,  Oxford Road felt like a ghost town as police diverted traffic and pedestrians watched on from the windows of McDonalds and Costa.</p><p> Approaching the venues of <strong>Kro Bar </strong>and <strong>Jabez Clegg </strong>for the beginning of the festival, everything still felt far too quiet for this to be a festival. Perhaps being fashionably late was actually a social decorum, and not just something hipsters followed as gospel, so I began my very punctual yet quiet start suitably in the room housing the <strong>For Folk’s Sake </strong>Stage. As the venues began to fill, the strengths of this festival become very obvious. The two venues are situated within 10 seconds walk of one another, allowing easy transitions between stages without missing out on any particular band’s set. Moreover, the unsigned acts that play the festival are matched fantastically to intimate and authentic stages, which present their music in the raw entirety that it deserves.</p>\n<p>However while I viewed the festival in a positive light, indeed as I had a very enjoyable experience, I imagine some came away feeling otherwise. This is so as the sound of the stages was far from perfect, while stage times appeared to be abandoned on many occasions. What’s more, the lack of well known headline acts, normally the climax of any festival, meant that some may have felt the festival ended as unassumingly as it had began. However to view the <strong>Friends of Manchester Festival </strong>in such a way is to misunderstand it’s very essence. From my experience the charm of this festival lies in many of these perceived misgivings, as the raw sound and less than punctual set times created an atmosphere that was relaxed, entertaining, and engaging. Therefore, for it’s third year running, the <strong>Friends of Manchester Festival </strong>produced another fantastic day of Manchester born music, and the valuable friends from slightly further a field.</p>\n<p>Below are a few highlights that <strong>Crack In The Road </strong>enjoyed and may otherwise have been eclipsed by the more well known evening acts.</p>\n<p><strong>Songs For Walter:</strong></p>\n<p>The first act to grace the <strong>For Folk’s Sake </strong>Stage, <strong>Songs For Walter </strong>are a three piece lo-fi folk band from Manchester. Their set contained a quiet intensity reminiscent of <strong>The Microphones </strong>and the melancholic lyrics of <strong>Nick Drake</strong>, producing a sound that would, frankly, wash over many people without incident. However for those listeners willing to actively engage the music, <strong>Songs For Walter </strong>have crafted wonderfully subtle sounds that are absorbing and harrowing in equal measure. A particular highlight was ‘<strong>Purple Blue</strong>‘, a serenely beautiful track.</p>\n<p><a href=\"https://www.myspace.com/songsforwalter\" target=\"_blank\"><strong>Songs For Walter Myspace</strong></a></p>\n<p><strong>The Watchers </strong>(pictured)<strong>:</strong></p>\n<p>My favourite act of the day, and they were on at 2:30pm (the hipsters wouldn’t have liked them anyway). A four piece from Newcastle, <strong>The Watchers </strong>played with an awe inspiring intensity, while orchestrating their wild sounds to near perfection. The lead vocalist could mutate between falsetto solos to gravely screams, the lead guitarist superbly improvised a slide guitar, and a transcendental drummer surged each track vehemently along. Baring a similarity to the genius fluctuations of <strong>Modest Mouse</strong>, <strong>The Watchers</strong> were incredibly entertaining to watch and wholly committed to each track they blasted towards the awaiting audience. Their MySpace recordings are a good indication of their music, but do not do their live performances justice. Therefore, be wise and witness these lads live!</p>\n<p><strong><a href=\"https://www.myspace.com/thewatchersuk\" target=\"_blank\">The Watchers Myspace</a></strong></p>\n<p><strong><a href=\"https://www.myspace.com/thewatchersuk\" target=\"_blank\"></a></strong><strong>Weird Era:</strong></p>\n<p><strong>Crack In The Road </strong>recently reviewed this Mancunian three piece during their support slot for <strong>Twin Shadow </strong>in Manchester. Sadly, and predictably, very little has changed since the first review. For just over half an hour the audience was simply blasted with a wall of noise, in which every song sounded exactly the same. Worried I was missing out on some obvious subtlety, I went home and listened to the recorded versions of their tracks. I’m glad that I did as away from the limits of a PA and the acoustics of a room, <strong>Weird Era </strong>redeem themselves with the products of their studio work. The layers of their sound are much more identifiable, and become enjoyable to listen to when it’s not being blasted at like like air through a jet engine. Despite this, their live performance was still well below average.</p>\n<p><a href=\"https://www.myspace.com/wierdera\" target=\"_blank\"><strong>Weird Era Myspace </strong></a></p>\n<p><strong>Crooked Rooks:</strong></p>\n<p>Positioned on arguably the most atmospheric stage, which was unsurprisingly the <strong>Bar Stage</strong>, <strong>Crooked Rooks </strong>positioned a model Rook on the top of a speaker before breaking in to their set. Now I don’t tend to agree with the <strong>Guardian </strong>very often, especially when it comes to music, however they provided a fantastically succinct description of <strong>Crooked Rooks </strong>as ‘like a Weimar cabaret trapped in a freak circus’. How very cooky you must be thinking. Well it’s a pretty accurate description of the Germanic sound <strong>Crooked Rooks </strong>produce. How it is Germanic I’m not quite sure, but it is both entertaining to listen to and to watch as the band march through each track with intrepid vocals and upbeat guitars that grace the sound with an intriguing level of mystique.</p>\n<p><a href=\"https://www.myspace.com/crookedrooks\" target=\"_blank\"><strong>Crooked Rooks Myspace</strong></a></p>\n<p><strong>The Temps:</strong></p>\n<p>Despite a less than impressive turn out of 6, including one very enthusiastic female fan, <strong>The Temps </strong>still produced a raucous set that matched their post-punk/grunge tracks. Having already received praise from <strong>The Chapman Family </strong>and <strong>Mark E. Smith</strong>, this four piece from Liverpool presented a level of energy that even a group of ADHD sufferers on speed would struggle to match. Dark and roaring guitars were accompanied by raging vocals, which together screamed of an oppressed pain that only the influences of Punk could do justice. While I’m sure many will be perhaps intimidated by <strong>The Temps</strong> and choose to slowly retreat to the warm and safe surroundings of indie pop, for those willing to brave the darkness I can guarantee they’ll be suitably rewarded. Besides, with the tough economic and political times to come, maybe it’s time for a Punk revival?</p>\n<p><a href=\"https://www.myspace.com/thetempsliv\" target=\"_blank\">The Temps Myspace</a></p>\n<p>Make sure to check out our exclusive interview with <strong>Run Toto Run </strong>when we caught up with them during the festival!</p>\n","slug":"4218-review-friends-of-manchester-festival","category":"music","date":1296438452000,"wpid":4218,"isSticky":false,"featured_image":{"width":596,"height":538,"src":"2011/01/the-watchers.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAJAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAABAMG/8QAJhAAAQIDBgcAAAAAAAAAAAAAAgERAAQFAwYSE0FxISIjMTIzsf/EABUBAQEAAAAAAAAAAAAAAAAAAAUG/8QAGhEAAgIDAAAAAAAAAAAAAAAAAQIAERRRYf/aAAwDAQACEQMRAD8AhN3vplErQlKWA2UmvQnVQULEqihCo8HdD7vo8CC+NXwDlUuRy25XEUVtIzdR9Y7r8WGj4ptEhjooBqz2Iktuf//Z"},"createdAt":1587294791545,"updatedAt":1588403561182,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2011/01/the-watchers.jpg","categories":["music"]}