{"id":"5e9c32449b6559241525de8d","title":"New Artists: Tips For Getting Your Music Posted","content":"<p><img class=\"alignnone\" title=\"ipod\" src=\"https://scaryideas.</p><p>com/i/6899.jpg\" alt=\"\" width=\"890\" height=\"556\" />Since the immaculate conception of Crack in the Road way back in April 2010 our growth has undoubtedly been supported by the co-operation and eagerness of artists to feature on our site. So in light of this, and with the new year just under way, I thought I’d outline a few principles which may help budding artists to have their music posted on blogs, either this one itself, or sites likes ourselves. Obviously all sites will vary with their procedures as to posting music and featuring artists, but the principles are very much the same, and you’d be astounded at the number of artists who deviate unashamedly from the basic steps.</p>\n<p>1) Contact the site directly.</p>\n<p>In a day and age where publicity and the growth of trends happens in seconds, it’s crucial that you are available for direct communication. It’s understandable for world superstars to have PR companies managing their affairs, but for a group who have played a few pubs and had a couple of tracks played on the local radio, it’s not necessary. It’s also a monetary concept as well, there is little that a PR company can do for you, that you couldn’t do yourself with slightly more thought and concerted effort, save the money for equipment, traveling, recording.</p>\n<p>2) Be approachable and honest.</p>\n<p>Any communication should be formal to a certain extent, but don’t make any email sound contrived or self-important. Do your utmost to come across as friendly, and most of all, passionate. Always tell the truth, it only takes a quick internet search to discover whether or not said fact or quote is in fact legitimate. Communicate through all media, whether it be facebook, email, twitter or whatever else is in fashion at the time.</p>\n<p>3) Be positive.</p>\n<p>Have belief in the quality of the music you are creating; instead of saying “If you like the music, I can send you a CD”, say, “Can I have an address for which to send a copy of our CD to?”. If you don’t have belief in your own music, then there’s nothing to suggest that anyone else should. Instead of opening your email with a quote from a never that great, washed up musician, start with a quote from yourself, outlining your creative intent found in your music. You are the creator, you know far more about your music than anyone else in the entire world, thrive upon that.</p>\n<p>4) Do your research and have an opinion.</p>\n<p>Have a look around the site before contacting them, it’s probably no use contacting a blog that specializes in 1920’s underground Asian rap, if your music is 1970’s harmonica solo’s recorded in igloo’s. Read a few articles/interviews and form an opinion on it – “yes I agreed with… however my personal highlight was….”. We love the music, show your passion as well.</p>\n<p>5) Offer something in return and be pro-active.</p>\n<p>As well as telling us about your next gig, offer guestlist places or competition tickets. The same goes for CD’s and other promotional goods, none of us at this site are paid for what we do, so it’s nice to receive some form of admission for the effort we put in. Also think in terms of the broader site, post links to the site on your facebook/twitter/myspace, we’re far more likely to do the same. Offer exclusives, if you’ve just recorded a cover of Afroman’s “Because I Got High” then tell us, and offer it as a free download from the site.</p>\n<p>6) Follow up communication.</p>\n<p>We’re not perfect and neither are you, emails get over-looked, misplaced, even forgotten at times, so send another email a few days later, however don’t just copy and paste what you have already sent. Appreciate also that we don’t have time to reply to each and every email received, so maybe after the second follow up email, leave it there and pursue other routes of promotion. Don’t get your brother’s mate’s uncle (albeit a huge fan of your music) to bombard the site with emails, “U guyz shud chek owt dis music!” it gets annoying after a while.</p>\n<p>7) Keep it relevant and concise.</p>\n<p>Give a bit of background information, ie who you are, where you from, what instruments you play, but ask yourself whether it is relevant, or just taking up time that could be spent listening to your music? Do we really need to know that you once sat on your dog and it yelped the chorus to Life Styles of the Rich and Famous by Good Charlotte, and from thenceforth you’ve wanted to be a punk rocker? Probably not.</p>\n<p>8) Showcase exactly what you are selling/promoting.</p>\n<p>If you are promoting your debut CD, then send us a copy of it, don’t send three or four soundcloud links, where none of the tracks are available to download. We don’t sit at our laptops all day, plugged into firefox, churning out review after review, at least send downloadable versions of the tracks, so if we want to enjoy your music away from the confines of a laptop, then we can do so. Someone who buys your music isn’t going to be expected to sit at their PC screen to listen to it, so neither should we.</p>\n<p>9) Be reasonable.</p>\n<p>This website, like many other music blogs, is run entirely for our own enjoyment, not for profit, in fact all of us have reached into our pockets at some point to help fund the running of this site. We write as much as possible and as appropriate, please understand this. On the whole we will not write negative reviews of bands who are trying to “make it”, especially of tracks or CD’s. If we see a live performance that is under-par, then we may write a short, critical, but helpful review. Also try to be reasonable with sales, is it better to have 10 sales of your track on iTunes, or have 2,000 people download your single for free? We live in an age where people will quite happily download a track in seconds, legally or not, but will hesitate when it comes to spending 79p on the unknown.</p>\n<p>10) Enjoy.</p>\n<p>Most importantly, show the sites that you are contacting that you have a real passion and drive for what you do. At the heart of music is an enjoyable, creative process, let us in on it, and we are far more likely to understand where you are coming from.</p>\n","slug":"4245-new-artists-tips-for-getting-your-music-posted","category":"editorials","date":1296477503000,"wpid":4245,"isSticky":false,"featured_image":{"width":890,"height":556,"src":"2011/06/6899.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAGAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAUH/8QAHxAAAQQCAgMAAAAAAAAAAAAAAQACAwQFEgchIjFx/8QAFQEBAQAAAAAAAAAAAAAAAAAAAwf/xAAbEQACAQUAAAAAAAAAAAAAAAABAgAFERNBkf/aAAwDAQACEQMRAD8Al0MhaxfKGWZM6S3QdciqxNfOWmKWWNp211IcA3x9g/T2tURFK6soGJ9lFvwQjP/Z"},"createdAt":1587294788412,"updatedAt":1588403561130,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/06/6899.jpg","categories":["editorials","life","music","opinion"]}