{"id":"5e9c32419b6559241525de8a","artists":["5e9b693e7a1236eccfeb24bc"],"title":"Interview: Run Toto Run","content":"<p>Change.</p><p> Development. Progression. Evolution. These words are central to understanding the musical entity that is <strong>Run Toto Run</strong>. Beginning as a twee-folk act back in 2008, the band have gone through a series of changes that stretch as close to last week, when <strong>Run Toto Run </strong>went from being a 3, to a 2. More on that controversy later (it seems the Saudi Arabian Royal Family is involved), however it’s important to understand the bigger picture of <strong>Run Toto Run</strong>. Loved by many as a Twee Folk act, the electronica influences acting upon lead vocalist <strong>Rachael Kichenside,</strong> amongst the results that time and experience inevitably imprint, meant that <strong>Run Toto Run </strong>fell into a three piece synth-pop outfit. This transition brought with it a great deal of critical acclaim from fans and the national media alike, with XFM even shortlisting the band as one to watch in 2010. Supporting performances for <strong>Ellie Goulding</strong>, <strong>Everything Everything, James Yuill, </strong>and <strong>Gold Panda</strong>, as well as the release of their single ‘<strong>Hater</strong>‘, saw 2010 as a rather successful year for the band, however many felt that they had no reached the lofty heights that the XFM shortlist had suggested they would.</p>\n<p>Fast forward to 2011 and the band claim that this will be their year. Not only do they have a single and an EP release planned, but they admit that in the new form of a two piece they feel they have reached a natural and confident position to truly demonstrate their musical talent. It may have taken them over 2 years, but <strong>Run Toto Run </strong>have gone through their various stages of evolution to reach what NME has described as ‘<strong>Postal Service indebted electronica</strong>‘. If their fantastic performance at the <strong>Friends of Manchester </strong>festival is anything to go off, then 2011 really is the year for <strong>Run Toto Run</strong>.</p>\n<p><strong>Crack In The Road: </strong>Firstly, let’s travel back to 2008 when <strong>Run Toto Run </strong>was a twee folk outfit. What caused the change?</p>\n<p><strong>Rachael Kichenside: </strong>Well we’re sitting here as a two piece today, and it was a four piece at that point, and Matt wasn’t even in it! So I’m the only persistent member of the band since then. We probably should have had a name change somewhere along the line, because I always wanted to make more electronic music but I wasn’t working with musicians who could do that stuff. I liked folk at the time, but my tastes expanded and Matt approached us by saying he could see what I wanted to do, and that he could bring the electronics. So I was like, Hell yeah!</p>\n<p><strong>Matthew Farthing: </strong>But there was a massive learning curve from there. It took us years to get where we are now. I guess we work in a producer/songwriter way, insofar as we throw the songs together in a studio environment.</p>\n<p><strong>CITR: </strong>So how was this transitional period?</p>\n<p><strong>RK: </strong>It took a lot of work!</p>\n<p><strong>MF: </strong>I think the problem was we weren’t quite sure on what to do. It’s like you’re doing something, and you’ve always got this feeling it could be better if you do this thing, but you don’t realise you’re moving closer and closer to something else. There were loads of small steps, but persistently. They probably would have worked more in our favour if we had just done one thing for ages, then shut down, and then come back with another thing. It was kind of an organic process really.</p>\n<p><strong>RK</strong>: There was a time, like 2 years ago at <strong>In The City</strong>, when <strong>Run Toto Run </strong>was a completely different band. Now you see us and we’re an electronica, pop outfit!</p>\n<p><strong>CITR: </strong>So why the folk beginnings, if electronica was always going to be the destination?</p>\n<p><strong>RK: </strong>Mainly as it started out with just me, and I played the guitar! So from there I wanted to get more musicians in and I started listening to bands like <strong>The</strong> <strong>Postal Service</strong>. After that I knew that was how I wanted my music to sound.</p>\n<p><strong>CITR: </strong>Funny you should mention <strong>The Postal Service</strong>, as NME described your sound as such. Do you agree? Ben Gibbard is a bit of a hero ..</p>\n<p><strong>RK: </strong>Yeah I do agree, I love <strong>The Postal Service</strong>! It’s electronica but it’s not cold or aloof, it’s warmer and I enjoy it for that reason.</p>\n<p><strong>CITR: </strong>Which artist has influenced you the most and why?</p>\n<p><strong>MF: </strong>I think mine would always be Radiohead. Just as they’re a band that could evolve and weren’t afraid to deviate away from the music that was really successful to pursue other avenues. I think they’re the ultimate for that really, in the journey that they took from ‘The Bends’ to ‘Kid A’.</p>\n<p><strong>RK: </strong>I’d probably say David Bowie, and there’s two elements to that. Firstly the want to write good songs that stand out, and I also like the idea of the visual side and the ability to change.</p>\n<p><strong>MF: </strong>Ch-ch-ch-changes!</p>\n<p><strong>RK: </strong>And thinking about it as a performance!</p>\n<p><strong>MF: </strong>I think he was another artist that went through a massive evolution, and still is.</p>\n<p><strong>CITR: </strong>So I’d be right in saying that there’s a theme of development and evolution in <strong>Run Toto Run</strong>?</p>\n<p><strong>MF: </strong>Yeah I think so, especially as it’s important to us as a band that we’re not afraid of evolving and changing. I think we’ve got time for bands that do that. It can create quite a negative impression as you’ll do gigs on the circuit with a lot of the same bands, and occasionally you’ll come across bands that you haven’t seen for a few years and although you’ve liked what they’re doing, they haven’t changed and it appears to become stagnant.</p>\n<p><strong>RK: </strong>However sometimes it does just need a bit of persistence as <strong>Fenech Soler </strong>and <strong>Joy Formidable </strong>are becoming famous with the songs that they released two, three or maybe even four years ago.</p>\n<p><strong>MF: </strong>Maybe we are a bit ADHD about it! I mean for instance, we’re about to play a new version of a song that we’ve only written about six months ago. Mainly as I threw my toys out of the pram about it and I just went ‘I’m bored of this song!’. So we just rewrote it.</p>\n<p><strong>RK</strong>: However you have a ‘world exclusive’ as this is the first time that we’re going to play as a two piece. And we’ve only been a two piece for two days.</p>\n<p><strong>CITR: </strong>I had noticed that you appeared to be one member short .. what’s the story behind that?</p>\n<p><strong>MF: </strong>Should we go with the story that he was fifth in line to the Saudi Arabian throne?</p>\n<p><strong>RK: </strong>That’s right! The whole Saudi Arabian family were gathered together in one place and there was a horrible freak accident ..</p>\n<p><strong>MF: </strong>What Mike didn’t tell us was that he was like fifteenth in line to the throne ..</p>\n<p><strong>RK: </strong>And he was at the gathering, but not close enough to be killed, so he’s had to respond to his royal duties.</p>\n<p><strong>MF: </strong>And that’s the honest answer! We had made up some shit about him not really wanting to do it anymore and stuff, but the truth is easier!</p>\n<p><strong>CITR: </strong>Blimey, how unfortunate. Well if we rewind a few steps, back in 2010 you were in XFM’s shortlist for bands to watch out for in 2010. Looking back in hindsight, do you consider 2010 to be a successful year?</p>\n<p><strong>RK: </strong>I’ll let you in on a bit of a secret, we’re one of the only artists ever to get on that list more than once. We were on it in 2009 and 2010, but we were on it as totally different bands. So what’s nice is that at every stage of your development, we’ve had people singling us out as being good at what we’re doing. Last year was definitely a year of graft, and us going away to solidify our sound. So now, for the last year, we’ve been consistent and coherent.</p>\n<p><strong>MF: </strong>This is probably the first time, probably as of this set actually, that we’re playing a collection of songs that we feel work together. Say you’ve got a set of 8 songs, 6 of them would be now, 1 of them would be a bit of an old one that you feel like you need to play or you haven’t got anything to replace it with, and 1 of them will be really forward looking and feel a bit out of place as well but you want to keep it as it’s the direction you want to go. This set will be one of the first examples where they all just fit together. .</p>\n<p><strong>RK: </strong>I feel really excited about this year as a two piece, as we’re both on the same page now! The single, <strong>This is a Lull</strong>, we’ve just put out has been XFM playlisted and its been on BBC Radio 6 a few times.</p>\n<p><strong>CITR: </strong>You might have to use one of Stalin’s old tricks and ‘remove’ the third member from the video of <strong>This is a Lull</strong>?</p>\n<p><strong>RK: </strong>Haha! Well we’ve got another video which was ready to go, but that’s going to have to be axed now. However the video for <strong>This is a Lull </strong>has been very well received, especially as I’ve had people from MTV emailing me saying ‘this went through the meeting, and we all liked it!’ However they can’t play it on MTV yet as it’s not going to sit next to the likes of <strong>Kanye West</strong>. But it’s nice people are liking it, and it bodes well for the future.</p>\n<p><strong>CITR: </strong>So as a two piece, are the plans for an EP release still going to be worked on this year?</p>\n<p><strong>RK: </strong>We’re just going to get our heads down and work our asses off for a couple of weeks to see where we stand, especially as there’s a few little labels interested in putting the EP and the next single out.</p>\n<p><strong>CITR: </strong>Do you feel the EP will carry on from the sound you had as a three piece, or does that change now?</p>\n<p><strong>RK: </strong>The tracks on the EP are essentially our work. So Mike didn’t have anything to do with it, which I think is part of the reason why he left.</p>\n<p><strong>CITR: </strong>How do you feel ‘<strong>Hater</strong>‘ was like as an experience to record and release?</p>\n<p><strong>RK: </strong>‘<strong>Hater</strong>‘ got a lot of good press, and I’d say it was definitely a positive experience. It was the only track on iTunes all of last year that even vaguely represented us as a band, as all the other tracks were back from the folky days. Maybe we should take it off ..</p>\n<p><strong>MF: </strong>I thought we had!</p>\n<p><strong>CITR: </strong>Maybe you shouldn’t, as it seems like the Italian edition of ‘Vogue Magazine’ may have enjoyed it ..</p>\n<p><strong>RK: </strong>Haha it’s not that great of a back story I’m afraid. Actually, when you read reviews people take it as ‘photogenic front woman Rachael Kichenside has been singled out by Italian Vogue’ — hell no! If only that was the case. It was actually someone talking about their release schedule, and they mentioned us. And since the article is in Italian you can put it online and people will be like ‘ah, I see the words <strong>Run Toto Run</strong> in there’!</p>\n<p><strong>MF: </strong>I think we should do our own protentious photo shoot up on line and make a link to it from the article!</p>\n<p><strong>RK: </strong>Definitely!</p>\n<p><strong>CITR: </strong>But why would Italian Vogue want to write about Mancunian bands? Slow fashion news day?</p>\n<p><strong>MF: </strong>Haha yeah! Or maybe they just get bored with writing about clothes sometimes! It might just be a case of ‘well we could write about fucking clothes again, or we could mix it up with some music news!’</p>\n<p><strong>RK: </strong>However do feel free to tell everyone that it is because I am so beautiful and photogenic, haha!</p>\n<p><strong>CITR: </strong>On the subject of <strong>Passion Pit</strong>, I thought your remix of ‘<strong>Sleepyhead</strong>‘ was fantastic! It topped <strong>Hype Machine </strong>for a while didn’t it?</p>\n<p><strong>RK: </strong>Yeah it got to number 1! We were about the likes of <strong>Lady Gaga </strong>and loads of heavy remixes!</p>\n<p><strong>CITR: </strong>Was it a remix that you put a lot of effort in to?</p>\n<p><strong>RK: </strong>No to be honest! We had several thousand people email for the .mp3, and we get emails pretty much everday about it! Literally it’s not even a proper recording, as we just had a microphone in the middle of the room, and we did one take with everyone playing at the same time. We just had a bit of times on our hands, and we had some masks lying about, so why not make a silly little video? Though as a result of making it we’ve been trolled horrifically for being ‘hipsters’! The only problem with it is that it really does not reflect us as a band, and a lot of people will think we’re a folk band. However it was never let’s do a viral video. It was a shame that it didn’t drop when we were ready as a band though, as it really did bring us a lot more attention.</p>\n<p><strong>CITR: </strong>What has been your favourite gigging experience to date?</p>\n<p><strong>RK: </strong>We’ve played some great shows in London, but I especially enjoyed playing at <strong>Glastonbury</strong>! That was pretty cool.</p>\n<p><strong>MF: </strong>Yeah that was pretty epic.</p>\n<p><strong>RK: </strong>Actually we played a great gig in London where <strong>The Whip </strong>had dj’ed recently, it was such a good night as it was rammed with people.</p>\n<p><strong>MF: </strong>To be honest it’s much easier to pick out the ones which were the worst!</p>\n<p><strong>CITR: </strong>Intriguing, do carry on ..</p>\n<p><strong>RK: </strong>Birmingham, that was pretty horrific. We were playing to the other band and just one other dude. He was a friend of Mike’s, and I felt pretty sorry for him. The other one would probably be when we supported <strong>The Noisettes </strong>..</p>\n<p><strong>MF: </strong>Ah I thought we weren’t going to go there!</p>\n<p><strong>RK: </strong>There was around a 1000 people and the sound just fucked up so badly, to the point where the whole in house team got sacked. Meanwhile we were still at the front having to get through it in front of a sold out show!</p>\n<p><strong>MF: </strong>There’s a funny discrepancy in the Brick Lane gig actually, from you saying it was one of the best gigs as it was one of the most horrific gigs of my entire life! I was so hungover, we had just driven down from Manchester that morning and I just remember for the first 45 minutes of the journey that I just sat in silence with my mouth shut in fear that I would vomit. I couldn’t hear out of my left ear at that point either, and then randomly my eye was hurting as well!</p>\n<p><strong>CITR: </strong>What is <strong>Run Toto Run</strong>‘s plan for the summer, now that you’re a two piece?</p>\n<p><strong>RK: </strong>Well I think things could radically change in the period of time up until then.</p>\n<p><strong>MF: </strong>And we’re looking at quite a big change to the tour bus, as Michael was the only one who could drive!</p>\n<p><strong>RK: </strong>So basically we’ve had to condense everything to the point where we can both carry it all ourselves! So we’re going to be on trains now ..</p>\n<p><strong>MF: </strong>Or coaches if we’re poor.</p>\n<p><strong>RK: </strong>Err, I was on a megabus once and I’m sure that the guy next to me was trying to touch himself ..</p>\n<p><strong>CITR: </strong>How does someone try to touch themselves? You’d think if they were attempting it on a megabus, then they’d at least commit themselves ..</p>\n<p><strong>MF: </strong>Simple, he had very short arms! I once had an old lady fall asleep on my shoulder for a whole megabus journey once ..</p>\n<p><strong>CITR: </strong>Please don’t say this story ends morbidly as you realised at the end of the journey that the old woman just wasn’t waking up ..</p>\n<p><strong>MF: </strong>Haha! That would be a proper in the shower, hugging your knees and rocking back and forward response!</p>\n<p><strong>CITR: </strong>If you could play one festival this summer, which would it be?</p>\n<p><strong>MF: SXSW</strong>!</p>\n<p><strong>RK: </strong>Yeah! But that’s Easter, not summer! I personally really enjoyed Bestival, so I’d love to play there. It’d be good if it wasn’t as squalid as last year though, as everything was on a slope so when it rained things became difficult!</p>\n<p><strong>CITR: </strong>Many thanks for your time <strong>Run Toto Run</strong>!</p>\n<p><strong><a href=\"https://www.myspace.com/runtotomusic \" target=\"_blank\">Run Toto Run Myspace</a></strong></p>\n<p><strong> </strong></p>\n","slug":"4246-interview-run-toto-run","category":"interviews","date":1296507329000,"wpid":4246,"isSticky":false,"featured_image":{"width":600,"height":475,"src":"2011/01/run-toto-run.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAIAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAYH/8QAIRAAAQMDBAMAAAAAAAAAAAAAAQIDBAAFIQYHERIxUaH/xAAVAQEBAAAAAAAAAAAAAAAAAAABAv/EABkRAQACAwAAAAAAAAAAAAAAAAEAEQMxQf/aAAwDAQACEQMRAD8Aqdf7tTbNcrrbWn4aJQfDHVl8qcYIc6jHjlSShXrOa1aLqYojNJltxjISgB0iSkcq4z9pSqy0BRyO5//Z"},"createdAt":1587294785685,"updatedAt":1588403561105,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2011/01/run-toto-run.jpg","categories":["interviews","music","reviews"]}