{"id":"5e9c32409b6559241525de87","artists":["5e9b68f27a1236eccfeb2010"],"title":"Review: Esben and the Witch – Violet Cries","content":"<p>As an act recently nominated for the BBC Sound of 2011 competition, it would be easy to assume that the Brighton three piece <strong>Esben and the Witch</strong> make for easy listening, especially when coupled with the lazy comparisons to Florence and the Machine.</p><p>  Whilst Florence makes epic, but nonetheless accessible pop music, Esben and the Witch create an ominous, doom-laden soundscape to narrate a solitude and disturbia more akin to Zola Jesus and Fever Ray; building an intensely personal and isolating atmosphere through howling vocals, and ranging, awkward drumming.</p>\n<p>Written with clear classical inspiration- try song titles ‘Chorea’ and ‘Euminedes’ on for size- this is not an album written for light listening, it requires commitment and an open mind, preferably combined with a dark walk home and a burgeoning paranoia.  The specifically uneasy overtones which are emphasised, rather than driven, by Rachel Daives’ guttural vocals inspire an incredibly original, contemporary album which will never threaten the mainstream, but will be celebrated as an alternative classic, much like These New Puritans.</p>\n<p>After witnessing Esben and the Witch at Leeds’ Constellations Festival, I can testify to their hypnotic live show, which has informed their swift rise to a mainstream consciousness.  This is in fact a challenge to the band; it is very difficult to maintain an intensity over the 43 minutes of <em>Violet Cries</em>, when compared to their live act, with both their timing and recording awkward and angular, though this arguably heightens the definitively mournful sound.  This is not an album that will spawn singles, it is a record to be enjoyed (if that’s the correct term) as an experience from start to finish, invoking fear and celebrating a subtlety and bravery rarely seen in our stale music industry.  It is to be commended as an ambitious and dynamic debut record.</p>\n","slug":"4268-esben-and-the-witch","category":"music","date":1296514234000,"wpid":4268,"isSticky":false,"featured_image":{"width":550,"height":365,"src":"2011/01/esben_and_the_witch_new_large_1296136063_crop_550x365.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAYH/8QAIhAAAQMDAwUAAAAAAAAAAAAAAQIDBAAFIQYREhMUMUGh/8QAFQEBAQAAAAAAAAAAAAAAAAAAAwT/xAAXEQADAQAAAAAAAAAAAAAAAAAAAREC/9oADAMBAAIRAxEAPwDKolxtytMSJjbHbPDnH45Wk7gEHb0cVLszgGkA9NRCRkp8/KUoYUbccR//2Q=="},"createdAt":1587294784142,"updatedAt":1588403561080,"author":"5e9b68b27a1236eccfeb1d4c","old_image":"2011/01/esben_and_the_witch_new_large_1296136063_crop_550x365.jpg","categories":["music","reviews"]}