{"id":"5e9c323b9b6559241525de82","title":"Review: Band of Horses (Manchester)","content":"<p>Accompanied by <strong>Anna ‘Blacky’ Savage</strong>, our most recent addition to the writing team here at <strong>Crack In The Road</strong>, we found an ideal spot in the cavernous <strong>Manchester Academy 1</strong> to witness the folk infused rock sound of <strong>Band of Horses</strong>.</p><p> Known to many simply by their hit, yet morbidly named, single ‘<strong>The Funeral</strong>‘, <strong>Band of Horses </strong>made sure that the sold out audience became very aware of their fantastic back catalogue of tracks. Support for the evening was provided by <strong>Crack In The Road </strong>favourites <strong>Goldheart Assembly</strong>, and <strong>Mojave 3</strong>.</p>\n<p><strong>Goldheart Assembly:</strong></p>\n<p>Taking to the stage only as the venue was half full, <strong>Goldheart Assembly </strong>exerted their normal charm and unique character as they traded light hearted jibes across stage, and humourously plugging the merchandise they had for sale. <strong>Goldheart Assembly </strong>have gone from strength to strength since <strong>Crack In The Road </strong>first interview them just under a year ago at the <strong>2010 Dot To Dot Festival</strong>. Presenting themselves as a wholly more confident and polished out fit, they have even welcomed the addition of a new lead guitarist, who appears to fit the role perfectly. Tracks such as <strong>King of Rome </strong>and <strong>So Long St. Christopher </strong>both appealed to the die hard fans who had arrived deliberately on time, and entertained a lot of the punctual punters who subsequently appeared to be swayed into becoming fans of <strong>Goldheart Assembly </strong>themselves. Energetic, funny and professional, this was everything you’d want in headline act, nevermind a support act.</p>\n<p><strong><a href=\"https://www.myspace.com/goldheartassembly\" target=\"_blank\">Goldheart Assembly Myspace</a></strong></p>\n<p>8/10</p>\n<p><strong>Mojave 3:</strong></p>\n<p>Still technically listed as ‘on hiatus’, <strong>Mojave 3</strong>‘s support of <strong>Band of Horses </strong>can be seen as a return to the mainstream for this country/folk/rock collective, with word that the band are recording another album , 4 years on from their last release of ‘<strong>Puzzle Like You</strong>‘. Gathering on the stage rather unassumingly, <strong>Mojave 3 </strong>played an enthused set that caught the attention of the now rammed venue. Noticeably quieter and calmer than <strong>Goldheart Assembly</strong>, <strong>Mojave 3 </strong>excelled in creating a serene intensity that held the audience from beginning to end. However I could not help but feel that while I could appreciate <strong>Mojave 3</strong> and their sound, I wouldn’t find myself listening to them outside of this gig, and so far that’s been the case. A great deal of their sound is intimate and intricate, though this does sometimes border on the dull. While this benefited from the demands of a live performance, I hope that should a new album be on the cards, it is a more invigorating affair.</p>\n<p><strong><a href=\"https://www.myspace.com/mojave3official\" target=\"_blank\">Mojave 3 Myspace</a></strong></p>\n<p>7/10</p>\n<p><strong>Band of Horses:</strong></p>\n<p>Taking to the stage to a soundtrack of 70’s Funk (this was a great delight), <strong>Band of Horses </strong>broke straight in to a set that encompassed the musical diversity the band can so effortlessly create, ranging from the melancholic to the addictively up beat. Inspiringly, the band had crafted a fast moving still frame montage of stunning nature scenes and memories of a previous tour, which was projected to epic proportions on the back wall of the stage. What <strong>Band of Horses </strong>had created was a wonderful sensory overload. Well, in terms of sight and hearing, however I can assure you taste, touch and most certainly smell, were very envious.</p>\n<p>As I mentioned earlier, many may have just known <strong>Band of Horses </strong>by ‘<strong>The Funeral</strong>‘, however this stunning performance made sure that nobody left simply knowing that track alone. Particular highlights were ‘<strong>Factory</strong>‘ and ‘<strong>The End’s Not Near</strong>‘ , which demonstrated the band’s sheer ability to express the utterly emotive undertones that are fused within their tracks. Moreover, towards the end of their set, the band explained they had played a different cover track on each leg of the tour, and that they’d even decided ‘to play this cover instead of ‘<strong>The Funeral</strong>‘. A joke that wasn’t received quite as well as I imagine the band would have liked, their effort of the cover track was in many ways a great success. My only complaint with <strong>Band of Horses </strong>would be their choice of encore. Their set came to an ecstatic climax as they finished with ‘<strong>The Funeral</strong>‘, however they then proceeded to play three of the slowest songs I have ever heard. Now while I am a big fan of the slow, brooding tracks, they are not the sort of songs you play for an encore, and certainly not after the buzz that ‘<strong>The Funeral</strong>‘ created. However despite this, <strong>Band of Horses </strong>created an energetic and interesting set that showcased the immense musical talent that this band possesses.</p>\n<p>9/10</p>\n<p><strong><a href=\"https://www.myspace.com/bandofhorses\" target=\"_blank\">Band of Horses Myspace</a></strong></p>\n","slug":"4285-review-band-of-horses-manchester","category":"music","date":1296866192000,"wpid":4285,"isSticky":false,"featured_image":{"width":510,"height":412,"src":"2011/02/band-of-horses.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAIAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAQH/8QAIRAAAQMEAQUAAAAAAAAAAAAAAQIDEQAEBiEHEzFxk9H/xAAVAQEBAAAAAAAAAAAAAAAAAAAAAv/EABkRAQACAwAAAAAAAAAAAAAAAAEAAhESIf/aAAwDAQACEQMRAD8AyfFcsXb2rrrfTBQw6ktrWBsCUkGdeI3qO1SHkx+TFg37D8pSq2a4CClXqT//2Q=="},"createdAt":1587294779244,"updatedAt":1588403561053,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2011/02/band-of-horses.jpg","categories":["music","reviews"]}