{"id":"5e9c32399b6559241525de7f","title":"Review: Sketches/Dog Is Dead","content":"<p>Previous <strong>Crack In The Road </strong><a href=\"https://admin.</p><p>crackintheroad.com/music/2860-interview-sketches\" target=\"_blank\">interviewees</a>, <strong>Sketches </strong>have recently announced their next single release, ‘<strong>My Father’s Son</strong>‘, which is due out on the 28th February, and it’s a cracker. Therefore I, on behalf of <strong>Crack In The Road, </strong>travelled to Leeds for <strong>Sketches </strong>single launch night to see this indie rock quartet perform the track, along with some of my other favourites from their back catalogue. Support for the evening was supplied by another set of past <strong>Crack In The Road </strong><a href=\"https://api.crackintheroad.com/music/1490-interview-dog-is-dead\" target=\"_blank\">interviewees</a>, <strong>Dog is Dead</strong>, who have gained a considerable amount of attention and have their own fantastic new single which too is due out on the 28th February!</p>\n<p><strong>Dog Is Dead:</strong></p>\n<p>What is so fantastic about the <strong>Brudenell Social Club </strong>is how intimate it is, with a slightly elevated stage meeting an immediate standing and sitting audience. Not to mention it’s a working men’s social club that hasn’t, thankfully, been refurbished for the past 30 years. Since <strong>Crack In The Road</strong> first interviewed <strong>Dog Is Dead </strong>all those months ago at the <strong>Dot to Dot 2010 Festival</strong>, they have steadily gained an ever growing fan base, which has gained the attention of many those in the music ‘know’. An appearance on <strong>Skins </strong>(surely this music is to happy for those melancholic/moronic rapscallions?), a performance at a <strong>Chess Club Records</strong> show, and listed as a ‘one to watch’ on <strong>The 405</strong>, has made sure 2011 will be a very exciting year for <strong>Dog Is Dead</strong>.</p>\n<p>Taking to the stage, <strong>Dog Is Dead </strong>still hold that unique charm and energy that I first witnessed in Manchester, albeit slightly more polished. With an ever enthusiastic audience, <strong>Dog Is Dead </strong>positioned themselves in a line (the drummer emphatically made himself known despite being hidden) across the stage, and played their choral pop hits superbly. I say ‘choral pop’ as a great deal of their music comes from the choral vocals that add to the spirit raising melodies in each track, and really does make the band stand out from what else is currently on offer. However their latest single, the last in the ‘Your Childhood triology’ (single for a major label deal?), ‘<strong>River Jordan</strong>‘ displays a slighter dark side to this 5 piece that really does suggest <strong>Dog is Dead </strong>are no one hit wonder. The intensity of this record contrasts with the upbeat and light hearted nature of their other tracks, and in doing so made a live performance that was a delight to watch.</p>\n<p>8/10</p>\n<p><strong><a href=\"https://www.myspace.com/dogisdeadband\" target=\"_blank\">Dog Is Dead Myspace</a></strong></p>\n<p><strong>Sketches:</strong></p>\n<p><strong>Sketches </strong>new single ‘<strong>My Father’s Son</strong>‘ is in many ways the culmination of a great deal of effort and progression on behalf of the band. Way back when <strong>Crack In The Road </strong>first interviewed the band, they stated that <strong>Wild Beasts </strong>were a massive influence. So what do they go and do? That’s right, they enroll the help of <strong>Richard Formby</strong>, who worked on the <strong>Wild Beasts Mercury Award </strong>nominated track, ‘<strong>Two Dancers</strong>‘. Noticeably more directed and driven, ‘<strong>My Father’s Son</strong>‘ takes the sharp melancholy which is present in such tracks as <strong>‘Sycophants with Style</strong>‘, and channels it down a more anthemic vein of sound. This could be seen in their fantastic live performance, which absorbed the audience and managed to soak the atmosphere in angst while remaining thoroughly entertaining.</p>\n<p>While their sound is by no means the melodic triumph that is <strong>Dog Is Dead</strong>, <strong><span style=\"font-weight: normal;\">Sketches </span></strong>manage to balance on the line between defeat and defiance, anger and realism, and even darkness and light, which as a result creates a sound that is as intense as it is enjoyable to listen to. While their stage presence could have been argued to be lesser than that of their main support, <strong>Sketches</strong> single launch night should be seen as a highly successful and entertaining gig that brimmed with exciting promise for both acts.</p>\n<p>7/10</p>\n<p><strong><a href=\"https://www.myspace.com/sketchesband\" target=\"_blank\">Sketches Myspace</a></strong></p>\n","slug":"4288-review-sketchesdog-is-dead","category":"music","date":1296933563000,"wpid":4288,"isSticky":false,"featured_image":{"width":600,"height":450,"src":"2011/02/sketches-band.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAAAAf/xAAgEAACAgICAgMAAAAAAAAAAAABAgMEABEFEyExBiJR/8QAFQEBAQAAAAAAAAAAAAAAAAAAAwT/xAAXEQEBAQEAAAAAAAAAAAAAAAABAAIR/9oADAMBAAIRAxEAPwBxkV2x8er2OMuy0Ug7Gjrxs3WzHW/rvQHj3+gHWSLkaEMnIWXdZy7SsSWKsSdn2SfOMYxg5Tukb//Z"},"createdAt":1587294777344,"updatedAt":1588403561027,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2011/02/sketches-band.jpg","categories":["music","reviews"]}