{"id":"5e9c34959b6559241525e257","title":"The Death of Creativity","content":"<div style=\"text-align: center;\"><a rel=\"attachment wp-att-1933\" href=\"https://admin.</p><p>crackintheroad.com/life/43-the-death-of-creativity/attachment/spotify1\"><br />\n</a></div>\n<div style=\"text-align: center;\">I had been considering writing an article along these lines for a while, however had never felt much good would come of it, but after hearing that the Digital Economy Bill was passed yesterday in the House of Commons, I felt compelled to air my opinion. For those unfamiliar with the bill, to sum it up basically, it will allow Internet Service Providers to cut off the internet connection of any customer who is suspected to have been participating in illegal file sharing. Owners of copyrighted material can report internet users to their ISP if they suspect that certain user has been illegally downloading the material that they own. Once the connection of the user has been cut off, it is up to the user themselves to prove that they were not using their connection for the downloading of copyrighted material. The law was passed at the House of Commons, with just over 3% of MPs turning up for the debate.</div>\n<div style=\"text-align: center;\">Without even putting much thought into it, you can see a huge hole in the logic there. The countless number of times I have “piggy-backed” someone’s internet connection whilst out and about is the first hole in the law, how would that person prove that I had hacked into and used their internet connection? Especially tour average, everyday internet user not knowing a huge amount about the programs or the set up of the systems they are using. If someone was to sit outside my house and access the internet for downloading copyright material by breaking through my WEP code, do the Government really think there is any chance whatsoever that my unsuspecting parents could then prove in a court of law that it wasn’t them downloading? They find it difficult enough to use the internet with the WEP settings in place, never mind having to implement new security options.</div>\n<div style=\"text-align: center;\">The second major flaw is how will this apply for businesses? If an employee downloads copyright material whilst at work, will the ISP cut off the internet for the entire business? Of course they wouldn’t. As the law will include any material downloaded illegally, it will span from all mediums, TV shows, movies, music and software, but will they all be treated in the same respect? Will the copyright owners of an adult film company report a person for downloading their copyrighted material? Not a chance. It’s a hugely flawed law, being used to target your everyday internet user, who yes, may occasionally download a song they heard on the radio, but aren’t causing any meaningful damage to the industry. From conversations with artists themselves, I can say that the general consensus is that downloading their music for free is benefiting them in the long run, in terms of record sales and gig attendances. As it currently stands, the artists themselves see an almost insignificant amount of money generated from the sales of their records anyway.</div>\n<div style=\"text-align: center;\">This leads me onto the death of creativity, as I have named it. Being a “consumer” of music, I can openly say that yes, I do illegally download the odd song from the internet, however the amount of money I have put back into the industry through buying songs first listened to through illegal methods, easily outweighs that of the money that I would otherwise have used to try to discover new music. People who feel pressurised by new laws which restrict illegal downloading, are opting to use legal services such as Spotify for experiencing music. Having never especially been a huge fan of the idea, the new Digital Economy Bill is only going to heighten the usage of such programs. I’m sure the majority of musicians would agree with me on this, that music is not created to be listened to whilst sat in a dark, cramped room, through cheap laptop speakers. The very fundamentals behind the art of music assert it as being a portable method of expressing emotion, the very fact the the majority of instruments are of the size to be carried on the person emphasises this point. At a time when expressionism should be being encouraged, it seems that new laws are repressing this emotion, and forcing people to adhere to a set stereotype. The invention and growing usage of the portable mp3 player has opened up an entire new art form to many people, with those who otherwise might not been inspired by music, being given an easy and affordable chance to experience sounds new to them.</div>\n<div style=\"text-align: center;\">In summary, I believe that the music industry, record labels in particular, should be looking for ways to work alongside “illegal” downloading, not suppress it to the extent that people are put off from listening to music at all. There is also no doubting that on the whole, the more people listen to music, the more inspired they are to produce music of their own. As it is we are a generation who find it hard to express ourselves other than through the medium of the internet, do we really want to remove another of our most important and beautiful pastimes?</div>\n<div style=\"text-align: center;\">What are your opinions on the matter?</div>\n","slug":"43-the-death-of-creativity","category":"life","date":1270682640000,"wpid":43,"isSticky":false,"featured_image":{"width":570,"height":386,"src":"2010/04/spotify1.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAMG/8QAHBAAAgICAwAAAAAAAAAAAAAAAAECEQMSITFC/8QAFQEBAQAAAAAAAAAAAAAAAAAABQf/xAAYEQADAQEAAAAAAAAAAAAAAAAAAhEBEv/aAAwDAQACEQMRAD8A0sVgqO08u3pKKok7vjoAlLP1kkCD/9k="},"createdAt":1587295381843,"updatedAt":1588403569329,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2010/04/spotify1.jpg","categories":["life"]}