{"id":"5e9c32319b6559241525de72","title":"Review: Grouplove/Patterns (Manchester)","content":"<p>Formed out of the most annoyingly arty and inspiring stories, <strong>Grouplove </strong>began life by the chance meeting of Hannah Hooper and Christian Zucconi in Manhattan.</p><p> An opportunity for Hooper to take part in an art residency in Crete, Greece influenced Zucconi to follow her, and facilitated the meeting of the further members of what is now <strong>Grouplove</strong>. Their debut EP ‘Colours’, which has already received critical acclaim from music bloggers right along to national music press, is due out on the 7th February, and I can promise you it’ll be one of your best purchases of the year. Support for the evening was supplied by <strong>Patterns</strong>, a local Manchester band that is gaining increasing attention for the blurred guitar pop sound they so effortlessly create. The vocalist even sounds a bit ‘<strong>Smiths</strong>-y’, which can only be exciting.</p>\n<p><strong>Patterns:</strong></p>\n<p><strong>Patterns </strong>were a pleasant surprise for a support act at a small gig; they were actually very good. While their low tempo sound was somewhat at odds with the sound many were expecting from <strong>Grouplove</strong>, <strong>Patterns </strong>still managed to entertain myself and the audience. It is hard to pigeon hole the sound <strong>Patterns </strong>have created, though it lies somewhere around chillwave and shoegaze. Dreamy, abstracted and whole heartedly atmospheric, each track felt like a separate and definite experience, which were all navigated by transcendental vocals that matched the serenity of the music. Their debut EP. ‘<strong>New Noise</strong>‘ is already out, and is very much worth a listen!</p>\n<p>8/10</p>\n<p><strong><a href=\"https://www.myspace.com/maliciouspixels\" target=\"_blank\">Patterns Myspace</a></strong></p>\n<p><strong>Grouplove:</strong></p>\n<p>Looking and sounding annoyingly perfect .. well, they are. Energetic and honestly enthusiastic, <strong>Grouplove</strong>‘s short set was an absolute delight to witness. Up tempo and addictively melodic, Zucconi and Hooper’s vocals harmonized superbly to create a idealistic and eternally optimistic sound that I was more willing to buy in to. Positioned across the stage, each track would provoke a series of head banging and wild dancing from the band that only served to further the fun intensity that this set was so concentrated with. <strong>Colours </strong>and <strong>Naked Kids</strong>, perhaps if they had been released later in the year, could easily be summer anthems,  with uplifting vocals and projecting feelings of a lack of responsibility through jangly guitars and percussion. <strong>Gold Coast </strong>provided a sole breakaway to a slower and introspective track that felt almost like a contemplative come down from what had preceded it, though it also proved that these crazy kids were much more than just happy go lucky musicians. A particular highlight was <strong>Don’t Say Oh Well</strong>, which seemed to strike a balance between the likes of <strong>Naked Kids </strong>and <strong>Gold Coast</strong>. <strong>Don’t Say Oh Well </strong>in many ways provides a succinct summary of <strong>Grouplove </strong>and their music, insofar as a sound that is inspired to lift your soul, and a band that you’d want as your friends at festivals, parties and on adventures in your VW Campervan.</p>\n<p>9/10</p>\n<p><strong><a href=\"https://www.myspace.com/groupmusic\" target=\"_blank\">Grouplove Myspace</a></strong></p>\n<p><strong><br />\n</strong></p>\n","slug":"4314-review-grouplovepatterns","category":"music","date":1297109424000,"wpid":4314,"isSticky":false,"featured_image":{"width":292,"height":50,"src":"2011/02/grouplove-292x50.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAACAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAQG/8QAHxABAAEEAgMBAAAAAAAAAAAAAQIAAwQFERIhMVFx/8QAFQEBAQAAAAAAAAAAAAAAAAAAAgP/xAAVEQEBAAAAAAAAAAAAAAAAAAAAAv/aAAwDAQACEQMRAD8A0uxjHX6zBlgRMWVzZWSbZOjLtkBLnj3yeH6VXrwlgYygraiq/hSlSOn/2Q=="},"createdAt":1587294769653,"updatedAt":1588443779820,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2011/02/grouplove-292x50.jpg","categories":["music","reviews"]}