{"id":"5e9c322f9b6559241525de6f","artists":["5e9b69047a1236eccfeb218e"],"title":"Review: James Blake – James Blake","content":"<p>It is a strangely 21st century phenomenon; the desire to project and predict annually the new “saviours of music” and musicians likely to be successful in the coming year.</p><p> Every year critics, bloggers, radio presenters etc all fall over themselves in the rush to predict the forthcoming years next big thing. In this years annual tipping bun fight one name has been commonplace, that of 21 year old virtuoso producer and singer songwriter James Blake.</p>\n<p>James Blake has been creating quite a stir on the underground electronic scene for a while now with his blistering and dazzlingly inventive productions on records such as last years “CMYK” and “Klavierwerke” gaining himself a reputation as one of the leading lights of the UK’s burgeoning electronic post-dubstep scene along with contemporaries, both in terms of age and musical philosophy, Jamie XX and the likes of Mount Kimbie and Burial, however, with the release of his debut record “James Blake” it now seems that those pulsating electronic floor fillers were rather a red herring and James Blake the singer songwriter is a vastly different proposition.</p>\n<p>“James Blake” is an album of textures, of sparse sounds and minimal production, space and silence is key. Blake is a classically trained musician who has previously proclaimed his love of gospel music and classic soul singers like Sam Cooke and Ottis Redding. It is this musical background that shapes his debut album, self produced and with every instrument played by Blake himself, his debut album sets out James Blake’s musical philosophy and principals.</p>\n<p>Rather than being primarily an electronic record, Blake’s debut is a record grounded in traditional singer songwriter principals, however, the beauty of the record is Blake’s ability in taking these simple sounds and organic Spartan instrumentation and bending and shaping it into a beguiling record full of real soul and beauty.</p>\n<p>Forthcoming single “Wilhelms Scream” sets the template for the record, it begins quietly with Blake’s pure soulful vocal, “I don’t know about my dreamin’ anymore/ All that I know is I’m fallin’, fallin’, fallin’, fallin’,” This line is then looped throughout the song as electronic sounds and blips and gurgles float around it, it is very simple but incredibly effective.</p>\n<p>Blake’s voice is a high point throughout the record and his ability to manipulate his voice and layer vocals on top of each other creates the wonderful effect of Blake harmonising with himself, it appears as if James Blake is the latest in a very long line of British male singers appropriating the soul sound of America in that very British blue eyed style but Blake does it in a way that is original and very clever and never sounds like a pastiche.</p>\n<p>The lyrical content of the record is rather oblique but hints at some darker undercurrents, for example the repeated vocal line of “I never Learnt To Share”; “My Brother and Sister don’t speak to me, but I don’t blame them” The theme of melancholy established by lyrics like these and love songs like the lilting “To Care (Like You) is further explored throughout the album</p>\n<p>The mainstream breakthrough track, the cover of Feist’s “Limit To Your Love” is present here and of course it represents a major highlight, the haunting piano still makes the hairs on the back of your neck stand up, and while there is nothing else on the record as accessible as this, the record is certainly one that can establish James Blake as a mainstream successful artist.</p>\n<p>As a piece of work “James Blake” is a very accomplished debut album but still a suspicion lingers that he is capable of more, a couple of songs on the record are nothing more than a few vocal lines surrounded by sparse drum machine sounds and a little bit of guitar, the figure of Bon Iver looms large during the largely acoustic “Lindisfarne”</p>\n<p>The album is high on beauty but low on genuine thrills and it can be argued that the record could do with a quickening of the pulse but those who argue this miss the point that the record is not intended for the dance floor or underground raves but is a record of understated beauty full of hidden depths and sounds. By the time you get to the final track, the wonderful one man gospel choir of the largely a capella “Measurements” it is abundantly clear that James Blake is, rather than just being an intensely gifted producer and DJ, a supremely talented musician, his potential is limitless and just once he may prove the hype-makers right in their predictions.</p>\n","slug":"4358-review-james-blake-james-blake","category":"music","date":1297156435000,"wpid":4358,"isSticky":false,"featured_image":{"width":165,"height":165,"src":"2011/02/james-blake-james-blake-165x165.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAABQMG/8QAIBAAAQMEAwEBAAAAAAAAAAAAAQIEEQMFEiEABkFxE//EABQBAQAAAAAAAAAAAAAAAAAAAAT/xAAbEQACAQUAAAAAAAAAAAAAAAABAgADEyJRYf/aAAwDAQACEQMRAD8Ah26x1rxeHLuk8p4NaCYRnukrZ2J1I3rmhtze+C3tc7sM/wAkzIyMwPfeC9fAVaXhUJKq65J9+8bb6b0gNAJEAfODuZkxyAimq65P/9k="},"createdAt":1587294767851,"updatedAt":1588403560895,"author":"5e9b68b27a1236eccfeb1d33","old_image":"2011/02/james-blake-james-blake-165x165.jpg","categories":["music","reviews"]}