{"id":"5e9c322c9b6559241525de69","title":"Los Campesinos – Theme from R*A*S*H","content":"<p><a href=\"https://admin.</p><p>crackintheroad.com/music/4377-los-campesinos-theme-from-rash/attachment/new-white-heat-rash-site-banner-2/\" rel=\"attachment wp-att-4384\"><img class=\"alignnone size-900wide wp-image-4384\" title=\"new-white-heat-rash-site-banner\" src=\"https://api.crackintheroad.com/uploads/2011/02/new-white-heat-rash-site-banner1-900x435.jpg\" alt=\"\" width=\"900\" height=\"435\" /></a>With all the hype that suddenly appeared in the days leading up to Los Campesinos!’s ‘Heat Rash’ announcement (or rather, misplaced hype for a new album), many people quickly forgot about the mini-movie that was released to publicise the new project. Or more specifically, the <em>soundtrack</em> of this mini movie.</p>\n<p>Showcasing the gorgeous glockenspiel and distortion instrumental arrangements that were hinted at during some of their best past album moments (<em>2007, the year…,</em> <em>Coda</em> and <em>You’ll need those fingers….</em>), the short piece did little to abate the new album speculation at the time. Quite the opposite infact, implying the widening of the bands’ musical palette that characterised the development from <em>Hold on now Youngster </em>to <em>Romance is Boring</em> shows no sign of abating.</p>\n<p>In regards to the track itself, it can’t help but conjure up images of nights spent half awake and staring at fairy lights. Admittedly that’s the footage it soundtracked, and possibly a result of this writer having spent many nights doing the very same thing, but it’s fair to say that’s the imagery it would imply regardless. Being centred around a musicbox-esque loop, the track could easily have felt a bit flat and unsubstantial, like Lullatone without the infatuation for hypnotism, if it wasn’t for the heavily layered guitars and strings that occupy the space behind it and between the beats, filling out the rest of the track. Where the lead part lends the music a dreamy, night atmosphere, the other instruments’ gradual build up and discordant nature lends it a listless yet forward pushing quality that rewards repeated listens.</p>\n<p>And that follow up album? It’ll be here eventually- the band released a statement at the end of January stating they’ve begun planning and working on the new album, with their huge, recent gig at the Shepherd’s Bush Empire seeing new track <a href=\"https://www.youtube.com/watch?v=XA2CjcPcqcU\">‘The Black Bird, The Dark Slope</a>‘ get its first airing. Fans of investigative journalism might also be interested in stalking their local neighbourhood band guitarist’s Last.fm page to see hints of current demos. In the meantime, Gareth has confirmed that a “Double A Side, 7″/download, coming to Heatrash subscribers very soon.” The tracks are now known to be ‘Light Leaves, Dark Sees’ and ‘Four Seasons’.</p>\n<p>As for why someone would suddenly write about this months after it soundtracked an advert? Well the lovely folks at Los Campesinos! have been kind enough to offer an extended and higher quality version of the track itself for you lovely readers, that’s why.</p>\n<p><object width=\"100%\" height=\"81\" classid=\"clsid:d27cdb6e-ae6d-11cf-96b8-444553540000\" codebase=\"https://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=6,0,40,0\"><param name=\"allowscriptaccess\" value=\"always\" /><param name=\"src\" value=\"https://player.soundcloud.com/player.swf?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F9427610&show_comments=false&auto_play=true&color=4f00ff\" /><embed width=\"100%\" height=\"81\" type=\"application/x-shockwave-flash\" src=\"https://player.soundcloud.com/player.swf?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F9427610&show_comments=false&auto_play=true&color=4f00ff\" allowscriptaccess=\"always\" /></object></p>\n","slug":"4377-los-campesinos-theme-from-rash","category":"music","date":1297198450000,"wpid":4377,"isSticky":false,"featured_image":{"width":292,"height":50,"src":"2011/02/new-white-heat-rash-site-banner-292x50.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAACAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAUI/8QAHhAAAgICAgMAAAAAAAAAAAAAAQIDBQAGBBIHIWH/xAAVAQEBAAAAAAAAAAAAAAAAAAACBP/EABgRAAIDAAAAAAAAAAAAAAAAAAADBDEy/9oADAMBAAIRAxEAPwC/4MnmlqZEklkdDMg6sxI9pmYdi2G6TYLNUt7FVXlSgAclwAO5+4xkUfI22f/Z"},"createdAt":1587294764500,"updatedAt":1588443779768,"author":"5e9b68b27a1236eccfeb1d0b","old_image":"2011/02/new-white-heat-rash-site-banner-292x50.jpg","categories":["music","reviews"]}