{"id":"5e9c32299b6559241525de63","title":"Review: Wintersleep (Newcastle)","content":"<p><a rel=\"attachment wp-att-4405\" href=\"https://admin.</p><p>crackintheroad.com/music/4403-review-wintersleep-newcastle/attachment/wintersleep1\"><img src=\"../uploads/2011/02/wintersleep1-288x192.jpg\" alt=\"\" width=\"288\" height=\"192\" /></a></p>\n<p>I feel I should begin this review with a confession – I was originally going to review two bands – <strong>The Hold Steady</strong>, and <strong>Wintersleep</strong>, their support act. However, around the mid-point of their set in Newcastle last night, I had an epiphany: these guys are quite simply too good to relegate them to a subsidiary paragraph. So, instead, I’m going to do something rather strange – do a full review of a support act.</p>\n<p><strong>Wintersleep</strong>, as they quite proudly pointed out, are a rock band from Canada. 2007’s magnificent album <strong>Welcome to the Night Sky </strong>won a Juno Award the following year, and their 2010 album, <strong>New Inheritors</strong>, was critically acclaimed and managed to solidify their position on the indie rock scene. In their support act, they played a strong set of 8 songs, made up mostly of tracks from the aforementioned albums.</p>\n<p>Opening with <strong>Drunk on Aluminium</strong>, a song that wouldn’t seem out of place in a stadium, <strong>Wintersleep</strong> powered through their set, showcasing their latest songs such as<strong> Preservation</strong> and <strong>New Interiors, </strong>whilst sticking to some spectacular tracks from their 2007 album. In particular, the 8-minute epic <strong>Miasmal Smoke and the Yellow Bellied Freaks</strong>, aside from being an incredible name for a song, stood out as evidence of why this band should be far bigger than they are. On the other end of the scale, <strong>Weighty Ghost</strong> provided a sobering, hugely emotional mid-set song and demonstrated just how diverse <strong>Wintersleep</strong> can be.</p>\n<p>Deserving special mention, too, is the band’s drummer, Loel Campbell. The percussion is what truly sets out <strong>Wintersleep </strong>from their competition. Live, Campbell put in such energy and skill (and the most wonderful facial expressions) rarely seen in too many bands which stick their drummer at the back and focus instead on driving the music with their guitars. Here, however, is a band which is driven by its incredible percussion, and manages to have it almost perfectly compliment every other instrument onstage – it really is something special.</p>\n<p>In writing this, I hope not to have offended any <strong>Hold Steady</strong> fans – nothing against them (indeed, they played a hugely impressive – and surprisingly extensive – set), but they were completely outshadowed by a band which manages to combine emotional lyricism, incredible instrumental skill and some really rather brilliant songwriting. All this comes together to form a band which, far from playing support acts in an O2 Academy on a Monday night, should, by all rights, be headlining themselves.</p>\n<p><a href=\"https://www.youtube.com/watch?v=Q-iW0zL2LI0\">Wintersleep – Weighty Ghost</a></p>\n","slug":"4403-review-wintersleep-newcastle","category":"music","date":1297261687000,"wpid":4403,"isSticky":false,"featured_image":{"width":292,"height":50,"src":"2011/02/wintersleep1-292x50.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAACAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAQH/8QAHRAAAwACAgMAAAAAAAAAAAAAAQIDAAQTMSEiUv/EABUBAQEAAAAAAAAAAAAAAAAAAAME/8QAFxEAAwEAAAAAAAAAAAAAAAAAAAEyAv/aAAwDAQACEQMRAD8Ah5qx1IPKjo6j1ZWII8Do5tT68S7Exn38jGMo3TCUo//Z"},"createdAt":1587294762000,"updatedAt":1588443779718,"author":"5e9b68b27a1236eccfeb1d16","old_image":"2011/02/wintersleep1-292x50.jpg","categories":["music","reviews"]}