{"id":"5e9c32289b6559241525de60","artists":["5e9b69517a1236eccfeb25fa"],"title":"Review: The Complete Short Stories – Perfectly Still","content":"<p><img class=\"alignnone\" title=\"Short Stories\" src=\"https://c3.</p><p>ac-images.myspacecdn.com/images02/13/l_10139e485e394b11a4bc74787a670336.jpg\" alt=\"\" width=\"600\" height=\"400\" />Receiving albums and CD’s through the post is a charming, albeit fading form of promotion, yet is far and away my preferred method of experiencing new music. Not only do you get a feel for the physical product, there’s a remarkable affection stirred in me upon viewing striking and beauteous artwork. Having an image of the album cover appear on a portable mp3 player will never quite match up to the feeling of touching the CD case and examining the intricacy’s of the work of art in your hands.</p>\n<p>Upon receiving The Complete Short Stories debut record, Perfectly Still, I was immediately struck by the alluring and exquisite album cover. A solitary chair topped with colourful balloons, perched by what appears to be a disused railway line; with such care taken with the artwork, it would be injust not to give the record a listen.</p>\n<img class=\"alignnone\" title=\"Short\" src=\"https://c4.ac-images.myspacecdn.com/images02/127/l_63da5ce446ed47c48474da5f9af9c967.jpg\" alt=\"\" width=\"600\" height=\"600\" />\n<p>Opener A Million Ways is a feisty introduction, outlining the albums aims from the off, quirky pop with a sinister undertone prowling knowingly beneath the surface. Coming in somewhere between The Cribs and The Long Blondes; The Complete Short Stories are energetic and lively. Uplifting chorus’s coupled with imperfect yet harmonious vocals aid each and every track. Upcoming single Burn is as vicious and poignant an attack on a former lover as you are going to hear this year, “man I’m gonna watch you burn” laments lead singer Kerry Adamson in a ferocious yet remorseful way.</p>\n<p>Value The One You Love is a moving ode to failing relationships and sobbing hearts, showing the groups’ songwriting diversity. Encompassing orchestral effects that build to an epic conclusion, one of the strongest and most emotionally stirring tracks on the record. There are touches of Be Your Own Pet and Metric amongst the frantic and at times claustrophobic songs, with so much going on it’s effortless to get lost in the midst of the variety of sounds.</p>\n<p>The Complete Short Stories is an apt name for the group, as these ten tracks are clearly aiming to accomplish just that. Concise story telling, poetic in nature is the basis of Perfectly Still. Ranging from the utmost agitated to the downright heartbreaking, there’s plenty for whatever mood you are in at the time.</p>\n<p>The bizarrely titled Fish Food summarizes the albums finest traits, majestic melodies and regal swirling harmonies, underpinned by a steady drum beat. The lyrical content is by no means exceptional, yet with the record not relying upon the strength of words, it’s understandable. With this their first full length release, the London seven piece have created a debut album to be proud of as well as providing a stable base to build upon for the future.</p>\n<p>The Complete Short Stories have kindly allowed us to give away a track from Perfectly Still, the beautiful Value The One You Love is available to download from below (right click, save as.)</p>\n<p><a rel=\"attachment wp-att-4444\" href=\"https://api.crackintheroad.com/music/4418-review-the-complete-short-stories-perfectly-still/attachment/05-value-the-one-you-love\">Value The One You Love</a></p>\n<p><a href=\"https://www.myspace.com/thecompleteshortstories\">The Complete Short Stories on Myspace</a></p>\n","slug":"4418-review-the-complete-short-stories-perfectly-still","category":"music","date":1297286306000,"wpid":4418,"isSticky":false,"featured_image":{"width":188,"height":188,"src":"2011/06/l_10139e485e394b11a4bc74787a670336-188x188.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFwAAAwEAAAAAAAAAAAAAAAAABAUGB//EACMQAAAEBgEFAAAAAAAAAAAAAAECAwQABRESITETBhRBUXH/xAAVAQEBAAAAAAAAAAAAAAAAAAABA//EABcRAAMBAAAAAAAAAAAAAAAAAAACESH/2gAMAwEAAhEDEQA/AMVYzRVjxGZytYLS0qY4jQhdBX2PyCnHWc1WcKq9+5SvMJuME8FqOteISTXErLTGtROmEbhyO4mrXRp//9k="},"createdAt":1587294760179,"updatedAt":1588403560766,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/06/l_10139e485e394b11a4bc74787a670336-188x188.jpg","categories":["music","reviews"]}