{"id":"5e9c32219b6559241525de51","title":"Exhibition Review: Larry Clark- What Do You Do For Fun? (London)","content":"<img class=\"alignnone\" title=\"Larry Clark\" src=\"https://farm4.</p><p>static.flickr.com/3038/3049451557_0d8cb28d40_b.jpg\" alt=\"\" width=\"1024\" height=\"778\" />\n<p><strong>Larry Clark</strong> is one of the most prolific photographers of our time. His work came at a time when the world simply wasn’t willing to accept, address or even talk about the issues that kids were and still are going through. It was daring, dark and in some ways purposely obnoxious. Of course consulting issues such as addiction, violence and sex comes with the baggage of controversy. The Parisian mayor for example banned his last exhibition ‘<em>Kiss The Past Hello</em>’ to those under the age of 18. If anything it revealed how relevant his work still is, despite <em>Clark</em> describing the move as “ridiculous”.</p>\n<p>So with ‘<em>Kiss The Past Hello</em>’ and the backlash that came with it now behind him, <strong>Clark</strong> returns to London with his new show ‘<em>What do you do for fun?’</em> a collection of vintage and more current pieces. The vintage work at points retains the relevance of its day, however <strong>Clark’s </strong>one piece from 2010 screams of an obsoleteness that the reaction in Paris did its best to distract from. Despite this, some of the older work still holds the disturbing power it did all those years ago. Works such as <em>Untitled (Cory Haim) </em>and <em>Untitled (Matt Dillon)</em> are stomach churning depictions of youthful sexuality. Although the older work that accompanies it can often stray into the area of simple shocks, especially with this level of hindsight, the work still manages to transfer a message today. <em>1992</em> is perhaps the most successful; consisting of 209 prints, the piece literally becomes a shrine of sadness, depression, and despair. With the photos sporting almost fashion like imagery, the result is a sterile, airbrushed and utterly overwhelming take on the subject matter. Grimly appropriate to the establishments and institutions that deal with this brand of behavior.</p>\n<p>What isn’t so successful is <strong>Clark’s </strong>later work. <em>I want a baby before u die</em>, his only recent piece seems forced and overly contrived. Babies are juxtaposed with pornographic imagery, newspaper clippings of brutal child related crimes are paraded and of course graphic images of ‘the naked youth’ are celebrated in a wincingly confident manner. The problem in many ways is the scale; it’s a large piece, and contains what can only be described as collection of disturbing party tricks that aim to address issues and themes sharply and quickly. So when looking back at <strong>Clark’s</strong> older work, pieces that aimed for the viewer to slowly digest the images in front of them, his more recent efforts now seem lazy. Finally, the film <em>Tulsa</em> was on display: a one-hour silent film made with footage of <strong>Clark</strong> as a young man. The small amount those at the opening managed to catch was disturbing, honest and prevailed in creating an almost fictional state of reality. It exonerated an arrogance that captured the time: young men shooting heroin in front of the camera and boys in the back seats of convertible cars. With many of those that starred in the film now deceased the film had a power that perhaps even <strong>Clark</strong> could not have anticipated. As I walked to leave the gallery I overheard a woman asking <strong>Clark</strong> a question, “what do you want people to think in your exhibition?” to which he replied smartly, “Whatever they like, you’d better ask them”. For me his reply summed up the show, whether we like it or not, time has passed since the early work’s initial conception, ultimately only the viewer can decide if the work still has relevance today.</p>\n<p><em><strong>Larry Clark’s</strong>, <strong>W</strong><strong>hat do you do for fun?</strong> is at the <strong>Simon Lee Gallery</strong> from 10 February to 2 April.</em></p>\n<p><span style=\"font-size: small;\"><em><br />\n</em></span></p>\n","slug":"4428-review-larry-clark-what-do-you-do-for-fun-london","category":"reviews","date":1297360241000,"wpid":4428,"isSticky":false,"featured_image":{"width":1024,"height":778,"src":"2011/06/3049451557_0d8cb28d40_b.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAIAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAAAAb/xAAgEAABBAIBBQAAAAAAAAAAAAAEAQIDEQAFMQYSEzKB/8QAFQEBAQAAAAAAAAAAAAAAAAAAAAL/xAAWEQEBAQAAAAAAAAAAAAAAAAAAEUH/2gAMAwEAAhEDEQA/AITonV6aAIoEooIsaSLvYQySK0lu+Fdbm0lVSfKyPOAJaaQkbNO9iSORrvNElpfPtjGTpH//2Q=="},"createdAt":1587294753974,"updatedAt":1588403560636,"author":"5e9b68b27a1236eccfeb1d24","old_image":"2011/06/3049451557_0d8cb28d40_b.jpg","categories":["reviews","arts"]}