{"id":"5e9c32209b6559241525de50","title":"Review: Paul Thomas Saunders (Manchester)","content":"<p>Finding myself at the fantastically refurbished <strong>Sound Control </strong>in Manchester (it still has that new venue smell .</p><p>.), the live performance area suitably matched the passionate acoustic stylings of <strong>Paul Thomas Saunders</strong>.</p>\n<p>Taking to the stage with his band, <strong>The Fever Dreams</strong>, <strong>Saunders </strong>cuts the figure of an introspective musician, raising his voice (apart from when he was singing) no louder than a whisper and hiding behind his fringe. A final year art student, <strong>Saunders </strong>sound is inspired by the likes of <strong>Leonard Cohen </strong>and <strong>Joe Meek</strong>, and<strong> </strong>has been gaining a great deal of attention of late, which has only been furthered with numerous plays on <strong>BBC Radio 6</strong>.</p>\n<p>Beginning very unassumingly, I was initially disappointed by <strong>Saunders </strong>& co. The normally delicate tones of his powerfully calm vocals were lost in his live performance, and instead it all felt a bit moan-y. While <strong>Saunders </strong>never managed to replicate the majesty of his recorded tracks during his set, things did improve and his vocals began to gain a sense of clarity, and as a result his poetic lyrics were done justice. Musically, the performance was superb, with <strong>Fruits of the Poisonous Tree </strong>being a particular highlight in which <strong>Saunders </strong>was able to hyponitize the audience into a level of quiet serenity. I believe had I not listened to <strong>Saunders</strong>‘ tracks before the gig, I would have been a lot more impressed than I was. However we must bare in mind how difficult it is to capture the fragility and quiet power in <strong>Saunders</strong>‘ sound, and I’m sure that he will only improve as <strong>Saunders </strong>is very much at the beginning of his musical development, Evidence of this could be seen as he played a new track he’d only written ‘in the past week’.</p>\n<p>7/10</p>\n<p>Definitely a musician to watch out for, make sure to buy a copy of his incredibly moving debut EP, ‘<strong>Lilac and Wisteria</strong>‘!</p>\n<p><strong><a href=\"https://www.myspace.com/paulthomassaunders\" target=\"_blank\">Paul Thomas Saunders Myspace</a></strong></p>\n","slug":"4441-review-paul-thomas-saunders","category":"music","date":1297362471000,"wpid":4441,"isSticky":false,"featured_image":null,"createdAt":1587294752528,"updatedAt":1588441790232,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2011/02/paul-thomas-saunders-188x188.jpg","categories":["music"]}