{"id":"5e9c321f9b6559241525de4f","title":"American Splendor: Escapism for Realists","content":"<p>It has been a shitty day.</p><p> The milk in your coffee was sour. You didn’t catch the eye of that girl you like and you’ve been waiting for this bus for an hour. You can’t wait to get home, pick up a book or slide in a DVD and immerse yourself in a world more exciting than your own. This is escapism, mental diversion from the banality of real life. But however hard you try to ignore it, the real world sucks and sooner or later you better get used to it. <strong>American Splendor</strong> is a comic book that tackles this very issue.</p>\n<p>The words<strong> </strong>‘comic book’ conjure up images of spandex-clad megalomaniacs, zooming round dot-shaded cityscapes, shooting lasers from their eyes and taking down super villains before they know whats hit them.  For Harvey Pekar ‘comic book’ could mean anything, from getting pissed off queuing for groceries to trying to find a rare record in a yard sale. Pekar is the master of realist comic book writing and American Splendor is his lovechild</p>\n<p><a href=\"https://api.crackintheroad.com/arts/4451-american-splendor-escapism-for-realists/attachment/tumblr_kr7p8k7vhu1qzwjl9o1_400/\" rel=\"attachment wp-att-4531\"><img class=\"size-full wp-image-4531 alignleft\" src=\"https://admin.crackintheroad.com/uploads/2011/02/tumblr_kr7p8k7vHU1qzwjl9o1_400.jpg\" alt=\"\" width=\"184\" height=\"269\" srcset=\"https://api.crackintheroad.com/images/2011/02/tumblr_kr7p8k7vHU1qzwjl9o1_400-260x382.jpg 260w, https://api.crackintheroad.com/images/2011/02/tumblr_kr7p8k7vHU1qzwjl9o1_400-165x242.jpg 165w\" sizes=\"(max-width: 184px) 100vw, 184px\" /></a>Harvey Pekar (1939-2010) was born in Cleveland, Ohio to a corner-store owning Jewish family. His childhood was nothing special, graduating from high school and dropping out of university when compulsory maths classes got too much. He served in the Navy before taking up a number of menial odd-jobs including that of a file clerk which he kept until 2001. it was this mediocre existence that inspired him. He got together his ideas, staying up all night writing, and all day taking inspiration from his dead-end job.  Eventually he compiled a few pages of scrawled frames and perfectly phrased captions. He met friend and already renowned underground artist , Robert Crumb, in a coffee shop and asked him what he thought. Crumb loved the ideas and  offer to illustrate Pekar’s squiggly stick-man cartoons into the first issue of American Splendor, published in 1976.</p>\n<p>Harvey Pekar wrote about the trivialities of real-life, the problems we all face, none of this kryptonite and crime-fighting, just the straight up truth of this nitty gritty world we live in. He described American splendor as: <strong>“<em>an autobiography written as it’s happening. The theme is about staying alive. Getting a job, finding a mate, having a place to live, finding a creative outlet. Life is a war of attrition. You have to stay active on all fronts. It’s one thing after another. I’ve tried to control a chaotic universe. And it’s a losing battle. But I can’t let go. I’ve tried, but I can’t”</em></strong></p>\n<p>First self-published, American Splendor went on to be printed by Dark Horse and DC comics. Harvey himself became a TV personality when he made numerous appearances on the <a href=\"https://www.youtube.com/watch?v=KxqHb5dIo9I&feature=related\">Letterman show</a> hoping to promote his comics. These appearances came to an abrupt end when Harvey became sick of being stuck under a spotlight and poked fun at for being grumpy and himself. Letterman refused to believe that Harvey Pekar sincerely had to keep up his day job to pay the bills.</p>\n<p>Battling depression and constantly fighting to make enough money to support his wife and pay rent. Pekar wrote not for fame, nor for riches, purely to highlight the struggle of the common man. A nineteenth-century Walt Whitman, hunched over and shuffling round Cleveland with a pen and paper, recording day-to-day interactions of the general public.</p>\n<p>With 39  issues, now all available in collected paperback anthologies, American Splendor was a comic like no other. The life of Harvey Pekar was adapted into a 2003 film narrated by the man himself which received some critical acclaim and brought Pekar a little closer into the limelight from the shadows of the underground he felt so comfortable with. An eccentric and a cynic to the end, Harvey Pekar was found dead on 1 a.m, July 12, 2010 by his wife. He had overdosed on anti-depressants.</p>\n<p>I’m not denying there’s not a place for web cartridges and claws. Whilst Spiderman symbolises geeks  fighting back and Catwoman signifies a society of repressed female sexuality, Harvey Pekar represents us all, fighting to get along in this wicked world one day at a time.</p>\n<p>Check out the <a href=\"https://www.amazon.com/gp/product/0941423646?ie=UTF8&tag=samg02-20&linkCode=as2&camp=1789&creative=390957&creativeASIN=0941423646\">American Splendor anthology</a><img style=\"border: none !important; margin: 0px !important;\" src=\"https://www.assoc-amazon.com/e/ir?t=samg02-20&l=as2&o=1&a=0941423646\" alt=\"\" width=\"1\" height=\"1\" border=\"0\" /> at Amazon.com.</p>\n<p><a class=\"aligncenter\"><img class=\"aligncenter\" src=\"https://api.crackintheroad.com/images/2011/02/surplus-publishing-460x448.jpg\" alt=\"\" width=\"460\" height=\"448\" /></a> It has been a shitty day. The milk in your coffee was sour. You didn’t catch the eye of that girl you like and you’ve been waiting for this bus for an hour. You can’t wait to get home, pick up a book or slide in a DVD and immerse yourself in a world more exciting than your own. This is escapism, mental diversion from the banality of real life. But however hard you try to ignore it, the real world sucks and sooner or later you better get used to it. American Splendor is a comic book that tackles this very issue…</p>\n","slug":"4451-american-splendor-escapism-for-realists","category":"arts","date":1297422646000,"wpid":4451,"isSticky":false,"featured_image":null,"createdAt":1587294751904,"updatedAt":1588441790203,"author":"5e9b68b27a1236eccfeb1d40","old_image":"2011/02/americansplendor-292x50.jpg","categories":["arts"]}