{"id":"5e9c32249b6559241525de57","title":"Film Review: Never Let Me Go","content":"<p><img class=\"alignnone\" title=\"Never Let Me Go\" src=\"https://www.</p><p>hemanthology.com/uploads/2011/02/2010_never_let_me_go_008-1024x680.jpg\" alt=\"\" width=\"1024\" height=\"680\" />Set in a modern dystopian Britain, Alex Garland’s adaptation of Kazuo Ishiguro’s Never Let Me Go was deservedly heralded as one of the films of last year. Directed by Mark Romanek, famed for his work on One Hour Photo and Static, it’s a hauntingly beautiful accomplishment. Visually stunning, combining a script documenting emotional turmoil, human endurance and immortal love, Never Let Me Go saw it’s DVD release earlier this month.</p>\n<p>Adapting books for films is an action I have never viewed as particularly successful in the majority of cases. There’s an underlying difficulty in converting what is delightful to enter the mind through written prose, and in turn stimulating to view visually. Although in my mind there is no doubting the achievement of Romanek in creating a film both visually enticing and emotionally engrossing.</p>\n<p>It’s a love story in the boldest sense, refined and alluring at it’s best, heartbreaking yet honest throughout.</p>\n<p>Never Let Me Go follows Kathy (Carey Mulligan), a sophisticated, level headed donor, coming to terms with her purpose in life, whilst dealing with the trials of tribulations of dynamic love. Andrew Garfield plays Tommy, the awkward albeit delectable young man, finding his feet amongst the path that has been chosen for him. Keira Knightley also stars as Ruth, Kathy’s closest female companion, selfish but sequentially veracious at heart. Centred around Mulligan and Garfield, whom both excel in their roles, coming across as insincere, youthful and charmingly innocent. Their short lives are elegantly intertwined, ultimately revealing the undying yet merciless power of true love.</p>\n<p>The script is kept as minimal and to the bare essentials as possible, the fascination being in what is not spoken, rather that what is. Each shot is expertly tailored, and precisely considered, to allow for polished relationships to form and be exaggerated between characters.</p>\n<p>However it never comes across as contrived or corny, summarized beautifully by one of the final scenes, where we witness Tommy screaming in anguish, fear and frustration, only to be comforted and calmed by the headstrong Kathy. The message is obvious yet portrayed artistically, love will out.</p>\n","slug":"4452-film-review-never-let-me-go","category":"reviews","date":1297348823000,"wpid":4452,"isSticky":false,"featured_image":{"width":188,"height":188,"src":"2011/06/2010_never_let_me_go_008-1024x680-188x188.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAAAwb/xAAhEAACAgEDBQEAAAAAAAAAAAABAgMRBAASIQUGByJBMv/EABUBAQEAAAAAAAAAAAAAAAAAAAMF/8QAGREAAQUAAAAAAAAAAAAAAAAAAAECEhNR/9oADAMBAAIRAxEAPwCvyfJ3cOPiO8LDKlUkGMYy7lpftcXemh8tdXaFGljx45CoLIcVrU/R+tT8XpAu313ZBuuL05As8DU612ixQ//Z"},"createdAt":1587294756420,"updatedAt":1588403560691,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/06/2010_never_let_me_go_008-1024x680-188x188.jpg","categories":["reviews","arts"]}