{"id":"5e9c321c9b6559241525de49","title":"Review: Bright Eyes – The People’s Key","content":"<p><img class=\"alignnone\" title=\"Bright Eyes\" src=\"https://soundsuck.</p><p>com/images/oberst.jpg\" alt=\"\" width=\"1024\" height=\"768\" />With this, their tenth and final album, Bright Eyes, wave a weary and sentimental goodbye to the music industry. A business growing ever more unforgiving and less impassioned by the day; how it has changed in the fifteen years since the formation of the Omaha based group. Whilst it’s true that the output of Oberst and co has been somewhat questionable in recent years, there’s no doubting his songwriting talent, stunningly portrayed on 2000’s Fevers & Mirrors.</p>\n<p>Seemingly coming to terms with the heartless industry, Bright Eyes allowed two tracks from The People’s Key, to be made available as a free download. A step that would have been unimaginable at the turn of the Millennium, even if purely for the disjointed feel it may have given the record upon first listen.</p>\n<p>In what has become a Bright Eyes tradition, the record is opened by a spoken verse segment, in this case an investigative speech from Danny Brewer of Refried Ice Cream. Two and a half minutes into Firewall and Conor interjects with his stereotypical, elegant drawl. Although it’s not an entirely convincing introduction to The People’s Key, it shows the apparent air of conviction in confusion that appear to surround this album. Where the listener shall be taken from here is shrouded in mystery and trepidation, yet with Bright Eyes we know this is exactly how it is intended.</p>\n<p>Late last year Saddle Creek offered Shell Games as a taster of The People’s Key, and it’s certainly a fair portrayal of the records best traits. Intricate and insightful lyrics, solid musicianship wrapped in a thinly woven veil of turbulence. Whilst on earlier releases it appeared Conor was writing from personal life experience, these tracks are more mature both in sound and lyrical content, detracting slightly from the emotional fragility we’d grown to love. “My private life is an inside joke, no one wants to share it with me” bemoans Conor, but it doesn’t come across as completely authentic, at least far from the honesty experienced on Fevers & Mirrors.</p>\n<p>These are unashamedly folk inspired pop tracks, there’s no hint of depression, heartbreak or suffering, three themes that were overbearing on previous records. However this is to be expected, no one can spend their whole life documenting gloomy surroundings, especially when you’re engulfed in the success that Bright Eyes have experienced. As The People’s Key goes on it picks up in quality, A Machine Spiritual harks back to I’m Wide Awake It’s Morning era Bright Eyes and the upbeat Triple Spiral is Conor at his intuitive best.</p>\n<p>With all I’ve said so far, you’d be forgiven for thinking I’m not too fond of this album, there’s nothing offensive to the ears, far from it, it’s a pleasant listen, just not as engrossing or emotionally creative as previous releases. Yet almost as if to leave us with a lingering taste of true discerning, conscientious Bright Eyes, the two tracks that close The People’s Key are some of the finest work they’ve ever produced. Ladder Song is a heart-wrenching ballad, seemingly yearning for the joy of days past, “if I’ve got to go first, I’ll do it on my terms”, openly weeps Oberst. There’s an admirably honesty about the track, as Conor spills all with the finest lyrical content of the record. Album closer One For Me, One For You is an optimistic tune, finding innumerable positives in everyday life in a way that only Bright Eyes are able to. They will be sorely missed, however it’s their previous works that will cement their name in musical history, and one can’t help but feel that The People’s Key will have to be filed under further listening. So it’s with a heavy heart that we wish Bright Eyes all the best with their future endeavors, thanks for the incandescent memories and wave them a fond farewell.</p>\n","slug":"4496-review-bright-eyes-the-peoples-key","category":"music","date":1297458473000,"wpid":4496,"isSticky":false,"featured_image":{"width":1024,"height":768,"src":"2011/06/oberst.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAIAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAAAAf/xAAiEAABAgYBBQAAAAAAAAAAAAABAgMABAUREiEHExQiMWH/xAAUAQEAAAAAAAAAAAAAAAAAAAAB/8QAFREBAQAAAAAAAAAAAAAAAAAAAAH/2gAMAwEAAhEDEQA/AJjK8bSc9xO9XZaqMqnWcHVMrHTDaTiFDyVfQIUSQAQrV9RN+wp40urN5D3iwsi/w23CEEL/2Q=="},"createdAt":1587294748759,"updatedAt":1588403560583,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/06/oberst.jpg","categories":["music","reviews"]}