{"id":"5e9c32199b6559241525de43","artists":["5e9b69317a1236eccfeb243e"],"title":"Review: PJ Harvey – Let England Shake","content":"<p><a rel=\"attachment wp-att-4712\" href=\"https://admin.</p><p>crackintheroad.com/music/4580-review-pj-harvey-let-england-shake/attachment/minolta-dsc\"><img class=\"alignnone size-full wp-image-4712\" title=\"Minolta DSC\" src=\"https://api.crackintheroad.com/uploads/2011/02/PJ_Harveyuse.jpg\" alt=\"\" width=\"800\" height=\"649\" srcset=\"https://api.crackintheroad.com/images/2011/02/PJ_Harveyuse.jpg 800w, https://api.crackintheroad.com/images/2011/02/PJ_Harveyuse-260x210.jpg 260w, https://api.crackintheroad.com/images/2011/02/PJ_Harveyuse-640x519.jpg 640w, https://api.crackintheroad.com/images/2011/02/PJ_Harveyuse-165x133.jpg 165w\" sizes=\"(max-width: 800px) 100vw, 800px\" /></a></p>\n<p>Monday sees the much anticipated release of the eighth studio album from PJ Harvey; focusing on the trials and tribulations of war, Let England Shake has so far been met with phenomenally positive reviews. Trying to wipe any preconceived bias from my mind, I gave the record a listen, hoping for it to emulate the emotional fragility expressed on 2007’s White Chalk.</p>\n<p>Title track Let England Shake opens the album in upbeat fashion, an insanely catchy melody intertwines with Polly’s elegantly delivered lyrics. However, the content is far more depressive than the sound would have you believe, “England’s dancing days are done” bemoans Harvey. Only someone who had grown up in England could soliloquize about it with so much honesty and passion. Next track, The Last Living Rose is a rawer affair, with PJ Harvey yearning to return to her home country,  vividly painting a picture of “fog rolling down behind the mountains, on the graveyards and dead sea captains”.</p>\n<p>Only two tracks in, Let England Shake already has a real feeling of being a record best listened to in it’s entirety, there’s an all encompassing flow between tracks that sucks you into the world Harvey so expertly paints. The sole single release so far from the album, The Words That Maketh Murder is a slice of pop heaven; male backing vocals add an extra dimension to the track, harking back to her To Bring You My Love era.</p>\n<p>In both the make up, and production of the record I’m reminded of Anais Mitchell’s Hadestown, recounting a heart wrenching story with inspirational, moving style. On England we hear Harvey again reminiscing about her beloved home country, as many soldiers bravely serving overseas will have found themselves doing time and time again. Bitter Branches is an intrinsic account of fighting on the front lines, chronicling the emotional struggle faced every minute by these courageous individuals.</p>\n<p>Documenting earth shattering love and our fascination with human interaction has always been a key feature of popular music, yet strangely enough recounting harrowing war memories has never been intensely scrutinized through the medium of music. For a subject that has been such an undeniable part of our lives for the last century, to receive as striking and substantial coverage as Let England Shake, is a much welcome shock to the system. Whilst we will never truly understand the turmoil and horrific scenes experienced out on the front lines, Let England Shake is as an exquisite, honorable insight as I have undergone.</p>\n<p><script src=\"https://video.unrulymedia.com/wildfire_11244048.js\" type=\"text/javascript\"></script></p>\n","slug":"4580-review-pj-harvey-let-england-shake","category":"music","date":1297615822000,"wpid":4580,"isSticky":false,"featured_image":{"width":800,"height":649,"src":"2011/02/pj_harveyuse.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAIAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAYH/8QAIBAAAgEDBAMAAAAAAAAAAAAAAQIEAAMRBRITIUFSkf/EABQBAQAAAAAAAAAAAAAAAAAAAAP/xAAXEQEAAwAAAAAAAAAAAAAAAAABAAMR/9oADAMBAAIRAxEAPwDIpMCBY0Pgl5sz7Y3pdLKA7Mw6I7JQKDgjzUzhPY/KUoqlTWPYA5P/2Q=="},"createdAt":1587294745417,"updatedAt":1588403560522,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/02/pj_harveyuse.jpg","categories":["music","reviews"]}