{"id":"5e9c345d9b6559241525e1fd","title":"Interview: Frank Turner","content":"<p style=\"text-align: center;\">‘<em>I bought my soul back from the Devil/And now I’m keeping it all to myself</em>‘, and so begins <strong>Frank Turner</strong>‘s most recent, and critically acclaimed, album ‘<strong>Poetry of The Deed</strong>‘.</p><p> Created in his post-hardcore origins, <strong>Frank Turner</strong>‘s acoustic sound rages with the burning desire to cast aside the oppressing evils of the world, and to pursue an anarchic passion to enjoy life while we can. Currently touring around Australia, New Zealand and China, <strong>Frank Turner </strong>kindly found time to answer a few of our questions.</p>\n<p style=\"text-align: center;\"><em>CITR:</em> If you had to cite one band/artist as a major influence upon you, who would it be?</p>\n<p style=\"text-align: center;\"><strong>Probably Bruce Springsteen. He’s such an incredible singer, songwriter, lyricist and performer. I always go back to his work and find new inspirations.</strong></p>\n<p style=\"text-align: center;\"><em>CITR:</em> What has been your favourite gigging experience to date?</p>\n<p style=\"text-align: center;\"><strong>There are too many to choose from. The last UK headline tour was very special, playing venues of that size (like the Roundhouse), but then I played a sold out bar show in Vancouver the other day that was awesome as well.</strong></p>\n<p style=\"text-align: center;\"><em>CITR:</em> What inspired you to move from the post-hardcore nature of ‘Million<br />\nDead’ to the your now more acoustic grounding?</p>\n<p style=\"text-align: center;\"><strong>Many things. Partly just a changing taste in music as I got older, partly feeling pretty bored with hardcore, partly the stress of the band breaking up. I tried it out and felt like I’d found my place in life,<br />\nwhich was a good feeling. Still is. </strong></p>\n<p style=\"text-align: center;\"><em>CITR:</em> Two of your songs, ‘The Journey of the Magi’ and ‘I knew Prufrock Before</p>\n<p style=\"text-align: center;\">He Got Famous’ appear to allude to poems written by T. S. Eliot.<br />\nArguably both of the poems alluded to demonstrate feelings of defeat and<br />\nmundanity, whereas your respective songs appear to promote a more<br />\npositive and proactive approach to life. How important is this contrast<br />\nto you not only in these songs, but in all of your work?</p>\n<p style=\"text-align: center;\"><strong>I’m a big fan of Eliot, and many other modernist poets as well (Auden, Larkin etc.). I guess it’s probably fair to say that I have a slightly more optimistic bent than Eliot, haha, I hadn’t thought about it like<br />\nthat before. But I suppose you could say that one of my overarching themes is laughing in the face of  adversity (or reality, depending on how you want to look at it). Life is nasty, brutish and short, so we might as well have fun with it.</strong></p>\n<p style=\"text-align: center;\"><em>CITR: </em>You established yourself as a well known artist after years of extensive<br />\ntouring, with word of mouth playing a great part in people’s recognition<br />\nof your music. With many current artists trying to reach out to their<br />\naudience through online mediums such as myspace, how important would you<br />\nsay touring is to the development of yourself as an artist and your music?</p>\n<p style=\"text-align: center;\"><strong>It’s been very important for me, I’m pretty old fashioned in that sense.<br />\nI think it can be important for bands, but it doesn’t have to be, the<br />\ninternet is a very powerful medium. I don’t like to try and draw general<br />\nrules on music industry progress from my own experience, I’m not sure<br />\nI’m a paradigm. Ha.</strong></p>\n<p style=\"text-align: center;\"><em>CITR:</em> When can we expect to a new album to be released? In what ways will it<br />\nbe a development from ‘Poetry of the Deed’?</p>\n<p style=\"text-align: center;\"><strong>I’m working on a lot of new material right now, but I’m also not in as<br />\nmuch of a hurry as I have been in recent years – I’m quite into the idea<br />\nof letting these songs percolate for a while longer, so far I’ve been<br />\nworking on the “release and be damned” approach, I think it’d be fun to<br />\nlet things settle a little more. Directionally-speaking, who knows. I’m<br />\ndeeply into Nick Cave, Gomez and The Band at the moment. Go figure.</strong></p>\n<p style=\"text-align: center;\"><em>CITR: </em>PC or Mac?</p>\n<p style=\"text-align: center;\"><strong>Mac please. I like computers that work!</strong></p>\n<p style=\"text-align: center;\"><em>CITR:</em> What was the funniest thing you did/witnessed at University?</p>\n<p style=\"text-align: center;\"><strong>Hm, it was quite a while ago now, and I spent most of that time running<br />\naround with Million Dead anyways. Pass.</strong></p>\n<p style=\"text-align: center;\"><strong><span style=\"font-weight: normal;\"><a href=\"https://www.myspace.com/frankturner\" target=\"_blank\">Check out Frank Turner’s Myspace!</a></span></strong></p>\n<p><iframe src=\"https://www.facebook.com/plugins/likebox.php?id=114090381951328&width=292&connections=10&stream=false&header=false&height=255\" scrolling=\"no\" frameborder=\"0\" style=\"border:none; overflow:hidden; width:292px; height:255px;\" allowTransparency=\"true\"></iframe></p>\n","slug":"459-5-minutes-with-frank-turner","category":"interviews","date":1272353138000,"wpid":459,"isSticky":false,"featured_image":{"width":4368,"height":2912,"src":"2010/04/sendfrankcat-2.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAUH/8QAIBAAAgEDBAMAAAAAAAAAAAAAAQIDAAUGBBEUMRMhQf/EABQBAQAAAAAAAAAAAAAAAAAAAAX/xAAdEQACAgEFAAAAAAAAAAAAAAABAgAEEgMRITHB/9oADAMBAAIRAxEAPwCFml6nvONPzDHw7dEynxJsULeyAD2Oz3WVLk95jUJBd9QsSjZACRsvylKKoudZSX5IPkQtNjio62n/2Q=="},"createdAt":1587295325363,"updatedAt":1588403568602,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2010/04/sendfrankcat-2.jpg","categories":["interviews","music"]}