{"id":"5e9c320c9b6559241525de2b","artists":["5e9b69377a1236eccfeb2478"],"title":"Track by Track Review: Radiohead – The King of Limbs","content":"<p><img class=\"alignnone\" title=\"Radiohead\" src=\"https://3.</p><p>bp.blogspot.com/_ZVkb0M61jmc/TEx3YCA0CYI/AAAAAAAAA98/r3dq0G5nGKY/s1600/Radiohead.jpg\" alt=\"\" width=\"1024\" height=\"843\" />So it’s been the music story of the month, if not the year. With music bloggers, journalists and fans chomping at the bit for tomorrows release of Radiohead’s new record The King Of Limbs, the Oxford group decide to unleash a surprise. Allowing the download link for the album to go live twenty four hours before planned was a bold move, again keeping fans and fanatics alike on the edges of their seats. However, we should remember that they are still a band, and should be judged upon their music, so will The King Of Limbs live up to the fans monumental expectations?</p>\n<p>Bloom</p>\n<p>Opening with a disjointed James Blake sounding rhythm, Yorke’s haunting voice is complimented by swirling atmospheric violins. The incoherent drum beat, underlay-ed is somewhat overpowering, allowing the track to descend into a muddled, almost aimless confusion of numerous elements.</p>\n<p>Morning Mr Magpie</p>\n<p>This time the guitar takes the lead, allowing Yorke’s brooding voice to emanate far more effectively. Rumbling bass gradually crescendos alongside a cataclysm of pulsating sirens and repetitive hi-hats, before fading out into a fuzz of bird song and reverb.</p>\n<p>Little by Little</p>\n<p>Yorke’s voice carries the track, whilst the bulkiest guitar riff so far underpins what is again chaotic sounding rhythmic sections. These are the vocals we’ve grown to love from Radiohead, and showcase Yorke at his utmost vunerable, he bemoans in agony “I’m such a tease and you’re such a flirt”.</p>\n<p>Feral</p>\n<p>Echoed vocals add an extra dimension to yet another varied, quirky rhythmic track. Dubstep influenced in it’s delivery and production, with Kid A vibes loitering on the outskirts. Easily the most energetic and exciting track so far.</p>\n<p>Lotus Flower</p>\n<p>Chosen by the group as the “first single”, and it’s obvious why. A beautifully powerful track, elegant yet authoritative. “There’s an empty space inside my heart” weeps Yorke, over the top of subtle but enigmatic beats.</p>\n<p>Codex</p>\n<p>A piano led ballad, again oozing with an otherworldly yet natural feeling. The looping chords gracefully provide a foundation for the tension that surrounds the rest of the track. Layers build up over time before a cello led string section enters, adding another dimension to the wall of sound.</p>\n<p>Give Up The Ghost</p>\n<p>Almost entirely acoustic, layered vocals form an integral part of the track, barely audible at times under repeated phrases. Appearing emotionally fragile, it’s relatively new ground for them, “I think I should give up the ghost” wails Yorke, amongst several other sampled vocals.</p>\n<p>Separator</p>\n<p>Like the rest of the album, this track is almost drowned in reverb laden melodies. Opting for a far more cohesive flow than other songs on the record, the percussion is again a focal point. There’s an entrancingly ostentatious vibe to it, certainly ending the album on a high note.</p>\n<p>Overall</p>\n<p>It’s certainly not immediate, however there is an underlying feeling that given time the record with mature into the exquisite spectacle that everyone expected. Unfortunately, whether people will allow it this time will remain to be seen, their dedicated fans will stand by them, but the casual listener may not be quite so immersed. Enough from me now, let us know what you think of it!</p>\n","slug":"4663-track-by-track-review-radiohead-the-king-of-limbs","category":"music","date":1298046235000,"wpid":4663,"isSticky":false,"featured_image":{"width":1024,"height":843,"src":"2011/06/radiohead.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAIAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAAAAT/xAAiEAABAwQBBQEAAAAAAAAAAAABAgMEAAUGESESIjEyQZH/xAAUAQEAAAAAAAAAAAAAAAAAAAAA/8QAFBEBAAAAAAAAAAAAAAAAAAAAAP/aAAwDAQACEQMRAD8AkzTK48jP3YFtYZksrhCPEipLaEpdSkqU9rWueR3HZ+DxVYxlogFy623rPtqORz+0pQf/2Q=="},"createdAt":1587294732234,"updatedAt":1588403560309,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/06/radiohead.jpg","categories":["music","reviews"]}