{"id":"5e9c32049b6559241525de1c","title":"Review: White Lies (Newcastle)","content":"<p><a rel=\"attachment wp-att-4737\" href=\"https://admin.</p><p>crackintheroad.com/music/4735-review-white-lies-newcastle/attachment/white-lies-outdoor-1\"><img class=\"alignnone size-medium wp-image-4737\" src=\"https://api.crackintheroad.com/uploads/2011/02/white-lies-outdoor-1-288x176.jpg\" alt=\"\" width=\"288\" height=\"176\" /></a></p>\n<p>I’ve always found that the best way to gauge a band’s success, when it comes to live performances, is through the reactions of the crowd. A band can be technically brilliant, filled with energy, and brimming with talent, but if the crowd doesn’t care, then what’s the point? This philosophy came in particularly useful at White Lies’ set in Newcastle’s O2 Academy, where the crowd turned out to be ever-fluctuating between the two extremes of “completely mental” and “downright bored”.</p>\n<p>It certainly wasn’t random – there was an obvious pattern to the high and low-points of the night, and I’m sure a few people could already guess what that is. Simply put, most of the songs (bar the fantastic single, <strong>Bigger Than Us</strong>) from <a href=\"https://admin.crackintheroad.com/music/4026-review-white-lies-ritual\"><strong>Ritual</strong></a>, the band’s latest album, were met with a lukewarm reception – in my opinion, rightly so. Most tracks off that album, though well-performed, just don’t seem to work as live songs – at least, they don’t seem to be able to stir a crowd into a frenzy. Exceptions to this do exist – the aforementioned closing song <strong>Bigger Than Us</strong> received the best reception of the night, and was one of the most fun songs I’ve seen live in a long time, whilst <strong>Strangers </strong>and <strong>The Power & The Glory</strong> went down particularly well with the crowd. It’s just a shame that, for most of the other songs from <strong>Ritual</strong>, a large portion of that crowd was content with standing still and seeming largely unaffected by the band playing on-stage. Whether this is because <strong>Ritual</strong> is recently released, and hasn’t quite worked its way into the public consciousness, or just due to the failings of the album itself, I can’t tell – but for a few mid-set songs, it seemed very much like I was just watching a particularly crowded support act.</p>\n<p>It is with the songs from the band’s first album, <strong>To Lose My Life…</strong> where the band really shone. <strong>Unfinished Business</strong> and <strong>Death</strong> went down a storm, and truly demonstrated the band at their best. They seemed right at home with these songs, and the crowd responded in turn, displaying an aura of bliss that I haven’t seen at a gig for a very long time.</p>\n<p>Had the band been able to maintain the highs of the latter quarter of the setlist (which saw the standout performances of the night, in <strong>Death</strong>, <strong>Unfinished Business</strong>, <strong>The Power & The Glory</strong> and <strong>Bigger Than Us</strong>), this could truly have been an incredible gig. Unfortunately, however, the sub-par second album songs failed to live up to this, and really helped to make the night stop short of brilliant. I won’t say it wasn’t good – it was great fun – and I would find it damned hard to find someone who didn’t enjoy themselves – and the technical skill and performance of the band was nigh-on perfect. It was, essentially, an almost-perfect gig, unfortunately marred by a few dull, uninteresting, and very below-average songs.</p>\n","slug":"4735-review-white-lies-newcastle","category":"music","date":1298205172000,"wpid":4735,"isSticky":false,"featured_image":{"width":640,"height":392,"src":"2011/02/white-lies-outdoor-1.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAGAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAAAAb/xAAfEAABBAIDAQEAAAAAAAAAAAABAgMEBQYRABIhMUH/xAAUAQEAAAAAAAAAAAAAAAAAAAAC/8QAFhEBAQEAAAAAAAAAAAAAAAAAAAER/9oADAMBAAIRAxEAPwCvqMpt8dl4jSTZhmzLWdNadkrQF6bR2Wn06Pba2xv8CT98HL6kx63Zpa9qbkk16UiO2l1wJSe6wkdj6N+nfHHDtJ//2Q=="},"createdAt":1587294724509,"updatedAt":1588403560179,"author":"5e9b68b27a1236eccfeb1d16","old_image":"2011/02/white-lies-outdoor-1.jpg","categories":["music","reviews"]}