{"id":"5e9c31e09b6559241525dddd","artists":["5e9b69517a1236eccfeb2610"],"title":"New: The Hidden Words – Track Preview","content":"<p><a rel=\"attachment wp-att-4787\" href=\"https://admin.</p><p>crackintheroad.com/music/4776-new-the-hidden-words-track-preview/attachment/hiddenwords\"><br />\n</a>Ex-Unicorn and Clues member Alden Penner has re-united with old compadre Jamie Thompson in a new project, The Hidden Words. This is a  track from their first album slated for release in Spring 2011</p>\n<p><a rel=\"attachment wp-att-5003\" href=\"https://api.crackintheroad.com/music/4776-new-the-hidden-words-track-preview/attachment/the-hidden-words-temple-mystique\">The Hidden Words – Temple Mystique</a> (MP3)</p>\n<p>The Hidden Words play music inspired by the Bahá’í Faith. Soft and soothing guitar, reminiscent of many of Penner’s solo releases, with the subtle yet sophisticated beatmaking of Thompson, carrying the vocals along like a rowboat down a river. Starting rehearsal sessions at a local Bahá’í centre in Montreal, the duo soon attracted a crowd of regulars taking part in their jam session. Thus, The Hidden Words were born, Neah Bahji Kelly playing cello, the brothers James and Eric Farr on  second guitar and accordion. Marie-Claire Saindon contributing to the orchestration and textures.</p>\n<p>Alden Penner rose to fame in 2003 with Nick ‘Diamonds’ Thorburn and Jamie Thompson as The Unicorns. The one and only full length album the by band, “Who Will Cut Our Hair When We’re Gone,” was included in Pitchforks top 100 albums of 2000-2004 and the band, who’d previously released their own fuzzy circuit bent lo-fi on tapes in Montreal, burst into the limelight. After emerging from the underground, the band toured the world until exhaustion. Arguments on stage during a show at the Engine Room in Houston led to a break-up when Alden was quoted as saying “I quit, I can’t do this anymore.” He returned to Montreal and, like an effeminate Jeff Mangum, disappeared</p>\n<p>Three years later, Alden emerged from the Canadian woodwork and formed Clues with ex-Arcade Fire member Brendan Reed & Bethany Or. Their self titled first release was a dark, brooding and somewhat confusing mix of orchestral anthems and understated acoustics. After Or left the band Ben Borden, Lisa Gamble and Nick Scribner were added to the lineup. As far as I know Clues continue to play.</p>\n<p>Since the breakup of The Unicorns although keeping it lo-fi, Penner has been busy. He founded a short-lived record label, produced the soundtrack to indie film ‘The Hamster Cage,’ starred in a documentary about freecycling and contributed to a lot of other musician’s songs and videos. All the while avoiding the Internet and mainstream press like a rabbit dodging a fox. Returning to his roots but with a faith-driven direction to his music, perhaps one of the greatest songwriters of our generation has finally found his place.</p>\n<p>Sam Golden</p>\n<p>For more info on The Hidden Words check out their <a href=\"https://www.facebook.com/pages/The-Hidden-Words/170972952946190\">facebook page</a></p>\n","slug":"4776-new-the-hidden-words-track-preview","category":"music","date":1299317457000,"wpid":4776,"isSticky":false,"featured_image":{"width":795,"height":561,"src":"2011/02/hiddenwords.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAYH/8QAIRAAAQQBAwUAAAAAAAAAAAAAAQACAwQRBSEiBhIUMUH/xAAVAQEBAAAAAAAAAAAAAAAAAAADBP/EABcRAAMBAAAAAAAAAAAAAAAAAAABAhH/2gAMAwEAAhEDEQA/AMq6kl1JusNtRTeQLMbXF0wB3I7SQM+9lUAUccbk2PnAhEUChVK0Y//Z"},"createdAt":1587294688608,"updatedAt":1588403559635,"author":"5e9b68b27a1236eccfeb1d40","old_image":"2011/02/hiddenwords.jpg","categories":["music","reviews"]}