{"id":"5e9c31de9b6559241525ddda","artists":["5e9b694b7a1236eccfeb25b3"],"title":"Review: T G Elias – The Man In The Iron Cage & God’s Own Land","content":"<p><a rel=\"attachment wp-att-5032\" href=\"https://admin.</p><p>crackintheroad.com/music/4818-review-t-g-elias/attachment/joshreview\"><img class=\"alignnone size-full wp-image-5032\" title=\"joshreview\" src=\"https://api.crackintheroad.com/uploads/2011/03/joshreview.jpg\" alt=\"\" width=\"740\" height=\"452\" srcset=\"https://api.crackintheroad.com/images/2011/03/joshreview.jpg 740w, https://api.crackintheroad.com/images/2011/03/joshreview-260x158.jpg 260w, https://api.crackintheroad.com/images/2011/03/joshreview-640x390.jpg 640w, https://api.crackintheroad.com/images/2011/03/joshreview-165x100.jpg 165w\" sizes=\"(max-width: 740px) 100vw, 740px\" /></a></p>\n<p>Numerous male songwriters nowadays fall foul to the Dylan curse. As soon a male musician shows any sign of storytelling ability in their tracks, they immediately are branded with the Dylan tag. From Conor Oberst to The Tallest Man On Earth, it’s a comparison that is thrown about nonchalantly, and whilst there’s no doubting the talent of the crooner from Minnesota, it shouldn’t detract from any artists attempting to create and define their own sound.</p>\n<p>It remains to be seen whether Manchester based solo artist T. G. Elias will also suffer under this worn out cliche, if so, it would be a cruel injustice to his talent. With the release of two records last year, and another album in the works, it’s clear he’s highly driven as well as musically talented. His first record, the Americana influenced God’s Own Land is acoustic folk by numbers, insightful lyrics complete with rasping drawl.</p>\n<p>Album highlight Ball & Chain sees Elias at his most emotionally fraught lamenting “when the devil gets lonesome”. Whereas Is It The End… sees the guitarist asking questions of himself in an almost Bowie-esque fashion, bizarre lyrics add a complex dimension to the simplistic musical qualities. The words are undoubtedly the central motive behind God’s Own Land, highlight expertly on Hark Back The Hounds, it’s a record drenched in religious references and attributes.</p>\n<p>Next release The Man In The Iron Cage is a less spiritual affair, instead choosing to discuss events closer to home, such as living in “this Mancunian disaster” on album opener Rancid Misbehavior. For me, the subject matter is far more accessible, focusing on the intricacies of life rather than becoming caught up with religious propaganda. The Vagrant Son of A Policeman is another highlight, a ballad that again showcases the mystical, Bowie side to Elias, almost a sister track to Lily, Rosemary and the Jack of Hearts<strong></strong>. Sure, the Dylan comparison is unavoidable, but with these two diverse records, T.G. Elias has proved he deserves respect as an artist in his own right.</p>\n<p><a href=\"https://www.myspace.com/tgelias/music\">T.G. Elias on Myspace</a></p>\n<p><script type=\"text/javascript\" src=\"https://video.unrulymedia.com/wildfire_11244048.js\"></script></p>\n","slug":"4818-review-t-g-elias","category":"music","date":1299350616000,"wpid":4818,"isSticky":false,"featured_image":{"width":188,"height":188,"src":"2011/03/joshreview-188x188.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAABQQH/8QAIxAAAgECBgIDAAAAAAAAAAAAAQIDBBEABQYSITEiQSNSgf/EABQBAQAAAAAAAAAAAAAAAAAAAAD/xAAUEQEAAAAAAAAAAAAAAAAAAAAA/9oADAMBAAIRAxEAPwDINK6ZOb5fXZoakQUsdbtTcbCXx3ML2PQsf3CFVolo6mZJJ6ourkMY4wFJv646wVlJMFDCkBMayKxcJwG8fdu8WrUz7R80nX2OA//Z"},"createdAt":1587294686754,"updatedAt":1588443779634,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/03/joshreview-188x188.jpg","categories":["music","reviews"]}