{"id":"5e9c31f69b6559241525de01","title":"Review: Darwin Deez (Manchester Academy)","content":"<p>Didn’t get off to a flying start with this review as I managed to entirely miss the first band, <strong>Ram’s Pocket Radio</strong> (sorry).</p><p> However, I did manage to make it to Academy 2 in time for the other support, <strong>Totally Enormous Extinct Dinosaurs</strong>, and then for <strong>Darwin Deez</strong> when I felt compelled to push to the front (or, as near as I could get).</p>\n<p><strong>Ram’s Pocket Radio</strong></p>\n<p>Having missed the performance, and feeling really rather guilty, i went around the people lounging at the bar and asked them what their thoughts were on <strong>Ram’s Pocket Radio</strong>. General consensus was that <strong>Ram’s Pocket Radio</strong> was, indeed, impressive and that I had missed out. The words ‘piano pop’ seemed to be thrown around quite a few times, along with ‘very’ and ‘good’. A couple of the gig-goers were even heading to the merch stand to buy the CD, which is no mean feat after just a 20 minute set.</p>\n<p>(I think it would be wrong to give a mark out of 10, given that I didn’t see the performance, so I shan’t.)</p>\n<p><strong>Totally Enormous Extinct Dinosaurs</strong></p>\n<p>With a headdress that would make <strong>Jonsi</strong> jealous, and a lot of what my friend called ‘strobey goodness’, we were already off to a great start within the first appearance on stage of <strong>Orlando</strong> (aka <strong>Totally Enormous Extinct Dinosaur</strong>). The music is entirely infectious, and people-friendly. Not only this but on stage, he actually darts between drum machines, keyboards, synths not to mention singing live vocals for most of the songs, a testament to his musical talent as well as his penchant for multi-tasking. I really couldn’t stop myself from dancing to <strong>Totally Enormous Extinct Dinosaurs</strong>, which was especially welcomed when <strong>Orlando</strong> said to the audience “if you could put your hands in the air, turn around and dance like Russians, that’d be great”. I couldn’t get enough of the off-beat cowbells either.</p>\n<p>8/10</p>\n<p><strong> Darwin Deez</strong></p>\n<p><strong>Darwin Deez </strong>arrived on stage, with the phenomenally lanky and glittery-eyed Darwin Smith sporting his signature hairstyle and headband from his album cover. Their first port of call was to attempt to make the entire crowd bounce… and we did, of course. Opening their set with a rather slow rendition of <strong>‘Up In The Clouds’</strong> seemed risky, but it actually managed to set a rather good tone for the rest of the night; especially as the band were grinning all the way through. It’s so refreshing to see a band who not only seem to like each other, but also seem to really enjoy playing their own music. I had heard a little bit about <strong>Darwin Deez’s</strong> live show before I saw them, but even the little snippets I had heard (‘synchronised dance routines’ and ‘80s music’) didn’t prepare me for how well this performance would come across. The rather frequent choreographed interjections, which would happen every couple of songs, were a real hit with the crowd; one particular break with a routine to <strong>Enya</strong>’s ‘Orinoco Flow’ saw a mosh pit (I use that term loosely here, as it was more of a pushing love pit) form right behind me.</p>\n<p><strong>Darwin Deez</strong>’s music generally translated very well from the record across to the live show, and their incessant smiling was not creepy, but was entirely genuine and charming. There was a minor lapse in the middle, with the harmonies going slightly wonky on <strong>‘Bed Space’</strong>. Also, the attempt to get everyone swaying to <strong>‘The City’</strong> with it’s particular focus on the off-beat was, perhaps, a little too much to ask of the audience. Neither of these hiccups lasted particularly long, and we were rewarded for our attentiveness by a couple of songs that Darwin Deez said that they don’t normally play, the first was a seemingly out of kilter, rather slow and lamenting song featuring the lead guitarist on lead vocals, which contained some beautiful harmonies that were particularly well performed. <strong>Darwin</strong> then did a cover of <strong>Toby Goodshank’</strong>s ‘Track 1’, cringing slightly when he said the words “ballsack” and “butthole”, which just made him even more endearing. The night took a dramatic upturn from this point, starting with the whole audience doing a synchronised dance with <strong>Darwin</strong>, containing both fist-pumping and crab-walking (sound good? if you want to see the dance I’m talking about, check out the video below). With a seriously beautiful rendition of <strong>‘The Bomb Song’</strong>, a rap break, and then ecstatic performances of both <strong>‘Radar Detector’</strong> and <strong>‘Bad Day’</strong> (accompanied by the manic screaming and dancing of the audience), the performance finished with a dance off, which was the perfect crescendo ending to this heart warming night.</p>\n<p>9/10</p>\n<p><a href=\"https://www.youtube.com/watch?v=0xrfc_QQnAA\">Darwin Deez – The Spring Dance</a></p>\n","slug":"4836-review-darwin-deez-manchester-academy","category":"music","date":1298657279000,"wpid":4836,"isSticky":false,"featured_image":{"width":600,"height":575,"src":"2011/02/darwin-deez.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAJAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAABgf/xAAnEAABAwIFAgcAAAAAAAAAAAABAgMEAAUGERIhIgeyMzU2QVFxdP/EABQBAQAAAAAAAAAAAAAAAAAAAAT/xAAYEQADAQEAAAAAAAAAAAAAAAABAhEAA//aAAwDAQACEQMRAD8AM4Yw43cLLEW6FCOqBwQhSvG1L1ubEb8Uj3+KIS4UFuU8hbTOtK1A5kg5g1WOiXpaL9HuqM37zy4/pc7jR+dLsLmtAo3/2Q=="},"createdAt":1587294710737,"updatedAt":1588403559919,"author":"5e9b68b27a1236eccfeb1d0d","old_image":"2011/02/darwin-deez.jpg","categories":["music","reviews"]}