{"id":"5e9c345a9b6559241525e1f7","title":"Review: Caribou","content":"<p><a href=\"https://admin.</p><p>crackintheroad.com/uploads/2010/04/caribou11.jpg\"><img class=\"aligncenter size-large wp-image-486\" src=\"https://api.crackintheroad.com/wp-content/uploads/2010/04/caribou11-1024x767.jpg\" alt=\"\" width=\"800\" height=\"599\" srcset=\"https://api.crackintheroad.com/images/2010/04/caribou11-1024x767.jpg 1024w, https://api.crackintheroad.com/images/2010/04/caribou11-300x224.jpg 300w, https://api.crackintheroad.com/images/2010/04/caribou11-165x123.jpg 165w, https://api.crackintheroad.com/images/2010/04/caribou11-950x712.jpg 950w, https://api.crackintheroad.com/images/2010/04/caribou11.jpg 1403w\" sizes=\"(max-width: 800px) 100vw, 800px\" /></a></p>\n<p>After a three year absence Caribou returns with his new record ‘Swim’. The music is still as genre defying as ever; sunny, groove-filled pop, but still with an ability never to be placed under any sort of category. His last record Andorra, made in 2007, was an ecstatic, euphoric slightly more vocal fuelled romp, here the sound has been slightly more refined, the music is more muted almost timid but also explores areas previously undiscovered.</p>\n<p>‘Swim’ is definitely less of a sonic whirlwind, in many ways the sound is simpler and perhaps more intricate; the album’s opening track ‘Odessa’ features almost impossibly muted vocals but is also wrapped in dark howls and screeches. ‘Sun’ rattles and reverberates again to the same indistinguishable voice. Throughout the record Caribou creates noises on his own terms, the voices possess an ‘other worldly’ quality; almost as if he’s speaking a different language altogether.<br />\nThe sound is also remarkably more stripped down. ‘Found out’ is an empty, lonely depiction of struggle. The beats clomp and the synths hum in the most casual of manners, this is by no means a negative thing; when the piece eventually reaches its climax the euphoria is all the more obvious. Despite the journey Caribou takes us on, he still manages never to shy away from a groove; ‘Leave House’ is a Soulwax like electronic ride, perhaps as close the record gets to traditional pop. ‘Jamelia’ is undoubtedly the stand out piece of the record, perfect in its escalation the lyrics erupt in a soulful form of elation; the synths are perfectly off key and the beat’s constant shuffles and rattles form something fantastically uncontrollable.</p>\n<p>Ultimately the records intricate new sound works, the journey Caribou takes us on is an interesting one. There are moments where this new muted sound falls on the slightly more simplistic side; however despite these moments Caribou’s ability to captivate never seems to fail.</p>\n<p style=\"text-align: center\"><a href=\"https://www.myspace.com/cariboumanitoba\">Check Out Caribou’s Myspace</a></p>\n","slug":"485-caribou","category":"music","date":1272443472000,"wpid":485,"isSticky":false,"featured_image":{"width":1403,"height":1052,"src":"2010/04/caribou11.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAYH/8QAHhAAAQQCAwEAAAAAAAAAAAAAAQIDBREABAYSIVH/xAAVAQEBAAAAAAAAAAAAAAAAAAABA//EABcRAQEBAQAAAAAAAAAAAAAAAAEDABH/2gAMAwEAAhEDEQA/AMQ5TyGDlttpUdDakZqshKUtIZFu2T2WtQ98FUkVkaeoNAWPuMYulOZM4b//2Q=="},"createdAt":1587295322063,"updatedAt":1588403568549,"author":"5e9b68b27a1236eccfeb1d24","old_image":"2010/04/caribou11.jpg","categories":["music","reviews"]}