{"id":"5e9c31f39b6559241525ddfb","title":"James Blake (Manchester’s Band on the Wall)","content":"<p>Having never been to <strong>Band on the Wall</strong> before, I was very excited to see quite how ‘intimate’ this ‘intimate’ afternoon gig was going to be, especially given that I was going to see undoubtedly one of the most blogged about artists of the year.</p><p> With a couple of hundred capacity and only thirty tickets on the door, it was completely sold out; one of my friends had been waiting since 10 in the morning to get his hands on one of the 30 elusive tickets (he succeeded. Patience pays off, it seems).</p>\n<p><strong>Cloud Boat</strong></p>\n<p>This sit down synth and guitar duo had rather an unfortunate gig. The audience were unattentive from the offset. Whether this was because of the timings (<strong>Cloud Boat </strong>got onstage at 3pm) or because the levels didn’t seem quite right (I could hardly hear the vocals above the synths and guitars) I couldn’t tell, but it definitely didn’t help these guys. While there were some interesting lamenting melodies, they were accompanied by rather simple guitar parts and synths which seemed just a little too heavy. The set took a turn for the better in the penultimate song, with some really interesting rhythms and textures to the song, but at the climax of the song and set one of the outputs from their sampler died a rather painfully noisy death. To their credit, they handled this occurrence very calmly, and when it was fixed they informed the audience that they intended to play the end of that song again because, as the singer said “it gets better, I promise”. However, from this moment on it was extremely hard to recapture the audience’s attention.</p>\n<p>6.5/10</p>\n<p><strong><a href=\"https://www.myspace.com/cloudboat\" target=\"_blank\">Cloud Boat Myspace</a></strong></p>\n<p><strong>J</strong><strong>ames Blake</strong></p>\n<p>Half assuming<strong> James Blake</strong> to have a head with two very blurry faces, I was somewhat disappointed when he ambled onstage, looking positively normal (he had what looked like a cup of tea on the floor next to him), closely followed by the other two, very normal looking, members of his band. <strong>Blake’s</strong> first touch of the microphone resulted in huge amounts of feedback, which he laughed was a ‘good start’. Falling almost immediately into a practically perfect rendition of the painfully difficult <strong>‘Unluck’</strong>,<strong> Blake’s</strong> nightmarishly spindly fingers virtually unhinged themselves to get to around the discordance that makes the song just so mouth-watering. Meanwhile the drummer, whose line sounds so incredibly complicated, looked positively relaxed, and spent most of the gig playing fiendishly difficult drum patterns with his hands whilst looking in a completely different direction. Even the sampling in this first song over shone <strong>Cloud Boat’s</strong> entire set, not because theirs was bad, but just because <strong>James Blake</strong> and his entourage seemed <em>so </em>at ease with what they were doing, it seemed as if they could have done it both blindfolded and earplugged. <strong>Blake’s </strong>vocals glided through songs such as <strong>‘The Wilhelm Scream’ </strong>and <strong>‘To Care (Like You)’ </strong>with the help of the vocoded harmonies that have so defined his sound.</p>\n<p><strong>Blake</strong> took to the Steinway (yes, there was a grand piano on stage) to play a literally out of the spotlight version of <strong>‘Give Me My Month’</strong>. It seemed, perhaps, a little rushed as a performance, perhaps because of the occasional snippets of conversation that could annoyingly still be heard coming from the audience. However the turns in his vocals (which, when difficult, were accompanied by a raised eyebrow) were still hauntingly precise and his voice, even just in the clean mic, still had slight echoes of the vocoder that goes so well with his voice. <strong>‘I Never Learned to Share’ </strong>was, frustratingly, the first moment in the gig of near-silence, with <strong>Blake’s </strong>vocals<strong> </strong>being recorded and looped live. In fact, at this point the piano seemed a little out of sync with the vocals, and it was only when the drums came in that everything once again slotted into place, but this is entirely forgivable.</p>\n<p>The crowd pleaser <strong>‘Limit To Your Love’ </strong>was played last, on a keyboard facing the audience, rather than at an angle to them. This was obviously what everyone had been waiting for, with complete silence and attentiveness being apparently only at this point and in the heart-stoppingly beautiful encore that was <strong>Blake’s</strong> solo version of <strong>Joni Mitchell’s ‘A Case of You’</strong>.</p>\n<p>My only criticism of the gig was that there were one or two audience members who decided to chat, persistently, throughout the entire set. Given that <strong>Blake</strong> is known to employ and revel in the weight of silence (he has been said to “dj silence” by making people wait for what they’re expecting, sometimes for up to 10 seconds [much like the drops in <strong>‘Limit To Your Love’</strong>]) it seems bizarre that the people who pay to see him wouldn’t honour this. They can’t have been paying as much attention to his set as it deserved. Oh, and that he didn’t play for long enough, of course. His entire set lasted about 45 minutes (including the encore).</p>\n<p>In a nutshell, there aren’t enough superlatives to explain this performance.</p>\n<p>I’m going to give it a 9.5/10. Thanks a lot, chatty audience members.</p>\n<p><strong><a href=\"https://www.myspace.com/jamesblakeproduction\" target=\"_blank\">James Blake Myspace</a></strong></p>\n","slug":"4859-james-blake-manchesters-band-on-the-wall","category":"music","date":1298808428000,"wpid":4859,"isSticky":false,"featured_image":{"width":628,"height":640,"src":"2011/02/bodypart-111.jpeg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAABwIF/8QAIxAAAgAFAgcAAAAAAAAAAAAAAQIAAwQFERIxISIyUWFxsf/EABUBAQEAAAAAAAAAAAAAAAAAAAMF/8QAGhEAAgIDAAAAAAAAAAAAAAAAAAIBAxESIf/aAAwDAQACEQMRAD8AOr3UrKulueVVPKCsFfDnSo9eY2jcJZJIYYO3GD+oJLvknqP2IR20LzHbvA6lJbsNPD//2Q=="},"createdAt":1587294707384,"updatedAt":1588403559868,"author":"5e9b68b27a1236eccfeb1d0d","old_image":"2011/02/bodypart-111.jpeg","categories":["music","reviews"]}