{"id":"5e9c31ea9b6559241525dded","title":"Review: GhostPoet – Peanut Butter Blues & Melancholy Jam","content":"<p><a rel=\"attachment wp-att-4946\" href=\"https://admin.</p><p>crackintheroad.com/music/4892-review-ghostpoet-peanut-butter-blues-melancholy-jam/attachment/ghostpoet-2\"><img class=\"alignnone size-full wp-image-4946\" title=\"ghostpoet\" src=\"https://api.crackintheroad.com/uploads/2011/03/ghostpoet1.jpg\" alt=\"\" width=\"900\" height=\"567\" srcset=\"https://api.crackintheroad.com/images/2011/03/ghostpoet1.jpg 900w, https://api.crackintheroad.com/images/2011/03/ghostpoet1-260x163.jpg 260w, https://api.crackintheroad.com/images/2011/03/ghostpoet1-640x403.jpg 640w, https://api.crackintheroad.com/images/2011/03/ghostpoet1-165x103.jpg 165w\" sizes=\"(max-width: 900px) 100vw, 900px\" /></a></p>\n<p>If you believe the descriptions that have followed <strong>Ghostpoet’s</strong> release of his debut LP <em>‘Peanut Butter Blues & Melancholy Jam’</em>, the timing must seem appropriate. You’d be hard pushed to read one published article that fails to mention his apparent similarity with <strong>Mike Skinner</strong>. Perhaps this was based on his early releases in isolation, because when comparing in context to the LP as a whole the compressions seems more and more lazy. It’s not that <strong>Ghostpoet</strong> doesn’t attempt to explore the styles and themes contained in the first 2 <strong>Streets</strong> LPs; it’s just that he doesn’t even come close to achieving what those now legendary albums accomplished with such style.</p>\n<p>Regardless of the lyrical similarities, sonically <strong>Ghostpoet</strong> moves in a different way. In terms of professionalism the production of the album is flawless. Sparse dub-step influenced beats, atmospheric screeches and industrial crashes and blemishes give the record the ghostly quality you’d no doubt expect. The problem isn’t the sound itself, more how much it’s developed. <strong>Ghostpoet</strong> seems so content with the symbiotic relationship between name and sound that he totally forgets to have fun with what he accomplishes. By the end of the record the sound as a whole becomes stale and  repetitive, couple this with a complete lack of personality and life  you’ve got yourself a sound that’s cold and cold alone.</p>\n<p>Regardless of the sound, if the words that accompanied them cut to the heart of the drab eerie world of Coventry that <strong>Ghostpoet</strong> goes to great lengths to describe, the problems with the LP may essentially become irrelevant. Unfortunately more often than not he gets caught under his own uninteresting streams of consciousness. In theory this could have been the LP’s greatest strength and at times it is, <em>‘Cash And Carry Me Home’</em> is a point when the eerie sound is coupled perfectly with <strong>Ghostpoet’s</strong> lazy and conversational voice. Lines like <em>“please please take me home/I’m out of my comfort zone/the liquids wearing off/now I just feel alone”</em> capture a night gone wrong perfectly. At other times his words are bafflingly vague and verging on cliché, <em>“Loves Like A Shooting Star”</em> and pretty much every hook on the album are harsh reminders of <strong>Ghostpoet’s</strong> lyrical shortcomings. It’s not that his words never have poignancy, lines like <em>“I ‘aint been paid/ I ‘aint got a lot/ it’s us against whatever babe”</em> keep it simple and do so much more than his more ambitious flows. In reality though these moments are few and far between. For someone called <strong>Ghostpoet </strong>he’s remarkably unpoetic.</p>\n<p>More than anything though, the LP simply runs out of steam, songs like ‘<em>Longing For The Night’</em> and<em> ‘I Just Don’t Know’ </em>descend into production repetition that not even the lyrical highlights can save. Now and again his lo-fi drawl peaks interest in the song as a whole, but for the most part it’s hard to distinguish between each song, they simply don’t have enough personality. For someone who aims to tell stories, personality is something that needs to be present.</p>\n<p>The hardest thing to take is that now and again we see flashes of what the record could have been, ‘<em>Survive</em>’ for example is the most accomplished track on the LP. The melody is divine, the production is simple but still sports subtleties and the words escalate from <em>“dinner for one/with the dimmer lights on”</em> to an intense style of optimism in a gradual and delicate way. Ultimately however these moments are almost unnoticeable in the grand scheme of things, a perfect example of a good idea poorly executed.</p>\n<p><object classid=\"clsid:d27cdb6e-ae6d-11cf-96b8-444553540000\" width=\"100%\" height=\"81\" codebase=\"https://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=6,0,40,0\"><param name=\"allowscriptaccess\" value=\"always\" /><param name=\"src\" value=\"https://player.soundcloud.com/player.swf?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F10023908&show_comments=true&auto_play=false&color=5e66cc\" /><embed type=\"application/x-shockwave-flash\" width=\"100%\" height=\"81\" src=\"https://player.soundcloud.com/player.swf?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F10023908&show_comments=true&auto_play=false&color=5e66cc\" allowscriptaccess=\"always\"></embed></object> <span><a href=\"https://soundcloud.com/brownswood/ghostpoet-survive-it\">Ghostpoet – Survive It</a> by <a href=\"https://soundcloud.com/brownswood\">Brownswood</a></span></p>\n<p><script type=\"text/javascript\" src=\"https://video.unrulymedia.com/wildfire_11244048.js\"></script></p>\n","slug":"4892-review-ghostpoet-peanut-butter-blues-melancholy-jam","category":"music","date":1299021107000,"wpid":4892,"isSticky":false,"featured_image":null,"createdAt":1587294698685,"updatedAt":1588441790899,"author":"5e9b68b27a1236eccfeb1d24","old_image":"generated/b0b6f55562894b8f7d5b84fd4b6050df6132e59a.jpg","categories":["music","reviews"]}