{"id":"5e9c31e79b6559241525dde9","title":"Review: Vessels (Manchester)","content":"<p><a rel=\"attachment wp-att-4988\" href=\"https://admin.</p><p>crackintheroad.com/music/4954-review-vessels-manchester/attachment/vessels\"><img class=\"alignnone size-900wide wp-image-4988\" title=\"vessels\" src=\"https://api.crackintheroad.com/uploads/2011/03/vessels-900x703.jpg\" alt=\"\" width=\"900\" height=\"703\" /></a></p>\n<p>Walking in to a sparsely populated <strong>Academy 3</strong>, there appeared to be a distinct lack of atmosphere at this gig. Due to unforeseen circumstances, I wasn’t able to make it early enough to catch the support acts (who would have thought <strong>Chelsea/Man United </strong>would be so absorbing?), therefore I withheld my judgement a little longer.</p>\n<p><strong>Vessels </strong>are currently on tour promoting their sophomore album ‘<strong>Helioscope</strong>‘, which was recorded in the US under the guidance of <strong>John Congleton</strong>. Having been around for what will be now their 6th year, the news of a second <strong>Vessels </strong>album marks another landmark in a turbulent, and at times, understated, career for the band. A lot of attention and praise was heaped on the band back in 2007, with <strong>Huw Stephens </strong>a big fan and a memorable performance at <strong>Latitude Festival</strong>. However after all the initial hype, <strong>Vessels </strong>seemed to fade into obscurity to all those except their most committed fans and, for all intents and purposes, their performance in Manchester supports this decline.</p>\n<p>Committed and enthused, the modest crowd surged forward when the lights dimmed and a synth-y reverb tone echoed across the stage. However <strong>Vessels</strong>‘ attempt to set the scene was let down by the fact it went on for far too long. I began to become bored as we waited for the band to emerge, and when they did their first track was just as underwhelming as their entrance. For the most part, the band’s saving grace was their drummer, who maintained a sense of life and urgency in many of the opening tracks. However, and quite thankfully as I do enjoy <strong>Vessels</strong>‘ recorded tracks, the band began to spark into life and their epic sound was truly projected.</p>\n<p>Lyrics are few and far between in the majority of their tracks, however with their dynamic and powerful range of sounds, created through transcendental guitars and progressive electronic interjections, they are rarely missed. Moving from relaxed periods to crashing crescendos, <strong>Vessels </strong>produced a fantastic set of tracks that truly reflect their potential. I felt as if the band deserved a bigger space to play to, however there was always something niggling in my mind that they were lacking. They, and their sound, were epic, however it still felt cruelly understated.</p>\n<p>The band seemed genuinely  pleased for the turn out they received, especially after revealing that<strong> Morrissey </strong>attended one of their Irish tour dates, but ‘left immediately after the first guitar riff’. Therefore I sincerely hope with their new album ‘<strong>Helioscope</strong>‘ (which will be worth buying after this performance), <strong>Vessels </strong>manage to regain a lot of the attention they once received and revel in their epic sound.</p>\n<p><strong><a href=\"https://www.myspace.com/vesselsband\" target=\"_blank\">Vessels Myspace</a></strong></p>\n<p><script type=\"text/javascript\" src=\"https://video.unrulymedia.com/wildfire_11244048.js\"></script></p>\n","slug":"4954-review-vessels-manchester","category":"music","date":1299107485000,"wpid":4954,"isSticky":false,"featured_image":null,"createdAt":1587294695330,"updatedAt":1588441790870,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"generated/992f456214e3989ccff1f09fea95c164eb773001.jpg","categories":["music"]}