{"id":"5e9c344a9b6559241525e1df","title":"5 Minutes With: Sjur Lyseid (LHoA and Monzano)","content":"<p><img title=\"Monzano\" src=\"https://www.</p><p>henriklindal.com/files/gimgs/10_monzano2a.jpg\" alt=\"Monzano\" width=\"800\" height=\"533\" />If you haven’t heard anything from last year’s debut solo album from Norway’s own <strong>Sjur Lyseid </strong>aka <strong>The Little Hands Of Asphalt</strong>, then I wholeheartedly recommend you track it down as quickly as possible. Combining the lyrical beauty of <strong>Elliot Smit</strong><strong>h</strong>, with the subtle, upbeat melodic values of <strong>Bright Eyes;</strong> <strong>Little Hands of Asphalt </strong>are further proof that the Norwegian music scene is at the strongest it has ever been. Whilst it wouldn’t be fair to attribute the growth of the scene to one person, it would be reasonable to say that<strong> Sjur </strong>has been an integral component to the way the music scene has begun to thrive. Helping to produce numerous records, as well as touring with some brilliant musicians, any praise <strong>Sjur</strong> receives is well deserved.</p>\n<p>As if producing, performing and writing music for <strong>Little Hands of Asphalt </strong>wasn’t enough, <strong>Sjur Lyseid </strong>also fronts twee indie band <strong>Monzano</strong>. <em>By This Time Last Year Everything Will Seem Younger</em> is the sophomore album from Monzano, released on the 8th of February via the fantastic record label<strong> Spoon Train Audio</strong>. The album itself is optimistic and injected with much of the same hopeful despair experienced on their 2008 debut<em> High Horses & One Trick Ponies</em>. It serves as a great testament to the standard we have come to expect from <strong>Sjur</strong>, with his gently delivered vocals telling stories of lost lovers and fond acquaintances. Stand out track<em> Cold Waters </em>features <strong>Thea Glenton Raknes </strong>of <strong>Norma Sass </strong>on backing vocals, and is an upbeat tuneful affair, with<strong> Lysied</strong> reminiscing that “<em>every night was like a dream, we were feeding shapes, on a movie screen”</em>. <strong>Raknes</strong> vocals add an extra depth to the song, the like which is not seen elsewhere on the album, however<em> Yes We Can’t </em>comes close, as a slow drum beat signals the beginning of the song, until the vocals enter and it comes to life, as <strong>Sjur </strong>tells us <em>“so their raising their glasses, so here’s to staying blind”</em>. His lyrics may appear to be pessimistic and downtrodden at time, but they contain a certain amount of expectant ambition and humour as well, so whilst he croons <em>“if I leapt from the Brooklyn bridge tonight, I bet I wouldn’t be missed”</em>, he later ironically recalls “<em>oh I never thought it would come to this, I’ve read every page of The Economist”</em>. Whilst the album doesn’t quite reach the standard of last years debut from <strong>Little Hands Of Asphalt</strong>, it is certainly a step in the right direction, for <strong>Monzano</strong>, <strong>Sjur </strong>and the Norwegian music scene as a whole.</p>\n<p><strong>Sjur Lyseid </strong>kindly agreed to answer some questions for us.</p>\n<p><em>CITR: </em>If you had to cite one band as a major influence on you, who would it be?</p>\n<p><strong>I think it would be impossible for any musician to name a single band, because that would make you an approximate copy, and probably an inferior one, wouldn’t it. Having said that, I think the bands I was listening to as a kid definitely influenced me in a different way than the ones I’ve appreciated as a cynical twenty-something. I mean, when I was sixteen, I could listen to the same bands for weeks and even months, exclusively. Something I’m not really able to do anymore. So, artists from that period, my formative years, so to say. Like Pavement, or Elliot Smith. </strong><br />\n<em></em></p>\n<p><em>CITR:</em> How much do you think growing up in Norway has affected the music you produce?</p>\n<p><strong>A lot I’m sure. Even though most of the music I was listening to was Anglo-American, and even though I lived in the states for a bit. The snow, the fact that it’s dark half the year, the welfare state, black metal, people’s shyness and their obsession with obscure winter sports, being part of something bigger but being very much on the periphery of everything, closeness to nature (and lots of it). I think it all plays a part in what I write and how I write it. It might be a cliché, but I think there’s something about northern gloominess and melancholy which is very real.</strong></p>\n<p><em>CITR: </em>Do you have any other plans for the rest of the year?</p>\n<p><strong>I’m producing a lot of other bands right now. I’d been doing it for a while, but after I built a studio with my friends at Spoon Train Audio, it’s pretty much all I’ve been doing, apart from a little touring. I produced a record with the brilliant postrock/emo-band Youth Pictures of Florence Henderson last year, everyone should check them out. Right now I’m working on the next My Little Pony album, and also records by Like Spinning and Casa Murilo, and in the fall pop wunderkind Einar Stray. </strong></p>\n<p><em>CITR: </em>Can we expect a new Little Hands of Asphalt album in the near future?</p>\n<p><strong>I’ve written some songs for it, but I’m always really uncertain if my songs are any good. Maybe a few of them are. If I have enough songs, I might be start recording a bit this autumn. So maybe early next year? I usually release my records in March for some reason, and I kind of like that. March 2011! I think I need to start telling people, to put a little pressure on myself to write some more songs.</strong></p>\n<p><em>CITR: </em>Messi or Ronaldo?</p>\n<p><strong>Messi. Mostly because he plays for Barcelona, Ronaldo for Real. That rivalry sort of has this geopolitical twist which for me makes it incredibly easy to side with Barca. You know, Real; the royal team, Franco’s team, imperialistic and capitalist. Whereas Barcelona is traditionally the team of the socialists, anarchists, and liberty-loving Catalans. Hugely simplified, of course, but that’s the thing with football anyway, isn’t it?</strong></p>\n<p><em>CITR: </em>PC or Mac?</p>\n<p><strong>I’m on a PC. It’s a love/hate relationship for sure, at the same time my hipster anxiety would kill me if I went to the coffee shop with a macbook under my arm.</strong></p>\n<p><em>CITR: </em>If you could be any animal, what would you be, and why?</p>\n<p><strong>A Dodo. It would be a bit lonely, `cause I would be the only one, but I’m sure a lot of people would find me interesting, despite the fact that I would be incredibly simple minded and clumsy.</strong></p>\n<p style=\"text-align: center;\"><a href=\"https://https://www.myspace.com/monzano\">Monzano Myspace</a></p>\n<p style=\"text-align: center;\"><a href=\"https://www.monzano.com/\">Monzano Official Site</a></p>\n<p style=\"text-align: center;\"><a href=\"https://www.myspace.com/thelittlehandsofasphalt\">Little Hands Of Asphalt Myspace</a></p>\n","slug":"496-5-minutes-with-sjur-lyseid-lhoa-and-monzano","category":"interviews","date":1272874614000,"wpid":496,"isSticky":false,"featured_image":{"width":188,"height":188,"src":"2011/06/10_monzano2a-188x188.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAABgX/xAAiEAACAAYBBQEAAAAAAAAAAAABAgADBAUSIREGIzFBUTL/xAAUAQEAAAAAAAAAAAAAAAAAAAAC/8QAHREAAgEEAwAAAAAAAAAAAAAAAQIAERITITJhkf/aAAwDAQACEQMRAD8AXpaHoqAVM66T6tipkEDEKjq360BvXER5lHcTMYy7pwhJxBlKSB65OMI+s2ZapsWI7QbR9/YPO7h2AZvP2GruTyPseNAK2jfU/9k="},"createdAt":1587295306969,"updatedAt":1588403568343,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/06/10_monzano2a-188x188.jpg","categories":["interviews","music","reviews"]}