{"id":"5e9c31e59b6559241525dde6","title":"Review: Lykke Li – Wounded Rhymes","content":"<p><img class=\"alignnone\" title=\"Lykke Li\" src=\"https://www.</p><p>thelineofbestfit.com/wp-content/media/2010/11/Lykke-Li-@-Heaven-London-4-Nov-2010.-10.jpg\" alt=\"\" width=\"960\" height=\"639\" />Musical pre-conceptions are always a dangerous thing to have, sooner or  later the best musicians find a way to blow those pre-conceptions apart;  “Wounded Rhymes” the second record from 24 year old Swedish pop siren  Lyyke Li does just that.</p>\n<p>Lyyke Ii’s debut album 2008‘s “Youth  Novels” was a delicate piece of modern pop, a compendium of sweet  lilting Scandinavian lullabies, pleasant and melodic but rather  lightweight. “Youth Novels” success seemed to pigeon hole Lyyke as yet  another in a seemingly endless conveyor belt of beautifully sweet  Scandinavian  pop stars, however, “Wounded Rhymes” is an altogether  deeper and darker affair that should completely dispel that reputation.</p>\n<p>In  press interviews leading up to the release of this record Lykke Li has  spoke of the album having a theme of “Heartbreak” not just strictly in a  relationship sense but a more all encompassing heartbreak, how the  sadness of existence and the world around you can simply break your  heart and how you can indeed break your own heart. “Wounded Rhymes” is a  record of intense emotions, desires and feelings a world away from the  shy little girl of the previous record who thought she might have been  “A little bit in love with you.” “Wounded Rhymes” makes this desire  explicit.</p>\n<p>The first example of the new stronger willed and  attitude filled Lykke Li arrived last year with album taster “Get Some”  and what a striking return it was. A thrilling rumble of a record, the  tribal drums beat an incessant pattern as the lyrics provoke and tease,  “Like A shotgun needs an outcome, I’m your prostitute your gon’ get  some.” “Get Some” is the sound of a young girl liberated.</p>\n<p>Production  is again helmed by Bjorn Yttling, of Peter, Bjorn and John, and the  musical accompaniment he provides matches the darker sound.</p>\n<p>This  a very percussive record dominated by drums, voice and organ. The organ  plays a leading role in album opener “Youth Knows No Pain” A fabulously  groovy organ intro ushers in the first of this records many big chorus  with the repeated hook of the title.</p>\n<p>This stronger, strident  sound is a feature throughout the album and is matched by Lykke li’s  powerful voice, deep in resonance and expression. “Love Out Of Lust” is  the first of two show-stopping ballads on the album and again finds  Lyyke in emotional turmoil; “I’d rather die in your arms than die  lonesome” rather than drowning in a maudlin torpor, however, the song  climaxes in an uplifting crescendo; “ So dance while you can, Dance  cause you must.”</p>\n<p>The highlight of the album is the second  grandstanding ballad “Sadness is a Blessing” coming across like a 21st  century Dusty Springfield,  Lykke’s voice ripples with passion as she  pours her heart out. “My wounded rhymes make silent cries tonight” The  melody is terrific and this track is a highly effective update on a  classic sound.</p>\n<p>The albums does flag somewhat during the  slightly weaker second half, the interminable six minute dirge of “ I Know Places” could easily be pruned and “Jerome” is rather  underwhelming.</p>\n<p>The lyrical content throughout the record is very  direct and simple and mostly incredibly affecting, however at times the  sense of morbidity is so strong that even a well known miserablist   like Morrissey would cringe, nevertheless, these criticisms do not  detract from what is a very good record.</p>\n<p>With “Wounded Rhymes”  Lykke Li has shown that she is not just a 2 dimensional sugary sweet  popstar but a well rounded and developed musician with unbounded  potential. This is a sound of heartbreak to wallow in and embrace.</p>\n<img class=\"alignnone\" title=\"Lykke Li\" src=\"https://www.innewmusicwetrust.com.br/uploads/2011/02/Lykke-Li-Wounded-Rhymes-2011.jpg\" alt=\"\" width=\"500\" height=\"500\" />\n<p><script type=\"text/javascript\" src=\"https://video.unrulymedia.com/wildfire_11244048.js\"></script></p>\n","slug":"4991-review-lykke-li-wounded-rhymes","category":"music","date":1299164157000,"wpid":4991,"isSticky":false,"featured_image":{"width":188,"height":188,"src":"2011/06/lykke-li-@-heaven-london-4-nov-2010.-10-188x188.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAABgf/xAAjEAACAAUEAgMAAAAAAAAAAAABAgADBAURBhIhMRMiYXGB/8QAFQEBAQAAAAAAAAAAAAAAAAAAAgP/xAAbEQABBQEBAAAAAAAAAAAAAAACAAEDEiEEEf/aAAwDAQACEQMRAD8AuOmrjQUNsUHxB1T0lb1VmOOhkiDMzW9SZjE0k8Ek8C27sfuefuI9r+Y7G27nY4lN2fkQGesqQ7AVE4AHAAcwJzK2Oq8sQV1vV//Z"},"createdAt":1587294693782,"updatedAt":1588403559711,"author":"5e9b68b27a1236eccfeb1d33","old_image":"2011/06/lykke-li-@-heaven-london-4-nov-2010.-10-188x188.jpg","categories":["music","reviews"]}