{"id":"5e9c31e49b6559241525dde3","title":"Review: Oh No Oh My – People Problems","content":"<p><a rel=\"attachment wp-att-4997\" href=\"https://admin.</p><p>crackintheroad.com/music/4995-review-oh-no-oh-my-people-problems/attachment/oh-no-oh-my\"><img class=\"alignnone size-900wide wp-image-4997\" title=\"OH NO OH MY\" src=\"https://api.crackintheroad.com/uploads/2011/03/5349532138_2d4f701916_b-900x428.jpg\" alt=\"\" width=\"900\" height=\"428\" /></a>After the release of an artists debut album, there’s often an overpowering urge to return straight to the studio and attempt to funnel yet more ideas into fully formed music. However, in the majority of cases, it ends up appearing forced and contrived, yearning to ride the wave of their own hype, but becoming caught underneath it, leading to a monotonous, sub-standard sophomore record.</p>\n<p>With Austin darlings Oh On Oh My, this is certainly not the case, having taken the best part of four years off to allow their creativity to actively grow of it’s accord. Their second full length record, People Problems is released next monday (7/3/2011), and whilst not being a departure sonically, it’s clear they’ve grown with their lyrical confidence. There’s still the lightly strummed acoustic guitars and upbeat melodies that their listeners are accustomed to, yet thematically they’ve turned into exploring darker territories.</p>\n<p>Opener Walking Into Me sets the tone for what is to come, on first listen seemingly optimistic and encouraging, the lyrics reveal a more sinister viewpoint, yet it’s not all sunless and mystic. These are still songs about love, loss and longing, just perhaps looking from a bleaker point of view. Musically they’ve stepped it up a notch, shown elegantly on No Time For Talk, a number which wouldn’t appear out of place on a Shins record. “They don’t know you, they don’t like the way you talk” laments lead singer Greg Barkley, in a fashion that elevates the listener to the position of a close, caring friend.</p>\n<p>These are emotionally charged pop folk songs, intended to engross and bewitch, drawing you into a world of all to familiar situations. The title of the record couldn’t be more apt, it’s almost a documentary in style, with it’s storytelling bravado. Personal favourite, There Will Be Bones is a swing influenced track, with Barkley’s easy on the ear vocals, combining perfectly with the musically compositions. “I will take the time we spent, and put it in a jar” wails the lead singer, with such wide-eyed concern and honesty that only serve to heighten it’s emotional strengths.</p>\n<p>Followed by another of People Problem’s strongest tracks, the acoustic Should Not Have Come To This, a regret soaked lullaby, bemoaning what appears to be a shattered friendship. Being young, carefree and wayward can be unnerving, yet People Problems effortlessly and exquisitely provides a realistic testimony to the turbulent but authentic lives we lead.</p>\n<p><object height=\"81\" width=\"100%\"><param name=\"movie\" value=\"https://player.soundcloud.com/player.swf?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F7982209\"></param><param name=\"allowscriptaccess\" value=\"always\"></param><embed allowscriptaccess=\"always\" height=\"81\" src=\"https://player.soundcloud.com/player.swf?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F7982209\" type=\"application/x-shockwave-flash\" width=\"100%\"></embed></object>  <span><a href=\"https://soundcloud.com/okannie/oh-no-oh-my-brains\">Oh No Oh My – Brains</a> by <a href=\"https://soundcloud.com/okannie\">okannie</a></span><br />\n<a href=\"https://www.ohnoohmy.com/#\">Check out their official website!</a></p>\n<p><script type=\"text/javascript\" src=\"https://video.unrulymedia.com/wildfire_11244048.js\"></script></p>\n","slug":"4995-review-oh-no-oh-my-people-problems","category":"music","date":1299173412000,"wpid":4995,"isSticky":false,"featured_image":{"width":188,"height":188,"src":"2011/03/5349532138_2d4f701916_b-188x188.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAABgf/xAAkEAABBAEEAAcAAAAAAAAAAAABAgMEBREAEiExBhMVIkFRYf/EABQBAQAAAAAAAAAAAAAAAAAAAAT/xAAaEQABBQEAAAAAAAAAAAAAAAABAAIDBBEh/9oADAMBAAIRAxEAPwChV8t6HRxF3chqZaiQpp1xMctbeSUpUgD2nAxk/GDpkZTRJKG3ik9cnrR6ao+n+IlZO7z1c557GoHY29kmwlAWEwAOqAAfV9n90d1uQAaUqOlG4nOL/9k="},"createdAt":1587294692219,"updatedAt":1588443779660,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/03/5349532138_2d4f701916_b-188x188.jpg","categories":["music","reviews"]}