{"id":"5e9c31d89b6559241525ddd0","title":"Review: Dog Is Dead/The Collectable Few (Manchester)","content":"<p><strong>The Castle Hotel </strong>is arguably the best hidden gem of a venue not only in Manchester, but across the whole nation.</p><p> Walking in to a front room made up of an old fashioned bar, equipped with fine ales and oak furniture, the gig venue itself is towards the rear of the building. Holding no more than 70 people (at a push), the room allows the most intimate of gigs to be held in the most atmospheric of conditions. With a cathedral-esque backdrop, a stage was only discernible by the position of the monitors and microphones that marked the thinest of boundaries between band and audience. With <strong>Dog Is Dead </strong>attracting an ever increasing amount of attention, I have no doubt that this will be a gig that I, and the other 69 people present, will be able to boast about in the future.</p>\n<p><strong>The Collectable Few:</strong></p>\n<p>Already causing a bit of a stir across the interweb, <strong>The Collectable Few </strong>are a quartet hailing from London that many have compared to <strong>Little Comets, Mystery Jets, The Drums</strong>,<strong> </strong>and <strong>The Cure</strong>. I’m not normally a fan of listing swathes of bands to describe another band’s sound, however in the case of <strong>The Collectable Few </strong>I’m willing to make an exception as there really are so many points of reference within their sound. A charismatic, and very energetic, front man was supported by marching percussion and jangly guitars that both flared and smoldered as each track raged with a youthful passion. The band’s debut single, ‘<strong>Headstrong</strong>‘, stood out clearly as their strongest and most vibrant track, however the band, during their first gig outside of London, had managed to entertain and hold the attention of their northern audience throughout their whole set, which is by no means as easy task!</p>\n<p>An intriguing band that are fun and interesting to listen to in equal measure, <strong>The Collectable Few </strong>are certainly worth listening to.</p>\n<p>8/10</p>\n<p><strong><a href=\"https://www.myspace.com/thecollectablefew\" target=\"_blank\">The Collectable Few MySpace</a></strong></p>\n<p><strong>Dog Is Dead:</strong></p>\n<p>I really should stop reviewing <strong>Dog Is Dead </strong>as I’m no doubt now riddled with bias! I’ve raved about <strong>Dog Is Dead </strong>since I first saw them perform live at last years <strong>Dot To Dot Festival </strong>and interviewed the band shortly after their set. Instantly striking me as a group of mates who were playing music simply for enjoyment (while also being insanely talented at it), that first performance will always stick in my mind as one of the best gigs I’ve ever been to. Entrepreneurs in ‘choral-pop’, <strong>Dog Is Dead </strong>have created a sound that is energetic, mystic, upbeat, dark, intense, humble, dramatic, and fun. Such a list of adjectives is necessary as each track <strong>Dog Is Dead </strong>have created is unique in it’s own light, with <strong>Glockenspiel Song </strong>sounding completely different to <strong>River Jordan </strong>while being just as interesting and engaging.</p>\n<p>On this evening, <strong>Dog Is Dead </strong>performed arguably one of their strongest gigs yet. Confident and committed, the band performed their trademark harmonies with an awe inspiring level of accuracy, and each track brought the audience to an entertained silence before bursting in to applause. However the most promising sign of the night was that the band’s new tracks made their older tracks sound weaker. This sign of development demonstrates that there is a great deal more to come from <strong>Dog Is Dead, </strong>and I for one am incredibly excited for what this band will produce over the coming months.</p>\n<p>10/10</p>\n<p><strong><a href=\"https://www.myspace.com/dogisdeadband\" target=\"_blank\">Dog Is Dead MySpace</a></strong></p>\n<p><a href=\"https://api.crackintheroad.com/music/5066-exclusive-unplugged-session-dog-is-dead\" target=\"_blank\">Check out our exclusive unplugged session with </a><strong><a href=\"https://admin.crackintheroad.com/music/5066-exclusive-unplugged-session-dog-is-dead\" target=\"_blank\">Dog Is Dead !!! </a></strong></p>\n<p><script type=\"text/javascript\" src=\"https://video.unrulymedia.com/wildfire_11244048.js\"></script></p>\n","slug":"5017-review-dog-is-deadthe-collectable-few-manchester","category":"music","date":1299602862000,"wpid":5017,"isSticky":false,"featured_image":null,"createdAt":1587294680280,"updatedAt":1588441790151,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2011/03/dog-is-dead-yo-188x188.jpg","categories":["music"]}