{"id":"5e9c31dc9b6559241525ddd7","artists":["5e9b694b7a1236eccfeb259f"],"title":"Interview: Surfer Blood","content":"<img class=\"alignnone\" title=\"SB\" src=\"https://www.</p><p>hearya.com/uploads/2010/04/SurferBlood_SessionPhoto-1024x576.jpg\" alt=\"\" width=\"1024\" height=\"576\" />\n<p><em>Crack in the Road</em> sits down with John-Paul Pitts, TJ Schwarz, and Kevin Williams, before their show in Newcastle to talk surfing, “party fun lunchboxes”, and getting high on-stage.</p>\n<p><em>CitR: What brought Surfer Blood, as a band, into existence?</em></p>\n<p><strong>JP: A need to feel individual, from my parents, brought us into existence – a general sense of contempt at understanding the place we grew up in. I think most people who make music just do it because they’re not very good at anything else.</strong></p>\n<p><em>CitR: Where does the name come from?</em></p>\n<p><strong>TJ: We were on a trip in Florida, coming from Gainsville, and I had a backpack on and JP was asking where I got that backpack from, and I said “something like a surfer would wear, like a surfer blood would wear”. You know, like “it’s in my blood, it’s part of who I am”. </strong></p>\n<p><em>CitR: But you’re not surfers.</em></p>\n<p><strong>JP: No we’re not. TJ was, he was very passionate. But it’s not literal, like you’re surfing and get bitten by a shark and blood comes out. It’s not supposed to be like that.</strong></p>\n<p><em>CitR: What are your plans for this year?</em></p>\n<p><strong>JP: Make a record, play some festivals. We’ve got this tour, then another US tour. We have some singles coming out, a set of singles</strong>. <strong>Then we’ve got a tour with </strong><strong>And You Will Know Us By The Trail of Dead, and we’re gonna do that in North America. After that, we’re just gonna make a new record and hopefully we’ll have much more at our disposal than with out first record and with all the added opportunities we can make the best record we can possibly make.</strong></p>\n<p><em>CitR: Are those singles coming up from the EP, or from the album?</em></p>\n<p><strong>JP: It’s hard to gauge what a release will be. We just wrote songs and they kept coming out and I think it’d be a shame not to give them a chance to be a full LP, it’d be a shame to release an EP when we’ve got the opportunity for an LP.</strong></p>\n<p><em>CitR: If you could sum up all those singles and those releases you’ve got coming up, in three words, what would they be?</em></p>\n<p><strong>JP: Fast, dynamic, and contrast.</strong></p>\n<p><strong>Kevin: Party fun lunchbox.</strong></p>\n<p><em>CitR: Are there any changes in direction in the new stuff, or any new influences that you’ve got?</em></p>\n<p><strong>JP: We were trying to do more focussed stuff, because some of the songs tend to take a strange diversion, but at the same time everyone who’s heard the new songs have said they’ve got Surfer Blood written all over them. Which is a good thing to hear because apparently we can’t escape our own thumbprint. It still has that Surfer Blood sound. </strong></p>\n<p><em>CitR: What sort of music have you been listening to recently?</em></p>\n<p><strong>JP: In the car? Uh… There are no new bands that are good. Our radio in our van is broken so we’ve been listening to Arcade Fire. We’ve been limited to our CD collection that is right now with us.</strong></p>\n<p><strong>TJ: We’ve been listening to The Clientelle’s <em>Suburban Light</em>. One of my favourite records. </strong></p>\n<p><em>CitR: What is the first record you ever fell in love with?</em></p>\n<p><strong>JP: The first record I ever fell in love with, or the first record I ever fell <em>fell</em> in love with? Let’s just go with that. No Doubt, <em>Tragic Kingdom</em>. </strong></p>\n<p><strong>TJ: Yeah, I’ll go with <em>Presidents of the United States</em>.</strong></p>\n<p><em>CitR: How important do you think it is to keep in touch with fans over social networking sites, like Facebook and Twitter?</em></p>\n<p><strong>JP: We were talking about this actually, about what bands should do for their internet presence, and it’s something that’s come up a lot. Drums are important for a band, but a Facebook is just as important. So sell your drumset, and buy a Facebook account. </strong></p>\n<p><em>CitR: What are your highest and lowest gig moments?</em></p>\n<p><strong>JP: Our highest was when we were really high. Or that was our lowest. Can we talk about drugs in interviews and stuff, is that okay?</strong></p>\n<p><em>CitR: Go for it.</em></p>\n<p><strong>JP: Well, we don’t usually smoke weed, and we don’t handle it very well. We just got here and we played a show and we were so happy, and blah blah blah, so of course we proceed to smoke all this marijuana, and we had another show that night, and we got on-stage, and my guitar isn’t working, we got nothing to work, and I was freaking out ‘cos I can’t figure out why it is, and the whole time I was not plugged in or my volume was all the way down or something or something ridiculous like that. I haven’t cried in a long time, but I cried after that show. Highest was when we played Barcelona, and we played the set, and we got off-stage and saw all our friends and walked over and watched Pavement play in front of the Mediterranean Sea at night. It was absolutely an amazing experience.</strong></p>\n<p><em>CitR: Do you have any pre-gig rituals?</em></p>\n<p><strong>JP: We have a rule that we’re not allowed to use laptops 30 minutes before the set. I think taking off your shirt helps a lot, to get yourself ready for the show. Also, shadowboxing is a good thing to do. Trying to touch the ceiling. I’ve always wanted more pictures in these places because, you know Magic Eye? Those things where you look at them and it looks funny and you see an image? I kinda wish we had one of those, but we keep forgetting it. </strong></p>\n<p><strong>Kevin: One of my rituals is not eating.</strong></p>\n<p><strong>JP: I can’t eat for 4 hours before being on-stage. You feel like you’re gonna burp into the microphone. It’s not pleasant.</strong></p>\n<p><strong>TJ: I’m trying to imagine myself. Tie your shoes.</strong></p>\n<p><strong>JP: If you’re wearing a long-sleeve shirt, roll the sleeves up so you don’t get in the way of the strings.</strong></p>\n<p><em>CitR: Which artist would you most like to collaborate with?</em></p>\n<p><strong>JP: Ever? David Bowie.</strong></p>\n<p><em>CitR: How are UK audiences compared to audiences in the US?</em></p>\n<p><strong>JP: It’s different, ‘cos in the States you get used to people who just heckle you and scream at you and calling you names and there’s never any problem – they’ll have a full conversation with you right there on stage. So you can take as long as you want tuning your guitar ‘cos they’ll just keep calling you. In the UK, you think because they’re more reserved, they’re not into the music, and you think to yourself “Oh God, is this not going well?”, and afterwards, in the US, afterwards, they just walk right by you at the merch table and not say anything, and here you think you play terribly ‘cos the crowd was like crickets the whole time, and they’ll come up to you at the merch table afterwards and say “that was amazing and I want a copy of your LP”. So I suppose more people actually watch the show here than in the US.</strong></p>\n<p><em>CitR: Where do you see yourselves in five years time?</em></p>\n<p><strong>JP: Making records and touring. </strong></p>\n<p><em>CitR: If you could be any animal, what would it be?</em></p>\n<p><strong>JP: [without hesitation] Kangaroo.</strong></p>\n<p><strong>Kevin: Turtle.</strong></p>\n<p><strong>TJ: Good question…</strong></p>\n<p><strong>JP: Chihuahua.</strong></p>\n<p><strong>TJ: I think I’d be a hyena. I think that’s ‘cos of <em>The Lion King</em>.<br />\n</strong></p>\n<p><script src=\"https://video.unrulymedia.com/wildfire_11244048.js\" type=\"text/javascript\"></script></p>\n","slug":"5039-interview-surfer-blood","category":"interviews","date":1299452283000,"wpid":5039,"isSticky":false,"featured_image":{"width":1024,"height":576,"src":"2011/06/surferblood_sessionphoto-1024x576.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAGAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAUH/8QAHRAAAgIDAQEBAAAAAAAAAAAAAQMCBAAREgUhMf/EABUBAQEAAAAAAAAAAAAAAAAAAAQF/8QAGBEBAQADAAAAAAAAAAAAAAAAAQAhQXH/2gAMAwEAAhEDEQA/AMm8m3J3mXHWH2ZWUNitG5mcR1IgE9H5rX4Mm16rLKFvDuQ2ImByPmxvGMmuF7NNX//Z"},"createdAt":1587294684941,"updatedAt":1588403559580,"author":"5e9b68b27a1236eccfeb1d16","old_image":"2011/06/surferblood_sessionphoto-1024x576.jpg","categories":["interviews","music"]}