{"id":"5e9c31d39b6559241525ddcb","title":"Feature: Ten Tearjerkers","content":"<p><a rel=\"attachment wp-att-5195\" href=\"https://admin.</p><p>crackintheroad.com/music/5051-feature-ten-tearjerkers/attachment/joydiv\"><img class=\"alignnone size-full wp-image-5195\" title=\"joydiv\" src=\"https://api.crackintheroad.com/uploads/2011/03/joydiv.jpg\" alt=\"\" width=\"790\" height=\"354\" srcset=\"https://api.crackintheroad.com/images/2011/03/joydiv.jpg 790w, https://api.crackintheroad.com/images/2011/03/joydiv-260x116.jpg 260w, https://api.crackintheroad.com/images/2011/03/joydiv-640x286.jpg 640w, https://api.crackintheroad.com/images/2011/03/joydiv-165x73.jpg 165w\" sizes=\"(max-width: 790px) 100vw, 790px\" /></a></p>\n<p>For many people, music is one of the first ports of call when dealing with grief, whether it be loss of life, broken relationships or shattered hearts, it’s comforting to find a piece of music to find solace in. Without giving away too much about my own life, here is a short yet insightful look into some tracks that have the ability to turn on my waterworks. </p>\n<p>Bright Eyes – Lime Tree </p>\n<p>Choosing just one track from Conor Oberst was far and away the most complex decision in compiling this list. With his unrivaled back catalogue of heartwrenching songs, I managed to narrow it down to a list of three, and from there dwindled it down to just one. Whilst Lime Tree is a smoother, more polished affair than other Bright Eyes tracks, it’s the tone of despair and grief with which Conor sings that completes the track. </p>\n<p>The tearjerker – “Don’t be so amazing or I’ll miss you too much, I felt something that I had never touched” </p>\n<p><iframe title=\"YouTube video player\" width=\"425\" height=\"30\" src=\"https://www.youtube.com/embed/9591zoSkqyc\" frameborder=\"0\" allowfullscreen></iframe> </p>\n<p>Joy Division – Atmosphere </p>\n<p>Such an apt title for a hauntingly poignant track, many have said in hindsight that it portrayed what was to come, however the lyrics almost contradict the way events played out. Desolation, loss and pain are all encompassing, and Atmosphere goes some way to proving this. </p>\n<p>The tearjerker – “Walk, in silence. Don’t walk away, in silence” </p>\n<p><iframe title=\"YouTube video player\" width=\"425\" height=\"30\" src=\"https://www.youtube.com/embed/yG5tUsCeXys\" frameborder=\"0\" allowfullscreen></iframe></p>\n<p>Elliott Smith – The Biggest Lie </p>\n<p>Another that in hindsight seems to have an altered meaning. The depression that Smith battled with throughout his life is perfectly summarised in The Biggest Lie, crucially the devastating effects in can have on others and the relationships we build. Following an argument with his girlfriend in 2003, Smith fatally stabbed himself in the heart. </p>\n<p>The tearjerker: “Oh, we’re so very precious, you and I, and everything that you do makes me want to die” </p>\n<p><iframe title=\"YouTube video player\" width=\"425\" height=\"30\" src=\"https://www.youtube.com/embed/fd-zwe1fWB0\" frameborder=\"0\" allowfullscreen></iframe> </p>\n<p>Band Of Horses – The Funeral </p>\n<p>Not as outwardly bleak as the title may suggest; much of the beauty lies in the instrumental sections, which at times dominate the lyrics. Such emotionally artistry has to be admired, and I can assure you that hearing Band of Horses play The Funeral live is an experience of biblical proportions. </p>\n<p>The tearjerker: “At every occasion I’ll be ready for the funeral” </p>\n<p><iframe title=\"YouTube video player\" width=\"425\" height=\"30\" src=\"https://www.youtube.com/embed/cMFWFhTFohk\" frameborder=\"0\" allowfullscreen></iframe> </p>\n<p>Sinaed O’Connor – Nothing Compares 2 U </p>\n<p>The video, the atmosphere, the song itself. Rarely does a work of art come together with such intricacy, in a form that can only be described as perfection. It’s a timeless classic, never appearing cheesy or contrived, and has consoled many a shattered heart. </p>\n<p>The tearjerker: “Nothing can stop these lonely tears from falling, tell me baby where did I go wrong?” </p>\n<p><iframe title=\"YouTube video player\" width=\"425\" height=\"30\" src=\"https://www.youtube.com/embed/4jv-0foinNA\" frameborder=\"0\" allowfullscreen></iframe> </p>\n<p>Color Of Clouds – Lullysome </p>\n<p>My most recent discovery from this list, taken from last years debut record, the entire album is emotionally stirring, but none more so than this track. First hearing this after a difficult breakdown of a relationship, it really struck a nerve; with the track longing to hold onto the fragile remains of a love once so powerful, ultimately ending inconclusive. </p>\n<p>The tearjerker: “Do you think, that we could fall in love again? I can see it clear” </p>\n<p><iframe title=\"YouTube video player\" width=\"425\" height=\"30\" src=\"https://www.youtube.com/embed/ygrd2RsmYKM\" frameborder=\"0\" allowfullscreen></iframe> </p>\n<p>Sigur Ros – Flugufrelsarinn </p>\n<p>Sung in Hopelandic, there’s incalculable solace in the vocal sounds created, which at peak at almost tormenting levels. Every second of it’s epic eight minute is carefully considered and orchestrated, allowing for this mystical yet alluring track to soar gracefully through the realms of the listeners consciousness. </p>\n<p><iframe title=\"YouTube video player\" width=\"425\" height=\"30\" src=\"https://www.youtube.com/embed/NOQVaoYtAsA\" frameborder=\"0\" allowfullscreen></iframe></p>\n<p>Slint – Good Morning, Captain </p>\n<p>The closing track on their sublime 1991 record Spiderland, and arguably their most prolific track. Over the course of seven minutes the track builds in a fragile yet assured way, culminating in McMahan’s violently screamed vocals; the ultimate show of anguish. </p>\n<p>The tearjerker: “I miss you” </p>\n<p><iframe title=\"YouTube video player\" width=\"425\" height=\"30\" src=\"https://www.youtube.com/embed/xoH5MPIgM7c\" frameborder=\"0\" allowfullscreen></iframe> </p>\n<p>Silver Springs – Fleetwood Mac </p>\n<p>A heartwrenchingly honest ballad, documenting a relationship from start to finish. There will be few out there who cannot in some way relate to the honesty of this track, yearning for a spark to ignite in the heart of a loved one. The tearjerker: “Time casts a spell on you, but you won’t forget me, I know I could have loved you, but you would not let me” <iframe title=\"YouTube video player\" width=\"425\" height=\"30\" src=\"https://www.youtube.com/embed/Ksmsv4myOmg\" frameborder=\"0\" allowfullscreen></iframe> </p>\n<p>Tom Waits – Ruby’s Arms Yet </p>\n<p>another artist who could have numerous entries in this list. His rasping, remorseful voice is at it’s utmost piercing, a simply sublime, moving track about a broken down relationship and a torn heart. The tearjerker: “I’ll never kiss your lips again, or break your heart, as I say goodbye I’ll say goodbye, say goodbye to Ruby’s arms.” </p>\n<p><iframe title=\"YouTube video player\" width=\"425\" height=\"30\" src=\"https://www.youtube.com/embed/_i5wX8WQ8qU\" frameborder=\"0\" allowfullscreen></iframe></p>\n","slug":"5051-feature-ten-tearjerkers","category":"music","date":1299631280000,"wpid":5051,"isSticky":false,"featured_image":{"width":188,"height":188,"src":"2011/03/joydiv-188x188.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAABQQI/8QAJhAAAQMCBQMFAAAAAAAAAAAAAQIDBQQRAAYSEyEHFEEWIjEyUf/EABQBAQAAAAAAAAAAAAAAAAAAAAD/xAAUEQEAAAAAAAAAAAAAAAAAAAAA/9oADAMBAAIRAxEAPwCnKU/WsZfjZCByi082xUsq3w6lbvC1JtoUQbnc4APjBszRzEjL11b6fm2u5fW9tmjKtOpRNrg2Nr/Iwf0gAXTIaWAptOlQQeQD+2xoxlxey371fUecB//Z"},"createdAt":1587294675353,"updatedAt":1588443779583,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/03/joydiv-188x188.jpg","categories":["music","opinion"]}