{"id":"5e9c31d59b6559241525ddce","title":"Review: The Naked & Famous (Newcastle)","content":"<p><a rel=\"attachment wp-att-5144\" href=\"https://admin.</p><p>crackintheroad.com/music/5139-review-the-naked-famous-newcastle/attachment/scaled-the-naked-famous\"><img class=\"alignnone size-650home wp-image-5144\" src=\"https://api.crackintheroad.com/uploads/2011/03/scaled.The-Naked-Famous-650x433.jpg\" alt=\"\" width=\"650\" height=\"433\" /></a></p>\n<p>First up at this (surprisingly busy) gig at Newcastle’s Riverside venue was local band, <strong>Viva</strong><strong> City</strong><strong>. </strong>Some pretty great new talent on display here, boasting some top electro-indie tunes, and managing to blend in guitar-driven riffs with electro-style beats. Admittedly, nothing truly stood out as excellent, but the band put on a tight show, well-performed, with lead singer Ali doing his very best to get the crowd going. Nothing truly special, but a fun band with some decent tracks.</p>\n<p><strong>7/10</strong></p>\n<p>Taking the stage next was the highlight of the evening – London-based indie pop band <strong>Wolf Gang</strong>. Great stage presence, strong vocals, some brilliantly catchy tunes accentuated by fantastic song-writing. The band just signed some SXSW dates and are quite clearly on the way up to the top – if there’s any justice in the world, they’ll get there. Check out <strong>Dancing with the Devil</strong> and <strong>Lions in Cages</strong>. Fantastic on record, fantastic live.</p>\n<p><strong>9/10</strong></p>\n<p>And then it all fell apart. I’d been looking forward to this – <strong>Passive Me, Agressive You</strong>, the debut album by New Zealand band <strong>The Naked and Famous</strong> is a great record, full of synth-rock, highlighted best in lead single <strong>Young Blood</strong> and the equally catchy <strong>Punching in a Dream</strong>. But that’s on record, and their live performance is something else entirely.</p>\n<p>I must admit to not being entirely unbiased here: a couple of factors that couldn’t possibly be controlled by the band helped to ruin the entire evening – namely, the presence of some truly pretentious pseudo-hipsters and a small group of insanely irritating young teenagers who, by all rights, should not be up past 10pm. Apart from this, the band itself barely impressed. On-stage, they failed to interact well with the audience, stopping once or twice to comment on how “Volvic” sounds like “Volvo”, and then complaining that the audience weren’t hyped up enough. Apart from the aforementioned songs, <strong>Young Blood </strong>and <strong>Punching in a Dream </strong>(which, I will admit, were highlights of the set and came across brilliantly live), the rest of the set was rather uninteresting and, thinking back, I can remember no other songs played that night that stood out as particularly good.</p>\n<p>It wasn’t all bad, though. Lead singer Alisa Xayalith gave a strong vocal performance, and, instrumentally, the band was clearly skilled. It just seems that after such a great album, good prospects, and fantastic support acts, it’s a shame that the main set was so poor – indeed, a lot can be said when the support act was vastly more enjoyable than the headlining band.</p>\n<p>Walking out of the venue after the gig, I passed an unfortunate young woman vomiting onto the street. Sadly, she clearly echoed my sentiments. Disappointing.</p>\n<p><strong>5/10</strong></p>\n<p><script type=\"text/javascript\" src=\"https://video.unrulymedia.com/wildfire_11244048.js\"></script></p>\n","slug":"5139-review-the-naked-famous-newcastle","category":"music","date":1299607332000,"wpid":5139,"isSticky":false,"featured_image":null,"createdAt":1587294677204,"updatedAt":1588441790098,"author":"5e9b68b27a1236eccfeb1d16","old_image":"2011/03/scaled.the-naked-famous-188x188.jpg","categories":["music","reviews"]}