{"id":"5e9c31ce9b6559241525ddc6","title":"Review and Interview: Admiral Fallow (Manchester)","content":"<p>Nearly a year on from <strong>Crack In The Road</strong>‘s first encounter with <strong>Admiral Fallow</strong>, the band are in the process of rereleasing their debut album.</p><p> However do not jump to any conclusions, as I can reassure you this is no money grabbing exercise or sign of stagnation. Rather, the rerelease of ‘<strong>Boots Met My Face</strong>‘ marks a moment of progression in <strong>Admiral Fallow </strong>that holds a great deal of promise in communicating this fantastic ‘orchestral-pop-folk’ outfit’s music  to a wider audience.</p>\n<p>As myself and my gig compatriot, <strong>Hannah Berry</strong>, arrived, I realised the band’s performance at Manchester’s <strong>Deaf Institute </strong>was criminally undersold. However that did mean those who had made the proactive effort to discover the gig listing and turn up were honestly interested in the band. This created a very attentive atmosphere, though this may have contributed to the distinct sense of nervousness from the band to begin with. However after a few tracks the tentative nature of <strong>Admiral Fallow</strong>‘s performance swiftly diminished and was replaced with a relaxed and enthused display, which was interspersed with moments of jovial banter between lead singer <strong>Louis Abbott </strong>and the audience.</p>\n<p>The band performed their most well recognised tracks with a vibrant enthusiasm, while playing a couple of new, and very promising, tracks. <strong>Abbott </strong>told the crowd that one of the tracks was under a working title, however after a discussion over the <strong>Arsenal vs Barcelona </strong>score, it was decided that for this evening it should be called <strong>4-3 on Aggregrate</strong>. This was followed by a stunning a cappella performance by the whole band, which was rounded with a story of the band performing the same track in Dundee, only for the bar staff to think the gig was over and turn the background music on. As the gig ended and approached the normally predictable encore, <strong>Abbott </strong>took to the stage to perform a solo cover of <strong>Elbow</strong>‘s track ‘<strong>Switching Off</strong>‘ and entertain the audience with an incredibly absorbing and intimate version of the track.</p>\n<p>A very entertaining gig by a band that should certainly be on your musical radar.</p>\n<p>8/10</p>\n<p>Prior to the gig, <strong>Crack In The Road </strong>were lucky enough to catch up with the band – enjoy!</p>\n<p><strong>CITR: </strong>What sort of music did you listen to as you were growing up?</p>\n<p><strong>Louis Abbott: </strong>I guess there was a lot of <strong>Paul Simon</strong> as I was growing up, thanks to my father. During my teenage rebellious phase I’d say <strong>Gun N Roses</strong> and <strong>Metallica</strong>, still love ’em but never listen to them and they have never influenced anything we’ve ever done! However in more later years, and it’s nice to say this in Manchester, that I’ve been a massive <strong>Elbow </strong>fan for a long time. From a writing perspective, it’s definitely <strong>Elbow </strong>and even a bit of <strong>Bowie</strong> as well.</p>\n<p><strong>Sarah Hayes</strong>: I grew up playing, and still do play, loads of folk and traditional music, so I think that’s influenced my singing a lot!</p>\n<p><strong>CITR: </strong>What has been your favourite gig of all time and why?</p>\n<p><strong>LA: </strong>Ah, good question!</p>\n<p><strong>Phil Hague</strong>: You can have favourite ones because things go so shit! But I think most favourite and important was a gig we did at King Tut’s around <strong>T in the Park</strong><strong> </strong>time last year where they put up and coming local bands on the bill, and I think that seemed to go down really well. It felt like quite an important show in a way, as it established we’d hopefully be expanding outside of Glasgow.</p>\n<p><strong>LA: </strong>It was easy to tell it wasn’t your average Tut’s gig because we’d played at Tut’s a few times before, but on this occasion there seemed to be this extra buzz about the show, and we seemed to get a lot of the praise from it. I personally really enjoyed the London leg of the <strong>Frightened Rabbit </strong>tour at <strong>Shepherd’s Bush Empire</strong>, so it was nice and big and lots of great acts have played there before. Another gig which I think is going to be special is our gig at the<strong> Mercury Lounge</strong> in New York, which is part of this tour after we’ve played <strong>SXSW, </strong>as I’ve just found an old <strong>Jeff Buckley </strong>bootleg from when he played there, and he’s a huge hero of mine.</p>\n<p>Opening for <strong>King Creosote </strong>when he was doing a solo show in Glasgow was amazing. He’d sold it out and we even got to play some songs with him! I’d been listening to his music for years and years, and I was always worried about meeting him incase he was a dick, but he is honestly the sweetest guy I’ve ever met. So there’s been a lot of good ones, but those are a few of the best.</p>\n<p><strong>CITR: </strong>You mentioned gigs that stand out because they’re so shit, do any spring to mind? ..</p>\n<p><strong>Admiral Fallow </strong>(pretty much in unison): Bathgate!</p>\n<p><strong>LA: </strong>Bathgate .. just Bathgate! Bathgate is a town between Edinburgh and Glasgow, and it is just that. Now I don’t have anything against Bathgate, I’ve got some pals from Bathgate and they’re nice people, but fuck me is that a digusting wee town. We turned up to the venue, and I think there was one or two working monitors and the sound system was fucked up on one side. It was just a real shite hock of a venue. I think there was maybe 12 people at the show, and we’ve never done a faster load out! For people who have never heard of Bathgate, we went to grab a quick bite to eat before hand and on the Spar window, there was a sign that read ‘We are now able to sell alcohol from 10am on Sunday mornings’. So yeah, that puts it in to perspective really; a fucking shite hole.</p>\n<p><strong>CITR: </strong>Wow, fantastic! I’ll just get right on to the Bathgate Tourism Board for their thoughts ..</p>\n<p><strong>LA: </strong>Haha! ‘Band slams Bathgate!’. It’ll be like when Paolo Nutini took the piss out of Paisley, and he got in to real trouble for making fun of his home town and had to make a public apology!</p>\n<p><strong>CITR: </strong>Moving on to the album, the biggest question would be why are you effectively rereleasing it?</p>\n<p><strong>LA: </strong>Let’s just definitively put the cards on the table. When we first release the album last April, we pretty much self released it. It is on a label called Low 5, however that is just the name for the tiny group of people we were work with, i.e. our manager, and some other creative people. So it came out as a very small pressing of the record, initially through quite a small distribution company mainly in Scotland. When it came out we got some national Scottish paper reviews, and we did a little tour around Scotland and England for the record too. However since then we did the BBC Introducing Stage at T in The Park, which this year seems to be picking up some great moment, and I’ve started working with a publishing company who were able to inject a bit of money in to repressing the record and distributing it nationwide. Basically we’re all proud of the record and felt that it deserved to be given as big a push as we could afford to give it.</p>\n<p>So its not a money making scam or anything like that! There’s a new bonus track on the record, and we’ve rejigged the artwork, and we don’t want anyone to think we’re making people buy the same record twice ..</p>\n<p><strong>CITR: </strong>I’m afraid thats the tact the Bathgate tourism board may take ..</p>\n<p><strong>LA: </strong>Ha! The bonus track is going to be able to be downloaded separately for those who have already bought the album, so it’s just really ‘Hello England, now we’ve got some money so you can hear about us and perhaps come to one of our shows or buy our record’. So far it’s worked wonders because on the first tour we did, just before the record came out, the shows were ok but there weren’t a great deal of people there. However this time around we’ve already done three or four english shows and they’ve all been pretty full and attentive crowds, and to be honest it’s not even been that long since that’s started happening in Scotland. We’ve also recently been 6 music playlisted, so every little bit helps.</p>\n<p><strong>CITR: </strong>So you don’t feel that releasing the record last year may now feel a bit premature with the initial success of this rerelease?</p>\n<p><strong>LA: </strong>I don’t think it was premature really, as we’d been around for quite a while in Scotland. We were choking to record the 12 or so songs we had ready, and just to get them out, so we got a bit of money from the arts council and made a really good sounding record for the money we had. Although we maybe should have built up a bit of a ‘hype machine’ about the record, the word was already being spread about us in Scotland. We really couldn’t have sat on those songs for any longer without hating them.</p>\n<p>In a way we’re in a time warp where in Scotland, we’re ready to give them Number 2, and play all these new songs, however down here we’re worried people are just starting to hear our tracks, and over in America they haven’t really heard of us at all. So we’re time stretched as a band, however hopefully our arse end will catch up with us! Saying that, I’m not calling England the arse end of our music project ..</p>\n<p><strong>CITR: </strong>Yes, that’s probably a bigger tourism board that you wouldn’t want to upset ..</p>\n<p><strong>LA: </strong>Haha yeah!</p>\n<p><strong>CITR: </strong>You’re heading across to <strong>SXSW</strong>, was it something that came as a surprise or do you feel that it can be marked down as a justification for your hard work?</p>\n<p><strong>SH: </strong>Well every year you look at the line up and realise how amazing it is, and I think this year we felt that we had the ability to play their ourselves. When we got the news we were understandably excited, despite all the visas ..</p>\n<p><strong>LA: </strong>Yeah, the red tape can be a fucking nightmare. We know some slightly lesser known bands that were confirmed to play, but they heard back from the visa board that they didn’t believe who they said they were, or that they weren’t well known enough to be playing at the festival, so they were refused visas. There’s quite a bit of bullshit to get through, but we seemed to have just about to come through the other end. However it won’t be until I touch my feet down on the Texan soil that I’ll feel ok about it all and believe we’re playing there!</p>\n<p><strong>CITR: </strong>How long are you going to be in America for after <strong>SXSW</strong>?</p>\n<p><strong>LA: </strong>We’re doing 4 days in Texas, and then we’re flying to a town in North Carolina called Durham, and then it’s New York after that. We’ll probably do a few Gorrila gigs to take over the Empire State Building or something like that, you know, something ‘cooky’! Then our final show is in Boston, so it’s about 7 or 8 days.</p>\n<p><strong>CITR: </strong>Looking past America and to the summer, is the plan to further spread the <strong>Admiral Fallow </strong>word to the world, or will you begin to record the second album?</p>\n<p><strong>LA: </strong>It’s a bit of both really, as this is the first year which we would have done any English festivals. Which I think will really help.</p>\n<p><strong>CITR: </strong>Which festivals have you confirmed so far?</p>\n<p><strong>LA: </strong>Well, I don’t know if I can tell you. <strong>Green Man Festival </strong>and <strong>Truck Festival </strong>are confirmed, and then there are three other bigger festivals which I just don’t know .. I don’t want to say anything incase it gets us in trouble, but they’re really good festivals. If you were to say them, and my eye were to twitch, then I reckon you’d be able to guess, but we’ll do that later!</p>\n<p>[<strong>Ed: </strong>Unfortunately the festivals must remain secret for the time being, however they are of such magnitude that you are more than likely to see <strong>Admiral Fallow </strong>perform this summer!]</p>\n<p>On top of hopefully a wee bit of the radio play will be that we get at least 24 people coming to see us play! At the same time we’ll be working on number 2, and we hope to have that out early next year. To be honest we’re already feeling quite chuffed about the work we’ve already done for the second record, and we’re going to be playing live a few new songs that are hopefully are going to be on it. We’re always keen to play new songs, however this tour is supposed to be making people aware of the first one! It keeps us fresh, not that we trudge through the album and then go ‘Yes! Thank god for a new one!’. Well it might be like that, sometimes.</p>\n<p><strong>CITR: </strong>Are there any new and upcoming bands from Glasgow that we may otherwise not know of, but should?</p>\n<p><strong>LA: </strong><strong>Olympic Swimmers</strong>, who joined us on three dates on the Scottish leg of this tour. There used to be a band called <strong>Bad Dancer</strong>, who’s rhythm section play in loads of great bands. They play in <strong>Unwinding Hours </strong>and sometimes with <strong>Idlewild </strong>when they are away having babies and the like. <strong>Over the Wall</strong> are a pretty good, fun duo, kind of electro chaps! We wanted to bring them on tour as well, but it’s tricky as no one knows us, so when you bring another band that not many people know you’d be having trouble getting people through the door.</p>\n<p><strong>PH: Silver Columns </strong>are good fun too!</p>\n<p><strong>LA: </strong>I’m pretty keen on <strong>Rachael Sermanni </strong>too, but I’m sure she’s going to do alright even without us promoting her to the world! She’s coming to <strong>SXSW </strong>as well, and she’s doing well as a really great singer-songwriter.</p>\n<p><strong>CITR: </strong>Cheers for the insight in to Scottish music. However if we look at more established Scottish bands, how do you feel when many people instantly compare you to <strong>Frightened Rabbit? </strong></p>\n<p><strong>LA: </strong>Well many people do that purely on the basis of us both being Scottish, and we both share a similar sound. It’s not a bad thing, especially as <strong>Frightened Rabbit </strong>are a fantastic band! However what I’m more keen on is when someone brings in a total left field comparison, and actually you go ‘yeah I can here that now!’ and you’ve actually done your homework and not just been lazy and said, they’ve got a country song so they sound like <strong>Mumford & Sons </strong>or they’re Scottish so they sound like <strong>Frightened Rabbit</strong>.</p>\n<p>A while ago someone said we sounded like <strong>King Crimson</strong>! I don’t know their music but I’ve heard little bits and bobs, and I think that’s a more clever comparison. It doesn’t really matter at the end of the day, though it would be better not to have any comparisons and just to be unique.</p>\n<p>Many warm thanks to <strong>Admiral Fallow </strong>for a stellar performance and entertaining interview!</p>\n<p><strong><a href=\"https://www.myspace.com/admiralfallow\" target=\"_blank\">Admiral Fallow MySpace</a></strong></p>\n<p><script type=\"text/javascript\" src=\"https://video.unrulymedia.com/wildfire_11244048.js\"></script></p>\n","slug":"5170-review-and-interview-admiral-fallow","category":"interviews","date":1299795653000,"wpid":5170,"isSticky":false,"featured_image":null,"createdAt":1587294670774,"updatedAt":1588441790045,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2011/03/admiral-fallow-188x188.jpg","categories":["interviews","music","reviews"]}