{"id":"5e9c34549b6559241525e1ee","artists":["5e9b69577a1236eccfeb2650"],"title":"New: The Xcerts – Slackerpop","content":"<p><strong>The Xcerts</strong> are a band who are self-described as sounding like <strong><em>‘a pissed off Scotland</em>‘</strong>, with music oozing passion, angst and ferocity and hooks that you can’t forget.</p><p> Their debut record, <strong>‘In The Cold Wind We Smile’</strong>, was an amazing 12-track slab of distorted pop, laden with ‘oohs’ and ‘aahs’ but with a perfect, heavy element. These are the contrasting sounds  that earned them slots supporting many an artist, from Bat For Lashes to Biffy Clyro, from Future of the Left to Get Cape. Wear Cape. Fly.</p>\n<p><strong>‘Slackerpop’</strong> is the first offering we can hear from the band’s currently untitled second album and sees the boys take a darker, even heavier approach to their sound. <strong>Murray</strong>, the band’s frontman told <strong>Rocksound</strong> <em>“It’s the first song where we realised we could be a bit more raucous, a bit more 90s. It’s the first time I’m properly screaming as well, which is fun.”</em></p>\n<p>He later went on to talk further about the change of direction in their sound and hint at possible responses to the album, saying <em>“I really think this is going to be a love/hate record. I can’t see anyone being like, “This is okay.” I think a lot of people expected us to do a Biffy and make a pop record. I imagine there’s a small group of people who would want us to do exactly the same thing with that distorted pop sound again and I do believe those people will be extremely disappointed. There are still some big choruses, but there’s definitely not another ‘Just Go Home’ on there.”</em></p>\n<p>On first play, the track is a surprise in comparison to previous material. However, straight away the opening lines of the chorus are stuck in my head. <strong><em>“I’ll be your man, I’ll be your mannequin, oooh, oooh, oooh, oooooh…” </em></strong>Heavier riffs, screamed lyrics and another awesome chorus all give the impression that the band have nothing to worry about concerning their new sound. It may be risky but it’s <strong>definitely a progression</strong>.</p>\n<p style=\"text-align: center;\"><a class=\"aligncenter\" href=\"https://www.youtube.com/watch?v=fvo73wvAHE8\" target=\"_blank\">Kerrang Exclusive: Slackerpop video.</a></p>\n<p style=\"text-align: center;\"><a class=\"aligncenter\" href=\"https://www.myspace.com/thexcerts\" target=\"_blank\">The Xcerts’ MySpace.</a></p>\n","slug":"519-the-xcerts","category":"music","date":1272560636000,"wpid":519,"isSticky":false,"featured_image":{"width":600,"height":903,"src":"2010/04/murray.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAPAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAABwUG/8QAIhAAAgEDAwUBAAAAAAAAAAAAAQIDBAUSABEhBgcxQVGB/8QAFQEBAQAAAAAAAAAAAAAAAAAAAQT/xAAfEQABAgYDAAAAAAAAAAAAAAABAgQAAwURIUFRYZH/2gAMAwEAAhEDEQA/ACaGkHVXbuuq66Jzc7SoFPIpO88IBLceDgB69awEVmrJY0kSIFGAYHMeD+6oUT17UEkkOGHELZbEjIZbr83w5+6Z7f2n6nmoKaR7pbUd4lYoYgSpIHG4XnVsxs9crM1eb84gD6mNEhDlYQNW9Ou4/9k="},"createdAt":1587295316533,"updatedAt":1588403568472,"author":"5e9b68b27a1236eccfeb1d49","old_image":"2010/04/murray.jpg","categories":["music","reviews"]}