{"id":"5e9c31c99b6559241525ddbf","title":"Review: Elbow – Build A Rocket Boys!","content":"<p><a rel=\"attachment wp-att-5274\" href=\"https://admin.</p><p>crackintheroad.com/music/5272-review-elbow-build-a-rocket-boys/attachment/170919_elbow_18_6-tif\"><img class=\"alignnone size-900wide wp-image-5274\" title=\"170919_Elbow_18_6.tif\" src=\"https://api.crackintheroad.com/uploads/2011/03/elbow2-900x570.jpg\" alt=\"\" width=\"900\" height=\"570\" /></a>Mainstream success is, and always has been, a strange and difficult  thing for bands to deal with. For some, success is a poisoned chalice,  an albatross around their neck as they struggle to grapple with the  increased expectation and demands of a new rabid fan base. For a band  like Elbow success is the realisation of over a decade of struggling to  sell records and struggling to even exist consistently making great  records but to ever diminishing returns.</p>\n<p>2008’s The Seldom Seen Kid  saw Elbow finally achieve the mainstream success that some felt was a  long time coming. Ivor Novello’s, Brit Awards and the Mercury Prize were  garlanded on the band and they entered the national consciousness as  the media’s self appointed “Peoples band.”</p>\n<p>Build a Rocket Boys!,  their fifth album, arrives three years later as the first Elbow album  to ever be truly anticipated beyond a loyal fan base. Therefore, you  would imagine the pressure on the band to create a masterpiece to follow  The Seldom Seen Kid would be immense. On the contrary, Guy Garvey has spoken of  the success of The Seldom Seen Kid freeing the band from the pressure of  wondering whether or not they could actually release an album. Before  their move to Fiction records in 2007 and their indian sumer of 2008  they suffered from the constant fear of being dropped from their label.  The whole band have proclaimed Build a Rocket Boys!  to be the easiest and most enjoyable record to make of their career and  it is another outstandingly coherent and excellent Elbow record.</p>\n<p>There  is no grand reinvention here or a desire to challenge some of their new  found fan base. The hallmarks of all of Elbows records are present. A  sense of subtlety and intimacy coupled with wonderfully evocative lyrics  and imagery and Guy Garvey’s age-weathered but glorious croon.</p>\n<p>Thematically  the album is about looking back rather than looking forward. Guy Garvey  reminisces of his youth and the simple joy’s of childhood and the  thrills of first love in Lippy Kids and Jesus is a Rochdale Girl.  It is his skill as a writer that allows the listener to imagine  perfectly being a teenager on the streets of Bury and all the  possibilities of youth “Do they know these days are golden?” The title track of the album comes from this track as Garvey exhorts those lippy kids to “Build a Rocket Boys!” It is a truly heart-warming track.</p>\n<p>While there are no obvious anthems in the style of “Grounds for Divorce” or “One Day Like This” Build a Rocket Boys! sonically is slightly more adventurous than The Seldom Seen Kid. The  album is once again expertly produced and crafted by keyboard player  Craig Potter and it is his twinkling piano’s and soaring strings that  feature heavily on the record, never overpowering and always fitting the  mood perfectly. This album has more akin though  to Elbows debut Asleep in the Back with it’s nods to electronica in eight minute opener The Birds and Dear Friends wistful address to friends both present and departed evoking the sombre understated beauty of Scattered Black and Whites.</p>\n<p>Dear Friends,  the albums final track perhaps encapsulates the human quality that has  endeared Elbow to so many people. In the final verse Guy Garvey  eloquently and beautifully expresses his love for his friends and it is  this human touch that underpins Build a Rocket Boys! as another heartfelt and subtly beautiful record.</p>\n<p>“Dear  Friends/you are angles and drunks/you are maji/old friends/you stuck a  pin in the map I was in and you are the stars I navigate home by.”</p>\n<p>Despite now being a bone-fide star and gazing out from the cover of music magazines throughout the nation Build a Rocket Boys!  shows that Elbow and Guy Garvey have not been changed by success. Elbow  are a band grounded in the knowledge that while commercial gain and  fame and fortune is nice, it is the real things like home and friendship  that are really important. Elbow are a perfect example of a band that  have grappled with the conundrum of success and won.</p>\n","slug":"5272-review-elbow-build-a-rocket-boys","category":"music","date":1299887666000,"wpid":5272,"isSticky":false,"featured_image":{"width":188,"height":188,"src":"2011/03/elbow2-188x188.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAABgEH/8QAJBAAAgIBAwMFAQAAAAAAAAAAAQIDBBEFEiEABjEHEyJBUXH/xAAVAQEBAAAAAAAAAAAAAAAAAAAAAf/EABgRAAMBAQAAAAAAAAAAAAAAAAABETFR/9oADAMBAAIRAxEAPwDIYqentX1elXgYSQUNzV4L26JZAuHlPkPzjwTjjjHiv6bNI7PXe17LHKbqs2dv1n4/nQ/thimt1whKht6HBxlSjAj+EcdLtL7p7gi02pHFruqpGkKKqrckAUBRgAZ6NTC3p//Z"},"createdAt":1587294665808,"updatedAt":1588443779530,"author":"5e9b68b27a1236eccfeb1d33","old_image":"2011/03/elbow2-188x188.jpg","categories":["music","reviews"]}