{"id":"5e9c31b49b6559241525dda9","artists":["5e9b68d47a1236eccfeb1e3c"],"title":"Review: Bibio – Mind Bokeh","content":"<p><img class=\"alignnone\" title=\"Bibio\" src=\"https://www.</p><p>kzradio.net/uploads/2011/03/bibio_thumb.jpg\" alt=\"\" width=\"659\" height=\"461\" />If, like my younger brother, you become hooked on songs from adverts, then you may well have heard music from Bibio without realising it. The most recent Amazon advert for Kindle features <a href=\"https://www.youtube.com/watch?v=3Eks4gB9tbE\">Lovers’ Carvings</a>, a track from his superb 2009 release Ambivalence Avenue. It would be foolish to write Wilkinson off as a one hit wonder, as his consistent output of records show, he has a stunning ear for melody and composing intricately perfected rhythms.</p>\n<p>Released through Warp Records, Mind Bokeh is his sixth full length release if you include The Apple And The Tooth, a record largely comprised of remixes and album outtakes. Given the quality of Ambivalence Avenue, it’s safe to say this was quite comfortably one of my most anticipated album’s of the year, and possibly even the album to catapult him into the realms to mainstream success.</p>\n<p>Album opener Excuses was premiered on Pitchfork at the beginning of February, complete with a hauntingly fitting yet trippy video from Michael Robinson. The track itself sees Wilkinson creating a fantastical glitch-pop atmosphere in which the song moodily treads up until the final minute where it kicks into life, in resplendent style. His music, which is often described as folktronic, has a bewitching quality to it; entrancing the listener whilst never giving itself away to one genre.</p>\n<p>If there has been one criticism of Bibio’s musical career to date, it would be the occasionally repetitive feel to some of his tracks. Looping and sampling are key elements of his work, as is finding a hook and using it to maximum effect, whether it be vocals or an instrumental section. However occasionally these samples can be over used, and begin to become more memorable than the track itself.</p>\n<p>There’s arguably more variation on Mind Bokeh than his previous records, the soulful Pretentious leads into a heavily sidechained Anything New, featuring a Dilla influenced beat. Elsewhere there’s the rock heavy Take Off Your Shirt, that sounds like it could have slipped off the end of a Phoenix album, yet ends up sounding anything but convincing.</p>\n<p>The strongest tracks are where Bibio keeps to his electro roots, such as the atmospheric title track and the two minute blinder that is Feminine Eye. However, you can’t help but feel that it lacks the beauty often found in Bibio’s music; there’s nothing that even comes close to the hollow perfections of Fire Ant from Ambivalence Avenue. Perhaps this record will garner more interest in his music, however it may fall some way short of the expectations of his current fanbase.</p>\n<p>Listen to K is for Kelson from Mind Bokeh below.</p>\n<p><object classid=\"clsid:d27cdb6e-ae6d-11cf-96b8-444553540000\" width=\"100%\" height=\"81\" codebase=\"https://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=6,0,40,0\"><param name=\"allowscriptaccess\" value=\"always\" /><param name=\"src\" value=\"https://player.soundcloud.com/player.swf?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F11946405\" /><embed type=\"application/x-shockwave-flash\" width=\"100%\" height=\"81\" src=\"https://player.soundcloud.com/player.swf?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F11946405\" allowscriptaccess=\"always\"></embed></object> <span><a href=\"https://soundcloud.com/warp-records/bibio-k-is-for-kelson\">Bibio – K is for Kelson (taken from ‘Mind Bokeh’)</a> by <a href=\"https://soundcloud.com/warp-records\">Warp Records</a></span></p>\n","slug":"5292-review-bibio-mind-bokeh-2","category":"music","date":1300377312000,"wpid":5292,"isSticky":false,"featured_image":{"width":188,"height":188,"src":"2011/06/bibio_thumb-188x188.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFwAAAwEAAAAAAAAAAAAAAAAAAgMECP/EACUQAAIABQEJAQAAAAAAAAAAAAECAAMREiEEExQVMTJBU3GRof/EABQBAQAAAAAAAAAAAAAAAAAAAAL/xAAYEQEAAwEAAAAAAAAAAAAAAAABAAIRMf/aAAwDAQACEQMRAD8AzpstDw/WicHOuuTdrXBQLU3k074/YgWWto6OXjgRiU1MVlg49GFMoLEkD5Ba4GRWuPSf/9k="},"createdAt":1587294644642,"updatedAt":1588403559259,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/06/bibio_thumb-188x188.jpg","categories":["music","reviews"]}