{"id":"5e9c31c59b6559241525ddb8","title":"News: Latitude 2011 Line Up Announced","content":"<p>Now in it’s sixth year, Latitude has announced the first bunch of artists for this years line up.</p><p> Taking pride in their laid back attitude and conscientious approach to the punters, the event has been gathering increased momentum since it’s inception. The Suffolk Festival which runs from 14th-17th July, will feature The National, Paolo Nutini and the newly reformed Suede as headliners. However Latitude also excels as not only a music festival, but as an arts and film celebration, quite rightly cementing it’s name as one of the most diverse festivals in the UK. Also appearing over the weekend will be Bright Eyes, My Morning Jacket, Foals and Everything Everything amongst numerous other established acts. Melvin Benn had this to say about the event:</p>\n<p>“I am extremely proud of what has been achieved over the past five glorious years of Latitude. We’ve been listening to our loyal fans and this year, for our sixth edition, we are making some changes to the site which will further enhance everyone’s enjoyment of their favourite festival weekend. Latitude truly is ‘more than just a music festival’ and this year’s programme across the full spectrum of arts and music is utterly exceptional. We look forward to welcoming you to explore, discover and enjoy all that it has to offer.”</p>\n<p>See the full line up and ticket information at the <a href=\"https://www.latitudefestival.co.uk/2011/\">official festival site.</a></p>\n","slug":"5305-news-latitude-2011-line-up-announced","category":"editorials","date":1300133237000,"wpid":5305,"isSticky":false,"featured_image":{"width":165,"height":165,"src":"2011/08/2009_latitude_arena_andi-sapey-165x165.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAABAMG/8QAIhAAAgAFBAMBAAAAAAAAAAAAAQIAAwUREgQGIUEUIjGh/8QAFQEBAQAAAAAAAAAAAAAAAAAAAAX/xAAaEQACAgMAAAAAAAAAAAAAAAAAAgEEESFR/9oADAMBAAIRAxEAPwDJ0zZtGnqPHrDTDcAhyqXAHA+GBTNhabNsaxocbm3ox/e4lMATWKqAKua8DgQyY7iYwDNa57iO9h0nA1w//9k="},"createdAt":1587294661179,"updatedAt":1588403559364,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/08/2009_latitude_arena_andi-sapey-165x165.jpg","categories":["editorials","festivals","music"]}