{"id":"5e9c31c49b6559241525ddb7","title":"Film Review: Norwegian Wood","content":"<p>Director: Trần Anh Hùng</p>\n<p>Length: 133 minutes</p>\n<p>Language: Japanese (English subtitles)</p>\n<p>Drawing from Haruki Murakami’s own experience of the student uprisings in the late 60’s in Tokyo, Norwegian Wood is a multi-layered tale of love, rebellion and isolation.</p><p></p>\n<p>Perhaps the first thing worth mentioning about the film is that it is a Japanese production, not some oversimplified Hollywood blockbuster, and it is aimed at a Japanese audience, where Murakami is a household name, and intimate familiarity with the tale is commonplace.</p>\n<p>For those who have never read Norwegian Wood, it follows the story of Toru Watanabe during his time at university as he attempts to come to terms with the recent suicide of his closest friend, Kizuki, and his relationship with two girls: Naoko, the girlfriend of Kizuki, and Midori, a fellow student at his university. On the surface it is a fairly simple tale of choice, between the past with Naoko, and the future with Midori, but contains dark undercurrents concerning the nature of life, and death, and points of cohesion.</p>\n<p>The tale is told fairly accurately, and although engaging may tire those who aren’t familiar with the novel. With its rapid changes of pace as Trần Anh Hùng races through a hefty wedge of exposition, the first twenty minutes are somewhat disjointed and disorientating, making it almost a relief when Hùng focuses on a single scene for more than a couple of minutes. The dialogue is sometimes curt, and oddly surreal as single lines from the novel are inserted in odd places casually, but the main problem with the dialogue is the lack of internal monologue, which provides much of the intrigue and depth of the novel. There are two brief internal monologues from Watanabe, at the start, and at the end, and because of the omission of so much internal struggle, much of the emotional strength of the film is lost. Indeed, Watanabe comes across as exceptionally callous at points, and empathising with him feels far less natural. The student protests are largely ignored, which is a little jarring given that the first twenty minutes contain protestors in almost every urban shot, but overall not central enough to the plot to matter.</p>\n<p>Whilst there are always problems with adapting such a rich novel for the screen, and the problems with the adaptation are fairly typical, there is also a lot going for the film; the lines that may seem out of place to some, serve to refresh memory of the book, and perhaps hinting at occurrences in the book that are omitted in the film is more flowing than trying to cram everything in by extending the film further. The camera work is superb, a rich infusion of delicate and majestic shots, and holds artistic symbolism under analysis: the camera rotates to follow Toru as he is led in circles both physically and mentally by conversation with Midori and correspondence with Naoko, shots of Toru and Naoko contain fewer others and the background becomes less focused as Naoko loses her connection with the world, isolating both of them. From a less symbolic viewpoint, the photography is simply gorgeous, light is captured beautifully as it caresses flesh and fauna, and Hùng makes full use of the beautiful countryside of Japan to provide an elegant backdrop.</p>\n<p>The soundtrack is pleasant, although given all the musical references made by Murakami in the novel, choosing a selection of music to set the film to should be a fairly straightforward task. As with the camera work, much of the sound holds symbolism, with ambient weather providing audial pathetic fallacy, and with the position of characters vocal expression in the background of the mix at points serving to underline the isolation and distance the characters undergo.</p>\n<p>Overall, the film is as fine an adaptation as could be expected without an additional hour of internal struggle over lingering shots, and whilst not as rich as the novel, is still a thought-provoking and moving film which is definitely worth seeing whether you are familiar with Murakami’s work or not, although perhaps more coherent with prior knowledge of the book.</p>\n","slug":"5310-film-review-norwegian-wood","category":"arts","date":1300139593000,"wpid":5310,"isSticky":false,"featured_image":null,"createdAt":1587294660611,"updatedAt":1587825928632,"author":"5e9b68b27a1236eccfeb1d35","categories":["arts"]}