{"id":"5e9c31c29b6559241525ddb4","artists":["5e9b69517a1236eccfeb2638"],"title":"Review: The Strokes – Angles","content":"<p><a rel=\"attachment wp-att-5335\" href=\"https://admin.</p><p>crackintheroad.com/music/5328-review-the-strokes-angles/attachment/strokes_undercover\"><img class=\"alignnone size-650home wp-image-5335\" src=\"https://api.crackintheroad.com/uploads/2011/03/strokes_undercover-650x432.jpg\" alt=\"\" width=\"650\" height=\"432\" /></a></p>\n<p>This is it, then. Five years after the release of <strong>First Impressions of Earth</strong>, <strong>The Strokes</strong> are finally back. General fan-based and critical consensus, however, seems to imply a steadying decline in quality over the course of the band’s discography – from the masterpiece of <strong>Is This It</strong> to the very average<strong> First Impressions of Earth</strong>. So, does <strong>Angles </strong>break the trend? Is this a return to form for <strong>The Strokes</strong>?</p>\n<p>Well, yes and no. It’s an album that sounds both familiar and strange. From the classic <strong>Strokes</strong>-inspired <strong>Under Cover of Darkness </strong>(the album’s lead single) to the tragic melodies of <strong>Life is Simple in the Moonlight </strong>and the <strong>Muse-</strong>esque wailings of <strong>Metabolism</strong>, the album’s sound really is all over the place. Though that’s not necessarily a bad thing, the quality of music on offer, inevitably, varies wildly. Starting with the positive, the opening half of the album really is stunning. Opening track <strong>Machu   Picchu</strong>, with its South American influences and infectiously catchy vocals, stands out as easily one of the two best tracks on the album, and, some would say, could even be heralded as one of the best songs the band has ever written. From that platform of excellence, the album then launches straight into first single <strong>Under Cover of Darkness</strong>, a guitar-led reminder of the early 2000s, back when <strong>Is This It</strong> was released. Julian Casablancas’ iconic vocals and one of Nick Valensi’s trademark solos stand out, and one could be forgiven for (having heard only these two songs) believing that <strong>The Strokes</strong> may have just delivered a masterpiece.</p>\n<p>The rest of the first half of the album remains strong, too. Though not quite on par with the first two tracks, <strong>Taken for a Fool </strong>and <strong>Games </strong>(which is oddly reminiscent of the 1980s)<strong> </strong>should be highlighted as good, strong (though not exceedingly brilliant) songs. As we move into the second half of the album, however, things start to go a bit pear-shaped. <strong>Call Me Back </strong>is a somewhat dull track, and little good can be said about it. As well as this, <strong>Metabolism</strong> is a generic, ear-damaging song reminiscent of <strong>Muse </strong>in their darkest hour. A predictable riff and borderline annoying vocals don’t exactly help, either. Mercifully, <strong>Gratisfaction – </strong>a fantastically fun, laid-back song – just about makes up for this. The album’s closer, <strong>Life is Simple in the Moonlight</strong>, is also a standout track – though oddly out-of-place in how slow it is, it works nonetheless thanks to some genuinely great song-writing and fantastic instrumentation.</p>\n<p>Opinion will be split on this, then – that much is already clear. Under the circumstances (that is, a less-than-cohesive creative process marred by tensions in the band), this really is an excellent album – it is, after all, home to some tracks which many will inevitably regard as classics amongst <strong>The Strokes’ </strong>discography. However, after 6 years of waiting and tremendous amounts of hype, the occasional disappointing song and the relative shortness of the album may very well leave some fans wondering – is this it?</p>\n","slug":"5328-review-the-strokes-angles","category":"music","date":1300213259000,"wpid":5328,"isSticky":false,"featured_image":{"width":292,"height":50,"src":"2011/03/strokes_undercover-292x50.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAACAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAYH/8QAHhABAAICAQUAAAAAAAAAAAAAAQADBBESAgUGIXH/xAAUAQEAAAAAAAAAAAAAAAAAAAAA/8QAFBEBAAAAAAAAAAAAAAAAAAAAAP/aAAwDAQACEQMRAD8AwHt2RceOWpdYI8R5Po0OpL5SuTartet2v2Igf//Z"},"createdAt":1587294658853,"updatedAt":1588443779504,"author":"5e9b68b27a1236eccfeb1d16","old_image":"2011/03/strokes_undercover-292x50.jpg","categories":["music","reviews"]}