{"id":"5e9c31b39b6559241525dda8","title":"Review: Iron and Wine/Daniel Martin Moore (Gateshead)","content":"<p>Walking into <strong>Hall One </strong>at the <strong>Sage, Gateshead </strong>for the first time is an awe inspiring experience.</p><p> The fairly sizable hall, as I was informed by my colleague Josh Dalton who knows a thing or two about architecture, was designed with meticulous detail to every pane of wood and door handle (or lack of) to create the best possible sounding acoustics. This level of incredibly impressive sound meant that <strong>Hall One </strong>has the potential to turn a great show into an amazing show, and it did just that for <strong>Iron and Wine </strong>and <strong>Daniel Martin Moore</strong>.</p>\n<p><strong>Daniel Martin Moore:</strong></p>\n<p>A singer-songwriter from Kentucky who reached prominence after he sent an unsolicited demo to <strong>Sub-pop records</strong>, <strong>Daniel Martin Moore </strong>performed a serene set of Americana bliss. From the moment <strong>Moore </strong>began to speak, his distinctly southern American accent absorbed my attention and interest as every sentence he spoke sounded as if it was coated in warm molasses. <strong>Moore</strong>‘s first few tracks were performed very unassumingly, however immediately one could witness the the quiet power that underscored <strong>Moore</strong>‘s performance. As the set progressed, <strong>Moore </strong>began to engage with the very attentive crowd and humorously introduce them to each band member, before moving on to inform us of <strong>Mountaintop Removal </strong>and the problems that it causes. Normally I’m not a fan of bands using a performance as a platform to vent their anger or displeasure of political/environmental issues, essentially as people haven’t paid money for a ticket to hear about problems that they’re either already bombarded with or otherwise have no interest in.</p>\n<p>However, with all credit to <strong>Moore</strong>, he explained in a calm and fair fashion the problem of <strong>Mountaintop Removal </strong>(essentially a mining process which sees the literal removal of mountaintops that both poisons water supplies and damages the local wildlife), and the effects it has had on his state, his life, and his music. Obviously passionate about the issue, he performed <strong>Flyrock Blues</strong>, a track that takes its name from the massive boulders that fly from the high explosive detonations of mountaintops and potentially damage surrounding villages and towns. Incredibly intimate and emotional, <strong>Flyrock Blues </strong>was a particular highlight in a set that demonstrated one can be just as, if not more, powerful in quiet tones than in flares of loud cries.</p>\n<p>8/10</p>\n<p><strong><a href=\"https://www.myspace.com/danielmartinmoore\" target=\"_blank\">Daniel Martin Moore MySpace</a></strong></p>\n<p><strong>Iron and Wine:</strong></p>\n<p>Sam Beam, a.k.a. <strong>Iron and Wine</strong>, has developed his music over his past four albums with evolutionary ferocity that promised his performance would be interesting at the very least. Beginning all those years ago, <strong>The Creek Drank the Cradle </strong>cast <strong>Beam </strong>as rustic and typically americana acoustic with banjo plucking galore. As time progressed, <strong>The Shephard’s Dog </strong>veered away from such concrete definitions with ventures into unknown territory that maintained <strong>Iron and Wine</strong>‘s mystique while becoming more upbeat and open. <strong>Beam</strong>‘s most recent release, <strong>Kiss Each Other Clean </strong>has gone even further in developing his sound into a fuller and funkier experience.</p>\n<p>Attempting to cover these three albums was never going to be an easy task, however <strong>Beam & co </strong>managed to bridge these different elements of sound into a very convincing and entertaining performance. Each track that was performed was done so with a honest and excited level of commitment, even if <strong>Beam </strong>joked at one point ‘I hope y’all don’t mind us coming up here and fucking up our songs .. I figured you’ve all got the records at home anyway!’. There were moments in <strong>Iron and Wine</strong>‘s set where it felt the performance was somewhat dragging, mostly in periods of long instrumentals, however at a staggering one hundred and ten minutes, this performance was never going to be without its moments of slower energy. As we approached the end of the gig, the inevitable encore of <strong>Naked As We Came </strong>was met with roaring approval, and <strong>Beam</strong>‘s seemingly spontaneous decision to slightly speed up the track acted as a fitting tribute to energy that the band had mastered throughout their performance.</p>\n<p><strong>Beam & co </strong>should be credited with producing a performance that both showcased their incredible musical talent and dexterity, while encapsulating the raw emotion that made many so fond of <strong>Iron and Wine </strong>all those years ago.</p>\n<p>9/10</p>\n<p><strong><a href=\"https://www.myspace.com/ironandwine\" target=\"_blank\">Iron and Wine MySpace</a></strong></p>\n<p><strong><br />\n</strong></p>\n","slug":"5384-review-iron-and-winedaniel-martin-moore-gateshead","category":"music","date":1300383629000,"wpid":5384,"isSticky":false,"featured_image":null,"createdAt":1587294643107,"updatedAt":1588441789912,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2011/03/iron-and-wine-292x50.jpg","categories":["music","reviews"]}