{"id":"5e9c31b69b6559241525ddac","artists":["5e9b69257a1236eccfeb2378"],"title":"Obituary: Nate Dogg ‘First We Pray’","content":"<p style=\"text-align: right;\"><em>“Heavenly father shine your light on me<br />\nI know I promise to slow down on this weed<br />\nSeems I remember someone used to say<br />\nOne life gets taken, if you take one life away </em></p>\n<p style=\"text-align: right;\"><em>First we pray, then we ride”</em></p>\n<p><strong>As of March 15th 2011, Nate Dogg no longer rides with us after a series of strokes caused complications and killed him at a care facility in California.</p><p> He was 41.</strong></p>\n<p>Nathaniel Dwayne Hale was an american musician providing swagger to Long Beach gangster rap with a chasmic baritone voice, known for the entirity of his career under the stage name Nate Dogg.</p>\n<p>Nate was born to a pastor on August 19, 1969. The bright young son of a preacher man began singing in Long Island baptist churches. From an early age, he was immersed in faith and music but disillusioned by society, leaving school to join the US Marine Corps at the tender age of sixteen.</p>\n<p>When he returned to Long Beach three years later, His friends – Snoop Dogg, Warren G and RBX – had already found their voice in the rap game. Nate, who was a member of the Rollin 20 Crips formed a rap trio with Snoop and Warren G called the 213.</p>\n<p style=\"text-align: center;\"><img class=\"aligncenter\" src=\"https://api.crackintheroad.com/uploads/2011/03/snoopdogg_6_213_1024-e1300374233181-494x192.jpg\" alt=\"\" width=\"494\" height=\"192\" /><a href=\"https://www.youtube.com/watch?v=VZ2DSbq76vI\">213 – The Hard Way (via YouTube)</a></p>\n<p>213 recorded their first backroom demo in Long Beach record store, V.I.P.  Later, at a house party, someone span the record for the crowd, a young Dr. Dre was in attendance, was interested in Nate’s voice and asked him to feature on Dre’s debut album, <em>The Chronic.</em></p>\n<p>Well received by the fans and with the support of his hip-hop homies, Nate signed with Death Row Records in 1993, appeared on hit single <a href=\"https://www.youtube.com/watch?v=1plPyJdXKIY\">Regulate</a> in 1994 and went on to feature on many of Tupac’s releases including his collaborative masterpiece <em>Thug Life: Volume I.</em></p>\n<p>In 1998, Nate Dogg, who was still dealing with becoming hip hop royalty, split from Death Row after arguments concerning the release of his album <em>G-Funk Classics Vol. 1 & 2</em> which he had finished in ’96. He later described these last few months at Death Row a “troubled time” and in late 98 finally released <em>G-Funk Classics Vol. 1 & 2</em> on a different label. The double album was followed up in 2001 with <em>Music & Me</em> on Elektra Records. Music & Me peaked at number three on the Billboard hip-hop charts in 2001.</p>\n<p style=\"text-align: right;\"><em>“I know you gotta get paid, I can show you the way<br />\nSo take me home, polish the chrome<br />\nLoad me up, and put me to his dome<br />\nI got a lot work to do, so toss me and be gone”</em></p>\n<p>Nate Dogg’s lyrics are sprinkled heavily with references to the crimes he’d allegedly commited. It turned out he didn’t just talk the talk and in Arizona, April 2002, his tour bus was pulled over by the police, they found marijuana, drug paraphernalia, and stolen firearms. He was arrested, plead guilty and released after paying bail of $3,500.00.</p>\n<p><a href=\"https://www.youtube.com/watch?v=zEQClcRBxw8\">Nate Dogg – Hardest Man In Town (via YouTube)</a></p>\n<p>By 2004, Nate Dogg had featured on and contributed to over 40 chart singles, but he’d still not had a chance to release another album since 2001. It wasn’t until June 2008 that Nate’s self-titled album Nate Dogg was released on the Affiliated Entertainment Group label. By this time the popularity of West Coast hip hop has dropped and Nate’s album was just another disc in a sea of songs about guns, drugs & bitches.</p>\n<p style=\"text-align: left;\">Nate Dogg continued to collaborate with other artists including his old friend Snoop Dogg and in 2007 his life turned full circle and he formed a gospel choir reminiscent of the one he had sung in as a child. Soon after this, Nate had a heart attack, was rushed to Pomona Valley Hospital where he suffered a subsequent stroke. The left side of his body was left paralysed and he was unable to speak. In December 2007 he was admitted to a rehabilitation facility, Doctors believed Nate would make a full recovery and his voice would not be affected. In September 2008, Nate suffered a second stroke. At the time he was going through physiotherapy in an attempt to return to normality but on March 15, 2011  Nate was pronounced dead. His cause of death was listed as complications related to his previous strokes. Old collaborators and gangbangers ranging from Ice-T to Eminem sent their condolences to Nate’s family. Nathaniel Dwayne Hale exited stage left for the last time.<em></em></p>\n<p style=\"text-align: right;\"><em>“There’s no telling where I would be if I didn’t know how to do this music thing. Sometimes I would be about to lose my mind and want to knock somebody in the head or something, then I could hear a song and just chill out. It calms the savage beast.” – Nate ’98</em></p>\n<p><a href=\"https://admin.crackintheroad.com/music/5389-obituary-nate-dogg-first-we-pray/attachment/nate_dogg__500/\" rel=\"attachment wp-att-5391\"><img class=\"aligncenter size-full wp-image-5391\" src=\"https://api.crackintheroad.com/images/2011/03/nate_dogg__500.jpg\" alt=\"Nate Dogg - Thought he would never die\" width=\"500\" height=\"341\" srcset=\"https://api.crackintheroad.com/images/2011/03/nate_dogg__500.jpg 500w, https://api.crackintheroad.com/images/2011/03/nate_dogg__500-260x177.jpg 260w, https://api.crackintheroad.com/images/2011/03/nate_dogg__500-494x336.jpg 494w, https://api.crackintheroad.com/images/2011/03/nate_dogg__500-165x112.jpg 165w\" sizes=\"(max-width: 500px) 100vw, 500px\" /></a> As of March 15th 2011, Nate Dogg no longer rides with us after a series of strokes caused complications and killed him at a care facility in California. He was 41.<br />\nNathaniel Dwayne Hale was an american musician providing swagger to Long Beach gangster rap with a chasmic baritone voice, known for the entirity of his career under the stage name Nate Dogg.</p>\n","slug":"5389-obituary-nate-dogg-first-we-pray","category":"music","date":1300371365000,"wpid":5389,"isSticky":false,"featured_image":null,"createdAt":1587294646197,"updatedAt":1588441789937,"author":"5e9b68b27a1236eccfeb1d40","old_image":"2011/03/natedogg-188x188.jpg","categories":["music","news"]}