{"id":"5e9c34529b6559241525e1eb","title":"Interview: James Yuill","content":"<p style=\"text-align: center;\">Standing as a one man band, <strong>James Yuill</strong>‘s sound has been described as ‘<em>Nick Drake given a machine pulse by New Order</em>‘.</p><p> His use of quietly powerful acoustic tones combined with pulsating electronic beats allows <strong>James Yuill</strong> to create songs with a melancholy that you can’t help but want to dance to. His debut album ‘<strong>T</strong><strong>urning Down Water for Air</strong>‘ was well received by critics and fans alike, with many labeling <strong>James Yuil</strong><strong>l</strong> as a promising artist to watch. While some may argue that he may not have reached the lofty heights that were once predicted, <strong>James Yuill</strong>‘s new album due out in June, entitled ‘<strong>Movement in a Storm</strong>‘, promises to further hone this brilliantly unique sound.</p>\n<p style=\"text-align: center;\">\n<p style=\"text-align: center;\"><em>CITR:</em> If you had to cite one band/artist as a major influence upon you, who would it be?</p>\n<p style=\"text-align: center;\"><strong>Well I think Nick Drake has been a massive influence. I first listened to his music when I was at university. It completely changed the way I played guitar. I started de-tuning strings and getting into acoustic music (as I’d been fully into Nirvana, Korn and Deftones for the years before).</strong></p>\n<p style=\"text-align: center;\"><em>CITR:</em> What has been your favourite gigging experience to date?</p>\n<p style=\"text-align: center;\"><strong>I think playing at British Anthems in Japan last year. It was weird to travel so far away from my bedroom and have people know all the songs and be so into it.</strong></p>\n<p style=\"text-align: center;\"><em>CITR: </em>Your debut album ‘Turning Down Water for Air’ appears to present the various consequences of love, from the strength it can create to the hurt it can inflict. Is it this essential nature of love that inspired you to create the album?</p>\n<p style=\"text-align: center;\"><strong>I guess I can’t help but write songs about love both positive and negative. With this new album I’ve tried to vary it slightly. There are some more ambiguous ones on there and some obvious too.</strong></p>\n<p style=\"text-align: center;\"><em>CITR:</em> Many critics have labelled your music ‘folktronica’, would you say this is accurate? If so, what inspired you to combine your mellow acoustic elements with upbeat electronic rhythms?</p>\n<p style=\"text-align: center;\"><strong>Well I don’t mind people describing my music as folktronica. I don’t think it’s that folky or that glitchy. I’d say it was more acoustic house? But that doesn’t really work either… I first started out playing gigs on the London circuit with only a guitar. It was when I wanted to record my album ‘The Vanilla Disc’ that I decided to produce it differently. I originally wanted to mix acoustic songs with Amon Tobin style production, but it was hard to find samples and pitch them appropriately. I then discovered the joys of putting a house beat on everything. Instant dance music!</strong></p>\n<p style=\"text-align: center;\"><em>CITR:</em> You were listed as ‘Best Newcomer of 2008’ in Clash Magazine, how has your musical career developed since then?</p>\n<p style=\"text-align: center;\"><strong>Well I’m very honoured to have been called that. I don’t think much has changed. I’ve been touring for a while. I guess we’ll see when the album comes out what people really think of me.</strong></p>\n<p style=\"text-align: center;\"><em>CITR: </em>Your next album, ‘Movement in a Storm’ is being released this summer. As the title suggests change, what developments can we expect in your sound in this album?</p>\n<p style=\"text-align: center;\"><strong>Well it’s more focused and it contains the full range of my musical styles. I also think it’s a more song based album (I know that probably sounds a bit weird as all albums are effectively song based), but I sat down to get some really hard electro tracks on there but it turns out that all the best ones were written on the guitar first and then produced up to be electronic. I think my production skills have come on a bit more. It’s a more developed sound.</strong></p>\n<p style=\"text-align: center;\"><em>CITR:</em> PC or Mac?</p>\n<p style=\"text-align: center;\"><strong>Mac definitely.</strong></p>\n<p style=\"text-align: center;\"><em>CITR:</em> What is your favourite TV advert?</p>\n<p style=\"text-align: center;\"><strong>I</strong><strong> quite liked those ads for Rocky Biscuit bars. They were genuinely funny, something that is rare in adverts these days.</strong></p>\n<p style=\"text-align: center;\"><em>CITR: </em>If you could be any animal, which animal would you be?</p>\n<p style=\"text-align: center;\"><strong>A bird. I would love to have the experience of flying under my own power.</strong></p>\n<p style=\"text-align: center;\"><strong><span style=\"font-weight: normal;\"><a href=\"https://www.myspace.com/jamesyuill\" target=\"_blank\">Check out James Yuill’s Myspace!</a></span></strong></p>\n<p><iframe src=\"https://www.facebook.com/plugins/likebox.php?id=114090381951328&width=292&connections=10&stream=false&header=false&height=255\" scrolling=\"no\" frameborder=\"0\" style=\"border:none; overflow:hidden; width:292px; height:255px;\" allowTransparency=\"true\"></iframe></p>\n","slug":"541-5-minutes-with-james-yuill-2","category":"interviews","date":1272690777000,"wpid":541,"isSticky":false,"featured_image":{"width":600,"height":556,"src":"2010/04/james-yuill.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAJAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAwUG/8QAJhAAAAQEBQUBAAAAAAAAAAAAAQIDBQAEEjEGETVBshQhQlFzdP/EABQBAQAAAAAAAAAAAAAAAAAAAAL/xAAaEQEAAgMBAAAAAAAAAAAAAAABAAIDESEx/9oADAMBAAIRAxEAPwB1cUoN+IG1tlk5dVIyQFW3Ex/Lva1s9whJhZDqFaShTUOVvcTGnTXL9CnKMW6anN/Y/IYRmcar3cLQuB5qf//Z"},"createdAt":1587295314690,"updatedAt":1588403568444,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2010/04/james-yuill.jpg","categories":["interviews","music"]}