{"id":"5e9c31b09b6559241525dda2","artists":["5e9b68e07a1236eccfeb1f1b"],"title":"Review: Coma Cinema – Blue Suicide","content":"<p><a rel=\"attachment wp-att-5454\" href=\"https://admin.</p><p>crackintheroad.com/music/5431-review-coma-cinema-blue-suicide/attachment/coma\"><img class=\"alignnone size-900wide wp-image-5454\" title=\"coma\" src=\"https://api.crackintheroad.com/uploads/2011/03/coma-900x675.jpg\" alt=\"\" width=\"900\" height=\"675\" /></a>Upon first glance, it may appear that Coma Cinema has developed a morbid and unhealthy curiosity with suicide. From the title of his newest record, to the quirky video for the track of the same name shot by Tyler T Williams, there’s a foreboding bleak shadow surrounding his recent output. With your first experience of Blue Suicide you would be forgiven for thinking this, however with further listens, the facade of this elegant record peels away and it’s true beauty is revealed.</p>\n<p>Mat Cothran, the inspiration behind Coma Cinema bares no bones about the blighted view he portrays of life in much of his work, it’s partially what makes this record so mesmerizing. Two minutes into the album, and Cothran is drawling “no one cares, it’s easier to quit”, if it wasn’t for the comforting way in which the vocals were delivered, it would make the record entirely disheartening. The majority of the tracks are short, concise bursts of creativity, there’s no diluting of instrumental sections or drawn out lullabies, just beautiful lo-fi inspired songs. Greater Vultures again finds Coma Cinema in a desolate place, bemoaning “are you willing to eat what the vultures will not?” a lyric that’s as open to interpretation as intended.</p>\n<p>Yet it’s partly this mystery that makes Blue Suicide so fantastic, sure there’s an overcast sense of death and pain lurking suspiciously around the record, but it doesn’t allow itself to dwell upon these emotions themselves, more examines the causation and circumstances behind such feelings. Take Caroline, Please Kill Me for example; whilst seeming mournful and oppressive on first listen; further plays reveal it’s not as much an ode to a poetic and vicious girl, but more to the emotions that can be aroused by members of the opposite sex.</p>\n<p>Elsewhere, Wondering is one the few tracks on the record that does shine a pale ray of glowing light over Blue Suicide. Showcasing a relatively upbeat sound, almost drenched in sarcasm compared to the tempo and atmosphere of the other tracks, but it forms a welcome break in the middle of the record. As if to shrug off any chance of alteration of character, shoegaze influenced number Her Sinking Sun sees Cothran at his most unstable, as he almost weeps “torn apart from everyone, the sinking sun, I watch her die”. There’s no denying it’ll stir some form of emotional response.</p>\n<p>Gentlewoman again picks up the tone slightly, yet is far from being as resplendent or joyous as the music from Toro y Moi or Washed Out, two other “bedroom artists” hailing from his surrounding area, however that doesn’t detract from the beauty it contains. The title track is a fully flushed beauty of a track, complete with a drowsy melancholic organ and vacantly delivered lyrics, fitting perfectly to the video directed by Tyler T WIlliams.</p>\n<p>My personal favourite track, and one of the standout songs from this year thus far, is the alluring Eva Angelina, again shrouded with ambiguity. For those of you not aware of Angelina, she was a late 90’s adult movie star, whose boyfriend committed suicide in peculiar and unexpected circumstances, certainly an interesting concept for a song. Centred around the lyric, “I want to know, what Eva Angelina knows”, it’s much like her life, seductive, arduous yet still maintaining the essence of what makes us humans. It’s on this that Blue Suicide excels; sure it has it’s depressing, downtroden moments, but ultimately it’s a record about the highs and lows of being alive, and the subtleties of life that make it worthwhile. “Is your heart to big to be broken?” yearns Cothran on Tour All Winter; after several listens to Blue Suicide you should find yourself able to answer that question.</p>\n<p><a href=\"https://comacinema.org/sounds.html\">Download Blue Suicide</a></p>\n<p><a href=\"https://forkandspoonrecords.net/\">Order the record on vinyl</a></p>\n<p><a href=\"https://wonderbeardtapes.tumblr.com/\">Or on cassette</a></p>\n","slug":"5431-review-coma-cinema-blue-suicide","category":"music","date":1300388258000,"wpid":5431,"isSticky":false,"featured_image":{"width":292,"height":50,"src":"2011/03/coma-292x50.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAACAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAYH/8QAHhAAAgICAgMAAAAAAAAAAAAAAQIAAwQRBhIHUXH/xAAUAQEAAAAAAAAAAAAAAAAAAAAF/8QAHREAAAUFAAAAAAAAAAAAAAAAAAECAzMEQXHB8P/aAAwDAQACEQMRAD8AgfHV91fA88122IUoyAvViOoJTevuhuZQ7MWYkkkn3EQWkmcztQUfjT1iH//Z"},"createdAt":1587294640038,"updatedAt":1588443779454,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/03/coma-292x50.jpg","categories":["music","reviews"]}