{"id":"5e9c31ae9b6559241525dd9f","artists":["5e9b69377a1236eccfeb2472"],"title":"Review: R.E.M. – Collapse Into Now","content":"<p><a rel=\"attachment wp-att-5472\" href=\"https://admin.</p><p>crackintheroad.com/music/5434-review-r-e-m-collapse-into-now/attachment/rem-collapse-into-now\"><img class=\"alignnone size-full wp-image-5472\" title=\"rem-collapse-into-now\" src=\"https://api.crackintheroad.com/uploads/2011/03/rem-collapse-into-now.jpg\" alt=\"\" width=\"608\" height=\"608\" srcset=\"https://api.crackintheroad.com/images/2011/03/rem-collapse-into-now.jpg 608w, https://api.crackintheroad.com/images/2011/03/rem-collapse-into-now-165x165.jpg 165w, https://api.crackintheroad.com/images/2011/03/rem-collapse-into-now-260x260.jpg 260w, https://api.crackintheroad.com/images/2011/03/rem-collapse-into-now-494x494.jpg 494w\" sizes=\"(max-width: 608px) 100vw, 608px\" /></a></p>\n<p>Collapse Into Now is R.E.M.’s fifteenth studio album, and like many established artists with such an extensive back-catalogue, R.E.M. seem to have succumbed to musical stagnation.</p>\n<p>If you didn’t care for Accelerate or Around The Sun, stop reading here. If you didn’t enjoy either of them, it’s not worth listening to Collapse Into Now. There’s all the usual talk about R.E.M. sounding more like their earlier work that seems to come from various quarters every time they release an album; they don’t.</p>\n<p>Sound-wise, the album is particularly close to Accelerate, with hints at the most gentle points of Around The Sun.  The titles are often unimaginative, with the more adventurous titles sounding more ludicrous than poetic. The lyrics are fairly typical of later R.E.M., punchy and with an obvious attempt to return to the mumbling poetry of early work, albeit with none of the mumbling. Mike Stipe’s voice is almost tedious, with little variation in tone, and lacking the sensitivity of albums like Out Of Time and Automatic For The People.  Oh My Heart and Walk It Back allow his voice more space to work, but lack enough passion to be of any real interest.  The guitar lines are pleasant if you enjoy the direction Accelerate took, but otherwise become a little tiresome.</p>\n<p>Something that may excite some R.E.M. fans is the return of Patti Smith, who co-wrote and contributed vocals to Blue, and has a minor uncredited vocal part in Alligator Aviator Autopilot Antimatter. Whilst the combination of Patti Smith and Mike Stipe may be very fine, Blue seems almost like a duller version of E-bow The Letter: spoken word from Stipe,  vocals later on from Smith to lift the song into something altogether more powerful. Whilst Blue is perhaps one of the best tracks on the album when considered alone, it seems rather weak in comparison to E-bow.  For some reason the album has been produced so that Blue will go smoothly into Discoverer if played on repeat, but it seems unlikely that anybody will enjoy it so much as to play it on repeat.</p>\n<p>R.E.M. have perhaps released enough lacklustre material in recent years to convince even some of the most dedicated fans that a return to anything like peak performance is off the cards. They come across as a band who have said all they need to say, and whilst new music is still welcome to avid fans, it is unlikely to capture the imaginations of anybody else.</p>\n<p>Tracks to listen to: Walk It Back, Mine Smell Like Honey, Blue</p>\n","slug":"5434-review-r-e-m-collapse-into-now","category":"music","date":1300403724000,"wpid":5434,"isSticky":false,"featured_image":{"width":292,"height":50,"src":"2011/03/rem-collapse-into-now-292x50.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAACAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAYH/8QAIhAAAgEDAwUBAAAAAAAAAAAAAQIDAAQRBQYHEhNCUXGR/8QAFAEBAAAAAAAAAAAAAAAAAAAAAv/EABoRAAICAwAAAAAAAAAAAAAAAAABAgMxMnH/2gAMAwEAAhEDEQA/AMw5OAHIGhQgARdtG6PHJdgTj4B+Cqjbdpby7d0uSWCJ5HtYmZmQEsSgySfdKUK9FwUss//Z"},"createdAt":1587294638262,"updatedAt":1588443779427,"author":"5e9b68b27a1236eccfeb1d35","old_image":"2011/03/rem-collapse-into-now-292x50.jpg","categories":["music","reviews"]}