{"id":"5e9c34509b6559241525e1e8","title":"Interview: Patch William","content":"<p style=\"text-align: center\"><strong>Stephen Fry</strong> has called them ‘<em>rather wonderful</em>‘ and they have been nominated for an <strong>Ivor Novello</strong> award, all while under the guidance of producer <strong>Steve Levine,</strong> who has worked with such bands as <strong>The Beach Boys </strong>and <strong>Culture Club.</p><p> </strong>In other words, they’re the band that the 165 ‘tastemakers’ of the BBC ‘Sound of 2010’ list criminally over looked. However <strong>Patch William </strong>won’t remain under the radar for much longer, as with comparisons to the <strong>Strokes</strong>, <strong>Damien Rice</strong>, <strong>the XX</strong>, and the <strong>Maccabees</strong>, their sound is destined to be heard on festival stages across the country. <strong>Cr</strong><strong>ack in the Road</strong> were lucky enough to be able to catch up with <strong>Patch William</strong> and find out more about their origins.</p>\n<p style=\"text-align: center\"><em>CITR:</em> If you had to cite one band/artist as a major influence upon you, who would it be?</p>\n<p style=\"text-align: center\"><strong>Jimi Hendrix has had a huge influence on us. We all love the blues and think he’s amazing.</strong></p>\n<p style=\"text-align: center\"><em>CITR:</em> What has been your favourite gigging experience to date?</p>\n<p style=\"text-align: center\"><strong>An unanimous answer (surprisingly, we disagree on many things!):  playing at Dirty South in Lewisham with the Maccabees. The crowd was fuelled with energy. People were coming up on stage and playing air guitar. It was a great vibe.</strong></p>\n<p style=\"text-align: center\"><em>CITR: </em>Critics have drawn comparisons to the Strokes, Damien Rice, the XX, and the Maccabees amongst many others in an attempt to classify your music. How would you describe your sound?</p>\n<p style=\"text-align: center\"><strong>Hmmm…this is always a tricky one. The words we tend to associate with our music are dreamy and delicate, yet raw and energetic. There are powerful electric guitar solos to plaintive cello lines…pretty extreme, we know!</strong></p>\n<p style=\"text-align: center\"><em>CITR: </em>You’ve recently been nominated for the Ivor Novello award in the category of ‘Best Song Musically and Lyrically’, competing against the likes of Lily Allen and The Leisure Society. This coupled with a declaration by the great Stephen Fry that he is a fan of you all, how has the band as a whole dealt with this sudden recognition?</p>\n<p style=\"text-align: center\"><strong>We’re over the moon! We have worked hard over the past few years and, of course, want Patch William to be successful. But, not in our wildest dreams, did we imagine an Ivor nomination, especially so early on in our careers. Stephen Fry has been hugely helpful and supportive of the band. The day he tweeted a link to our video of ‘The Boy With The Guitar’, we watched the viewing figures climb higher and higher to about 18,000…we put it down to the power of Fry.</strong></p>\n<p style=\"text-align: center\"><em>CITR:</em> ‘Last Bus’, the song that received the Ivor Novello nomination, is quite haunting yet serene to listen to. Could you explain a little more about the inspiration and the meaning of the song?</p>\n<p style=\"text-align: center\"><strong>This song was written by Will on acoustic guitar when he was 16. It was inspired by a a girl who, metaphorically, missed the last train/plane/bus. Basically she missed her last chance.</strong></p>\n<p style=\"text-align: center\"><em>CITR:</em> You have a self-titled album out and the ‘Last Bus’ EP has just been released. Are you planning on any UK tour dates? Or is there more new music to come from Patch William in the near future?</p>\n<p style=\"text-align: center\"><strong>We have recently met with  ITB an agent – we are planning a tour in September. Before then we are planning a UK mini-tour (venues and dates still being discussed) before heading over to New York in June for a few days to play and record. In conjunction to this, we are constantly working and writing new material for our next album.</strong></p>\n<p style=\"text-align: center\"><em>CITR:</em> It has been reported you like to keep control over your work, recording your own songs and rehearsing in Will’s father’s basement. Is this simply a necessity of being relatively unknown, or is this self-sufficient nature of the band vital to your sound?</p>\n<p style=\"text-align: center\"><strong>We believe it’s both. Whilst lack of funds prevents us from hiring out recording and rehearsal studios, it aides us in that we have complete control over our sound. We are lucky  to have direcion from our producer Steve Levine, but, as a group we call the shots. This is important to us.</strong></p>\n<p style=\"text-align: center\"><em>CITR:</em> PC or Mac?</p>\n<p style=\"text-align: center\"><strong>3 out of 4: Mac</strong></p>\n<p style=\"text-align: center\"><em>CITR:</em> QI or Have I Got News for You?</p>\n<p style=\"text-align: center\"><strong>QI, of course!</strong></p>\n<p style=\"text-align: center\"><em>CITR: </em>If you could have any super power, what would it be?</p>\n<p style=\"text-align: center\"><strong>We would love to fly.</strong></p>\n<p style=\"text-align: center\"><strong><span style=\"font-weight: normal\"><a href=\"https://www.myspace.com/patchwilliam\" target=\"_blank\">Check out Patch William’s Myspace!</a></span></strong></p>\n<p><iframe src=\"https://www.facebook.com/plugins/likebox.php?id=114090381951328&width=292&connections=10&stream=false&header=false&height=255\" scrolling=\"no\" frameborder=\"0\" style=\"border:none; overflow:hidden; width:292px; height:255px;\" allowTransparency=\"true\"></iframe></p>\n","slug":"555-5-minutes-with-patch-william","category":"interviews","date":1272708045000,"wpid":555,"isSticky":false,"featured_image":{"width":1544,"height":1024,"src":"2010/05/patch-william2.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAEF/8QAIRAAAQQCAgIDAAAAAAAAAAAAAQIDBAUAERIhBzEiQVH/xAAVAQEBAAAAAAAAAAAAAAAAAAAFBv/EABwRAAICAgMAAAAAAAAAAAAAAAECBDEAAwVBcf/aAAwDAQACEQMRAD8AlnfNXdDKvLOE64IkRbvBmTx5MnZRrafafkDv7/R3mJE871rcRlDsSQXEoSlRIGyQO/Q1jGT0biI29SHFY5NmbEISwKB68z//2Q=="},"createdAt":1587295312715,"updatedAt":1588403568418,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2010/05/patch-william2.jpg","categories":["interviews","music"]}