{"id":"5e9c31a19b6559241525dd86","artists":["5e9b69517a1236eccfeb2629"],"title":"Review: The Pains Of Being Pure At Heart – Belong","content":"<p><a rel=\"attachment wp-att-5639\" href=\"https://admin.</p><p>crackintheroad.com/music/5571-review-the-pains-of-being-pure-at-heart-belong/attachment/149222-pobpah525\"><img class=\"alignnone size-900wide wp-image-5639\" title=\"149222.pobpah525\" src=\"https://api.crackintheroad.com/uploads/2011/03/149222.pobpah525-900x428.jpg\" alt=\"\" width=\"900\" height=\"428\" /></a>So two years on from the release of their debut LP, and The Pains of Being Pure at Heart are back with a new record, Belong, released through Slumberland towards the end of the month. Their self titled record brought about comparisons to numerous early 90’s shoegaze acts, including the likes of Pale Saints, Slowdive and Ride, however they had moulded the sound into their own with a unique blend of twee pop cast in amongst the tracks. Receiving notable critical acclaim, the record was an almost entirely new experience for many listeners, whilst reviewers were quick to brand the genre “nu-gaze”, a term slightly less blundering than last years “chillwave”.</p>\n<p>With a string of singles since mid last year, fans have been kept on tenterhooks as to how Belong would turn out. Coming in at just under forty minutes, lead vocalist Kip Berman described the album as “taking away what we were hiding behind before” and containing “more emotionally compelling” lyricism. From the off it’s clear there’s no huge departure concerning musical direction, opener Belong is an accomplished track, yet nothing that wouldn’t have fitted on their debut record.</p>\n<p>However, it’s the lyrics that are most noticeably different, “we tried another, let’s try each other” yearns lead singer Kip Berman, with far more sexual gusto than previously experienced from him. These are still tracks that have been written to be played live; recent single Heart in Your Heartbreak doesn’t shirk this trend, exposing the group at their as emotionally fraught, filled with teenage angst and adolescent disorientation. Shimmering guitars and a strongly backed percussion section, complete with accustomary guitar solo provides a somewhat more anthemic sound than heard on other tracks, easily one of the highlights of the record.</p>\n<p>When they pull off the anthemic, stadium rock sound, it provides arguably their most invigorating and captivating music to date. However at times they cross the line between simplistic and heartfelt, and stray into the realms of forced and illogical, ending up coming across as The Killers covering Pale Saints, not a sensual or enticing prospect. This is the case with Anne With An E, which blunders along clumsily, never reaching the heights it threatens to; ultimately proving vastly underwhelming.</p>\n<p>At this halfway point, Belong could go one of two ways, spiraling out into a lazy memory, or catapult itself to the level that The Pains of Being Pure at Heart are capable of reaching. Luckily enough, after the disappointment of the aforementioned track, the next number, Even In Dreams sees the NY band clambering back upon the horse and kicking the record into life again. “Even in dreams, I could not betray you” cries Berman, met with a wall of shimmering guitars and a chorus of vibrant synths. Far and away my favourite track from Belong.</p>\n<p>Alas, from here the record is a mixed bag, ranging from the Ramones like grunge snarl that is Girl of 1,000 Dreams, to the pop fueled ballad and album closer Strange. All in all, Belong is an accomplished record, it’s high are ecstatically brilliant, yet it’s lows are all too average and mundane. What could be a thrilling and addictive listen, ends up falling somewhere by the wayside as the stand out tracks shine brighter than The Pains of Being Pure At Heart have before, yet the murky lows blunder along languidly. The title of the record tells you all you need to know, they are longing to Belong, and are ever so close to achieving their goal.</p>\n<p><object classid=\"clsid:d27cdb6e-ae6d-11cf-96b8-444553540000\" width=\"100%\" height=\"81\" codebase=\"https://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=6,0,40,0\"><param name=\"allowscriptaccess\" value=\"always\" /><param name=\"src\" value=\"https://player.soundcloud.com/player.swf?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F7232600\" /><embed type=\"application/x-shockwave-flash\" width=\"100%\" height=\"81\" src=\"https://player.soundcloud.com/player.swf?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F7232600\" allowscriptaccess=\"always\"></embed></object> <span><a href=\"https://soundcloud.com/slumberland-records/the-pains-of-being-pure-at-heart-heart-in-your-heartbreak\">The Pains of Being Pure At Heart – Heart In Your Heartbreak</a> by <a href=\"https://soundcloud.com/slumberland-records\">Slumberland Records</a></span></p>\n","slug":"5571-review-the-pains-of-being-pure-at-heart-belong","category":"music","date":1300657139000,"wpid":5571,"isSticky":false,"featured_image":{"width":292,"height":50,"src":"2011/03/149222.pobpah525-292x50.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAACAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAIH/8QAIBAAAQQCAQUAAAAAAAAAAAAAAQACAwQFERIUMTNCUf/EABQBAQAAAAAAAAAAAAAAAAAAAAX/xAAWEQADAAAAAAAAAAAAAAAAAAAAATH/2gAMAwEAAhEDEQA/AMqwtyycF1BsTGxK3jJKXnk8At0Ce50qu2Zxcn1PL5He5+oiJdFVD//Z"},"createdAt":1587294625596,"updatedAt":1588443779347,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/03/149222.pobpah525-292x50.jpg","categories":["music","reviews"]}