{"id":"5e9c31a69b6559241525dd8f","title":"Review: Kurt Vile- Smoke Ring For My Halo","content":"<p><a rel=\"attachment wp-att-5604\" href=\"https://admin.</p><p>crackintheroad.com/music/5592-review-kurt-vile-smoke-ring-for-my-halo/attachment/kurtvile\"><img class=\"alignnone size-full wp-image-5604\" src=\"https://api.crackintheroad.com/uploads/2011/03/Kurt+Vile.jpg\" alt=\"\" width=\"780\" height=\"392\" srcset=\"https://api.crackintheroad.com/images/2011/03/Kurt+Vile.jpg 780w, https://api.crackintheroad.com/images/2011/03/Kurt+Vile-260x130.jpg 260w, https://api.crackintheroad.com/images/2011/03/Kurt+Vile-640x321.jpg 640w, https://api.crackintheroad.com/images/2011/03/Kurt+Vile-165x82.jpg 165w\" sizes=\"(max-width: 780px) 100vw, 780px\" /></a></p>\n<p>For his fourth album proper, and first studio album, <strong>Kurt Vile</strong> has crafted a beautiful, dreamy record to get lost to, as he paints an Americana suffused with optimism and apathy.  In largely repudiating his lo-fi influences, he has created an insular, yet inviting album in the heritage of<strong> Tom Petty</strong> and <strong>Elliott Smith</strong>, as he contemplates the private and personal, at odds with the obvious alternative music so regularly touted as revolutionary.  Kurt Vile has grown into a witty, cynical artist and it has only benefitted his development from an awkward bedroom troubadour to a confident and unique performer, celebrating the halcyon opportunity of the early seventies.</p>\n<p>There is a subtlety to this album, as it veers from the fragile acoustics of ‘Peeping Tomboy’ to the brawn of the title track, as he subverts <strong>Bright Eyes</strong> to found a melancholy, gorgeous lament to hope and loss.  This is a whimsical, laconic record, with ‘Jesus Fever’ standing out as an angular folk song, with the jerking chord changes juxtaposed with the intricate finger picking building a rounded aural experience, at odds with his arguably narrow past works.  There is a real sense of progression to the record, a culmination of the undoubtedly vast talents of Vile as he steps beyond his self-imposed generic limitations to embrace a more accessible sound with the aid of his backing band The Violators.  ‘Puppet To The Man’ implausibly, and brilliantly, contemporises <strong>The Velvet Underground</strong>, testifying to the sonorous clarity of the record; every pick is now accentuated, with Vile’s voice and poetry a necessity to the depth of the album as a whole.  Lou Reed is an obvious influence, but there are also classic rock overtones, infusing a sense of yearning to the record.</p>\n<p><em>Smoke Ring For My Halo</em> is a brilliant album, taking all the potential of his earlier releases to fund a glorious, impulsive journey through seventies alternative America, rich with promise and romance.</p>\n","slug":"5592-review-kurt-vile-smoke-ring-for-my-halo","category":"music","date":1300646442000,"wpid":5592,"isSticky":false,"featured_image":{"width":780,"height":392,"src":"2011/03/kurt+vile.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAFAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAUI/8QAHhAAAQMEAwAAAAAAAAAAAAAAAQACAwQREjETFCL/xAAUAQEAAAAAAAAAAAAAAAAAAAAA/8QAFBEBAAAAAAAAAAAAAAAAAAAAAP/aAAwDAQACEQMRAD8AzWyvk71NFi3jikIAGzewNyqj6eLN3gbREH//2Q=="},"createdAt":1587294630505,"updatedAt":1588403559019,"author":"5e9b68b27a1236eccfeb1d4c","old_image":"2011/03/kurt+vile.jpg","categories":["music","reviews"]}