{"id":"5e9c319c9b6559241525dd7c","title":"Film Review: Submarine","content":"<p>Director: Richard Ayoade</p>\n<p>Length: 97 minutes</p>\n<p>Language: English</p>\n<p>Submarine is the directorial debut of the ever-growing presence that is Richard Ayoade (The IT Crowd, Garth Marenghi’s Darkplace), and focuses around two closely linked and independedly awkward coming-of-age experiences.</p><p> The primary focus is the looming, sinister, yet somehow likeable Oliver Tate (Craig Roberts, most easily recognisable as Adam in Being Human) and his pursuit of both sexual initiation and a meaningful relationship. Naïve and falteringly cynical, his affection for the seemingly indifferent and fickle Jordana (Yasmin Paige) ranges between cringeworthy, heart-warmingly precious, and straight-up twisted. In contrast to this stands the relationship between Oliver’s stoic, depressed father Lloyd (Noah Taylor), and his neurotic, despondent mother Jill (Sally Hawkins), whose marriage is suffering from some turbulence, primarily due to the return of an old lover of Jill’s, Graham (Paddy Considine).</p>\n<p>Perhaps the most interesting relationship in Submarine is between Oliver and Lloyd, as they try to aid each other in their pursuits of happiness. Oliver has all the directness of youth, and unabashedly delivers his clear-cut views of how things should be; Lloyd is shy and uncertain as to what his own experiences have actually taught him, and their relationship beautifully highlights many dissillusioned adults’ feelings – more life may have been lived, but it doesn’t make much more damn sense.</p>\n<p>Stylisticallly well defined, with some excellent tongue in cheek self-reference and third-wall mockery. The rule of not looking directly into the camera is broken almost instantly, Oliver quips about how the biopic of his life would pan out in a certain way at a point, unless the budget was minimal, in which case the camera would simply zoom out – the camera zooming out through the shot. The camera flickers between viewpoints, creating a fresh sense of intimate perspective between the characters, and after Oliver considers how life would be easier if it bore more similarity to an American Soap Opera, fading to black to allow characters some respite when things got too intense, scenes fade to either blue or red for the remainder of the film.</p>\n<p>Witty, light-hearted yet searching, a fantastic debut which leaves one feeling justified in expecting some truly classical cinema from Ayoade in the future. You are warned, this is not a rom-com, or not in the usual sense, and whilst the film focuses around love the relationships would be better described as fascinating than heart-warming. A must see for any fan of British cinema.</p>\n","slug":"5667-film-review-submarine","category":"arts","date":1300743903000,"wpid":5667,"isSticky":false,"featured_image":{"width":1054,"height":505,"src":"2011/03/submarine.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAFAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAMH/8QAIRAAAgEDAwUAAAAAAAAAAAAAAQIDAAQRBRIhMUFCcaH/xAAVAQEBAAAAAAAAAAAAAAAAAAADBf/EABwRAAEDBQAAAAAAAAAAAAAAAAEAAhEDBCEisf/aAAwDAQACEQMRAD8Ax3SnefVokuXLQEtlEARjwTy2M+P3tULmQR3MqJv2q5Ayw6A+qUoid4VBtJhtQ8jMni//2Q=="},"createdAt":1587294620368,"updatedAt":1588403558836,"author":"5e9b68b27a1236eccfeb1d35","old_image":"2011/03/submarine.jpg","categories":["arts"]}