{"id":"5e9c319a9b6559241525dd79","artists":["5e9b69047a1236eccfeb2141"],"title":"Interview: Howth","content":"<p><a rel=\"attachment wp-att-5704\" href=\"https://admin.</p><p>crackintheroad.com/music/5701-interview-howth/attachment/presspicture\"><img class=\"alignnone size-900wide wp-image-5704\" title=\"presspicture\" src=\"https://api.crackintheroad.com/uploads/2011/03/presspicture-900x546.jpg\" alt=\"\" width=\"900\" height=\"546\" /></a>Social networking is fast becoming one of the quickest ways to discover new or old music; gone are the days of trawling through dingy record stores, instead you can stream any track in the world within seconds of logging onto the internet. In the case of Howth, this method attributes to how I found out about their self titled record, after being recommend them from NY indie band The Antlers facebook page.</p>\n<p>Howth are Blake Luley and Carl Creighton, two close friends who have both been involved in numerous musical projects before, yet there is a real sense that this time the music has the capability to be heard by their largest audiences yet. After only one listen to the record it’s clear this is a rather special album, perfectly capturing the essence that is recording from home. Delightfully composed folk tunes mixed with the earthly atmosphere created by recording in domestic and familiar surroundings make for a gripping yet extremely personal listen. The likes of album opener Cooperstown and Idaho #1 showcase the songwriting ability on display, ranging from the bleakly desperate to the subtly beautiful, cementing this record as one of the finest independently recorded albums of 2011 so far. We were delighted to be able to catch up with Howth to find out a little more about the record, their influences and future aspirations.</p>\n<p><a href=\"https://howthhowth.bandcamp.com/\">Check out Howth’s self-titled record.</a></p>\n<p><em><span style=\"color: #000000;\">Crack in the Road: How did Howth come about?</span></em></p>\n<p><strong><span style=\"color: #000000;\">B:  Carl and I met while he was recording his first album at the Seaside  Lounge where I was interning at the time. I came in while he was  recording vocals for a song called “Light bulb” and I was blown away. I  asked Carl to be the first artist on a record label I was starting with a  friend and Carl was into it. Trouble was my friend and I had no idea  what we were doing, so Carl called bullshit on the label but asked if I  still wanted to record his album. That was really nice of him, although I  really did have every intention of starting a label. Being 20 isn’t the  best time to do that though, and I’m probably the least business savvy  person ever. We went on to record his 2nd solo album “11 North” at the  Seaside Lounge and in my bedroom. No one really bothered to check it out  besides our friends. That bummed me out because we had worked for a  year on the album and Carl is just such a talented songwriter. I think  that was the year that you had to sound like Animal Collectives  “Merriweather Post Pavilion” to have anyone listen to your music. Right  after we finished “11 North”, we decided to just record a bunch of  Carl’s new songs in the basement of our apartment in Brooklyn, NY. It  was way more relaxed and laid back then when we were working on “11  North”. I would record Carl then he’d go to class and I’d add some weird  keyboard or drum part. I remember one of the last weeks Carl was in  town he added a bunch of really wild keyboard parts using this old  Yamaha keyboard. I tried really hard to add enough layers to make  everything really interesting, but to never get in the way of how  awesome Carl’s voice and songwriting is. Carl moved back home to  Minnesota and I sporadically worked on the songs throughout 2010, adding  some instruments and mixing every song like 100 times. We were going to  put it out under Carl’s name and call it Merry Cemetery. I approached  Carl about how I thought that was a dumb album title, and he said lets  just call the thing Howth and make that our group name too. I think that  was what happened.</span></strong></p>\n<p><span style=\"color: #000000;\">C: Well,  I guess I can explain the name part. I got laid off from my job in  March 2008 (which you can hear about on the first song of our album) and  then went to France and Ireland for a week to celebrate. The trip was  supposed to be solo, but my exboyfriend jumped on the flight to France  because he has family there. It was nice and sort of romantic at the  time, but I really just wanted to be alone. We split ways when I went to  Ireland and he went back to New York. And Howth was this really awesome  place I went to when I was there, with the cliff overlooking Dublin  Bay. So for me, the name and the band reflects this idea of breaking  away from everybody, from expectations and everything else, to just do  what you want without having to account to anybody.</span></p>\n<p><em><span style=\"color: #000000;\">CitR: What would you cite as the main inspirations behind Howth, both musically and otherwise?</span></em></p>\n<p><strong><span style=\"color: #000000;\">B:  I think the sound of the Howth album was as much a reaction to the  first album we made together as it was us trying to really sound like  anyone in particular. That being said, I was listening to the  Microphones and Sigur Ros a lot when I was adding a lot of instrumental  tracks and mixing the album.</span></strong></p>\n<p><span style=\"color: #000000;\"> </span></p>\n<p><span style=\"color: #000000;\">C: Yeah,  we really wanted to do something that was a little more consistent  musically, since 11 North was all over the place. And more stripped  down. And more space for Blake to add his magic.</span></p>\n<p><em><span style=\"color: #000000;\">CitR: There’s a  real feeling of honesty and realism to your newest record, are many of  the songs written about actual events in your lives, or just taking  influence from?</span></em></p>\n<p><span style=\"color: #000000;\">C:  Yeah. I added some lies for dramatic effect, like the part about having  a baby and my grandma dying. But for the most part it’s based on real  life. I wouldn’t know what else to write about really. I used to try and  write story folk songs like Bob Dylan, but i just always come off as  contrived and stupid.</span></p>\n<div>\n<p><em><span style=\"color: #000000;\">CitR: Do you have any plans to take Howth to a live audience?</span></em></p>\n<p><strong><span style=\"color: #000000;\">B:  We actually played 2 shows in Brooklyn and Manhattan the first week  that the album came out. Carl was in town for his job training and the  timing seemed good. We only got to practice twice so it was a bit  patched together. Our friends liked it though! Sadly, at this point in  our lives we aren’t able to play live for the time being with work,  school, and the distance between us. We will be playing a few shows at  next years CMJ festival in New York, and I guess we’ll see from there. I  can’t really properly answer that question at this time.</span></strong></p>\n<p><em><span style=\"color: #000000;\">CitR: This  release has already, and quite rightly, garnered quite a bit of interest  in your music. Do you see yourselves possibly re-releasing your debut  record to a larger audience and with greater financial backing?</span></em></p>\n<p><strong><span style=\"color: #000000;\">B:  All the money that we are making from donations for the album and  people buying physical copies is going toward a proper mastering and  pressing of the album. I think we are going to do vinyl because with  everyone downloading music CD’s are starting to become really out of  style and hard to sell. I feel like CD’s will be as relevant as the  laser disc in a few years. Vinyl was awesome when my parents were  growing up, and it still sounds great now. As far as greater financial  backing, yes please! If you know the dude who owns Rough Trade let him  know we could get into that. </span></strong></p>\n<p><span style=\"color: #000000;\">C: Please buy our album.</span></p>\n<p><em><span style=\"color: #000000;\">CitR: Increasingly  it’s becoming more and more common for artists to record in bedrooms,  basements, living rooms etc, how do you think this has the changed the  face of the music industry?</span></em></p>\n<p><strong><span style=\"color: #000000;\">B:  I think as someone that has made a lot of music in my various  apartments and also interned at a really awesome studio (The Seaside  Lounge) I’ve seen a good bit of both sides. I think a lot of bands  really benefit from a proper studio recording and getting the highest  sound quality possible. On the other hand, I feel like a lot of really  cool music has come out in recent years that has been recorded in  unconventional places. The biggest advantages to that are that you  create the schedule of when you are going to record and there is no  pressure to finish quickly ’cause your time is free (unlike a studio). I  think this has allowed for artists like The Antlers, Sufjan Stevens,  and Bon Iver to really find a unique voice with there music. Recording  is always a trial and error process but if you aren’t a real  professional sometimes your errors become happy mistakes. On the other  hand, I think there is a lot of value in recording in a studio. The  money pressure can really push you to just go with your gut rather than  making a million mixes of the same song. Overall, I think it’s really  awesome how easy and cheap it is to make a record in your bedroom. The  whole Howth album was made with an old 2 track cassette deck from my  mom, a cheap-o 2 input M-Audio recording device, 2 or 3 microphones, and  a bunch of random instruments that we had lying around. Considering I  was borrowing the M-Audio devices and a few of the mics it was pretty  close to a $0 budget album. That was about the only way we could have  done it because we were both unemployed and broke at the time. It would  have been great to have some nicer gear, but overall it wouldn’t have  been the same product in the end.</span></strong></p>\n<p><em><span style=\"color: #000000;\">CitR: What was the first record you can remember falling in love with?</span></em></p>\n<p><strong><span style=\"color: #000000;\">B:  The Space Jam soundtrack and Hanson’s first record when I was in 5th  grade. By 8th grade I had slightly less embarrassing taste in music and  was obsessed with At the Drive In’s “In Casino Out”.</span></strong></p>\n<p><span style=\"color: #000000;\">C: Tori Amos’ Boys for Pele. Loved how indulgent it is and the quiet of the piano. Made me want to play music.</span></p>\n<p><em><span style=\"color: #000000;\">CitR: If you could be joined by any musician (alive or dead) on stage for a duet, who would it be?</span></em></p>\n<p><strong><span style=\"color: #000000;\">B:  I would say Sigur Ros. Thats a few musicians, but a singular group. Is  that okay? I’d just be curious as to how they create such other worldly  sounds.</span></strong></p>\n<p><span style=\"color: #000000;\">C: PJ Harvey.</span></p>\n<p><span style=\"color: #000000;\">CitR: In  keeping with “The Wind Blows Cold”, what was the name of your imaginary  friend when you were younger?<br />\n</span></p>\n<div>\n<p><span style=\"color: #000000;\"> </span></p>\n<p><span style=\"color: #000000;\"> </span></p>\n</div>\n<p><span style=\"color: #000000;\">C:  Hmm. I had a cabbage patch doll named Orson. Does that count? I think  my imagination was too lazy for imaginary friends when I was a kid.</span></p>\n<p><em><span style=\"color: #000000;\">CitR: If you could be any animal, what would you be?</span></em></p>\n<p><strong><span style=\"color: #000000;\">B:  My spirit animal is the red panda or the firefox, as it is sometimes  called. I found that out the first time I took mushrooms. My friend just  got back from India and said there are monkeys there that steal your  shoes and won’t give them back unless you buy them a soda. I could also  see myself being one of those monkeys.</span></strong></p>\n<p><span style=\"color: #000000;\">C: Sperm whale.</span></p>\n</div>\n<p><object classid=\"clsid:d27cdb6e-ae6d-11cf-96b8-444553540000\" width=\"400\" height=\"100\" codebase=\"https://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=6,0,40,0\"><param name=\"data\" value=\"https://bandcamp.com/EmbeddedPlayer/track=884953063/size=venti/bgcol=FFFFFF/linkcol=4285BB//\" /><param name=\"quality\" value=\"high\" /><param name=\"allowNetworking\" value=\"always\" /><param name=\"wmode\" value=\"transparent\" /><param name=\"bgcolor\" value=\"#FFFFFF\" /><param name=\"allowScriptAccess\" value=\"never\" /><param name=\"src\" value=\"https://bandcamp.com/EmbeddedPlayer/track=884953063/size=venti/bgcol=FFFFFF/linkcol=4285BB//\" /><embed type=\"application/x-shockwave-flash\" width=\"400\" height=\"100\" src=\"https://bandcamp.com/EmbeddedPlayer/track=884953063/size=venti/bgcol=FFFFFF/linkcol=4285BB//\" allowscriptaccess=\"never\" bgcolor=\"#FFFFFF\" wmode=\"transparent\" allownetworking=\"always\" quality=\"high\" data=\"https://bandcamp.com/EmbeddedPlayer/track=884953063/size=venti/bgcol=FFFFFF/linkcol=4285BB//\"></embed></object></p>\n<p><object classid=\"clsid:d27cdb6e-ae6d-11cf-96b8-444553540000\" width=\"400\" height=\"100\" codebase=\"https://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=6,0,40,0\"><param name=\"data\" value=\"https://bandcamp.com/EmbeddedPlayer/track=2746483960/size=venti/bgcol=FFFFFF/linkcol=4285BB//\" /><param name=\"quality\" value=\"high\" /><param name=\"allowNetworking\" value=\"always\" /><param name=\"wmode\" value=\"transparent\" /><param name=\"bgcolor\" value=\"#FFFFFF\" /><param name=\"allowScriptAccess\" value=\"never\" /><param name=\"src\" value=\"https://bandcamp.com/EmbeddedPlayer/track=2746483960/size=venti/bgcol=FFFFFF/linkcol=4285BB//\" /><embed type=\"application/x-shockwave-flash\" width=\"400\" height=\"100\" src=\"https://bandcamp.com/EmbeddedPlayer/track=2746483960/size=venti/bgcol=FFFFFF/linkcol=4285BB//\" allowscriptaccess=\"never\" bgcolor=\"#FFFFFF\" wmode=\"transparent\" allownetworking=\"always\" quality=\"high\" data=\"https://bandcamp.com/EmbeddedPlayer/track=2746483960/size=venti/bgcol=FFFFFF/linkcol=4285BB//\"></embed></object></p>\n","slug":"5701-interview-howth","category":"interviews","date":1300810944000,"wpid":5701,"isSticky":false,"featured_image":{"width":950,"height":577,"src":"2011/03/presspicture.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAGAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAMF/8QAIRAAAgEDAwUAAAAAAAAAAAAAAQIDAAURBBNBBhIxYqH/xAAVAQEBAAAAAAAAAAAAAAAAAAABBf/EABgRAQEBAQEAAAAAAAAAAAAAAAECAAMR/9oADAMBAAIRAxEAPwChuequckaTTtEkUgY7ShS54B9ecVjS9Xskjrs57SRnxn7SlTJ7WyPueUlQLv/Z"},"createdAt":1587294618353,"updatedAt":1588403558810,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/03/presspicture.jpg","categories":["interviews","music"]}