{"id":"5e9c31959b6559241525dd6d","artists":["5e9b69637a1236eccfeb271b"],"title":"Review: Wolf Gang – Dancing with the Devil EP","content":"<p><a rel=\"attachment wp-att-5741\" href=\"https://admin.</p><p>crackintheroad.com/music/5740-review-wolf-gang-dancing-with-the-devil-ep/attachment/192060_10150125741381089_98440031088_6615730_4655946_o\"><img class=\"alignnone size-900wide wp-image-5741\" src=\"https://api.crackintheroad.com/uploads/2011/03/192060_10150125741381089_98440031088_6615730_4655946_o-900x600.jpg\" alt=\"\" width=\"900\" height=\"600\" /></a></p>\n<p>Last time I wrote about <strong>Wolf Gang</strong>, the name behind singer-songwriter <strong>Max McElligott</strong>, was in the wake of their excellent <a href=\"https://admin.crackintheroad.com/music/5139-review-the-naked-famous-newcastle\">support act</a> under <strong>The Naked and Famous</strong> last month in Newcastle. Since then, he and his London-based indie-pop band have played a variety of <strong>SXSW</strong> dates, and have lined up future acts at the <strong>Camden Crawl</strong>, <strong>Dot to Dot Festivals</strong>, and a support slot under <strong>Editors</strong> at the Royal Albert Hall.</p>\n<p>The EP opens with 2010 single <strong>Lions in Cages</strong>, an infectiously catchy track with a fantastically punchy chorus. There’s no slow build-up here – straight from the off, we’re into the very best pop-rock has to offer – this is a song to dance to, to sing along to and to truly love, from the imagery of <em>Lions in cages just for fun</em> and a city that <em>joins us with hands of grace</em>. The lyrical imagery almost perfectly compliments the sound of the song itself – I dare anyone to listen to that chorus and not feel some sort of urge to sing along. It’s not particularly deep, it’s not hugely complex, but then, it wouldn’t work if it was – this track is the very pinnacle of indie pop-rock, and I’d be happy if this were the only decent track on the EP.</p>\n<p>Luckily, it isn’t. <strong>Dancing with the Devil </strong>is <strong>Wolf Gang</strong>‘s most recent single, and thus one that’s been getting some decent coverage lately – it’s very possible you may have heard it. There is absolutely no loss in quality from the first track to this one – it’s just as catchy, it’s just as fun, and it manages to create a fantastic blend of some quite rock-orientated guitar sounds, anthemic vocals and ever-so-subtle piano melodies. There’s definitely an <strong>Arcade Fire </strong>influence, thanks largely to the multi-instrumental wall of sound that’s created here.</p>\n<p>The final two original tracks off the EP, it must be said, don’t quite reach the peaks that the first two do. That is not to say they aren’t good songs – they are, in fact, perfectly enjoyable to listen to – from the pleasant change of sound of <strong>Back to Back </strong>to the synth-heavier <strong>Something Unusual</strong>, which is definitely channeling the earliest of <strong>MGMT</strong>‘s work – and although the stunning vocal work  and inevitably catchy choruses remain, they just don’t manage to be as epic as the EP’s first two tracks. On any other release, by any other band, I’d herald these songs as top-tier – it’s only here where they are ever so slightly overshadowed.</p>\n<p><strong>Wolf Gang </strong>close the EP with an alternate version of <strong>Dancing with the Devil</strong>, featuring supporting vocal work from on-the-rise singer-songwriter <strong>Kyla La Grange</strong>. For a track that worked so well earlier as an anthemic, epic singalong, it translates surprisingly well into this far more emotionally intense, very much stripped back version of the song. It’s an interesting take on a great song, and certainly works as an effective closing track.</p>\n<p>Essentially, <strong>Wolf Gang </strong>have, after spending a fair bit of time releasing singles and individual tracks, come out with an exceptional EP. <strong>Max McElligott</strong>‘s fantastic vocal work and songwriting, mixed in with some songs that should really be being played from the main stage of a festival or an arena, results in an EP that suggests a hugely bright future for <strong>Wolf Gang</strong>. The debut album, <strong>Suego Faults</strong> is released on June 13th. If this EP is any indictation, then it could very well end up as one of the best records of 2011.</p>\n","slug":"5740-review-wolf-gang-dancing-with-the-devil-ep","category":"music","date":1300822460000,"wpid":5740,"isSticky":false,"featured_image":{"width":292,"height":50,"src":"2011/03/192060_10150125741381089_98440031088_6615730_4655946_o-292x50.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAACAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAAAAb/xAAkEAABBAADCQAAAAAAAAAAAAABAAIDBAYHERITISIkQ5Gxwf/EABQBAQAAAAAAAAAAAAAAAAAAAAL/xAAWEQEBAQAAAAAAAAAAAAAAAAAAAQL/2gAMAwEAAhEDEQA/ALvOGaWK/g3dSvZ15PK4jjtRD6fJVteJF2xoe472iI0sv//Z"},"createdAt":1587294613645,"updatedAt":1588443779194,"author":"5e9b68b27a1236eccfeb1d16","old_image":"2011/03/192060_10150125741381089_98440031088_6615730_4655946_o-292x50.jpg","categories":["music","reviews"]}