{"id":"5e9c31819b6559241525dd4c","artists":["5e9b68da7a1236eccfeb1ea2"],"title":"Review: Broken Bells – Meyrin Fields EP","content":"<p><a rel=\"attachment wp-att-5870\" href=\"https://admin.</p><p>crackintheroad.com/?attachment_id=5870\"><br />\n</a></p>\n<p>The first album from <strong>Broken Bells</strong> (the side-project of <strong>Danger Mouse</strong> and <strong>The Shins’ </strong>James Mercer), was released last year and gained the band an instant following. The album’s best singles, <strong>October</strong>, <strong>The Ghost Inside</strong> and <strong>The High Road</strong> stood out as some of the best songs of 2010, and with this new EP, <strong>Broken Bells</strong> have clearly decided to build upon that success – if bringing little new to the table.</p>\n<p>Initially, <strong>Meyrin Fields</strong> sounds a little different to the self-titled debut album from the band. The opening track of the same name is a change in direction from the sound of their first release, showcasing some more electronica-based influences. Pleasingly, the backing vocals that stood out as a highlight of the first album remain, and James Mercer’s vocals are as strong as ever. The rest of the songs are much more typical of <strong>Broken Bells’</strong> style, and here lies the EP’s main flaw – it isn’t really <em>that</em> new. As an EP from a side-project, it would have been nice to see some more risky experimentation from the band, trying out something different. Unfortunately, this is not the case.</p>\n<p>That is not to say that the EP is a failure – anything but. There’s clearly nothing drastically wrong with sticking to the proven formula if it worked so well the first time around, and <strong>Meyrin Fields</strong> certainly works well in the context of the first album. In particular, <strong>Windows </strong>stands out as the strongest track, utilising the strongest points of the first album – catchy riffs and great vocals whilst managing to sound just that little bit unique in relation to the rest of the musical world.</p>\n<p>So, more of the same then. <strong>Meyrin Fields</strong> doesn’t really do much new, which is a shame – an EP should be a chance for the band to spread their wings and do something different. Nonetheless, although these tracks would’ve worked just as well on the first album, the fact that the debut self-titled was so strong means that this EP is definitely worth a buy. It may be more of the same, but when the same is so damn good, you really shouldn’t care that much.</p>\n","slug":"5862-review-broken-bells-meyrin-fields-ep","category":"music","date":1301165872000,"wpid":5862,"isSticky":false,"featured_image":{"width":790,"height":444,"src":"2011/03/broken_bells.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAGAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAcI/8QAHhAAAgIDAAMBAAAAAAAAAAAAAQIDBAAGEQUHQVH/xAAUAQEAAAAAAAAAAAAAAAAAAAAA/8QAFBEBAAAAAAAAAAAAAAAAAAAAAP/aAAwDAQACEQMRAD8Av2rWbF7XfEWbzI1qerFJMyDil2UE8HwdzM+y+2t3p7H5WrWtUxBBblijBDjiq5A+/gxjA//Z"},"createdAt":1587294593342,"updatedAt":1588403558436,"author":"5e9b68b27a1236eccfeb1d16","old_image":"2011/03/broken_bells.jpg","categories":["music","reviews"]}