{"id":"5e9c31769b6559241525dd37","title":"Review & Interview: The Crookes (Manchester)","content":"<p><strong>Crack In The Road </strong>first came across <strong>The Crookes </strong>just under a year ago at <strong>Dot to Dot Festival </strong>in Manchester, and since then this indie-pop quartet has only gone from strength to strength.</p><p> Their debut album, ‘<strong>Chasing After Ghosts</strong>‘, was released on the 21st March after the release of their very well received EP ‘<strong>Dreams of Another Day</strong>‘ towards the end of last year. With overwhelming positive attention from <strong>Steve Lamacq </strong>to <strong>Jon Mclure </strong>to <strong>Noel Gallagher</strong>, <strong>The Crookes </strong>certainly proved this was well deserved with a fantastic performance at <strong>FAC251</strong>.</p>\n<p>What one immediately notices about <strong>The Crookes </strong>is their impeccable charisma, contained in a genuine enthusiasm for their sound, and not to mention two very charming quiffs. Venturing straight into their classics, it is clear <strong>The Crookes </strong>have created a sound that captures a sense of the classic 50’s rock n roll, while injecting a thoroughly modern and energetic twist of pop. Lyrics about heartbreak and youth are meshed with jangly percussion and uplifting guitars, that produce an outcome that makes it impossible for you not to dance along to their bittersweet melancholy. My only criticism would be the band’s decision to choose a slower track to end on, which somewhat marred the fun energy they had steadily built up. However this slight criticism fades into insignificance when contrasted to the particular highlights of ‘<strong>Backstreet Lovers</strong>‘ and ‘<strong>Godless Girl</strong>‘, which left the audience buzzing well after the gig had finished.</p>\n<p>9/10</p>\n<p><strong>Crack In The Road </strong>were lucky enough to catch up with the band prior to their gig, in a dressing room which was supplied with beer and reduced price tesco sandwiches ..</p>\n<p><strong>Crack In The Road: </strong>How’s the tour going so far lads?</p>\n<p><strong>Alex: </strong>Well we’re on our third date, and it’s going really well! Last night we did a set of <strong>Pixies </strong>cover with Tim from <strong>Ash </strong>at <strong>XOYO</strong>, so needless to say that was amazing. Glasgow was good too, however as the first date of the tour, as I’m sure all bands would tell you, is a little bit messy! We’ve started using a backing track, and it’s all about getting everything together, which can sometimes be a little bit difficult.</p>\n<p><strong>Daniel</strong>: We had to go busking in Glasgow!</p>\n<p><strong>CITR</strong>: Desperate times for petrol money? ..</p>\n<p><strong>Daniel: </strong>Haha! Nah it was for charity, ‘Busking for Japan’. It was really good actually.</p>\n<p><strong>Alex: </strong>A couple girls actually realised who we were as well, mostly through ‘<strong>Backstreet Lovers</strong>‘, but they didn’t bother coming down to the gig!</p>\n<p><strong>Daniel: </strong>Yeah we just found it hard to concentrate as we were walking down this main street and there were attractive women everywhere!</p>\n<p><strong>CITR: </strong>Did you all happen to be laced in Lynx? The adverts would seem to suggest so ..</p>\n<p><strong>Alex: </strong>Haha! Funny you should mention that as I was wearing voodoo that day ..</p>\n<p><strong>Daniel: </strong>I’m more of a right guard man I’m afraid!</p>\n<p><strong>CITR: </strong>Old Spice knocks both of them out of the water, have you seen the adverts?</p>\n<p><strong>Daniel: </strong>I haven’t, but I did watch this really weird advert with <strong>Rolf Harris </strong>the other day. It’s about teaching kids how to swim, but in reality it’s just <strong>Rolf Harris </strong>surrounded by small children in a swimming pool ..</p>\n<p><strong>CITR: </strong>I must admit, I’ve always had my suspicions ..</p>\n<p><strong>Alex: </strong>Haha! Should we get back on topic?</p>\n<p><strong>CITR: </strong>Sure! Let’s talk about your debut album, ‘<strong>Chasing Ghosts</strong>‘. What was that like as a process to record? How did it differ from the EP?</p>\n<p>(<strong>Ed: </strong>Just after finishing that sentence, the kettle situated next to me appeared to turn itself on ..)</p>\n<p><strong>Alex: </strong>Can we have it on the record the kettle has just turned itself on?!</p>\n<p><strong>Daniel: </strong>Well didn’t you know that a famous tea drinker actually died in this dressing room .. !</p>\n<p><strong>Alex: </strong>By the time we had released the EP, we hated all the songs, and that’s just being honest! We had come up with the idea that in the Spring time, that we’ve got a collection of songs that we like and people had given us a good response to, but we felt we were moving in a slightly different direction. So basically <strong>Dreams </strong>was an EP designed around the idea of getting rid of all our old songs ..</p>\n<p><strong>Daniel: </strong>A pile of landfill essentially ..</p>\n<p><strong>Alex: </strong>Haha! Nah, it was more for those who had enjoyed the band in the early days, and for people to know that these tracks were our beginnings and that we were transforming into something slightly more sophisticated, whether or not people would agree with that I don’t know. It was a very deliberately mapped progression, as by the time we had released <strong>Dreams </strong>we had pretty much already recorded all the tracks that were going to go on the album. However the EP got a good reception, and I was particularly nervous about what the critics would say as we all knew where we were going after the EP, so we didn’t want people to judge us on it completely.</p>\n<p><strong>Daniel:</strong> I mean we’re over the moon that people still enjoy the tracks from the EP, and we still enjoy playing them live as we’re not one of those bands which expects an audience just to listen to new material and expect people to go ‘Yay! Here’s a song I’ve never heard before!’</p>\n<p><strong>Alex: </strong>I think our general ethos as musicians is that we’re entertainers, and people pay to see you play to entertain them with songs that they know too. I’d hate to think that we’d only ever use an audience to test out new material on.</p>\n<p><strong>CITR: </strong>I noticed that <strong>Noel Gallagher </strong>said that you had ‘great lyrics’, but followed it up with ‘all bands from Sheffield have good lyrics’.</p>\n<p><strong>Alex: </strong>It’s always under handed with him isn’t it!</p>\n<p><strong>Daniel: </strong>That’s like being given a reduced chicken sandwich I reckon .. !</p>\n<p><strong>CITR: </strong>I have to put this on the record, but the fact you’ve been given reduced priced sandwiches is unbelievable. They could have at least taken the labels off ..</p>\n<p><strong>Daniel: </strong>Haha! It’s the fact that they’re all different types too, as that’s just bound to cause trouble!</p>\n<p><strong>CITR: </strong>I couldn’t agree more! However to pick up on Noel’s tidbit, how important do you feel the lyrics are to your music?</p>\n<p><strong>Alex: </strong>I think the conflict between music and lyrics has never been apparent. What we like to do is to have quite happy instrumentals and then quite dark lyrics, and I’d like to put on record I don’t think Danny can write happy lyrics (!), so as we’ve progressed the music has become darker too. It was one of those things as I was growing up that I didn’t really listen to the lyrics and I was just focused on the melodies, whereas Dan was the opposite. So I think we’re trying to cover all the bases, as if you really like the poetic side of music, then I think Dan’s lyrics are fantastic, and then we’ve tried to design the music where it’s just as appealing but perhaps to a different type of listener.</p>\n<p><strong>Daniel: </strong>Yeah, I mean, superficially many people not really listen to the lyrics of a song on the first listen. However as you get into a track, I think its the lyrics which keep you there. For me it was bands that’ could create stories in their lyrics which interested me the most and how I was absorbed into finding more and more meaning every time I listened to their tracks. From there it goes from being a song to being a feeling of mutual experiences and feelings that appeal to your directly as a listener. I particularly enjoy albums like those <strong>Bright Eyes </strong>produce that have recurring meanings and themes that run within them, allowing you to pick up on them and be thoroughly engaged.</p>\n<p><strong>CITR: </strong>What are the plans for <strong>The Crookes </strong>this summer?</p>\n<p><strong>Alex: </strong>I think we’re doing a month in the UK and then a month and a half in Europe, and it just seems to be ever expanding. In our minds we just hope that we can stay out there and that people will keep booking us! In terms of UK festivals, we haven’t heard much yet, certainly nothing to give away as of yet.</p>\n<p><strong>CITR: </strong>Could you give our readers any tips on your past <strong>Glastonbury </strong>experiences? I ask as it’s my first year this year ..</p>\n<p><strong>Dan: </strong>Go to a place called <strong>The Growler</strong>. It’s a food place organised by Pauline Fowler, and you can get a baguette with bacon, chips and cheese in it. It’s amazing!</p>\n<p><strong>CITR: </strong>You’ve obviously realised early on I’m a man heavily interested in my food ..</p>\n<p><strong>Alex: </strong>Haha! I think I can’t emphasise enough how huge the site is itself, so be prepared to walk a great distance! I’ve been to quite a few festivals before hand, and they just seem absolutely tiny in comparison.</p>\n<p><strong>Dan: </strong>Another bit of advice, don’t buy acid from a man near the <strong>Stonehenge Circle. </strong></p>\n<p><strong>Alex: </strong>A man who had sunglasses with only one piece of glass, and he was walking around with ketamine in an old cider bottle. And he asked if I wanted any! So I surprisingly said no.</p>\n<p><strong>Dan: </strong>But then it’d be a nightmare if you had to go back to him, kind of like when you keep tabs on an ugly girl from the start of the night just in case ..</p>\n<p><strong>Alex: </strong>I have to say that we’re not sexist, if anything we’re just faceist ..</p>\n<p><strong>CITR: </strong>Well that sounds remarkably like Fascist ..</p>\n<p><strong>Alex: </strong>Haha! A definite important distinction there. However no, we very much value our female fans, who are all lovely!</p>\n<p><strong>CITR: </strong>I think we’re treading a dangerous path here so we’ll move on to something a bit more light hearted. What would you say has been your worst gig to date?</p>\n<p><strong>Alex: </strong>Ben, that is a question and a half! We as a band have had quite a few band gigs since we first met! I’ll give you my personal opinion first, and then Danny can tell you his. It was last winter when it was snowing a lot and we meant to be playing in Sunderland. We had had the first few dates of our tour cancelled as we just couldn’t get out of Sheffield, however it eased up and we got up to Sunderland,  and it was still really heavy snow. Moreover, it was a club night and we playing in this tiny room with no monitors, or anything really, and because it was so cold we were all pretty ill! So we played to about six people, and it was the worst gig ever. There was this girl looking at me from afar, and I thought this might be a small positive. So, I walked a little bit closer as I was thinking about my approach, and she turned out to be horrific. Now, once again, we’re not sexist!</p>\n<p><strong>Daniel: </strong>That’s right, we just appreciate a nice girl!</p>\n<p><strong>Alex: </strong>Actually don’t write horrific, maybe tone it down a bit! (<strong>Ed: </strong>Too late now?) So we started driving home after the gig and we didn’t get back to Sheffield until about 5:30am and it was about minus 8 or 9 degrees ..</p>\n<p><strong>Daniel: </strong>There was a solitary tear on all our faces that turned to ice!</p>\n<p><strong>Alex: </strong>I remember seeing the moisture on the inside of the window of where I was sitting had just frozen over and the doors were froze shut.</p>\n<p><strong>Daniel: </strong>I think it would have been a better gig had it not been for the weather and the fact we were all ill!</p>\n<p><strong>Alex: </strong>And to compound the whole situation I had holes in my shoes! So I was walking around with wet feet; what a nightmare.</p>\n<p><strong>CITR: </strong>Well I can promise you your gig in Newcastle this month won’t result in frost bite, best of luck .. Cheers <strong>Crookes! </strong></p>\n<p><strong><a href=\"https://www.facebook.com/pages/The-Crookes/112808954085?v=app_4949752878\" target=\"_blank\">The Crookes Facebook</a></strong></p>\n","slug":"5892-review-interview-the-crookes-manchester","category":"interviews","date":1301330340000,"wpid":5892,"isSticky":false,"featured_image":{"width":600,"height":365,"src":"2011/03/the-crookes.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAGAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAMG/8QAIxAAAQMCBQUAAAAAAAAAAAAAAQIDBAAxBQcRISMGEiJBof/EABUBAQEAAAAAAAAAAAAAAAAAAAID/8QAFhEBAQEAAAAAAAAAAAAAAAAAABEB/9oADAMBAAIRAxEAPwDQ4pEzCdxedJhY1BaRJkreaaW6ohDQUfE8d+MfN762jZj9TQ47UXsicKQ3s4TYaXKdTb3SlUlDX//Z"},"createdAt":1587294582014,"updatedAt":1588403558255,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2011/03/the-crookes.jpg","categories":["interviews","music","reviews"]}