{"id":"5e9c316c9b6559241525dd25","title":"Review: John Maus/Plug (Manchester)","content":"<p><strong>Islington Mill </strong>has a habit of throwing up the weird and the wonderful in terms of gigs, with my last experience being a fantastic show by <strong>Islet</strong>.</p><p> A recently renovated mill, <strong>Islington Mill </strong>is more of a ‘performance space’ than it is a venue, decked out with odd chairs, a make shift bar and the most minimal of stages. On this particular evening, after taking an inadvertent scenic route to the venue, I arrived in time to catch <strong>PLUG</strong> perform just before the much anticipated headline act, <strong>John Maus</strong>.</p>\n<p><strong>PLUG:</strong></p>\n<p>Formed around the duo of <strong>Sian Dorrer </strong>and <strong>Georgie Nettell</strong>, <strong>PLUG </strong>is the manifestation of a drum kit and a keyboard. With these two instruments alone <strong>PLUG </strong>took the stage, though their set began stutteringly with a faulty cable. Issue resolved, <strong>PLUG </strong>made a striking start with <strong>Dorrer </strong>emphatically playing percussion while blasting out strong vocals. ‘<strong>Body Story’ </strong>certainly set <strong>PLUG </strong>apart from anything I’d seen in the past, as the track created an atmosphere that felt far greater than what this relatively stripped back outfit could produce. However as the set progressed it began to feel like more of the same by <strong>PLUG</strong> and my interest slowly waivered. It must be said that both <strong>Dorrer</strong>‘s vocals and drumming were superb, though the creative range that this, and <strong>Nettell</strong>‘s keyboard, can produce is undeniably finite.</p>\n<p>7/10</p>\n<p><strong><a href=\"https://www.myspace.com/plugddd\" target=\"_blank\">PLUG MySpace</a></strong></p>\n<p><strong>John Maus:</strong></p>\n<p>Does erratically bounding around a stage while thumping a microphone against your chest constitute ‘a performance’? <strong>John Maus </strong>certainly thought so, beginning his set with so much bottled up energy that I was worried he may actually implode like a supernova into a black hole. With his tracks playing in the background controlled by the sound guy at the back of the room, <strong>John Maus </strong>sang/screamed over these tracks with unbounded enthusiasm while successfully looking like he was mentally deranged.<strong> </strong>Initially off putting, at least for those outside of the front 5 or 6 mimicking fans, I began to enjoy <strong>Maus</strong>‘ performance as he brought to life trashy synth pop tracks which would have sounded distinctly flat live if he were to simply stand behind a keyboard alone on stage. ‘<strong>Do Your Best</strong>‘ and <strong>‘Bennington</strong>‘ were particular highlights in a set that you have to see to believe.</p>\n<p>8/10</p>\n<p><strong><a href=\"https://www.myspace.com/johnmaus\" target=\"_blank\">John Maus MySpace</a></strong></p>\n","slug":"5894-review-john-mausplug-manchester","category":"music","date":1301485018000,"wpid":5894,"isSticky":false,"featured_image":{"width":600,"height":307,"src":"2011/03/john-maus.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAFAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAYH/8QAIhAAAgAGAgIDAAAAAAAAAAAAAQIAAwQFBhEhMQcSE0FS/8QAFAEBAAAAAAAAAAAAAAAAAAAAAv/EABYRAQEBAAAAAAAAAAAAAAAAAAARQf/aAAwDAQACEQMRAD8Ay/FqqZ5KzrC7BdyZFuoZUu3yUksQQiAszb/TFexrXGuoucypEXL74qHSiungAj2Ovkb7PJhCFC1//9k="},"createdAt":1587294572687,"updatedAt":1588403558097,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2011/03/john-maus.jpg","categories":["music","reviews"]}