{"id":"5e9c317e9b6559241525dd46","title":"Lullatone Pull a Radiohead For Japan","content":"<h2><strong>After the tragedy that befell Japan this month, Japanese duo, Lullatone, have allowed fans to pay what they want for their entire discography, all the proceeds going to the Red Cross.</p><p></strong></h2>\n<p>Everybody’s favourite pyjama pop musicians, Lullatone, are  doing what Radiohead did with their seventh studio album,<em> In  Rainbows: </em>Letting the public decide what they want to pay for their  music. The only difference is that all the proceeds are going to the  Japanese Red Cross, helping the country recover from a disaster  that has destroyed so many lives.</p>\n<p>For anyone living in some kind of news free & socially outcast bubble. On the 11th of March 2011, Japan was struck by one of the most powerful earthquakes ever to be recorded. The under sea shockwave triggered a tsunami which swept across the east coast obliterating everything in its path. So far the Japanese National police agency have confirmed 10,668 deaths with over 16,000 others still missing and many more without a home or even a city. Mother nature can be a bitch.</p>\n<p>Lullatone’s entire discography is available for download so dig deep and help those in need – <a title=\"Lullatone on Bandcamp\" href=\"https://lullatone.bandcamp.com/\" target=\"_blank\">https://lullatone.bandcamp.com/</a></p>\n<p>It isn’t just Japanese musicians who are doing their part for the relief effort. American indie hip-rockers, Why?, are holding a charity auction of signed records, artwork and goodies on Josiah’s, ebay page, check it out but if you outbid me then god help you – <a href=\"https://myworld.ebay.com/josiahnice/\">https://myworld.ebay.com/josiahnice/ </a></p>\n","slug":"5899-lullatone-pull-a-radiohead-for-japan","category":"music","date":1301242283000,"wpid":5899,"isSticky":false,"featured_image":{"width":983,"height":660,"src":"2011/03/3528373.jpg.png","placeholder":"data:image/jpeg;base64, iVBORw0KGgoAAAANSUhEUgAAAAoAAAAHCAYAAAAxrNxjAAAACXBIWXMAAA7EAAAOxAGVKw4bAAABIklEQVR4nAXBzytDAQDA8deUTZQSkRtOUkjtptWaV1MziaInTSNtLYplvdqaVmKbpabW/FwMbYxI7SCmDdFEsxM52PwDc3bZ1+cjfKYueUps0+deZixTxpOFUbuXfsMAuw8lErkyxy9/CMXMFR/JGBa3zFT0jZV0ifjCBJkFI6GdJLkCZF9/EQYlDdexdayTIqvWYZb8YQI2I2mbSHw/RvTwApfHg6Coq6C2W0V1p5Lm1ibkUS0HThNf0RWSAZn7iBfZYUGoalCiaKtBrWtHNg+RjyzyfObj7iRCMbXJz/s5hdMNhMp6FUJXDz6HidDcNLduHUGXiKTV8LjWz8nWDPngPEJjRwsGSeQmPIt9XI9/WoNlpBdJVGMe0fO65+T7yM0/3d2tEUg45BEAAAAASUVORK5CYII="},"createdAt":1587294590299,"updatedAt":1588403558386,"author":"5e9b68b27a1236eccfeb1d40","old_image":"2011/03/3528373.jpg.png","categories":["music"]}