{"id":"5e9c31799b6559241525dd3d","title":"Feature: Are DJs The New Rockstars?","content":"<p style=\"text-align: center;\"><!-- @font-face {   font-family: \"ＭＳ 明朝\"; }@font-face {   font-family: \"Cambria Math\"; }@font-face {   font-family: \"Cambria\"; }p.</p><p>MsoNormal, li.MsoNormal, div.MsoNormal { margin: 0cm 0cm 0.0001pt; font-size: 12pt; font-family: Cambria; }.MsoChpDefault { font-family: Cambria; }div.WordSection1 { page: WordSection1; } --> <em>(L-R Axwell, Ingrosso, Angello)</em></p>\n<p><em> </em>In the promotional spiel for Swedish House Mafia’s 45 minute long documentary ‘Take One” there was one sentence in particular that attracted my attention -“DJs are the new rockstars”; a quote coming from none other than the Rolling Stone Magazine. This had me thinking, has the accolade of international rockstar moved away from its home ground of guitar band based rock music, and been transcended by a new wave of commercial, mass appeal electronic based music? N.E.R.D pioneer Pharrell Williams seems to agree, talking to MTV he claimed</p>\n<p><em>“The Rock Stars are the dance DJs, because they ultimately know how to go in and make people move by rocking their turntables and sounds…I see these guys [Swedish House Mafia] as Rock Stars”</em></p>\n<p>Tiesto, another International ‘Super DJ’ also claimed that the Swedish House Mafia are the ‘<em>Rock stars of the scene’.</em> So does the common image of a band of excessive binge drinking, drug abusing and sexual promiscuousness really transfer over to the electronic genre? The documentary, “Take One”, offers an interesting answer to this question.</p>\n<p><a rel=\"attachment wp-att-5938\" href=\"https://api.crackintheroad.com/music/5935-feature-are-djs-the-new-rockstars/attachment/untitled2\"><img class=\"alignnone size-full wp-image-5938\" title=\"Untitled2\" src=\"https://admin.crackintheroad.com/uploads/2011/03/Untitled2.png\" alt=\"\" width=\"600\" height=\"400\" srcset=\"https://api.crackintheroad.com/images/2011/03/Untitled2.png 600w, https://api.crackintheroad.com/images/2011/03/Untitled2-260x173.png 260w, https://api.crackintheroad.com/images/2011/03/Untitled2-494x329.png 494w, https://api.crackintheroad.com/images/2011/03/Untitled2-165x110.png 165w\" sizes=\"(max-width: 600px) 100vw, 600px\" /></a></p>\n<p>Firstly, who exactly are “The Swedish House Mafia?” Made up of 3 Progressive House DJs/Producers; Steve Angello, Axel Hedfors a.k.a Axwell and Sebastian Ingrosso. All three have enjoyed successful solo careers before forming the Swedish House Mafia in 2007. In 2010 Axwell ranked 10<sup>th</sup> in the DJ Mags Top 50 DJs, and Angello and Ingrosso ranked 14<sup>th</sup> and 16<sup>th</sup> respectively. Axwell was responsible for global hit “Feel the Vibe” in 2004, Angello’s legendary remix of Robin S’s “Show Me The Love” with Laidback Luke in 2007 gained a chart number One in the UK, and finally, Ingrosso’s “How Soon Is Now” Feat. Julie Mcknight and Dirty South amongst other electronic household names was another charting success. However the DJs have so far found their most critical success coming when they instigated the formation of Swedish House Mafia in 2007. With the release of “Get Dumb”, with Laidback Luke, they firmly positioned themselves in the charts and minds of House fans, and the prestige of their brand, which was quite extensive, grew.</p>\n<p>It wasn’t until 2010, with the release of their first album “Until One” , when they really found global chart topping success. Working with artists such as Tinie Tempah and Pharrell, two of their singles “Miami2Ibiza” and most notably “One” had extensive chart success and was almost guaranteed to be played by any DJ in any club. They cemented this fame with Ibiza residencies and frequent appearances at huge gigs such as Creamfields, The Radio One Ibiza Weekend, Miami Winter Music Conference and the Ultra Music Festival, which helped them onto international success.  In 2008, veteran Swedish filmmaker, Christian Larsonn, filmed a documentary about Swedish House Mafia’s global rise, aptly named “Take One”, charting two years of the groups travels in 45 minutes as they play 253 gigs in 15 countries. The documentary also provides an interesting insight to how the group act whilst performing and in spare time, to be a rock star as conventional wisdom dictates; you need to be one off stage, as well as on.</p>\n<p><strong>Ingrosso  “ </strong>Why are we going on this crazy trip?”<br />\n<strong>Angello</strong> “ It’s not that crazy. Toronto to Madrid, then to Ibiza. Its pretty good.”<br />\n<strong>Axwell</strong> “Or we’ll just do London to Ibiza, and then back…in business class”</p>\n<p>The opening dialogue to the documentary is revealing in more ways than one. Firstly, we see even back in 2008 they had global reach, and secondly we see the relationship between the three DJs, something that becomes more apparent as the documentary goes on. Angello is the more arrogant and brash of the three, certainly the ‘bad boy’ of the group, Ingrosso seems to be more professional and down to earth, whilst Axwell is the quietest member of the trio.  The general dialogue is interspersed with clips from huge events across the world, one thing is for sure, these guys know how to create an atmosphere. Crowds of up to 250,000 going crazy to the drops of popular tunes may pay testament to the new ‘rock star’ status the group has earned. There are also more personal insights into how they act off stage, at times hilarious, at times shocking…sometimes outright confusing.. There’s a scene where Angello is in the lift with two attractive women, trying to convince them to say the word “insert”, a bit weird, no? However, what is most notable are the frequent outbursts of anger and arrogance from Angello. He became an internet sensation over night after an altercation with Paris Hilton, when asked by the socialite “Do you know who I am?!” he responded in term with “I’m Steve Angello, do you fucking know who I am?!” before retorting at one of her followers “You fucking touch me again, get the fuck out of my face”. Apparently the whole incident was caused by a festival goer who requested Angello to play Daft Punk or Bob Sinclair, to which he ‘rudely’ responded with “I only play this music”.  The whole debacle was reignited when Ingrosso realised he had booked into the same hotel as Paris Hilton in Amsterdam, the pictures beneath shows his humorous dig at her in support of his more vocal DJ colleague!</p>\n<p><a rel=\"attachment wp-att-5937\" href=\"https://admin.crackintheroad.com/music/5935-feature-are-djs-the-new-rockstars/attachment/untitled1\"><img class=\"alignnone size-full wp-image-5937\" title=\"Untitled1\" src=\"https://api.crackintheroad.com/images/2011/03/Untitled1.png\" alt=\"\" width=\"600\" height=\"310\" srcset=\"https://api.crackintheroad.com/images/2011/03/Untitled1.png 600w, https://api.crackintheroad.com/images/2011/03/Untitled1-260x134.png 260w, https://api.crackintheroad.com/images/2011/03/Untitled1-494x255.png 494w, https://api.crackintheroad.com/images/2011/03/Untitled1-165x85.png 165w\" sizes=\"(max-width: 600px) 100vw, 600px\" /></a></p>\n<p><!-- @font-face {   font-family: \"ＭＳ 明朝\"; }@font-face {   font-family: \"Cambria Math\"; }@font-face {   font-family: \"Cambria\"; }p.MsoNormal, li.MsoNormal, div.MsoNormal { margin: 0cm 0cm 0.0001pt; font-size: 12pt; font-family: Cambria; }.MsoChpDefault { font-family: Cambria; }div.WordSection1 { page: WordSection1; } --> <em>The battle of the words: Angello’s cheeky dig at Hilton</em></p>\n<p>Other incidents worthy of note include when the group get into a waiting bus for a gig in Brussels, whereupon finding that the bus drivers friend has come along for the ride, Angello abuses him for the whole journey and threatens to call the event manager. The other two members are a bit more down to earth, there are many scenes of heavy drinking and general partying, but that is to be expected. Axwell is seen leaving one gig evidently angry at the quality of the sound, and the fact that the drinks he ordered never came. At one point, the groups manager writes to them requesting that they turned up to gigs on time and behaved themselves, something which they evidently ignore as they are late for an important 3 minute slot because Axwell ‘needed a piss’.</p>\n<p>What is evident throughout the documentary however is that they love their music , but most importantly, they love playing their music for their fans. You see their pre-gig fears before a sell out performance at the Brixton Academy,  constantly going over their set, trying to perfect it, and then afterwards you see Ingrosso almost bought to tears by the experience he shared with his fans, whom he describes as his ‘best friends’. You also see a huge amount of studio time, dedicated to bringing out the next best single, we are in fact given exclusive access to the moment they conceived the legendary song “One”, and what a moment that is.</p>\n<p>For me, when you say to me ‘this guy is a rock star’, I don’t necessarily expect that certain person to lead a Charlie Sheen lifestyle. Paul McCartney is referred to as a ‘rock star’, and although he is no goody-two-shoes, he’s not well known for his marathon drug taking sessions. However, can you really refer to the Swedish House Mafia, as a group, not individually, as rock stars? They certainly live an extravagant life, full of riches, girls and big houses, just like your stereotypical rock stars. They fill out huge arenas, sometimes hundreds of thousands of people, just like rock stars. They have been controversial at times, but admittedly they’re not usually in the papers for the wrong reasons, unlike some rock stars. There is, however, the slight issue with the word ‘rock’, as if it refers to the genre of Rock N’ Roll, however with the decline of this genre, the word has become normalised to refer to anyone, across the music spectrum.</p>\n<p>What’s crucial in this assessment, in my opinion, is their music which, as Pharrell stated at the start of this article, gets ‘people rocking’. I don’t think a rock star is defined as such because of his or her off stage habits, I think its all about what they do with their performances, and frankly the meteoric rise of the Swedish House Mafia, and the live sets that I’ve seen for myself, such as the unbelievable 2 hours at Creamfields, all say to me…yes…I do believe DJs are the new rock stars.</p>\n<p><a rel=\"attachment wp-att-5936\" href=\"https://admin.crackintheroad.com/music/5935-feature-are-djs-the-new-rockstars/attachment/untitled-2\"><img class=\"alignnone size-full wp-image-5936\" title=\"Untitled\" src=\"https://api.crackintheroad.com/images/2011/03/Untitled.png\" alt=\"\" width=\"500\" height=\"333\" srcset=\"https://api.crackintheroad.com/images/2011/03/Untitled.png 500w, https://api.crackintheroad.com/images/2011/03/Untitled-260x173.png 260w, https://api.crackintheroad.com/images/2011/03/Untitled-494x329.png 494w, https://api.crackintheroad.com/images/2011/03/Untitled-165x109.png 165w\" sizes=\"(max-width: 500px) 100vw, 500px\" /></a></p>\n<p><!-- @font-face {   font-family: \"ＭＳ 明朝\"; }@font-face {   font-family: \"Cambria Math\"; }@font-face {   font-family: \"Cambria\"; }p.MsoNormal, li.MsoNormal, div.MsoNormal { margin: 0cm 0cm 0.0001pt; font-size: 12pt; font-family: Cambria; }.MsoChpDefault { font-family: Cambria; }div.WordSection1 { page: WordSection1; } --> <em>Angello in Ibiza</em></p>\n","slug":"5935-feature-are-djs-the-new-rockstars","category":"editorials","date":1301270906000,"wpid":5935,"isSticky":false,"featured_image":{"width":500,"height":333,"src":"2011/03/untitled.png","placeholder":"data:image/jpeg;base64, iVBORw0KGgoAAAANSUhEUgAAAAoAAAAHCAYAAAAxrNxjAAAACXBIWXMAABcSAAAXEgFnn9JSAAABCUlEQVR4nCWKu0rDYBhAvyTNn8vfpElB6RU1hSJYq6WDKKVaXURRxLq4iBWhXkBfQMHFwdmncOiog4Mv4OYrOIgP4Joj1ukcOEdMS3CU4LkGSgmuYxBrg1KUoRpbzBUyzOStVP6mrCe4mX8GvjARmqwkIa2KT+QL2jVSyWuhUbA4WSuwUFXEWSFQwnW/zO5qCRFB2UYq2hG6NZvR3QbrsyG2KeN4dTTF8KA+9py2UtlOPPYSm5tuwGUnZNAMGNQ1h62I43bMftGiMWmm8noecd+v8P20zM9blc/HMu+nJR56OS6WPIbziunYTGV0G/L1vMXHy4DhZsROM6CT+PQXA856Rdq1EO2Y6S/0EmjOrV1BMgAAAABJRU5ErkJggg=="},"createdAt":1587294585961,"updatedAt":1588403558305,"author":"5e9b68b27a1236eccfeb1d3a","old_image":"2011/03/untitled.png","categories":["editorials","music"]}