{"id":"5e9c316b9b6559241525dd22","title":"Review: Josh T. Pearson (Manchester)","content":"<p><strong>The Deaf Institute </strong>really is one the best venues in the UK, and on this occasion the atmosphere was absorbing as the place was packed to the rafters with eager <strong>Josh T.</p><p> Pearson </strong>fans. With his most recent album, ‘<strong>Last of the Country Gentlemen</strong>‘, receiving numerous 10/10 by major music critics, the level of expectation could be felt with ease as <strong>Pearson </strong>took to the stage. A towering, and well bearded, figure, <strong>Pearson </strong>began by informing the audience that it was his birthday. On this announcement, one particularly extrovert fan spontaneously burst into a rendition of ‘<strong>Happy Birthday</strong>‘ which quickly escalated into an emphatic, and surprisingly well coordinated, chorus of singing. Grateful, <strong>Pearson </strong>quipped that it was his 27th birthday, only for afore mentioned fan to tease out his actual age of 37. This level of stage banter would be typical for the rest of <strong>Pearson</strong>‘s set, demonstrated by a very well played joke<strong>:</strong></p>\n<p><strong>Josh: </strong>What’s this place called again?</p>\n<p><strong>Fan: </strong>The Deaf Institute!</p>\n<p><strong>Josh: </strong>Eh? What was that?</p>\n<p>(Hilarity ensues)</p>\n<p>Thoroughly engaging, <strong>Pearson </strong>began one of the most sublime sets I have ever seen. <strong>Pearson </strong>created a sound that filled the room, moving seamlessly from diminuendo to crescendo with his fantastic guitar playing while capturing the audience’s attention with tender yet powerful vocals. A particular highlight was ‘<strong>Sweetheart I Ain’t Your Christ</strong>‘, an 11 minute epic that was full of elements of country, but was remarkably unique in it’s authenticity and emotional rawness. Progressing on to ‘<strong>Women, When I’ve Raised Hell</strong>‘, standing at an impressive 7 minutes, <strong>Pearson </strong>joked about the length of his tracks, stating that the was ‘bringing back the ten minute pop songs back into trend’.</p>\n<p>What stood out in <strong>Pearson</strong>‘s set was the level of intimacy he so effortlessly created, both in terms of his tracks and his audience conversations. ‘<strong>Woman, When I’ve Raised Hell</strong>‘ was performed with such confidence and subtlety that one immediately imagined the ‘woman’ standing in front of <strong>Pearson</strong>, listening to his impassioned words. However <strong>Pearson </strong>also realised the melancholic nature of his tracks by interspersing them with amusing side stories (fiction or otherwise), one of which was his lesson that one shouldn’t attempt to get a ferry from Liverpool to Dublin, as after searching for two hours he ‘realised they don’t run anymore’.</p>\n<p>As <strong>Pearson</strong>‘s set drew to a close, he responded to an audience request to perform ‘<strong>Devil’s on the Run</strong>‘. The strongest track of the evening, <strong>Pearson </strong>performed ‘<strong>Devil’s on the Run</strong>‘ with a serene beauty that was only interrupted when, after the audience had agreed to sing along to the chorus, he had to jokingly tell us to ‘leave our coolness by the door’ and to all sing louder. Not many artists could tell a Manchester audience what to do and still expect an applause, however <strong>Pearson </strong>had won our hearts so emphatically that we responded in a zealous chorus and for that moment there was a genuine feeling of intimate community. With both his musical genius, emotional rawness and humourous charm, <strong>Josh T. Pearson </strong>produced a performance that was both entertaining and awe inpsiring to watch.</p>\n<p>10/10</p>\n<p><strong><a href=\"https://www.myspace.com/joshtpearson\" target=\"_blank\">Josh T. Pearson MySpace</a></strong></p>\n","slug":"5949-review-josh-t-pearson-manchester","category":"music","date":1301487543000,"wpid":5949,"isSticky":false,"featured_image":{"width":700,"height":485,"src":"2011/03/josh-t-pearson.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAYH/8QAIhAAAQQBAwUBAAAAAAAAAAAAAQIDBAUAEyFBBgcRElFh/8QAFAEBAAAAAAAAAAAAAAAAAAAAAv/EABkRAAIDAQAAAAAAAAAAAAAAAAACAREiUf/aAAwDAQACEQMRAD8Aib2xdoqeE5QtyXJttGlxpOpJUC0rXCQQfYcg7jjb7mo1nbGsTWxArqu6KgygEhRHnYfmMYm6GM0p/9k="},"createdAt":1587294571209,"updatedAt":1588403558069,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2011/03/josh-t-pearson.jpg","categories":["music","reviews"]}