{"id":"5e9c31649b6559241525dd13","title":"Feature: The Cuts Protest","content":"<p>The 26th of March was a day of ideological opposites.</p><p> What you’ve undoubtedly been subjected to over the last few days, however, is an endless stream of images that show the protest at its most violent and turbulent. Despite the media’s corruption of the day, at times it was exactly like that. By 9pm Piccadilly was a wasteland: fires billowed from huge piles of rubbish, bins and traffic cones littered the streets and the police desperately tried to control the situation as best they could.</p>\n<p>It hadn’t started like this however. 11 hours earlier I was on the top deck of a bus in east London. The seats were occupied almost exclusively by parents and their children, one kid even offered me a bit of her tuna sandwich, I declined but it looked pretty fucking delicious. The scene couldn’t have been further away from the scenes later in the day. As we left the bus with our newfound friends, the atmosphere that greeted us on the streets was electric with the sinister feelings of protests from the past evaporated, despite the location being the same. There was a genuine feeling that things could change. I even found I wasn’t annoyed by Socialist workers trying to sell me their propaganda as a walked by, believe me when I say this: that hardly ever happens. I was walking on air, we all were. More than anything people were having fun, protesters whistled and hollered as we marched under echo-filled bridges, bands played and there was a belief that with this unified attitude, we could overcome the appalling politics that had sparked the protests in the first place.</p>\n<p>As we followed the route to Hyde Park the feeling was sustained. We were greeted by thousands of people, a huge stage and a rather handsome didgeridoo player. Unfortunately this didn’t last long. A tweet from UK-UNCUT spread trough the crowd, “apparently they’re using tear gas on Oxford street” muttered my friend with his eyes locked to his phone. By the time we arrived the ‘violence’ had spread to Piccadilly Circus, I got there just in time to see around three banks being broken into. Alarms echoed through the streets to the soundtrack of “Whose streets? OUR STEETS!!” I was inclined to believe them.</p>\n<p>The last time I wrote about the protests in London I was fairly supportive of the actions of the anarchists. I’m not in anyway supportive of violence and would describe myself as a pacifist, yet the destruction didn’t seemed to be targeted at a particular person or sect, more the system that is failing us. On the 26th, although the sentiment may have been the same, the ‘anarchist’s actions were in no way in keeping with the mentality and ideology of the protest. This time they were actually a minority.</p>\n<p>As the statistics came through in the days that followed it made for depressing reading. 201 arrested and 149 charged along with a slightly annoying statement from Commander Bob Broadhurst, who led the Met police operation, “Their intent appeared to be causing havoc, with no concern at all for those people in central London they were putting in danger.” I don’t think that was their intent at all, if anything they were the people there that day that cared the most, but I still think they tainted what could have otherwise been a major step in the countries’ distaste for the cuts.</p>\n<p><iframe src=\"https://www.facebook.com/plugins/like.php?href=http%3A%2F%2Fwww.facebook.com%2Fcrackintheroad&layout=standard&show_faces=true&width=450&action=like&font=arial&colorscheme=light&height=80\" scrolling=\"no\" frameborder=\"0\" style=\"border:none; overflow:hidden; width:450px; height:80px;\" allowTransparency=\"true\"></iframe></p>\n","slug":"5956-feature-the-cuts-protest","category":"life","date":1301509408000,"wpid":5956,"isSticky":false,"featured_image":{"width":950,"height":633,"src":"2011/03/use1pro1.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAYH/8QAIhAAAQMDBAMBAAAAAAAAAAAAAQIDEQAEBQYTITEHIkFx/8QAFQEBAQAAAAAAAAAAAAAAAAAAAQL/xAAZEQADAAMAAAAAAAAAAAAAAAAAAQISITH/2gAMAwEAAhEDEQA/AI1zzRc4x2yb0qhzF2tmiA25D5eUpRUrcWqVEdAc/PyNFGv85cjfOTvE7vvDZSEieYAI6pSlvFaKiVXT/9k="},"createdAt":1587294564418,"updatedAt":1588403557925,"author":"5e9b68b27a1236eccfeb1d24","old_image":"2011/03/use1pro1.jpg","categories":["life","opinion"]}