{"id":"5e9c31669b6559241525dd19","artists":["5e9b68f27a1236eccfeb2056"],"title":"Review: Filardo – Enter The Edit Suite","content":"<p><a rel=\"attachment wp-att-6103\" href=\"https://admin.</p><p>crackintheroad.com/music/6023-review-filardo-enter-the-edit-suite/attachment/tumblr_lifojnjtpr1qbecjso1_500\"><img class=\"alignnone size-medium wp-image-6103\" title=\"tumblr_lifojnjTpR1qbecjso1_500\" src=\"https://api.crackintheroad.com/uploads/2011/03/tumblr_lifojnjTpR1qbecjso1_500-288x288.jpg\" alt=\"\" width=\"288\" height=\"288\" /></a></p>\n<p>Every now and then I stumble upon a website so visually astounding that I immediately become transfixed with the contents and spent hours analyzing every last image on the page. This was certainly the case when finding Christian Filardo’s independently run record label over at <a href=\"https://holypage.tumblr.com/\">Holy Page</a>, a cataclysm of vibrant colours, spliced photographs and intriguing paragraphs, and that isn’t even mentioning the music.</p>\n<p>My only criticism would be that a starting point would be useful, however I began to work my way through all the music featured on the page, and at the recommendation of Christian, gave a listen to Filardo”s Enter The Edit Suite. The opening blurb on it’s bandcamp suggest it’s a record hugely influenced by Brian Wilson, and it’s evident right from the word go. This is an album full of sun drenched pop melodies each with a quirky edge, with touches of Bowie thrown in for good effect. “We Start In Tango” being the perfect example of this, an upbeat electronic riff controls the entire tune, carrying it along effortlessly.</p>\n<p>Yet despite it’s upbeat theme, there’s a couple of tracks that seem to have appeared directly from a black and white 1950’s film. One can almost picture the scene, a young couple slow dancing whilst “I Can Love You More” plays in the background, it’s a truly fascinating listen. If that’s not your cup of tea, then check out the brash vibes of There Is A Fear, a song so brilliantly but absurdly pop. The vocals throughout the record are excellently delivered; it’s the imperfections in Tom Filardo’s voice that give Enter The Edit Suite it’s unique characteristics.</p>\n<p>Enter The Edit Suite is quite unlike any other record i have heard this year, and that’s entirely a positive attribute. It’s an album of many colours, all which are viewed in a way that’s ultimately decided by the listener. Head over to <a href=\"https://filardo.bandcamp.com/\">Filardo’s bandcamp</a> to download Enter The Edit Suite for free.</p>\n","slug":"6023-review-filardo-enter-the-edit-suite","category":"music","date":1301502451000,"wpid":6023,"isSticky":false,"featured_image":{"width":600,"height":600,"src":"2011/03/tumblr_lifojnjtpr1qbecjso1_500.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAABQIG/8QAIxAAAQMDAgcAAAAAAAAAAAAAAQIDEQAFBhIhBBMxQYGR8P/EABUBAQEAAAAAAAAAAAAAAAAAAAUG/8QAHBEAAgAHAAAAAAAAAAAAAAAAAAIBEhQhMkKx/9oADAMBAAIRAxEAPwDUnK+IctTqTjDsbqC23hG4gSPH0VbeWWHlp12F4LgSCoGD7oZS1gMAKUBEQD200esnUdz1oFZG16VFNbKJ/9k="},"createdAt":1587294566639,"updatedAt":1588403557982,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/03/tumblr_lifojnjtpr1qbecjso1_500.jpg","categories":["music","reviews"]}