{"id":"5e9c315c9b6559241525dd06","artists":["5e9b691e7a1236eccfeb22e7"],"title":"Review and Interview: Maps and Atlases","content":"<p><a rel=\"attachment wp-att-6207\" href=\"https://admin.</p><p>crackintheroad.com/music/6206-review-and-interview-maps-and-atlases/attachment/maps-atlases\"><img class=\"alignnone size-900wide wp-image-6207\" title=\"maps-atlases\" src=\"https://api.crackintheroad.com/uploads/2011/04/maps-atlases-900x555.jpg\" alt=\"\" width=\"900\" height=\"555\" /></a></p>\n<p> I first saw <strong>Maps and Atlases</strong> in 2008, supporting Foals in Aberdeen Music Hall and after noticing they were playing in Sneaky Pete’s in Edinburgh I had to see them perform again. Hailing from across the water in Chicago, Illinois, they fit in perfectly over here with their typical pop-rock style with a delicate touch of folk; incorporating all these massively popular genres into one. The venue itself is infamous for being one of the smallest in Scotland, and yet it plays hosts some very impressive bands. This night was no exception with <em>Solid Ground </em>and <em>You and Me and the Mountain</em> were the particular highlights of the evening until they decided to leave the stage and play in a circle on the already congested dancefloor acoustically as an encore. To be honest this is when the gig came to life, with the band surrounded by the humming crowd in a summer camp fire type sing-a-long. I was almost tempted to ask them to play <em>Kum Bay Ya</em> it felt so much like being 11 again at a scout camp and an ideal way to end the evening. It appeared to mellow everyone out; instead of the typical crush by drunken fans to leave the venue, people became almost sedated and unwilling to move at all; even when the band had vanished through the exit doors. However, before the gig I managed to chat to Dave and Shiraz from <strong>Maps and Atlases </strong>who were more than happy to chat to CitR:</p>\n<p>CitR: I saw you guys in 2008 with <strong>Foals </strong>and <strong>Wild Beasts</strong>, are you close to those bands or was it put together without much input from you?</p>\n<p><strong>We are great fans, of Foals and they are of us too, they are great guys and come to see us on tour a lot when we’re about the UK. Really good friends too and they invited us across initially.</strong></p>\n<p>CitR: You have played SXSW festival before, how does it compare with other festivals across the world you’ve performed at?</p>\n<p><strong>We have play it about 4 times I think, it is a great experience because so many of our friends play there too and with touring it is very hard to see them for much of the year so it is great to catch up and play music with people close to us.</strong></p>\n<p>CitR: Why did you think about playing in the UK as much as you do, and what are the differences in crowds and the reception to receive in each place?</p>\n<p><strong>Well initially it was because Foals asked us to play with them and our crowds are very similar here and across in the states. We are going on a European tour which we are looking forward to as well.</strong></p>\n<p>CitR: What are the best band you have supported and are there any bands that you know of that should get more recognition that have supported you in the past?</p>\n<p><strong>We have supported so many great bands that none really stands out but there are loads of band we are very good friends with that should be going places such as Gypsy Blood, Patterns Movement and Deer Hoof.</strong></p>\n<p>CitR: and finally, if you could have any superpower what would it be and why?</p>\n<p><strong>Shiraz: I would love to be able to stop time</strong></p>\n<p><strong>Dave: The power to heal people I think would be really good.</strong></p>\n<p>Catch them on Myspace <a href=\"https://www.myspace.com/mapsandatlases\">here </a></p>\n<p>On Facebook <a href=\"https://www.facebook.com/#!/pages/Maps-Atlases/103729676331967\">here</a></p>\n<p>Official site <a href=\"https://mapsandatlases.org/\">here</a></p>\n<p><iframe src=\"https://www.facebook.com/plugins/like.php?href=http%3A%2F%2Fwww.facebook.com%2Fcrackintheroad&layout=standard&show_faces=true&width=450&action=like&font=arial&colorscheme=light&height=80\" scrolling=\"no\" frameborder=\"0\" style=\"border:none; overflow:hidden; width:450px; height:80px;\" allowTransparency=\"true\"></iframe></p>\n","slug":"6206-review-and-interview-maps-and-atlases","category":"interviews","date":1301666041000,"wpid":6206,"isSticky":false,"featured_image":null,"createdAt":1587294556688,"updatedAt":1588441789780,"author":"5e9b68b27a1236eccfeb1d07","old_image":"generated/5e099030ad9df217542ca7df39838524448ca5b5.jpg","categories":["interviews","music","reviews"]}