{"id":"5e9c34479b6559241525e1d9","title":"Interview: Psychonaught","content":"<p style=\"text-align: center;\"><a href=\"https://admin.</p><p>crackintheroad.com/uploads/2010/05/jeffphoto.jpg\"><br />\n</a></p>\n<p>Although only 19 years of age, Alex Reid aka <strong>Psychonaught</strong>, is something of a veteran in Newcastle’s dubstep scene. Starting when he was only 16 Reid began music production using his dad’s old computer. To begin with he struggled to find his electronic identity, the amateurish Gabba he produced wasn’t exactly of the highest standard. What it did do however, is give this exciting producer the know how to go on to create the exciting brand of dubstep we hear from him today. <strong>Crack in The Road</strong> sat down with <strong>Psychonaught</strong> recently to discuss the sound, the scene and the future of this exciting young producer.</p>\n<p>It’s ten past three outside a small pub in Newcastle and <strong>Psychonaught </strong>is late. When he eventually arrives however I’m not met with the arrogance you might associate with a genre that has suddenly, and in many ways unexpectedly, become mainstream. Instead he apologises politely and offers to buy me a drink, not what many would expect. But then <strong>Psychonaught</strong> isn’t what many would expect; shy, composed and charming, he’s on the verge of being signed but there’s no way you could tell from his general demeanour. It’s this relaxed outlook on life and music that makes him instantly likable. I ask him about the scene and how it’s changed from his early years, does it depress him at all to watch the genre he loves being watered down. He smiles, “It doesn’t bother me” he chuckles, for him at least its exciting to see the genre he loves get the recognition it deserves. It seems his music is as well, with his <strong>Vibes EP</strong> being released on <strong>Kursed Recordings</strong> his music will finally be allowed to spread its wings. Something Psychonaught seems genuinely excited about; he grins almost like a small child at the prospect and even seems to think the mere mention of it is a “shameless plug”.</p>\n<p>But what about the sound? With a world of “wobble dubstep” at the masses finger tips, what does <strong>Psychonaught </strong>offer that they don’t? “Soul” <strong>Psychonaught</strong> states almost bluntly, and when going back and listening to some of his early work, the word soul certainly rings true. His music sounds almost like a throwback to the glory days of UK garage, blended with the modern flavours that make dubstep so exciting. <strong>Psychonaught</strong> makes it clear that it’s these Soul and Garage elements that he wants associated with his music. Rather than looking for Dub or reggae samples, <strong>Psychonaught </strong>scours old Rn’B and soul records in the hope of finding that perfect hook; it’s this that gives his music a distinct sound. The link with Burial’s music is obvious, his latest record <em>‘I just want you’ </em>holds certain parallels with <em>‘Archangel’</em>, however Psychonaught definitely isn’t trying to be Burial. The respect he has for the producer is clear “I’m really influenced by Burial, everyone fucking loves Burial man”, but this never seems to take his music to the wrong side of impersonation. His music first and foremost is party music, its there to “bob your head to”, but <strong>Psychonaught</strong> also makes it clear that he wants the “hairs to stand up on the back of your neck”.</p>\n<p style=\"text-align: center;\">So what does the future hold for <strong>Psychonaught</strong>? Well, by the time you read this his EP will be released, but rather than touring <strong>Psychonaught </strong>makes it clear that he’s going to stick to what he loves; production. Although the bright lights of the upcoming Heavyweight club night and others alike have their charm, it seems this particular artist simply wants to go it alone.</p>\n<p style=\"text-align: center;\">\n<p style=\"text-align: center;\"><a href=\"https://www.youtube.com/watch?v=q4E_OISeDVE\">Listen to The Interview</a></p>\n<p style=\"text-align: center;\"><a href=\"https://www.myspace.com/unwino\">Psychonaught’s Myspace</a></p>\n<p style=\"text-align: center;\"><a href=\"https://www.digital-tunes.net/labels/kursed_recordings\">Download the Vibes EP</a></p>\n<p style=\"text-align: center;\"><a href=\"https://www.kursedrecordings.blogspot.com/\">Check out Kursed Recording’s Website</a></p>\n<p style=\"text-align: center;\"><a href=\"https://www.youtube.com/watch?v=VGKSsZRQ5_k\">Listen on Youtube</a></p>\n<p style=\"text-align: center;\">\n","slug":"621-psychonaught","category":"interviews","date":1272908172000,"wpid":621,"isSticky":false,"featured_image":{"width":900,"height":897,"src":"2010/05/jeffphoto.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAABgL/xAAkEAABAwMDBAMAAAAAAAAAAAABAgMEAAUhBhIxBxETIiNBUf/EABQBAQAAAAAAAAAAAAAAAAAAAAD/xAAUEQEAAAAAAAAAAAAAAAAAAAAA/9oADAMBAAIRAxEAPwAvpjqVJiw7Nak6DhTUtwY6EoLQ8rpCSPLuDZwrGD+UMunUaW/c5bqrBZGS48tRbEVQCO6idvH1xRUT5ghwu0uQNjYSn5D6gcAZ4qHZUhTi1KfdJJJJKzmg/9k="},"createdAt":1587295303762,"updatedAt":1588403568290,"author":"5e9b68b27a1236eccfeb1d24","old_image":"2010/05/jeffphoto.jpg","categories":["interviews","music"]}