{"id":"5e9c31599b6559241525dd02","title":"Film Review: Essential Killing","content":"<p><a rel=\"attachment wp-att-6245\" href=\"https://admin.</p><p>crackintheroad.com/visual/6243-film-review-essential-killing/attachment/essential-killing\"><img class=\"aligncenter size-900wide wp-image-6245\" title=\"essential-killing\" src=\"https://api.crackintheroad.com/uploads/2011/04/essential-killing-900x522.jpg\" alt=\"\" width=\"900\" height=\"522\" /></a></p>\n<p>It’s been 17 years since <strong>Jerzy Skolimowski’s</strong> last film ‘<em>Four nights with Anna</em>’, 17 years that bring the director to the ripe old age of 72.  Essential Killing, his triumphant return to form, arguably wears <strong>Skolimowski’s</strong> age on its sleeve; it’s mature, minimalist and endurance testing cinema at its finest.</p>\n<p>The plot of the film has an impressive ability of being intriguingly vague while being set firmly in a given time period. <strong>Vincent Gallo</strong> stars as Mohammed, a suspected terrorist, captured in his native Afghanistan and brought through Europe for further interrogation. As expected, the van Mohammed is being transported in crashes, leaving him in a desolate Russian wasteland with only the clothes on his back. At its core, the film is a simple manhunt film, but in many cases the film takes strides to depart from such a rigid formula. For one, we’re never really invited to side with either of the two opposing forces. Although throughout the film we follow Mohammed, in certain moments we too are searching for him, through dramatic and sweeping aerial shots that show of the landscape in quite the fashion. When the film does follow a given formula, it still manages to be engaging.  The film’s sense of the metaphysical is visceral and entirely believable, with Mohammed’s fight for survival striking the perfect balance between excitement and realism.</p>\n<p>In fact, as a whole the film balances its different elements with a certain flare. As Mohammed slowly becomes weaker he slowly descends into a genuinely mild altering state of delirium. It does it with such a bold sense of conviction and subtlety that you’ll know doubt feel the same sense of confusion Mohammed does.  In short, the ideas of truth and fiction are entities of Essential Killing that can never be trusted.</p>\n<p>The most striking and indeed impressive aspect of the film only becomes apparent by the film’s half way point: Mohammed hasn’t spoken yet, and won’t for that matter, for the film’s entirety. This makes Vincent Gallo’s performance all the more impressive, his whimpers and shrieks become enthralling soliloquies and speeches and his very fight for survival, a cementation of his prior life. It’s for that reason, his character is so convincing, despite his crimes throughout the picture we’re constantly provoked to forgive and when faced with some of his actions the fact that we come anywhere close is impressive in itself.</p>\n<p><iframe src=\"https://www.facebook.com/plugins/like.php?href=http%3A%2F%2Fwww.facebook.com%2Fcrackintheroad&layout=standard&show_faces=true&width=450&action=like&font=arial&colorscheme=light&height=80\" scrolling=\"no\" frameborder=\"0\" style=\"border:none; overflow:hidden; width:450px; height:80px;\" allowTransparency=\"true\"></iframe></p>\n","slug":"6243-film-review-essential-killing","category":"arts","date":1301684538000,"wpid":6243,"isSticky":false,"featured_image":{"width":1720,"height":998,"src":"2011/04/essential-killing.jpeg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAGAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAYH/8QAIBAAAgECBwEAAAAAAAAAAAAAAQIRAAUDBAYSEyJBIf/EABQBAQAAAAAAAAAAAAAAAAAAAAT/xAAXEQEBAQEAAAAAAAAAAAAAAAABAAIR/9oADAMBAAIRAxEAPwCRseqrvcdamxPmeDNq7lMdZfD3L4UJHUgEQCIP2tgVcwFHJiIXjttBifYpSgOQldW//9k="},"createdAt":1587294553049,"updatedAt":1588403557791,"author":"5e9b68b27a1236eccfeb1d24","old_image":"2011/04/essential-killing.jpeg","categories":["arts"]}