{"id":"5e9c314e9b6559241525dcf5","artists":["5e9b68ec7a1236eccfeb1fd1"],"title":"Interview: Ducktails","content":"<p><strong>Matthew Mondanile</strong>, a.</p><p>k.a. <strong>Ducktails</strong>, first came into the spotlight with his unique blend of drone drenched lo-fi synths, before moving on to his current pop creations in his sophomore album, ‘<strong>Ducktails III: Arcade Dynamics</strong>‘. His solo performance in Manchester was criminally undersold, however those who did make the trip were treated to a thoroughly engaging and entertaining evening, in which <strong>Mondanile </strong>mastered a fine balance between his abstract beginnings and more recent indie revelations. Synths and samples were crafted with bouncy guitar riffs and distorted vocals, producing an atmosphere smothered in a mysterious serenity. Prior to <strong>Ducktails</strong>‘ performance, <strong>Crack In The Road </strong>were lucky to catch up with <strong>Matthew Mondanile. </strong></p>\n<p><strong>CITR: </strong>Which one band or artist has influenced you the most and why?</p>\n<p><strong>Matthew: </strong>Hmm, good question! .. I don’t know exactly one ..</p>\n<p><strong>CITR:</strong> We can broaden it to two? ..</p>\n<p><strong>Matthew:</strong> No, I think if it’s got to be one I’d say <strong>Spencer Clark</strong>. He’s a member of this band called <strong>The Skaters</strong>, and he’s influenced me a lot. At first he influenced my thoughts of how I should tour, and then that developed on to how I thought about releasing music.</p>\n<p><strong>CITR:</strong> Which has been your worst gig of all time?</p>\n<p><strong>Matthew:</strong> Ha I’ve definitely had a few gigs like that! I’ve had some really terrible gigs in New York, though I can’t think of one specifically ..</p>\n<p><strong>CITR:</strong> What sort of things make a gig terrible for you?</p>\n<p><strong>Matthew: </strong>Mainly the sound, more than anything. Like if my equipment is fucking up and it sounds really shitty, and as a result I end up playing way too short or brief. In terms of the audience, there was one gig I played in Bristol with the band and a guy in the audience, who after the first song shouted, ‘this sounds like shit!’</p>\n<p><strong>CITR:</strong> Moving on to your releases, lets first look back all the way to <strong>Landscapes.</strong> What was that like as a process to record?</p>\n<p><strong>Matthew:</strong><strong> Landscapes</strong> was cool to record as the guy who runs the label I released it on made me send him music all the time, and he helped me choose which songs he liked and which songs he wanted to put on. So it was a collaborative effort in terms of which songs went on, but I recorded it alone with loads of different types of tape recorders, like handheld tape records or four tracks. The album as a whole felt more like a compilation of songs, whereas the newer record is trying to sound more together.</p>\n<p><strong>CITR:</strong> Your new record, <strong>Ducktails III: Arcade Dynamics</strong>, feels somewhat more clarified and structured. Would you agree with that assessment?</p>\n<p><strong>Matthew:</strong> Yeah I would agree, and it’s certainly more pop-y! I think it’s because I was on tour with<strong> Real Estate</strong> and we were playing with lots of indie bands that played pop songs, so I really feel like that influenced me. I’ve played with quite a few indie bands in America, however with <strong>Landscapes </strong>I was  playing a lot more experimental shows, mainly I was making a lot weirder music!</p>\n<p><strong>CITR: </strong>Would you say that <strong>Arcade Dynamics</strong> is a progression or a digression?</p>\n<p><strong>Matthew: </strong>I’d just say it was a different thing. It’s not really a progression as it’s the same way I’ve recorded everything else, but I did have someone mix it with me this time so maybe that made it a bit more clearer.</p>\n<p><strong>CITR: </strong>You’re playing a couple of dates in the UK and then coming back in May. What can we expect on your return?</p>\n<p><strong>Matthew: </strong>Well I’m coming back with a full band in May, after we’ve played Primavera. We’ll be performing with <strong>Julian Lynch</strong>, and we’re both sharing the same backing band. He’s a student of ethnomusicology in the UK, so he wanted us to play a lot of shows in the UK with him. We’re definitely doing quite a few gigs, including three cities in Scotland. I’m looking forward to Aberdeen, mainly as I’ve been there before due to the fact Julian studied there at the university for a year.</p>\n<p><strong>CITR: </strong>You’ve played in Europe and the UK before, so did you come on this tour with any level of expectation of how the audiences would react?</p>\n<p><strong>Matthew: </strong>No, not at all. When I play solo sometimes I feel a bit worried that people will be disappointed sometimes, maybe because they’ve seen me play in a band on YouTube or something?! However when I come back in May it’ll be the first time I’ll play as <strong>Ducktails</strong> with a backing band, so that’ll be interesting. There’s more pressure on when you solo, and it always tends to be more electronic as with a band I’ll be playing guitar and singing. It can also be a pain in the ass when performing solo, as you can’t rely on other band mates for equipment!</p>\n<p><strong>CITR: </strong>You’ve mentioned Primavera festival, would you say you’re a big fan of music festivals?</p>\n<p><strong>Matthew: </strong>Not really to be honest! I mean there aren’t that many festivals in America, so the first festival I ever went to was Primavera last year. It was my first time at a big music festival and it was really cool!  As a band they treat you really well, in terms of a good hotel room and food. Pitchfork festival in Chicago is another good one that I really enjoy, both of which I played at as <strong>Real Estate</strong>.</p>\n<p><strong>CITR:</strong> How did where you grow up in America influence your music?</p>\n<p><strong>Matthew: </strong>Well I grew up in a suburb of New Jersey called Ridgewood. It’s like a small town and there really isn’t much there! New York City is about 30 minutes away, so when I learnt how to drive I’d head into New York to see shows in Brooklyn or Manhattan. I think that definitely influenced me, because most bands came to New York to play, so I saw <strong>Sonic Youth</strong> when I was in High School, and other bands like <strong>Lightning Bolt </strong>and <strong>Black Dice</strong>. However in New Jersey my friends and I would all be in bands and play open mic nights in music halls, so it was quite an insular community. We’ve all grown up now and it’s really nice to still have that community feel as musicians and friends.</p>\n<p><strong>CITR: </strong>Do you have any particular favourite venues in New York?</p>\n<p><strong>Matthew: </strong>I’m not sure about New York, but in Manhattan it’d be a place called K Shop. In Brooklyn I’d have to say .. well, there’s lots of venues we play but they’re all kinda shitty!</p>\n<p><strong>CITR: </strong>Do the audiences differ at venues between venues in America and Europe?</p>\n<p><strong>Matthew:</strong> Well some British audiences are pretty quiet, but I’d say in London they’re pretty loud. In Sweden the audiences are pretty quiet, but in Denmark and Brussels they were all pretty loud! However it’s always different in every city across the world, so I don’t think anyone can point out definite differences.</p>\n<p><strong>CITR:</strong> How would you sum up Ducktails sound in three words?</p>\n<p><strong>Matthew:</strong> Cheesey, Confused, Crazy!</p>\n<p><strong><a href=\"https://www.myspace.com/ducktailss\" target=\"_blank\">Ducktails MySpace</a></strong></p>\n","slug":"6328-interview-ducktails","category":"interviews","date":1301965922000,"wpid":6328,"isSticky":false,"featured_image":null,"createdAt":1587294542371,"updatedAt":1588441789673,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2011/04/ducktails-188x188.jpg","categories":["interviews","music","reviews"]}