{"id":"5e9c314a9b6559241525dcee","title":"Artist Interview: Katie Rogers","content":"\n\t\t<style type=\"text/css\">\n\t\t\t#gallery-4 {\n\t\t\t\tmargin: auto;\n\t\t\t}\n\t\t\t#gallery-4 .gallery-item {\n\t\t\t\tfloat: left;\n\t\t\t\tmargin-top: 10px;\n\t\t\t\ttext-align: center;\n\t\t\t\twidth: 11%;\n\t\t\t}\n\t\t\t#gallery-4 img {\n\t\t\t\tborder: 2px solid #cfcfcf;\n\t\t\t}\n\t\t\t#gallery-4 .gallery-caption {\n\t\t\t\tmargin-left: 0;\n\t\t\t}\n\t\t\t/* see gallery_shortcode() in wp-includes/media.php */\n\t\t</style>\n\t\t<div id='gallery-4' class='gallery galleryid-6365 gallery-columns-9 gallery-size-thumbnail'><dl class='gallery-item'>\n\t\t\t<dt class='gallery-icon landscape'>\n\t\t\t\tMissing Attachment\n\t\t\t</dt></dl><dl class='gallery-item'>\n\t\t\t<dt class='gallery-icon landscape'>\n\t\t\t\tMissing Attachment\n\t\t\t</dt></dl><dl class='gallery-item'>\n\t\t\t<dt class='gallery-icon landscape'>\n\t\t\t\tMissing Attachment\n\t\t\t</dt></dl><dl class='gallery-item'>\n\t\t\t<dt class='gallery-icon landscape'>\n\t\t\t\tMissing Attachment\n\t\t\t</dt></dl><dl class='gallery-item'>\n\t\t\t<dt class='gallery-icon landscape'>\n\t\t\t\tMissing Attachment\n\t\t\t</dt></dl><dl class='gallery-item'>\n\t\t\t<dt class='gallery-icon portrait'>\n\t\t\t\tMissing Attachment\n\t\t\t</dt></dl><dl class='gallery-item'>\n\t\t\t<dt class='gallery-icon landscape'>\n\t\t\t\tMissing Attachment\n\t\t\t</dt></dl><dl class='gallery-item'>\n\t\t\t<dt class='gallery-icon landscape'>\n\t\t\t\tMissing Attachment\n\t\t\t</dt></dl><dl class='gallery-item'>\n\t\t\t<dt class='gallery-icon landscape'>\n\t\t\t\tMissing Attachment\n\t\t\t</dt></dl><br style=\"clear: both\" /><dl class='gallery-item'>\n\t\t\t<dt class='gallery-icon landscape'>\n\t\t\t\tMissing Attachment\n\t\t\t</dt></dl>\n\t\t\t<br style='clear: both' />\n\t\t</div>\n\n<p>For a photographer so young, <a href=\"https://katiejrogers.</p><p>wordpress.com\">Katie Rogers</a> is an artist with a surprisingly comprehensive portfolio of work. Currently studying at Leeds College of Art, her work work explores humanity and its relationship with landscapes in an incredibly mature and often humorous way. Her work has very recently come into its own, so it was never a better time for her to sit down with <strong>CITR</strong>.</p>\n<p><strong>CITR:</strong> What originally attracted you to photography?</p>\n<p><strong>Kate:</strong> I knew from quite a young age I wanted to become an artist of some kind but photography never really seemed like an option. I tried to create fine art but it always left me frustrated and I felt like I wasn’t really expressing myself. I began painting from photographs but at some point realized I preferred taking the images to recreating them afterwards. To me photography seemed much more related to the real world and a more clear way to communicate what I was feeling.</p>\n<p><strong>CITR:</strong> Your work see’s you traveling the globe. Do you travel specifically for your work?</p>\n<p><strong>Kate:</strong> Although I love traveling for its own sake, I always plan trips with photography in mind. I’ve been really lucky so far and travelled all over the world, which has only given me more ideas about where I can go next and what I can photograph. I find that I get bored in any one place for too long and like to discover new places, and taking pictures seems like the perfect way to explore.</p>\n<p><strong>CITR:</strong> I see you don’t shoot very much portraiture, why is this?</p>\n<p><strong>Kate:</strong> I have a huge appreciation for great portraits. Not shooting them myself isn’t something I’ve really thought about before. I do tend to ask if I see an interesting face but sometimes I’m too shy…at the minute I’m much more interested in candid shots. I also think a certain part of a person’s character can be taken away when they’re too aware of a camera. I like to catch people off guard, when they’re acting naturally or doing things they might not if they were having a portrait taken for a specific purpose.</p>\n<p><strong>CITR:</strong> If you could shoot one person or place, what would it be?</p>\n<p>Kate: A strange but honest answer would be that I’ve always wanted to photograph in a slaughterhouse. It’s something I’ve been trying to do for a while but never seems to work out – people don’t want to let you in. I guess the reason for photographing a place like that is to expose what people don’t usually see, but the irony is that I can’t get in to see it myself…</p>\n<p><strong>CITR:</strong> Your work looks at environments in interesting and quirky ways. What do you look for in an environment whilst shooting?</p>\n<p><strong>Kate:</strong> I always feel like whatever happens when I’m shooting is a nice accident. I tend to seek out places I think will be interesting for photographing, but like going with an open mind about what will happen or what I’ll end up taking pictures of. I think the most interesting images happen when you least expect them – most of the time I forget what I’ve actually shot until I develop the film.</p>\n<p><strong>CITR:</strong> Your work also seems to explore colour in environments and landscapes? Do you photoshop your analogue work at all?</p>\n<p><strong>Kate: </strong>I’m really interested in the power of a colour image; how colour can change the mood or the meaning of a photograph. I never used to use photoshop at all because I’m quite stubborn over using analogue over digital processes. Since starting my degree I’ve come around to the idea that even some analogue work needs photoshopping to keep up with contemporary photography…I usually edit the contrast and/or saturation of my colour images until I feel they reflect what I was seeing when I took the photograph, but as a general rule I try to take the best photograph I can in-camera and do as little editing as possible. If I had access to a colour darkroom I’d much prefer to do it that way!</p>\n<p><strong>CITR: </strong>What are your plans for 2011?</p>\n<p><strong>Kate:</strong> I’ll finish the first year of my degree in a couple of months and then I’m travelling to Iceland in August, somewhere I’ve wanted to go for a couple of years now and I’m stupidly excited for.</p>\n<p><strong>CITR:</strong> Thanks for your time!</p>\n","slug":"6365-artist-interview-katie-rogers","category":"arts","date":1302034783000,"wpid":6365,"isSticky":false,"featured_image":null,"createdAt":1587294538671,"updatedAt":1587825926626,"author":"5e9b68b27a1236eccfeb1d24","categories":["arts"]}