{"id":"5e9c31489b6559241525dceb","artists":["5e9b68ec7a1236eccfeb1fd3"],"title":"Interview: Dum Dum Girls","content":"<p><a rel=\"attachment wp-att-6395\" href=\"https://admin.</p><p>crackintheroad.com/music/6388-interview-dum-dum-girls/attachment/dum/\"><img class=\"aligncenter size-900wide wp-image-6395\" title=\"dum\" src=\"https://api.crackintheroad.com/uploads/2011/04/dum-900x675.jpg\" alt=\"\" width=\"900\" height=\"675\" /></a></p>\n<p><strong>Kirstin Gundred</strong>, a.k.a. <strong>Dee Dee</strong>, is the lead singer, and arguably the key stone, of the all female lo-fi garage punk band, <strong>Dum Dum Girls</strong>. Originating as a solo project, <strong>Dum Dum Girls </strong>has gone through various stages of evolution to reach their current state, which sees the band truly reach the potential sound <strong>Gundred </strong>believes it has. Prior to their show at Manchester’s <strong>Deaf Institute</strong>, <strong>Crack In The Road </strong>caught up with <strong>Dee Dee</strong> in a room of misshapen bunk beds.</p>\n<p><strong>CITR: </strong>There’s a cover of <strong>There Is a Light That Never Goes Out</strong> on your most recent record, does this mean you’re rather partial to the Manchester music scene?</p>\n<p><strong>Dee-Dee: </strong>I didn’t really get into it knowing I was getting into a city’s worth of music, rather it kind of just happened. I just love all of these Factory bands, and I love love love The Smiths.</p>\n<p><strong>CITR: </strong>What is about The Smiths in particular that makes you such a big fan?</p>\n<p><strong>Dee-Dee: </strong>Well I think Morrissey is a phenomenal lyricist, and Johnny Marr’s guitar playing is so memorable. I guess it’s just the whole package, especially as I feel I can identify myself in their songs, and that they have the ability become your own anthems.</p>\n<p><strong>CITR: </strong>There’s a huge amount of information on the internet about the band’s formation, however I’d be interested in knowing how you feel about how far the band has come since then?</p>\n<p><strong>Dee-Dee:</strong> It’s come really far! The EP, <strong>He Gets Me High</strong>, brought us from where we are on record, to where we are on stage. I’ve always felt that I will be captured in a very specific time in my life, that being my beginnings of writing songs and recording. To me, I look back on our first album fondly and I’m proud of it, but it’s not what we sound like live now. There’s no reason, in my opinion, to have a band if you’re just trying to replicate what you did as a solo recording project! So I’d written some newer songs and I wanted them to sound like what we sound like as a band. So that was the biggest step up, other than moving into a real studio with all the professional equipment.</p>\n<p><strong>CITR:</strong> So do you feel that your most recent releases can be seen as a progression? I remember reading in another interview you did that you said you thought you’d never stray away from your use of heavy reverb.</p>\n<p><strong>Dee-Dee:</strong> I’d definitely say it was a progression, and I’d agree that I don’t think I ever could move away from the reverb. Though you could argue that you can find those elements in all sorts of music. To me the EP is very ‘full’ sounding as there’s a lot going on, like lots of guitars and the vocals are mixed in a place higher than they used to be. There’s not a ton of space, aside from the ballad of course. I think with the next record, a lot of those same values will be in place, but it’ll definitely be more open. The record we have out in the fall will be a closer representation of the sound of the band as a whole, and we’re making sure that the sounds in each track aren’t competing and instead we’re defining when the guitars should be at the forefront, and when the vocals should be at the forefront. The vocal melodies and harmonies have always been the most important things to me.</p>\n<p><strong>CITR: </strong>How was your experience at SXSW this year?</p>\n<p><strong>Dee-Dee: </strong>Yeah it was really crazy! A little too much for me ..</p>\n<p><strong>CITR: </strong>You’re not doing your street cred any good here ..</p>\n<p><strong>Dee-Dee:</strong> Haha! Well last year was our first experience of the festival, and in fact it was one of our first ten shows as a band before we went on tour! This year it was the end of a month and a half tour, so we’d been on the road and were exhausted! It was really really great, and it culminated in our last show at 1 am, wasted in a tiny bar! Maybe that’s how we used to play shows, but not quite so much nowadays. It was just exhausting really, especially the heat!</p>\n<p>Playing outside in the day is not my style, and it’s extra tiring when you involve heat and sunlight. You play for 45 minutes in a cold dark bar and you feel one way, and then you play 45 minutes and 98 degrees in directly sunlight with dust! Don’t get me wrong, it’s a really great opportunity for bands and it’s really cool if you are able to see things. The most I saw was at the Subpop showcase we played, but I couldn’t get into The Strokes! So I cried a solo tear and went home to watch ‘Breathless’ and eat Indian food by myself!</p>\n<p><strong>CITR: </strong>You’ve played tours around Europe before, so would you say you’ve come back with any level of expectation for this time around?</p>\n<p><strong>Dee-Dee: </strong>Well I love playing Manchester, Glasgow and Paris. Those are three I’m looking forward to the most I’d say. I really wanted to play this room (Deaf Institute) as I’d heard really good things about it from friends and bands. The last time we were in Manchester we were supporting MGMT, and Jonny Marr was like ‘it’s the best venue!’, so I told my booking agent we had to play here! In terms of Glasgow, I just love Scotland from a tourist perspective, as well as a music perspective. We have a really great promoter there too who always takes us out for beers too, so it’s always a really perfect evening.</p>\n<p><strong>CITR: </strong> Are you a fan of festivals?</p>\n<p><strong>Dee-Dee:</strong> No, not really! I like to be in control of the environment, so I like to curate shows when from start to finish I endorse the bands, and I like there to be a DJ playing great music that makes sense. I like more organized events with sound checks, so festivals freak me out! You’re playing outside in the day, and you have 15 minutes to set up, though we’ve done it a lot and it can be fun, to me it’s just not ideal. I know you have to put the legwork in for better festival opportunities, so we’ll see what happens.</p>\n<p><strong>CITR: </strong>You strike me as an artist/person who’d love the organized delight of All Tomorrow’s Parties ..</p>\n<p><strong>Dee-Dee: </strong>That’d be dreamy, though we’re yet to get the invite! That definitely appeals to me, as I’m not the type that would normally go to a festival. I mean I’ve gone to Coachella once, and it was for a very specific reason. I’m not really the type of person who would go ‘ah well there’s about 20 bands I kinda like’ and just end up meandering around. No doubt I’d end up just wanting a coffee and looking for shade! Not in a high maintenance way, but everyone enjoys music differently. For me I’m much more into the personalized experience, as my favourite festival experiences have been accidently walking into <strong>Bobby Gillespie</strong> at 1234 Shortage backstage, so I felt that it was totally worth playing and that I didn’t care that I messed up, and that my sunglasses fell off my face because I was so sweaty. Festivals are cool and they serve a really good purpose for a lot of people, but I like playing at nightclubs and theatres. Theatres are my particular favourites, like little small theatres full of old wooden carvings!</p>\n<p>This last tour we’ve just finished in the USA ranged from big theatres like the Bowery in New York, which was amazing, to some infamous Punk Club in North Carolina where Danzig had tagged on the wall, and it was dirty as fuck but was still amazing. I just like there to be a closer connection with an audience in a smaller room. Although the best show of our career was Primavera last year! It was unbelievable as it was our first festival ever, and we played at Midnight on the Pitchfork stage to 8 thousand people, and we nailed it. It was the last show of the tour and it had been a traumatic tour to an extent, with a lot of driving, however something clicked that night. We played after the Slits and before Lee Perry, and we capped off the night seeing Pet Shop Boys. It was the dreamiest night ever.</p>\n<p><strong>CITR:</strong> What was your worst experience of a gig?</p>\n<p><strong>Dee-Dee: </strong>Well I’ll tell you one with a silver lining. The tour that we did that was predominately these small festivals was pretty traumatic, because we had a lot of sound issues. The first festival was in Norway, and I’m part Norwegian and I’d never been, so I was really excited! So we get there and it’s been raining, and we set up on stage and there’s no sound check. We used to sing through reverb pedals, and on this occasion they all fried across the stage at the same moment! So all of a sudden we had no vocal effects, and we were pretty reliant on reverb, especially back then, and we then discovered our Sound Guy wasn’t actually a Sound Guy as he had no idea how to problem solve! Anyway, he’s faced with this problem of trying to create this very specific reverb sound, and it was just a nightmare. It was terrifying and I cut the set from 12 to 7 songs, and I just thought it was awful. However who do I see, first song, fucking Stewart Murdoch! I couldn’t believe it, and I was so freaked out that it didn’t sound like what I wanted it to sound. It’s so frustrating when you know you can do what you do, but it still isn’t what you want it to be. So we’re off stage and loading up, trying to forget about the horrors of the set, and he comes up to us and introduces himself! He tells us it was amazing and reminded him of the Shop Assistants! He even gave me his business card, and said we could open for him when we wanted. We were all just like, Oh my God! I still have his card in my wallet and it’s so cute, it says drinking tea, digging trees, making records, and that’s his ‘business!’</p>\n<p><strong>CITR: </strong>Many thanks for your time <strong>Dee-Dee </strong>and enjoy your show!</p>\n<p><strong><a href=\"https://www.myspace.com/dumdumgirls\" target=\"_blank\">Dum Dum Girls MySpace</a></strong></p>\n","slug":"6388-interview-dum-dum-girls","category":"interviews","date":1302049722000,"wpid":6388,"isSticky":false,"featured_image":{"width":188,"height":188,"src":"2011/04/dum-188x188.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAABwX/xAAkEAACAQIFBAMAAAAAAAAAAAABAgMEEQAFBxIiBiExQRMVYf/EABUBAQEAAAAAAAAAAAAAAAAAAAIF/8QAGREAAgMBAAAAAAAAAAAAAAAAAQMAAhFB/9oADAMBAAIRAxEAPwBAyvUyOfpmvzGpjpKWojgaohpJNwlKtcxcb8rqrEkEePXsOrdV8/krJ3bOWiLSMTHHJxTv4HDwMT9XJpftJ1+R9q7VUbjYAIlgPzBuwG49sBSq2GkSm2gWdHZ//9k="},"createdAt":1587294536204,"updatedAt":1588443779064,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2011/04/dum-188x188.jpg","categories":["interviews","music","reviews"]}