{"id":"5e9c31469b6559241525dcea","artists":["5e9b69577a1236eccfeb264f"],"title":"Interview and Review: The Wombats","content":"<p><a rel=\"attachment wp-att-6403\" href=\"https://admin.</p><p>crackintheroad.com/music/6402-interview-and-review-the-wombats/attachment/the_wombats\"><img class=\"alignnone size-900wide wp-image-6403\" title=\"The_Wombats\" src=\"https://api.crackintheroad.com/uploads/2011/04/The_Wombats-900x506.jpg\" alt=\"\" width=\"900\" height=\"506\" /></a></p>\n<p>Years after seeing them the first time around in Aberdeen in 2008 <strong>The Wombats </strong>came to Dundee in March of this year and I knew I had to meet the guys that inspired me to write about music such a long time ago. The gig itself was obviously not to everybody’s taste, but for the people who appreciate the band and the music they play it was a superb performance. They were as energetic as ever and managed to play new songs such as <em>Anti-D and Jump into the Fog </em>with as much precision as their, now, classic songs <em>Moving to New York </em>and <em>Let’s Dance to Joy Division </em>which for a fan was very pleasing. Any sign of their long break between albums was not on show as they played a large number of songs from their new album <em>This Modern Glitch </em>which is due for release later this month. These new songs, in my opinion, are a vast change from their early songs and even from the likes of <em>My Circuitboard City </em>which is most certainly a positive thing after considerable failures from other bands of a similar ilk releasing new albums that are repetitive and lacking in imagination. <em>Anti-D </em>was performed in such an emotive way, with the crowd being taken on a journey through the pitfalls of prescription drugs and it was this song that was the highlight of the night and a cracking single as well. CitR were lucky enough to chat at considerable length to the guys before their gig and this is a section of the interview that was conducted:</p>\n<p> CitR: Which bands or artists would you say influenced you the most when you were younger?</p>\n<p><strong>Tord: A lot of things really; bands like Kraftwerk to No FX and a lot of Skate punk and alternative bands like that.</strong></p>\n<p><strong>Dan: I liked the same sort of stuff really, but also bands like System of a Down, Metallica and Blink 182.</strong></p>\n<p>CitR: If you were not involved in the music industry, what do you think you would be doing?</p>\n<p><strong>Dan: I would probably be teaching music in a French school</strong></p>\n<p><strong>Tord: I really love working with people so I would probably be working in a home for disabled people like I used to do.</strong></p>\n<p>CitR: What is the best show or festival you have ever played at?</p>\n<p><strong>There is no particular show that I would say stands above the rest but festivals such as Glastonbury and other European Festivals are always fantastic to play at. We also played on a Berlin rooftop a few weeks ago, it was freezing cold but it was an amazing experience!</strong></p>\n<p>CitR: What would you say to any bands or artists that want to get the same success as you achieved?</p>\n<p><strong>You have to enjoy what you have and don’t plan ahead, focus on what is important and that is playing music. Do little gigs in front of a couple of people and enjoy it for what it is.</strong></p>\n<p>CitR: Can you go into detail about how you achieved the Bleeding Love cover you recorded a couple of years ago?</p>\n<p><strong>Dan: It was me and Murph who did the song together as Tord was back in Norway on holiday and we were in Paris seeing some friend and just drank 3 bottles of French wine between us and just went for it.</strong></p>\n<p>CitR: What was the best band you have supported and been supported by?</p>\n<p><strong>Well we played just before Radiohead came on at a festival so that could mean we supported them I suppose, and that was unbelievable! The best band who have supported us were probably goFASTER>> </strong>(a band we chatted to earlier in the day about) <strong>or Team Me who are on tour with us this time around.</strong></p>\n<p>CitR: What was your most embarrassing moment on stage?</p>\n<p><strong>We did a DJ set in Harrowgate a while ago in a school and we hadn’t slept in ages and when we turned up there were people at the front as if it was a gig or something which was really odd. The CDs didn’t work so I just got really embarrassed and hid underneath the DJ booth.</strong></p>\n<p>CitR: If you could have any superpower what would it be?</p>\n<p><strong>Dan: Invisibility</strong></p>\n<p><strong>Tord: To Fly</strong></p>\n<p>CitR: What are your favourite drinks?</p>\n<p><strong>Tord: Fresh juice from a juice extractor or a Mojito if it was an alcoholic choice</strong></p>\n<p><strong>Dan: Guava juice and alcoholic drink would be Guinness.</strong></p>\n<p> The Wombats official site <a href=\"www.thewombats.co.uk\">here</a></p>\n<p>The Wombats Myspace <a href=\"www.myspace.com/thewombatsuk\">here</a></p>\n<p>The Wombats Facebook <a href=\"https://www.facebook.com/?ref=home#!/thewombatsuk\">here</a></p>\n","slug":"6402-interview-and-review-the-wombats","category":"interviews","date":1302124120000,"wpid":6402,"isSticky":false,"featured_image":null,"createdAt":1587294534664,"updatedAt":1588441789648,"author":"5e9b68b27a1236eccfeb1d07","old_image":"generated/3af4e33f9deb107f9b2768ddd43def679ce74813.jpg","categories":["interviews","music","reviews"]}