{"id":"5e9c34409b6559241525e1cd","title":"Review: Flying Lotus- Cosmogramma","content":"<p><a href=\"https://admin.</p><p>crackintheroad.com/uploads/2010/05/Cosmogramma-650.jpg\"><img class=\"alignnone size-full wp-image-669\" src=\"https://api.crackintheroad.com/wp-content/uploads/2010/05/Cosmogramma-650.jpg\" alt=\"\" width=\"650\" height=\"650\" srcset=\"https://api.crackintheroad.com/images/2010/05/Cosmogramma-650.jpg 650w, https://api.crackintheroad.com/images/2010/05/Cosmogramma-650-150x150.jpg 150w, https://api.crackintheroad.com/images/2010/05/Cosmogramma-650-300x300.jpg 300w, https://api.crackintheroad.com/images/2010/05/Cosmogramma-650-494x494.jpg 494w, https://api.crackintheroad.com/images/2010/05/Cosmogramma-650-165x165.jpg 165w\" sizes=\"(max-width: 650px) 100vw, 650px\" /></a>Since releasing the tremendous<em> Los Angeles</em> LP in 2007, <strong>Flying Lotus</strong> has helped the founding of<strong> Brainfeeder</strong> records, led a huge serge in popularity for LA based electronic beat music and has gained an almost god like status amongst many experimental music fans. So, when news broke that he would release his new album, it was almost expected that the record would be a masterpiece.</p>\n<p>Described by <strong>Flying Lotu</strong>s as his ‘Star Wars’, <em>Cosmogramma</em> is a real epic, in which the music flows from one jam to another through a sea of delightful melodies and other worldly sounds, as something designed to be listened to all at once. The album features an enviable cast of extras including the hugely gifted <strong>Thundercat</strong> (bass guitar), <strong>Rebekah Raff </strong>(harp), <strong>Ravi Coltrane </strong>(tenor sax), <strong>Thom Yorke </strong>and<strong> Laura Darlington </strong>to name a few. So naturally, the album incorporates a huge variety of genre’s and sounds, making it very dense and hectic at times, which can be slightly overwhelming. However it is all so beautifully layered and is a sum of many incredible parts, that after a few listens you will start to hear something new every time, making it potentially very addictive.</p>\n<p>The album kicks off aggressively with <em>Clock Catcher</em>, <em>Pickled!</em> and <em>Nose Art</em>, three tracks including a lot of hard synthesis and some improvised bass guitar, over glitchy electronic beats and noises. Soon it lulls into a nostalgic wave of classical strings and harp, before the introduction of the wondrous <em>Zodiac Shit</em>, a stomach churning arrangement of strings, hums, wobbles and snappy percussion.</p>\n<p>As <strong>Cosmogramma </strong>reaches it’s half way point, the upbeat, synth led <em>Computer Face//Pure Being</em> is followed by possibly the most hyped track on the album, <em>..And The World Laughs With You</em> a somewhat chilled track boasting some delightfully vague and droney vocals from<strong> Radioheads </strong><strong>Thom Yorke</strong>.</p>\n<p>The second half of <strong>Cosmogramma</strong> is where it really sets itself apart as a masterpiece. In <em>Arkestery</em>, <em>German Haircut</em> and <em>Recoiled</em>, with the help from Steve Ellisson’s cousin<strong> Ravi Coltrane</strong> on tenor saxophone, elements of free jazz are infused with electronic noises and soundscapes to stunning effect. In between those tracks is the fabulous dance track <em>Do The Astral Plane</em>, which creatively uses improvised vocals to create melody and rhythm. Other tracks, <em>Table Tennis (featuring <strong>Laura Darlington</strong>)</em> and <em>Dance of the Pseudo Nymph</em> also stand out, through their originality and delicate arrangement. Finally, this trippy epic comes to an end with <em>Galaxy In Janaki</em>, a reflective track which finishes the album in a very satisfactory and optimistic manor.</p>\n<p>In <em>Cosmogramma</em>, <strong>Flying Lotus</strong>, has made a big step-up from his previous album<em> Los Angeles</em>, to produce a magnificently dense, atmospheric and original cosmic masterpiece that justifies all the hype and expectation. Though it won’t please everyone<em>, Cosmogramma</em> is <strong>Flying Lotus’ </strong>career defining record so far, and is well worth a listen.</p>\n<p style=\"text-align: center;\"><a href=\"https://bleep.com/index.php?page=release_details&releaseid=23694\">Buy (Bleep)</a></p>\n<p style=\"text-align: center;\"><a href=\"https://www.brainfeedersite.com/\">Brainfeeder</a></p>\n<p style=\"text-align: center;\"><a href=\"https://www.myspace.com/flyinglotus\">Myspace</a></p>\n","slug":"642-flying-lotus-cosmogramma-review-2","category":"music","date":1273150922000,"wpid":642,"isSticky":false,"featured_image":{"width":650,"height":650,"src":"2010/05/cosmogramma-650.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFwAAAwEAAAAAAAAAAAAAAAAAAAIEBf/EACQQAAIBAgMJAAAAAAAAAAAAAAEDAgARBBMhEiMxMlFhcaHw/8QAFQEBAQAAAAAAAAAAAAAAAAAAAgP/xAAXEQADAQAAAAAAAAAAAAAAAAAAAQIR/9oADAMBAAIRAxEAPwBsQuL0YrMbPDPRYqUSN70BsL2PqtRaHZceA0GnwoiuEWyEYRA2zoB2qyHJHxUKSwUn/9k="},"createdAt":1587295296863,"updatedAt":1588403568186,"author":"5e9b68b27a1236eccfeb1d18","old_image":"2010/05/cosmogramma-650.jpg","categories":["music","reviews"]}