{"id":"5e9c313d9b6559241525dcda","title":"Feature: Why I Don’t Care About Rick Martin","content":"<p><a rel=\"attachment wp-att-6467\" href=\"https://admin.</p><p>crackintheroad.com/music/6465-feature-why-i-dont-care-about-rick-martin/attachment/oak-park-april-6-2009cory-campbell-of-denver-browses-through-vinyl-at-vals-halla-records-on-harrison-st-the-40-year-old-oak-park-establishment-will-be-participating-in-record-store-day-april\"><img class=\"alignnone size-900wide wp-image-6467\" title=\"RSD\" src=\"https://api.crackintheroad.com/uploads/2011/04/dw-recordstore-041609-p3-900x589.jpg\" alt=\"\" width=\"900\" height=\"589\" /></a>With Record Store Day approaching, it’s inevitably going to stoke the flames of the already heated debate surrounding the murky future of physical releases in the music industry. After reading a horrendously written, poorly researched <a href=\"https://www.nme.com/blog/index.php?blog=146&title=why_i_don_t_care_about_record_store_day&more=1&c=1&tb=1&pb=1&fb_comment_id=fbc_10150256219723222_17209506_10150256998948222#f1f2d67f6\">article</a> courtesy of Rick Martin at NME, I took it upon myself to conjure up a rebuttal. Whilst there’s no denying the declining sales that physical records are experiencing; in no way does this automatically make CDs, vinyls and tapes obsolete, and to suggest so is to completely alienate and disrespect a sizeable and intensely passionate sector of the music buying public.</p>\n<p>In a modern, progressively digital age, Rick Martin’s comments shocked me; if not purely for the reason that they came from a business that is primarily based in print, and whose digital output leaves much to be desired. Was it not NME who only a couple of years ago took upon a huge campaign promoting the sales of vinyl, through a 7″ single giveaway courtesy of The White Stripes? Whilst there is the occasional mp3 made available to download through the NME website, they are mainly collated from various other, more accessible, more reliable websites, who deservedly pride themselves on the quality of their writing, design and functionality, three aspects that NME seemingly cares little for. If the future is indeed a purely digital one, NME are rapidly falling behind and showing few signs of adopting a different approach.</p>\n<p>Anyway, as with this site itself, I should hope people read each article as the personal thoughts of the writers, and not the view of the publication as a whole, so I’ll retrace my steps to the article at hand. Only two sentences into the piece and Martin has already deviated almost entirely from his chosen title, disregarding the importance of Record Store Day within a dozen or so words. With little intelligent input on Record Store Day itself, he instead chooses to use the article as a platform to voice his own, misinformed views on the record industry as a whole. For me, the day will be a success regardless of sales or financial gain; merely for the sense of joy and excitement felt by some as they purchase a exclusive, elegantly illustrated vinyl record from their favourite artist.</p>\n<p>Only last week I found myself wading through years of memories whilst cleaning my room; a painstaking and mundane task at best. Chancing upon the first CD I ever bought (Aqua – Aquarium if you were wondering) brought about an unprecedented sense of nostalgia, a feeling I wouldn’t have experienced had I stumbled upon the digitised folder whilst sorting through my laptop. Several hours and numerous memorable pop hits later, I tore myself away from Now 42 and got on with what I had originally intended to do, in a far more upbeat manor than previously.</p>\n<p>I entirely understand, as I’m sure that many others do, that owning a CD or vinyl single does not elevate you to the position of copyright holder or even the greatly sought after emotional holder of said music. However, since the age of 15 I have made it a goal of mine to own the majority of my favourite tracks in a physical form, as the artists intended them to be. Holding the limited edition 7″ Band of Horses vinyl for their epic track The Funeral brings about a wave of euphoria that I am yet to succumb to whilst scrolling blankly through my iTunes library. An intriguing and engaging artwork is always going to be so, whether displayed upon an LCD screen or printed upon cardboard, but that doesn’t change the fact it’s far more wholesome and enjoyable to physically open your new purchase, insert it into your CD/vinyl player for the first time and truly experience the intangible beauties of music.</p>\n<p>Now the one point I do agree with that Martin makes amongst his nonsensical ramblings, is the importance that is making a physical release both original and desirable, in it’s presentation, delivery and contents. We’ve seen Radiohead trial a ‘newspaper’ album recently, as well as the resurgence of cassette tapes, as shown with Of Montreal’s most recent release. Two bold moves, of what is hopefully part of a new level of creative thinking amongst the methods of realising music, to incorporate a way that will offer more personal satisfaction than simply clicking ‘purchase’ on the iTunes store.</p>\n<p>Thinking ahead to the not so distant future, one of the appeals of bringing up children is the thought of introducing and educating them in new creative forms that helped to define and shape the person I am. I don’t envision myself simply handing over a minuscule sized hard-drive and instructing them to drag and drop several hundred files onto their own portable device. I want to be able to sit down, and hand my child each individual record, retelling my own personal stories of discovery and enjoyment, in the hope that they to may share in the history of the artefact. Sounds awfully self-indulgent and idealistic when I describe it like that, however I remember being in a similar situation with my parents and learning about their lives, as well as unearthing countless musical gems, a treasured and invaluable experience we wouldn’t have shared had they simply loaded up Spotify and left me to my own devices.</p>\n<p>Having belief in the future of music and the important role that the internet will play in the path music promotion and discovery takes, is entirely different to claiming the ‘old-fashioned’ methods of distributing music as redundant. Claiming that music is purely about the actual creation itself, and only that, would be like saying football is solely about the events that occur between three and five o’clock on a Saturday afternoon. There’s no questioning the importance, however we shouldn’t limit ourselves to one, narrow minded way of thinking.</p>\n<p>Labelling local independent record store owners as ‘socially-inadequate, sniffy twerps’ is an arrogant and ignorant conclusion to come to. Whilst I have met some who are overly passionate about music as an art form, almost to the point of repulsion, I prefer this than to be treated sullenly by a surly teenager in HMV, incapable of telling the difference between Bruno Mars and The Mars Volta. Demolishing the concept of releasing singles in physical formats, is for me, another step towards music merely becoming a background noise, fading into obscurity amongst the continuous drone that soundtracks everyday life, but that is a subject for another day.</p>\n<p>It’s a depressing scenario when music is being enjoyed as such a diluted art form, that it’s almost unrecognisable, and I for one will do everything in my powers to prevent this. Current financial situations don’t lend themselves to extravagant vinyl spending sprees, however, if you have a couple of quid spare, then why not support both your local record store and your favourite musicians and maybe you’ll discover some self-fulfilment amongst it. So for now, I’ll let Rick Martin keep his iTunes library stocked up with the latest tracks from The View, I’m quite content with my vinyls and CDs, even if I am ‘livin da vida loca’.</p>\n<p><iframe src=\"https://www.facebook.com/plugins/like.php?href=http%3A%2F%2Fwww.facebook.com%2Fcrackintheroad&layout=standard&show_faces=true&width=450&action=like&font=arial&colorscheme=light&height=80\" scrolling=\"no\" frameborder=\"0\" style=\"border:none; overflow:hidden; width:450px; height:80px;\" allowTransparency=\"true\"></iframe></p>\n","slug":"6465-feature-why-i-dont-care-about-rick-martin","category":"editorials","date":1302373117000,"wpid":6465,"isSticky":false,"featured_image":{"width":292,"height":50,"src":"2011/04/dw-recordstore-041609-p3-292x50.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAACAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAQF/8QAIRAAAgEEAAcAAAAAAAAAAAAAAQIEAAMFEQYSMUNRYXH/xAAUAQEAAAAAAAAAAAAAAAAAAAAE/8QAGBEAAgMAAAAAAAAAAAAAAAAAAAECMTL/2gAMAwEAAhEDEQA/ALOKo9kYlUFm2EaMVZeUaI10PqsqHi8eYlgmDFJKL2V8fKUoM9MU6R//2Q=="},"createdAt":1587294525975,"updatedAt":1588443778943,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/04/dw-recordstore-041609-p3-292x50.jpg","categories":["editorials","life","music","opinion"]}