{"id":"5e9c31399b6559241525dcd1","artists":["5e9b69577a1236eccfeb266a"],"title":"Review: Timber Timbre – Creep On Creepin’ On","content":"<p><a rel=\"attachment wp-att-6502\" href=\"https://admin.</p><p>crackintheroad.com/music/6494-review-timber-timbre-creep-on-creepin-on/attachment/timber\"><img class=\"aligncenter size-full wp-image-6502\" title=\"timber\" src=\"https://api.crackintheroad.com/uploads/2011/04/timber.jpg\" alt=\"\" width=\"900\" height=\"602\" srcset=\"https://api.crackintheroad.com/images/2011/04/timber.jpg 900w, https://api.crackintheroad.com/images/2011/04/timber-260x173.jpg 260w, https://api.crackintheroad.com/images/2011/04/timber-640x428.jpg 640w, https://api.crackintheroad.com/images/2011/04/timber-165x110.jpg 165w\" sizes=\"(max-width: 900px) 100vw, 900px\" /></a></p>\n<p><strong>Timber Timbre’s</strong> Latest LP <em>Creep On Creepin’ On</em> is a record that wears its depravity for the world to see. Its not so much concerned with what caused the sadness, more how to deal with it. At times the album achieves this, at the very least the songs are convincing depictions of psychotic desires, but ultimately the album doesn’t work as a succinct body of work.</p>\n<p>That’s not to say there’s nothing here to love. The LP opens promisingly with <em>Bad Ritual</em>, a tune heavily influenced my 50’s balladry and doo-wop, and it’s almost difficult to listen to at times. “<em>It’s a bad, bad ritual. But it calms we down”</em> insists <strong>Taylor Kirk</strong>, concerning unhealthy obsessions with thinking of an ex-love with another man, all over ghostly dissonant piano notes and a deathly slow beat. In fact the juggling of sounds is perhaps the albums greatest strengths. The shrill and stark strings and brass throughout give the LP a hollow sense of desolation.</p>\n<p>The dark, folk influenced blues continues with ‘<em>Creep On Creepin In</em>’, but it’s perhaps one of the less successful songs on the album. It’s not awful, just not pungent in what it sets out to do. There are other highlights however, <em>Too Old To Die Young</em> has a wonderful shift in tone that almost hints at a grim sense of pleasure the band have for our obsessed character. It’s a rare example of a more mature attitude to the idea of multiple tones, something the LP lacks as a whole, it often has lots to say but sometimes only one way of saying it.</p>\n<p>Regardless, as a concept or story, <em>Creep On Creepin’ On</em> does at least tell a tale. The instrumental interludes that scatter the LP do an adequate job of splitting up the narrative, but often seems to be creating atmosphere for an album that lacks the substance to deal with the burden.</p>\n","slug":"6494-review-timber-timbre-creep-on-creepin-on","category":"music","date":1302642313000,"wpid":6494,"isSticky":false,"featured_image":{"width":292,"height":50,"src":"2011/04/timber-292x50.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAACAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAAAAX/xAAfEAAABgEFAAAAAAAAAAAAAAAAAQIDBBESBRMiMUH/xAAUAQEAAAAAAAAAAAAAAAAAAAAA/8QAFBEBAAAAAAAAAAAAAAAAAAAAAP/aAAwDAQACEQMRAD8AnQZ0t97UCflPukk045uGqru6sTXFq3Fcldn6AAP/2Q=="},"createdAt":1587294521463,"updatedAt":1588443778865,"author":"5e9b68b27a1236eccfeb1d24","old_image":"2011/04/timber-292x50.jpg","categories":["music","reviews"]}