{"id":"5e9c31339b6559241525dcc6","artists":["5e9b69377a1236eccfeb248c"],"title":"Feature: Record Store Day – Recommendations","content":"<p><a rel=\"attachment wp-att-6550\" href=\"https://admin.</p><p>crackintheroad.com/music/6548-feature-record-store-day-recommendations/attachment/recordstoreday_2011_logo-e1298411485857\"><img class=\"alignnone size-medium wp-image-6550\" src=\"https://api.crackintheroad.com/uploads/2011/04/RecordStoreDay_2011_logo-e1298411485857-288x201.jpg\" alt=\"\" width=\"288\" height=\"201\" /></a></p>\n<p><strong>Record Store Day</strong> is fast approaching. From the sublime, one-time-only limited edition classics to the somewhat more questionable releases, April 16th  is your chance to head down to a local record store, give them all your money, and walk away with some truly great music. To ease the pain of choosing from the endless list of releases, we’ve compiled a guide of the top ten must-buy records coming out on Saturday.</p>\n<p><span style=\"text-decoration: underline\"><strong>Daft Punk – Tron Legacy Soundtrack</strong></span></p>\n<p>Alright, love it or hate it, it’s still <strong>Daft Punk</strong>. What’s more is that this not only comes with an exclusive track, it’s also potentially the coolest vinyl you’ll ever see – translucent, blue, and very, very awesome.</p>\n<p><span style=\"text-decoration: underline\"><strong>Deerhoof – Friend Opportunity</strong></span></p>\n<p>The experimental rock band re-releases its fantastic 2007 album with only 1000 copies. You might be lucky to get it, but be proud if you do – it’s a genuine classic.</p>\n<p><span style=\"text-decoration: underline\"><strong>Fleet Foxes – Helplessness Blues/Grown Ocean</strong></span></p>\n<p>A nice little two-track preview of the upcoming album from, arguably, the best folk band in the world – if anything, buy it for the cover art.</p>\n<p><span style=\"text-decoration: underline\"><strong>Gorillaz – The Fall</strong></span></p>\n<p>This iPad-created album, released initially for free last Christmas, isn’t for everyone – it’s certainly very different to the <strong>Gorillaz</strong> you probably know – but it’s bound to be one of the more popular RSD releases, and certainly worth checking out.</p>\n<p><span style=\"text-decoration: underline\"><strong>Jimi Hendrix – Fire/Touch You</strong></span></p>\n<p>An alternative version of one of Hendrix’s best ever songs, and a previously unreleased studio recording. How can you possibly not want this?</p>\n<p><span style=\"text-decoration: underline\"><strong>Mumford & Sons/Laura Marling – Dharohar Project</strong></span></p>\n<p>Post-breakup awkwardness between Mumford and Marling aside, it’s nice to see them both do something different – namely, collaborating with Indian folk musicians.</p>\n<p><span style=\"text-decoration: underline\"><strong>My Chemical Romance – Na Na Na (Na Na Na Na Na Na Na Na Na) </strong></span></p>\n<p>Hah. Just kidding.</p>\n<p><span style=\"text-decoration: underline\"><strong>Nirvana – Hormoaning</strong></span></p>\n<p>Yeah, <strong>Foo Fighters </strong>do have a release out for RSD, but if you’re looking for classic 90s grunge, this is where to go.</p>\n<p><span style=\"text-decoration: underline\"><strong>Panda Bear – Tomboy</strong></span></p>\n<p>As good as any <strong>AnCo</strong> album, Noah Lennox’s latest solo album is a thing of true beauty. Definitely worth a buy.</p>\n<p><span style=\"text-decoration: underline\"><strong>The Flaming Lips – Heady Nuggs</strong></span></p>\n<p>Possibly the most mind-blowingly brilliant thing you could buy on Saturday. Five albums in one, including <strong>Yoshimi Battles the Pink Robots </strong>and <strong>The Soft Bulletin </strong>– if you’ve never heard these albums before, this is your chance. Your exclusive, £100 chance. Sorry. Maybe your local record store will give it to you for a tenner.</p>\n<p><span style=\"text-decoration: underline\"><strong>The Naked and Famous – This Machine/No Light</strong></span></p>\n<p>A double EP from the up-and-coming New Zealand rock band. However, though this is a nice RSD exclusive, if you’re really wanting to get some South Pacific action, try to find their debut album, <strong>Passive Me, Agressive You</strong>. Not only is it a fantastic record, but it’s also one of the most beautiful-looking vinyls you’ll ever see.</p>\n","slug":"6548-feature-record-store-day-recommendations","category":"music","date":1302807406000,"wpid":6548,"isSticky":false,"featured_image":null,"createdAt":1587294515717,"updatedAt":1588441789569,"author":"5e9b68b27a1236eccfeb1d16","old_image":"2011/04/recordstoreday_2011_logo-e1298411485857-188x188.jpg","categories":["music"]}