{"id":"5e9c34429b6559241525e1d0","title":"Interview: Nedry","content":"<p style=\"text-align: center;\">With the release of their debut album ‘Condors’, many have claimed <strong>Nedry</strong> are set to become the first mainstream dubstep indie band.</p><p> While this is somewhat validated by their infusion of warbling dubstep beats and recognisable indie guitar riffs, this is by no means the limit of their sound. Lead singer Ayu’s vocals are reminiscent of those of <strong>Joanna Newsom</strong>, as they gracefully glide transcendentally through the beating trip hop heart of each song. With such a delicate yet powerfully eclectic sound, <strong>Nedry</strong> are very much a band to watch for the future.<strong> </strong>Currently on tour with <strong>65daysofstatic</strong>, Matt kindly took the time out to reveal more about the band.</p>\n<p style=\"text-align: center;\"><em>CITR:</em> If you had to cite one band/artist as a major influence upon you, who would it be?</p>\n<p style=\"text-align: center;\"><strong>Radiohead.</strong></p>\n<p style=\"text-align: center;\"><em>CITR:</em> What has been your favourite gigging experience to date?</p>\n<p style=\"text-align: center;\"><strong>Headlining at The Lexington in London on Thursday was pretty special. Sold out a large gig indeed and everyone seemed to give a damn which was very cool.</strong></p>\n<p style=\"text-align: center;\"><em>CITR:</em> You’re currently on tour at the moment supporting 65daysofstatic, only days after finishing your own UK tour. How’s it all going?</p>\n<p style=\"text-align: center;\"><strong>Apart from the lack of internet and the endless waiting around, it’s really good. We’re playing our second show with 65dos (sic) and Loops Haunt tonight in Glasgow and the venue looks spectacular. I cant wait.</strong></p>\n<p style=\"text-align: center;\"><em>CITR: </em>Where did the inspiration for the band name ‘Nedry’ come from?</p>\n<p style=\"text-align: center;\"><strong>Basically came from Jurassic Park and the legend that is Dennis Nedry, the fat dastardly individual that is ultimately to blame for the downfall of the park. He’s awesome… a big fat loser!</strong></p>\n<p style=\"text-align: center;\"><em>CITR: </em>Your sound has been said to be ‘indie-dubstep’ and to incorporate elements of ‘trip-hop’. What inspired you to create this fusion of sound?</p>\n<p style=\"text-align: center;\"><strong>Its a blend of all of our influences in music. We are trying to express a selection of sounds that reflect our personal enjoyment of all kinds of music. Guess we just go with what we feel and what we enjoy and it comes out a bit of a mish mash but we like it and hope others do too.</strong></p>\n<p style=\"text-align: center;\"><em>CITR: </em>It has been reported that you’re ‘self-contained’, insofar as having full control over your creative and producing process. How important do you feel this is to the creation of your sound?</p>\n<p style=\"text-align: center;\"><strong>Think we’re only self contained in that we dont really have that much outside influence in the initial stages of making tunes but in fairness we do care a lot about what our friends have to say about our works in progress. Its just nice not to have people telling us how to make our music for ‘viable’ or something that I would expect might happen if we had involvement with management or a stricter label than the lovely Monotreme Records, who we work with at the moment.</strong></p>\n<p style=\"text-align: center;\"><em>CITR:</em> You have recently released your debut album ‘Condors’, with critics stating that your sound portrays a message that the ‘delicate is always threatened by the destructive’. How far would you agree this is present in your music?</p>\n<p style=\"text-align: center;\"><strong>I love this description! I think that most of the best music I can think of balances atmospheric with the brash. Post rock and electronic music, as well as post hardcore have done this so well for many years… I guess for us, it’s about taking our music in direction that will then turn into something unexpected and devastating. Sometimes we also just want to rock out though!</strong></p>\n<p style=\"text-align: center;\"><em>CITR:</em> PC or Mac?</p>\n<p style=\"text-align: center;\"><strong>I’m PC all the way but Chris and Ayu both have Mac’s… I get a lot of stick for it but ultimately it’s a damn sight cheaper, and I don’t have to deal with having a massive apple lit up on the front of my setup like some sort of billboard!</strong></p>\n<p style=\"text-align: center;\"><em>CITR:</em> If you could have any super power, what would it be?</p>\n<p style=\"text-align: center;\"><strong>Teleportation, so I could stop having to deal with these horrendous drives between cities on tour!</strong></p>\n<p style=\"text-align: center;\"><a href=\"https://www.myspace.com/nedrymakesmusic\" target=\"_blank\">Check out Nedry’s myspace! </a></p>\n<p><iframe src=\"https://www.facebook.com/plugins/likebox.php?id=114090381951328&width=292&connections=10&stream=false&header=false&height=255\" scrolling=\"no\" frameborder=\"0\" style=\"border:none; overflow:hidden; width:292px; height:255px;\" allowTransparency=\"true\"></iframe></p>\n","slug":"659-5-minutes-with-nedry","category":"interviews","date":1273047696000,"wpid":659,"isSticky":false,"featured_image":{"width":600,"height":522,"src":"2010/05/nedry.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAJAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAABAUH/8QAJRAAAgEDAwIHAAAAAAAAAAAAAQIDAAQRBQY0EnMTQVFhcbHR/8QAFAEBAAAAAAAAAAAAAAAAAAAABP/EABwRAAICAgMAAAAAAAAAAAAAAAECAAQDMROh4f/aAAwDAQACEQMRAD8AJtvdzalaFpba3gjtHDJDZZhjJGSAVQYY4Pnn0pybgtZUWSPStICOOpR4irgH2KZHxWR7Z4Mvc/Ku6fwLbtL9CkVaYyOyltRHOBod+T//2Q=="},"createdAt":1587295298721,"updatedAt":1588403568213,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2010/05/nedry.jpg","categories":["interviews","music"]}