{"id":"5e9c312b9b6559241525dcb8","artists":["5e9b69317a1236eccfeb2403"],"title":"Review: Panda Bear – Tomboy","content":"<p><a href=\"https://admin.</p><p>crackintheroad.com/music/6594-review-panda-bear-tomboy/attachment/panda-bear-tomboy-3\" rel=\"attachment wp-att-6646\"><img src=\"https://api.crackintheroad.com/uploads/2011/04/Panda-Bear-Tomboy2.jpg\" alt=\"\" title=\"Panda-Bear-Tomboy\" width=\"800\" height=\"800\" class=\"aligncenter size-full wp-image-6646\" srcset=\"https://api.crackintheroad.com/images/2011/04/Panda-Bear-Tomboy2.jpg 800w, https://api.crackintheroad.com/images/2011/04/Panda-Bear-Tomboy2-165x165.jpg 165w, https://api.crackintheroad.com/images/2011/04/Panda-Bear-Tomboy2-260x260.jpg 260w, https://api.crackintheroad.com/images/2011/04/Panda-Bear-Tomboy2-640x640.jpg 640w\" sizes=\"(max-width: 800px) 100vw, 800px\" /></a></p>\n<p>Noah Lennox’s Panda Bear has always been a curious beast. He’s able to make music that seems familiar to fans of Animal Collective while making strides on his own two feet. His last record, Person Pitch , is a tough act to follow, thankfully it’s an interesting reinvention while retaining all that made the last LP so great.</p>\n<p>Sonically, Tomboy sticks to a fairly rigid formula. Swarming and engrossing vocals combined with repeated melodies are the order of the day. You Can Count On Me and the title track Tomboy are great examples of this, they’re structured and composed, yet manage never to bore. This us largely down to influences, the corrupted psychedelia brings with it a dream like haze; the repetition only adds to this.<br />\nThere’s still comfort to be found in his work though. Although the haunting voices appear menacing, the focus on simple song structures and light over aching melodies give the work a blissful quality that contrasts with the other sounds.</p>\n<p>Ultimately Lennox’s ability to layer and develop sounds in new and exciting ways is as prominent as ever, tacks like Alsatian Darn and Afterburner are almost rampant in their celebration of music. There are times when the record feels one dimensional, however, with the obvious beauty of the album seemingly coming from one dimension or sound, regardless of this, Tomboy is a fantastic return from Panda Bear. </p>\n","slug":"6594-review-panda-bear-tomboy","category":"music","date":1302963628000,"wpid":6594,"isSticky":false,"featured_image":null,"createdAt":1587294507633,"updatedAt":1588441789517,"author":"5e9b68b27a1236eccfeb1d24","old_image":"2011/04/panda-bear-tomboy2-188x188.jpg","categories":["music","reviews"]}