{"id":"5e9c312a9b6559241525dcb5","title":"Review: TV On The Radio – Nine Types Of Light","content":"<p><a rel=\"attachment wp-att-6658\" href=\"https://admin.</p><p>crackintheroad.com/music/6656-review-tv-on-the-radio-nine-types-of-light/attachment/tvninetypes\"><img class=\"aligncenter size-full wp-image-6658\" title=\"tvninetypes\" src=\"https://api.crackintheroad.com/uploads/2011/04/tvninetypes.jpg\" alt=\"\" width=\"640\" height=\"640\" srcset=\"https://api.crackintheroad.com/images/2011/04/tvninetypes.jpg 640w, https://api.crackintheroad.com/images/2011/04/tvninetypes-165x165.jpg 165w, https://api.crackintheroad.com/images/2011/04/tvninetypes-260x260.jpg 260w, https://api.crackintheroad.com/images/2011/04/tvninetypes-494x494.jpg 494w\" sizes=\"(max-width: 640px) 100vw, 640px\" /></a></p>\n<p><strong>TV On The Radio</strong> are a band that, almost without us noticing, make music that defines an era or time. Although never strictly political or ‘socially conscious’, there still manages to capture the feelings and motivations of the world around them. It’s almost unexpected then, that apart from this LP, which was record in Los Angeles; all prior material was recorded in Brooklyn. Although <em>Nine Types Of Light</em> isn’t a huge departure from previous material, with the latter half of the album making a clear comparison with <em>Dear Science’s </em>raucous sounds, it still develops a sound that has been simmering under the surface amongst the other tones and textures the band produces.</p>\n<p>At its roots the album is a love album. The group make that very clear with the opening track ‘<em>Second Song</em>’, regardless of the well-trodden path they’ve chosen to take, they still manage to consume you in their lives better than most. The track has a wonderful delicacy, thanks mostly to <strong>Tunde Adebimpe’s</strong> vocals, “<em>confidence and ignorance approve me</em>” is an honest indication of how the record will play out.</p>\n<p>The track begins is what can roughly be described as a concept album, gently and at times heart wrenchingly, exploring the process of dealing with a loved ones departure. The production suits this perfectly, ‘<em>Second Song</em>’ and ‘<em>Keep your heart</em>’ gently overflow with their productions, catching a groove while complimenting with ambient strings and rough guitar riffs, it perfectly mirrors the mood.</p>\n<p>Ultimately though the songs are conservatively written, despite the subtle blemishes within the production that give the record so much life, we have a record that at times follows a familiar path. There are casualties of this, ‘<em>No Future Shock</em>’ and ‘<em>Repetition</em>’ at times feel predictable, and by the half waypoint the 2 tunes have given all they have to give. In other instances however, they offer a solid way of letting the various tones and themes of the record to really breath. The highlight ‘<em>Killer Crane</em>’ is a remarkable example of this, from the opening sober piano chords to the perfectly written chorus, (“<em>Sunshine I saw you through the hanging vine, A memory of what was mine fading away, But this night heals the, And the moonlight steals the sound, I could leave suddenly unafraid</em>”), the song gently takes the listener through a complicated and ambivalent healing process in the most stunning of manners.</p>\n<p>By the end of the album we stay into Dear Science’s territory, ‘<em>Caffeinated Consciousness’</em> is a blistering example of the bands range. This isn’t the tone that will be leave with you though, ‘<em>Will Do</em>’ the LP’s single sums up the tone perfectly. The chorus “<em>Any time will do, my love. Any time will do, what choice of words will take me back to you?</em>” is a composed, hopeful and resilient hook that manages to be rooted in romanticism yet unnervingly realist. <em>Nine Types Of Light </em>manages to explore these ideas effortlessly, something that will no doubt make this album timeless.</p>\n<p><object classid=\"clsid:d27cdb6e-ae6d-11cf-96b8-444553540000\" width=\"100%\" height=\"81\" codebase=\"https://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=6,0,40,0\"><param name=\"allowscriptaccess\" value=\"always\" /><param name=\"src\" value=\"https://player.soundcloud.com/player.swf?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F13447499\" /><embed type=\"application/x-shockwave-flash\" width=\"100%\" height=\"81\" src=\"https://player.soundcloud.com/player.swf?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F13447499\" allowscriptaccess=\"always\"></embed></object> <span><a href=\"https://soundcloud.com/igamusic/tv-on-the-radio-killer-crane\">TV On The Radio – Killer Crane</a> by <a href=\"https://soundcloud.com/igamusic\">Interscope Records</a></span></p>\n","slug":"6656-review-tv-on-the-radio-nine-types-of-light","category":"music","date":1303071289000,"wpid":6656,"isSticky":false,"featured_image":{"width":640,"height":640,"src":"2011/04/tvninetypes.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAABgf/xAAhEAABAwQBBQAAAAAAAAAAAAABAgMEAAYRIQUHEhMxQf/EABUBAQEAAAAAAAAAAAAAAAAAAAUG/8QAHBEAAgICAwAAAAAAAAAAAAAAAgMAAREhQVHh/9oADAMBAAIRAxEAPwCKRbfbVaAkwn0Py1PrakR1M6aI9YWdbG9GiyuKlBRBYGQabW4lJ6XylFIKjyuMkbx4qJqA7jr7RyyOjKs8yoclLFLKxxrvyf/Z"},"createdAt":1587294506063,"updatedAt":1588403557208,"author":"5e9b68b27a1236eccfeb1d24","old_image":"2011/04/tvninetypes.jpg","categories":["music","reviews"]}