{"id":"5e9c342e9b6559241525e1ae","title":"5 Minutes With: There Will Be Fireworks","content":"<img class=\"alignnone\" title=\"There Will Be Fireworks\" src=\"https://4.</p><p>bp.blogspot.com/_vfWx1AhMET0/SxVD9wF1_ZI/AAAAAAAAAT0/gGsiXxgumYI/s1600/twbf.jpg\" alt=\"There Will Be Fireworks\" width=\"600\" height=\"404\" />\n<p>A quick glance down the myspace of Scottish rockers <strong>There Will Be Fireworks</strong> and there is undoubtably one phrase which grabs you by the throat and throttles you; under influences they state music which is “both brutal and beautiful simultaneously”. After several listens to last years brilliant self titled debut, you begin to understand why so many critics have picked up upon this quote, with the bands ability to combine delicately read poems, soaring riffs, intricate lyrics and scream ridden chaos, standing out so evidently.</p>\n<p>Whilst the recent increased interest in bands from Scotland, particularly Glasgow, such as <strong>Frightened Rabbit</strong>, <strong>The Twilight Sad</strong> and <strong>Glasvegas</strong> to name three, it would seem like the record labels would be itching to sign another of their contemporaries up. However, somewhere along the line, <strong>There Will Be Fireworks </strong>managed to slip under the much acclaimed Scottish radar, and self released their debut album last year, both in physical format, and digitally. With the album appearing in many bloggers “Albums of 2009” lists, it is obvious that the labels missed a trick with the Glasgow based band. The understated lyrical beauty of tracks such as <em>Midfield Maestro</em> really strike a nerve, whilst the epic <em>We Sleep Through The Bombs</em> combines the raw emotions of powerful, abrasive vocals with an <strong>Explosions In The Sky</strong>-esque build up.</p>\n<p>With recording of their sophomore album under way, <strong>There Will Be Fireworks</strong> are undoubtably ones to watch for the near future. Lead vocalist and guitarist, Nicky from<strong> There Will Be Fireworks</strong> kindly agreed to answer some questions for us.</p>\n<p><em>CITR: </em>Your debut album received much praise, especially from independent critics, despite the lack of financial backing from a large record label. Do you think this serves as a testimony to the way that the production and release of music is going?</p>\n<p><strong>Probably, yes. In terms of production, recording software is a lot cheaper and easier to come by these days. You don’t need to be bankrolled by a label to record something that sounds good anymore. We were lucky in that our friend Marshall runs a studio – Old Mill Studios in Strathaven. He has all this brilliant equipment and he puts in a lot of time and effort. On top of that, his rates are ridiculously cheap. So we got to record in a really nice space with good equipment and microphones and everything, and we could afford to do it ourselves.</strong></p>\n<p><strong> </strong></p>\n<p><strong>In terms of releasing the music, the internet has obviously made it a lot easier for bands like us to distribute albums without the help of a label. I think there is definitely a glass ceiling though, in terms of the audience you can reach without all the PR and contacts that labels offer. So, while our album did get a lot of praise from blogs, we’re never going to be on MTV or anything like that.</strong></p>\n<p><em>CITR:</em> Was it out of choice that you decided to release the album yourselves? Or were you forced into it?</p>\n<p><strong>Sort of both. We were forced in that we never had any offers from labels that would allow us to do more than we could do on our own. And it was out of choice as well: we didn’t send out lots of demos to labels and made a conscious decision that we would just record it ourselves because it was the easiest thing to do.</strong></p>\n<p><em>CITR: </em>On your myspace you list music that is “both brutal and beautiful simultaneously” as an influence upon you, would this also seem like an appropriate way to describe your sound as well? What would you describe as your biggest influences both musically and otherwise?</p>\n<p><strong>Writers seem to pick up on that little line a lot! Yeah, I would think that that describes what we were attempting to do on the first album. There are moments of brutal heaviness on it, and a fair bit of screamy-shouting and lots of dischord and chaos going on. But we also had a few quiter moments and melody was always key for us. Even in the heaviest bits, there’s always a melody. It might be obscured by the noise, but it’s there if you listen (really) hard.</strong></p>\n<p><strong>Individually, I think we have very varied influences. There are certain bands that we all like, such as Neutral Milk Hotel and Bon Iver. When we were writing the first album, we were listening to a lot of Explosions in the Sky, The Twilight Sad and Neutral Milk Hotel. I think our collective listening habits have changed a bit since then. Personally, my favourite bands or artists right now are probably The National, Why?, Fionn Regan and the Low Anthem. I don’t know how much they influence us because it isn’t really a conscious thing, but I’m sure it’s there somewhere in the songs.</strong></p>\n<p><strong> </strong></p>\n<p><strong>Otherwise, I read a lot and AK, our drummer, studied English Literature, so some literary influences are probably evident. We had Kevin MacNeil, who wrote the novel ‘The Stornoway Way’, perform a spoken word part for the first song on the album. And we used an extract from an Ian McEwan’s ‘Enduring Love’ in ‘A Kind of Furnace’. My favourite writers are probably Philip Roth, Edwin Morgan, Don Delilo and John Berryman. I’ve been reading a lot of Tom Wolfe recently too. I know he’s not fashionable anymore because he liked Bush but his books are pretty good. Some of the stuff that those guys have written impacts on the lyrics, definitely. I sometimes steal little phrases or ideas.</strong></p>\n<p><em>CITR: </em>The music scene in Scotland at the moment is arguably the most vibrant and exciting it has been for a while, with the likes of Frightened Rabbit, Admiral Fallow, We Were Promised Jetpacks and yourselves, all upon the receiving end of positive media coverage and reviews. Do you think there are any reasons for the fantastic current crop of bands from Scotland? Do you have any recommendations?</p>\n<p><strong>I don’t really know what the scene was like before most of these bands came about so I don’t know how it compares to previous years. There was the whole Franz Ferdinand thing for a while with all the art school haricuts and suits and stuff like that. I only really went to see touring bands til I was about 18. The only local bands I went to see up until then were bands that people I knew played in, like Endor and WeHungYourLeader (now LightGuides). So I don’t have much to compare it to, and I suspect there has always been a lot of good bands in Scotland, but there does seem to a certain vibrancy at the moment. A lot of it has probably got to do with the Fat Cat trio of Frightened Rabbit, The Twilight Sad and We Were Promised Jetpacks. They’ve all garnered critical praise in quick succession, which throws a bit more attention towards Scotland, and Glasgow in particular.</strong></p>\n<p><strong>I really don’t know what the reasons for it are. It might be cyclical, that a lot of good bands come out of the same place at the same time. Everyone in Glasgow is in a band, so we’re bound to produce a few good ones. Edinburgh has produced some amazing bands recently – Withered Hand and Meurault being my favourites – and I have no idea why that is but there definitely seems to be a renewed sense of community in the music scene there.</strong></p>\n<p><strong> </strong></p>\n<p><strong>I would recommend a good few! Off the top of my head Lions.chase.tigers, LightGuides and Seventeenth Century have all released brilliant EPs over the last year or so. Everything Withered Hand and Meursault have released is amazing. And Endor have an album due out this summer, which I am very excited about.</strong><br />\n<em> </em></p>\n<p><em>CITR:</em> Do you have any plans for the second album? Is it possible it could be another “do it yourself” release, or do you think you could benefit musically by signing to a label?</p>\n<p><strong>Yes, we do. We have started recording it and I’d say the majority of it is written, mostly in my head at the moment unfortunately. I think we could benefit from signing to a label, but it doesn’t look likely and we’re more than happy to do it ourselves. We’ve made enough money from the first album to record another so that isn’t really an issue. We’re hoping to get it finished this summer, preferably as soon as possible. We’ve been in the studio a lot recently, so it is starting to take form.</strong></p>\n<p><em>CITR: </em>What has been your most amusing tour moment to date?</p>\n<p><strong>Ripping the roof off of our van on a maximum-height barrier. Not amusing at the time, but we made a makeshift roof out of ducktape and carried on regardless, driving through a storm. In hindsight, it’s one for the grandkids.</strong></p>\n<p><em>CITR: </em>If you could have any super power what would it be?</p>\n<p><strong>Hmm, I reckon flying would be pretty good. Definitely flying.</strong></p>\n<p style=\"text-align: center;\"><a href=\"https://www.myspace.com/therewillbefireworks\">Myspace</a></p>\n<p style=\"text-align: center;\"><a href=\"https://therewillbefireworks.weebly.com/\">Buy their debut album</a></p>\n","slug":"671-5-minutes-with-there-will-be-fireworks","category":"interviews","date":1273743853000,"wpid":671,"isSticky":false,"featured_image":{"width":188,"height":188,"src":"2011/06/twbf-188x188.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAABAYH/8QAJBAAAgIBAwMFAQAAAAAAAAAAAQIDBBEABjEFEiEHExRBQnH/xAAUAQEAAAAAAAAAAAAAAAAAAAAA/8QAFBEBAAAAAAAAAAAAAAAAAAAAAP/aAAwDAQACEQMRAD8Ag/S2lXm2Jvu3P08PNV6WtRIIsyTMzEgkjxgdwJ5yOB9ZHFtHYE0SStuerXLqGMLCZjHn8khPOOM6X063Zo7Vf4Viav3LH3ey5TP9xrG7TNJZmeRi7s5ZmY5JJPJOg//Z"},"createdAt":1587295278775,"updatedAt":1588403567927,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/06/twbf-188x188.jpg","categories":["interviews","music"]}