{"id":"5e9c31239b6559241525dcab","artists":["5e9b68da7a1236eccfeb1ed2"],"title":"Review: Cat’s Eyes – Cat’s Eyes","content":"<p><a href=\"https://admin.</p><p>crackintheroad.com/music/6741-review-cats-eyes-cats-eyes/attachment/cat_s_eyes_lo_res_press_photo\" rel=\"attachment wp-att-6797\"><img src=\"https://api.crackintheroad.com/uploads/2011/04/Cat_s_Eyes_Lo_Res_Press_Photo.jpg\" alt=\"\" title=\"Cat_s_Eyes_Lo_Res_Press_Photo\" width=\"1012\" height=\"550\" class=\"aligncenter size-full wp-image-6797\" srcset=\"https://api.crackintheroad.com/images/2011/04/Cat_s_Eyes_Lo_Res_Press_Photo.jpg 1012w, https://api.crackintheroad.com/images/2011/04/Cat_s_Eyes_Lo_Res_Press_Photo-260x141.jpg 260w, https://api.crackintheroad.com/images/2011/04/Cat_s_Eyes_Lo_Res_Press_Photo-640x347.jpg 640w, https://api.crackintheroad.com/images/2011/04/Cat_s_Eyes_Lo_Res_Press_Photo-165x89.jpg 165w, https://api.crackintheroad.com/images/2011/04/Cat_s_Eyes_Lo_Res_Press_Photo-950x516.jpg 950w\" sizes=\"(max-width: 1012px) 100vw, 1012px\" /></a><br />\nTo say Faris Badwan has had an interesting career to date would be an understatement of cataclysmic proportions; from being championed as the savior of indie by trash talking publication NME, to completely re-inventing the sound of his band on only their second album. Yes, The Horrors have certainly caught the attention, adulation and even disgust of many in their short but controversial existence.</p>\n<p>So it’s no surprise it shocked a few, myself included, when Badwan and close friend, renowned opera soprano Rachel Zeffira, played an unscheduled gig amongst the holy confines of The Vatican City. Showcasing a grander, smoother side to Badwan, and utilizing the contrasting vocals of Zeffira and Badwan, one hypnotic and elegant, the other coarse and jagged. Beauty and the Beast.</p>\n<p>After releasing their debut EP a few months back, Cat’s Eyes have readied their first full length album, before embarking on a string of festival shows around Europe. Featuring a couple of the tracks lifted from their Broken Glass EP, their self titled debut attempts to prove itself worthy of being branded beautiful, an accolade that The Horrors have so far yet to strive for. Opening track Cat’s Eyes isn’t too far from the shoegaze sound experimented with upon Primary Colours, but it has a more reassured swagger and sex appeal to it. Zeffira’s backing vocals add a new dimension to Badwan’s drawl, allowing the track to come across as sinister yet raunchy to the point of excitement.</p>\n<p>The Best Person I Know also featured on their debut release, and is a soulful ballad, thriving upon Zeffira’s fantastically moving vocal harmonies. Lyrically, it sounds as if it’s been written by a young child, yet it’s this innocence that really excells. As it does on I’m Not Stupid, opening with ‘I know I’m not the prettiest girl’, a track that wouldn’t be out of place soundtracking a 1960’s French love film.</p>\n<p>When Badwan takes the lead mic position, as on Face In The Crowd, tend to be the more upbeat, enthralling tracks. Lending themselves perfectly to Faris’s angst ridden drawl, imagine Scott Walker with a temper and years of heavy smoking. Bandit is another sensual number, backed by a resounding brass section, working to a degree but ultimately appearing rather underwhelming.</p>\n<p>At the times when Badwan’s recognizable vocal delivery thrives, the tracks are thrilling and unique, yet the likes of Sooner Or Later is a catastrophic mess for two minutes before opening out into an almost spoken word ode. Far from a perfect debut, but it’s true to say that the gems far outshine the worn rust, of which there is little.</p>\n<p>Album highlight and closer I Knew It Was Over, a piano driven ballad, building an intricate and complex relationship between Badwan and Zeffira, gesticulating the end of an affair, as well as their debut album; an epic and insightful way to end the record. Whilst it’s only early days, and their live shows will be under intense scrutiny this summer, Cat’s Eyes have certainly signaled their intent.</p>\n","slug":"6741-review-cats-eyes-cats-eyes","category":"music","date":1303163192000,"wpid":6741,"isSticky":false,"featured_image":null,"createdAt":1587294499879,"updatedAt":1588441789489,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/04/cat_s_eyes_lo_res_press_photo-292x50.jpg","categories":["music","reviews"]}