{"id":"5e9c343e9b6559241525e1ca","title":"Interview: The Winter Sounds","content":"<p style=\"text-align: center;\"><em>‘An intent, energetic rocker with an underlying Cure-ishness at its core, from its ringing, two-part guitar melody and mobile bass line to its yelpy-voiced front man’</em>, and so is described <strong>The Winter Sounds</strong>.</p><p><strong> </strong>Originating from Athens, GA, <strong>The Winter Sounds</strong> have released two full length albums since their creation, <em>Porcelain Empire </em>and <em>Church of the Haunted South, </em>and have amassed a staggering 450 gig performances during their existence. This passion for relentless touring has allowed <strong>The Winter Sounds </strong>to develop a solid fan base across the United States, so much so that fans were willing to contribute over five thousand dollars to a Kickstarter campaign by the band to fund their next album.<strong> </strong>Currently on yet another tour, lead guitarist <strong>Clayton Taylor</strong> took the time out to answer some of our questions.</p>\n<p style=\"text-align: center;\"><em>CITR:</em> If you had to cite one band/artist as a major influence upon you, who would it be?</p>\n<p style=\"text-align: center;\"><strong>It’s too tough to narrow down to one major influence…but right now I’m having my usual love affair with The Beatles. I feel like I learn so much from their music.</strong></p>\n<p style=\"text-align: center;\"><em>CITR:</em> What has been your favourite gigging experience to date?</p>\n<p style=\"text-align: center;\"><strong>Up there in the favorites would be the Halifax Pop Explosion. Its an annual festival in Halifax, Nova Scotia. That whole area of Canada was so beautiful, and all the people we met were super</strong><strong> friendly.</strong></p>\n<p style=\"text-align: center;\"><em>CITR: </em>With 450 gigs under your belt by the end of last year, how much would you say this almost constant touring has affected your music?</p>\n<p style=\"text-align: center;\"><strong> Honestly, I don’t know. I assume that bits and pieces of the touring lifestyle come across in our lyrics and music, but I really can’t pinpoint exactly where…. I just hope it is affecting us in good ways. </strong></p>\n<p style=\"text-align: center;\"><em>CITR: </em>With Athens, GA producing the likes of REM, The B-52’s and the Elephant 6 collective, did this have any impact upon your musical direction?</p>\n<p style=\"text-align: center;\"><strong>Not really. We came way after all of those bands, and none of us are from Athens per say. It was just where the band started. That being said, we do listen a bit to some of those bands. Neutral Milk Hotel is a favorite.</strong></p>\n<p style=\"text-align: center;\"><em>CITR: </em>Your recent ‘kickstarter’ fundraiser appears to have been a big success, taking in well over your original goal. How did you all find the experience of a fan funded album?</p>\n<p style=\"text-align: center;\"><strong>I thought the entire idea was amazing. Kickstarter ended up being a great way to make it more than just people giving money because we got to think of some creative ways to give back when someone donated. We’d totally do it again.</strong></p>\n<p style=\"text-align: center;\"><em>CITR: </em>When can we expect the new album to be released? And with the change in line up, can we expect to hear a changed sound from the Winter Sounds?</p>\n<p style=\"text-align: center;\"><strong>Good question. Haha.. We hope to have the album out by the end of the year, but we’ll just have to see where everything stands in the fall. Musically, I’d say the songs won’t be as thematically layered as the last record. We’re trying to strip things down and write some amazing pop songs this time around. </strong></p>\n<p style=\"text-align: center;\"><em>CITR: </em>PC or Mac?</p>\n<p style=\"text-align: center;\"><strong>Macs rule and PC’s drool!</strong></p>\n<p style=\"text-align: center;\"><em>CITR:</em> If you could have a special power, what would it be and why?</p>\n<p style=\"text-align: center;\"><strong>I would want to be able to fly. Right now we’re on the west coast, and the mountains and valleys are breathtaking. I want to fly over it all. </strong></p>\n<p style=\"text-align: center;\"><em>CITR: </em>Is Asher Roth right about college?</p>\n<p style=\"text-align: center;\"><strong>He’s not exactly wrong. I’m sure I’ve lived a few nights worth of his lyrics… haha.</strong></p>\n<p style=\"text-align: center;\"><strong><span style=\"font-weight: normal;\"><a href=\"https://www.myspace.com/thewintersounds\" target=\"_blank\">Check out The Winter Sounds’ Myspace!</a></span></strong></p>\n<p><iframe src=\"https://www.facebook.com/plugins/likebox.php?id=114090381951328&width=292&connections=10&stream=false&header=false&height=255\" scrolling=\"no\" frameborder=\"0\" style=\"border:none; overflow:hidden; width:292px; height:255px;\" allowTransparency=\"true\"></iframe></p>\n","slug":"677-5-minutes-with-the-winter-sounds","category":"interviews","date":1273153150000,"wpid":677,"isSticky":false,"featured_image":{"width":600,"height":402,"src":"2010/05/the-winter-sounds.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAMG/8QAIBAAAgIBAwUAAAAAAAAAAAAAAQIDEQAEElEFEyMxQf/EABUBAQEAAAAAAAAAAAAAAAAAAAQF/8QAFxEBAQEBAAAAAAAAAAAAAAAAAQACA//aAAwDAQACEQMRAD8AxuricayNER+xIAPIwYyEm33H2LF0Rx9yT9F029qkmq+cYye99ISDAX//2Q=="},"createdAt":1587295294990,"updatedAt":1588403568158,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2010/05/the-winter-sounds.jpg","categories":["interviews","music"]}