{"id":"5e9c31169b6559241525dc99","title":"Feature: The Sex Toy Double Standard","content":"<p>Sex Toys freak me out.</p><p> Not least because the very idea of them eclipsing me in the bed room is a fairly scary thought, but also because the idea of a vibrating plastic thing doing what should in my opinion be a manual, sensual act is a bit of a turn off. Regardless of my opinions, female sex toys are a completely accepted phenomenon. The facts speak for themselves, according to a 2004 study, over 50% of the women asked said that they regularly used sex toys, with most women saying the toys were used during a relationship and that the device wasn’t used as a substitute for a partner. Furthermore, a whopping 90% of the women who said they used sex toys, also said they were open and honest about their ‘hobby’ to their partners and friends. Couple this with shops like Ann Summers, who have recently seen huge boosts in profits (19%), and it’s safe to say that the sex toy train has no chance of derailing anytime soon.</p>\n<p>It all sounds rather healthy right? Sexually liberated women getting down and dirty with a vibrating piece of plastic might not be my ideal image, but I can see perfectly well why it could get some people off. More importantly it’s a completely acceptable thing to do, if anything it’s more of a taboo for a woman of the 21st century to be opposed to such ‘paraphernalia’.</p>\n<p>With that in mind, picture this scene. You’re a young, attractive, city dwelling woman on a night out and a man catches your eye across the bar. He’s young, tall dark and handsome, who knows he might even have a mustache? Words are exchanged, you say seductive and sexy things like, “Did you know that a chicken lays an egg every single day!” (I know right??) or even “did you know that in Victorian times, whores wore pubic wigs?”. With facts as fascinating as that, you’ve pulled. So, able and willing, you totter back to his flat. You get through the front door; it’s not bad, definitely not bad enough to prematurely feel guilty about the imminent ‘casual sex’. You make it into his bedroom, his sheets are clean, always a bonus, things are generally going well: and then you see it. A large, fleshy looking tube shaped device otherwise known as a ‘Flesh Light’ (other sex toys are available).</p>\n<p>Now we get to a cross road, a cross road that 9 times out of 10 leads to the revealing of the ‘sex toy double standard’, a phenomenon that has intrigued me of late. Whether we like it or not there’s a massive stigma attached to the very idea of a male sex toy. Band the idea around a group of friends and the same words tend to come up; creepy, sad or the well-known phrase “get a life you fucking weirdo and try getting laid”.  It’s simply not acceptable for a man, such as myself, to get freaky with his own self-fulfilling piece of wonder plastic. The natural reaction is to assume that these attitudes are caused because a small minority is actually using them, but this isn’t necessarily true. More and more men seem to be purchasing these sorts of male orientated products, yet despite their increased popularity the prejudice towards their use is still as prevalent.</p>\n<p>So why is this? For me it comes down to 3 things: the nature of the male orgasm, the nature of the toys themselves and finally the way society thinks men tend to view sex. Lets start with the male organism. I think we can all agree that as a rule, the male orgasm is pretty shit; it’s short, comes out of nowhere and can’t be experienced again without a re-charge period. The fact that a man would want to go to such lengths to heighten something that isn’t great to begin with, compared to a female orgasm, is for me where all the problems start. As well as this, the way of stimulating an orgasm is pretty much limited to one physical action, again compared to a female orgasm with a variety of methods, the male experience looks a tad rubbish in comparison.</p>\n<p>The main problem it seems stems from the toys themselves however. Whichever way you look at it, flesh lights are creepy. Its not like a dildo that comes in all shapes and sizes, a flesh light looks like a vagina, and a fucking scary one at that. The primary aim of the flesh light it seems isn’t to necessarily create pleasure for pleasures sake, but more to replicate the idea of being in a woman/man. Sure, dildos often replicate penises, but its more what it does, than what it looks like while it’s doing it. In contrast, when buying a flesh light you’re offered a choice of which orifice you prefer, with even the option of going for a cast of a famous porn-star now available. When put like this, the description of ‘creepy’ might not seem so harsh.</p>\n<p>But regardless, I think that if male sex toys are ever to be accepted, we need to re-evaluate how ‘we’ view sex. Now obviously I’m not asking for a group huddle to create a plan of action, but if this ‘sex toy double standard’ is ever to be shaken, the stereotypical throwaway attitude we assume men have towards sex needs to leave with it. As a rule, society assumes that women have a more emotional outlook towards sex, environmentally this might be true, but scientifically it’s anything but. Scientific American’s Martin Portner came to the conclusion that women actually shut down in emotion-processing regions during arousal and orgasm. So this position that men want a pump and a squirt, while woman enjoy the solitary, emotional pleasure of a rampant-rabbit induced orgasm, scientifically holds no weight.</p>\n<p>So after all this waffle, what should we do? Well if the female sex toy revolution is anything to go by, we should fully embrace the idea of the male sex toy. A world without preconceived ideas about sexuality and the ‘dos and don’ts’ that accompany them can only be a good thing. So while you all get on with sexually liberating yourselves, I’m going to stand back and find the whole thing really fucking creepy.</p>\n","slug":"6847-feature-the-sex-toy-double-standard","category":"life","date":1303323876000,"wpid":6847,"isSticky":false,"featured_image":{"width":1121,"height":764,"src":"2011/04/sextoy.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAAAAb/xAAjEAABAwIFBQAAAAAAAAAAAAACAQMEAAUGEhMhIhExMlGx/8QAFAEBAAAAAAAAAAAAAAAAAAAAAf/EABwRAAIBBQEAAAAAAAAAAAAAAAECABIhMYHR8P/aAAwDAQACEQMRAD8Ag38OYVn2q03eFd5hvyYrit252PtrtDyzH4qn32lQxALpK4xZQ0jXMHMU4r2260pQFCnXYlqhf2J//9k="},"createdAt":1587294486340,"updatedAt":1588403556972,"author":"5e9b68b27a1236eccfeb1d24","old_image":"2011/04/sextoy.jpg","categories":["life"]}