{"id":"5e9c31139b6559241525dc93","artists":["5e9b69577a1236eccfeb2692"],"title":"Review: tUnE-yArDs – w h o k i l l","content":"<p><a rel=\"attachment wp-att-6894\" href=\"https://admin.</p><p>crackintheroad.com/music/6893-review-tune-yards-w-h-o-k-i-l-l/attachment/tuneyards-album-whokill-2011_www-lylybye-blogspot-com\"><img class=\"aligncenter size-full wp-image-6894\" title=\"Tuneyards-album-Whokill\" src=\"https://api.crackintheroad.com/uploads/2011/04/Tuneyards-album-Whokill-2011_www.lylybye.blogspot.com_.jpg\" alt=\"\" width=\"800\" height=\"640\" srcset=\"https://api.crackintheroad.com/images/2011/04/Tuneyards-album-Whokill-2011_www.lylybye.blogspot.com_.jpg 800w, https://api.crackintheroad.com/images/2011/04/Tuneyards-album-Whokill-2011_www.lylybye.blogspot.com_-260x208.jpg 260w, https://api.crackintheroad.com/images/2011/04/Tuneyards-album-Whokill-2011_www.lylybye.blogspot.com_-640x512.jpg 640w, https://api.crackintheroad.com/images/2011/04/Tuneyards-album-Whokill-2011_www.lylybye.blogspot.com_-165x132.jpg 165w\" sizes=\"(max-width: 800px) 100vw, 800px\" /></a></p>\n<p>When <strong>Tune-Yards’</strong> 2009 LP, <em>Bird Brains</em>, was released in 2009 it was met with a mixed response. It was in no way a bad album, it just didn’t seem to fully realise the ambitious potential of the sound. The DIY nature of recording seemed to be at least partly responsible for this, with the lo-fi recordings inhibiting the vibrant and exciting sound that so desperately wanted reveal to itself.</p>\n<p><em>Who Kill</em>, Merrill Garbus’ second album, thankfully develops those raw ideas found in Bird Brains, leaving us with a raucous, manic, eccentric mix of cultures and sounds. Despite the major strides taken within production, the new LP will no doubt still split opinions of anyone who listens to it. Merrill Garbus’ voice is almost completely responsible for this, to put it simply; it’s like nothing you’ve ever heard before. Soaked in passion and energy, Garbus manages to sound both race-less and genderless, while still retaining her own striking personality.</p>\n<p>Thankfully this time the song writing, and the production that accompanies it, lives up to Garbus’ fantastic voice. Gone is the lo-fi background hum; in its place is a multi-layered cacophony of tones, textures and genres. The LP jumps from Afro-pop, to rock and back to the strange folk/Rn’B/funk hybrid that makes <strong>Tune-Yards</strong> so distinct. I suppose you could argue that this schizophrenic and ambitious attitude to genre was present in her debut, but it certainly wasn’t as accomplished. The LPs opening 2 tracks, <em>My Country </em>and<em> Es-So</em>, are rich with sounds and influences, harmonies circle around the listener, with synths and brass floating in at perfect moments. Most importantly the beats and groves are tighter and more infectious than ever. The LP’s first single <em>Bizness</em> is a great example, the beat slowly sucks you in, the melodies are wonderful and Garbus distinctive voice soars in the most enthralling of ways.</p>\n<p>Ultimately the LP is fairly consistent throughout, track <em>Doorstep</em> shifts the tone of the record at just the right moment, including some rather wonderful harmonies. Despite this there are areas where the sound becomes too much. Single <em>Gangsta</em> is perhaps too excitable for its own good while final track <em>Killa </em>is ultimately disappointing compared to the rest of the album. Regardless of these small concerns, <em>Who Kill</em> is fantastic; it’s almost never boring, it’s eccentric, vibrant, sun soaked, uncontrollable and more importantly the vibes and messages will stay with you for as long as they wish. Undoubtedly an album that refuses to let go.</p>\n","slug":"6893-review-tune-yards-w-h-o-k-i-l-l","category":"music","date":1303418299000,"wpid":6893,"isSticky":false,"featured_image":{"width":800,"height":640,"src":"2011/04/tuneyards-album-whokill-2011_www.lylybye.blogspot.com_.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAIAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAEH/8QAIxAAAQMDAgcAAAAAAAAAAAAAAQIFEgARIQMEExQiMUFRYf/EABQBAQAAAAAAAAAAAAAAAAAAAAT/xAAYEQADAQEAAAAAAAAAAAAAAAAAAQISEf/aAAwDAQACEQMRAD8A1NxbnBn4GnBW92siBqI6SgWOSb4Pj0aofwgR59aI4iUm4+d6Uo1zmuJiJrUptH//2Q=="},"createdAt":1587294483097,"updatedAt":1588403556917,"author":"5e9b68b27a1236eccfeb1d24","old_image":"2011/04/tuneyards-album-whokill-2011_www.lylybye.blogspot.com_.jpg","categories":["music","reviews"]}