{"id":"5e9c343d9b6559241525e1c7","title":"5 Minutes With: Casiotone For The Painfully Alone","content":"<p><a rel=\"attachment wp-att-6289\" href=\"https://admin.</p><p>crackintheroad.com/music/693-5-minutes-with-casiotone-for-the-painfully-alone/attachment/casio\"><img class=\"aligncenter size-900wide wp-image-6289\" title=\"casio\" src=\"https://api.crackintheroad.com/uploads/2010/05/casio-900x597.jpg\" alt=\"\" width=\"900\" height=\"597\" /></a></p>\n<p><strong>Owen Ashworth</strong> aka<strong> Casiotone For The Painfully Alone</strong> is one of the most emotionally stirring and humorously  insightful songwriters of all time. Just one listen to any of his five full length LPs and you will begin to understand why he is constantly on the receiving end of praise from the independent music scene. Characterised, but not limited to, his use of quirky electronic beats and original, retro keyboards, <strong>Ashworth </strong>is known for producing his music by his own methodology, and to his own ideals, which is a much missed rarity amongst modern musicians. All five albums have been produced on relatively modest budgets, with the first three being recorded on cassette tape, before they were later released on CD. Undoubtably one of my all time favourite lyricists, as well as songwriters, <strong>Owen Ashworth</strong> manages to combine clever and poignant words, with slow burning, but at the same time tasteful, moving electronic beats. We were delighted when <strong>Owen</strong> kindly agreed to answer a few questions for us, discussing last years brilliant <em>Vs Children</em> as well as what we might expect from <strong>Casiotone For The Painfully Alone</strong> in the future.</p>\n<p><em>CITR: <span style=\"font-style: normal;\">Your music contains lyrics of an inherently personal nature, do you ever find it difficult to perform certain songs live? If so, could you tell us which ones?</span></em></p>\n<p><em><span style=\"font-style: normal;\"><strong>I don’t really write songs about myself, so no.  For the most part, the people in my songs are fictional.  A few songs are more closely based on real things, but there’s always some element of fiction.  I’m just trying to write good songs.  Sometimes the best ideas come from real life things, but I don’t feel any obligation to stick to the truth.  The only songs that I find it difficult to perform are the ones that I just don’t like anymore.  I’d rather not say which ones they are, because some people like them, and I don’t want them to feel bad about it.</strong></span></em></p>\n<p><em>CITR: </em>Etiquette saw you experimenting with a more clean, crisp and overall broader sound, was this brought on by a larger budget to record the album on? Or would you say it was more of a natural progression that would have happened anyway?</p>\n<p><strong>All of the above.  The larger budget was basically just me paying a few friends to help me record the sounds that I didn’t know how to record myself.  I’d made three albums on cassette tape and I wanted to try something a bit more ambitious.  It was still a pretty modest production by most musician’s standards, I think.  I mean it was still just my friends and me.</strong></p>\n<p><em>CITR: </em>Your use of instruments both on albums and live performances are quirky and original, which instruments have you been playing with recently?</p>\n<p><strong>On the most recent tour, Casiotone for the Painfully Alone was a full band with drums, bass, guitar, trombone, cornet, some extra percussion, and a whole mess of keyboards (Fender Rhodes electric piano, a Farfisa Mini Compact organ, two Nord Electro digital keyboards, and a Korg MicroSampler).  The Rhodes is a recent acquisition.  I’ve been using the Rhodes and an Acetone Rhythm Ace drum machine as the foundation for some of the songs I’ve written recently.  I also have a Korg EMX-1 sequencer that I’ve been recording with.  Recently I’ve been working with a Chicago rapper named Serengeti.  I made three beats for his new album, and we might do a few more things.  I used the EMX-1 and an ESX-1 Sampler for a lot of that stuff.</strong></p>\n<p><em>CITR: </em>California was the centre of the “thrash metal” scene in the late 80s and early 90s, what effect do you think growing up so near to the centre of such a movement had upon the music that you were then to produce?</p>\n<p><strong>I wasn’t even aware of it, to be honest.  A lot of my music tastes were inherited from my parents (classic rock, soul, country… the stuff they listened to in college).  I started listening to the local hip hop station when I was 13 or so, and then the Modern Rock station, and then Nirvana happened and suddenly there was punk and indie music. Metal wasn’t even on my radar until I was older.  My younger brother Gordon played in a metal band when he was in high school, but it was the early 2000’s by then, and I was out of the house and living in my own apartment.  Metal was his thing.  He got all of the metal genes.</strong></p>\n<p><em>CITR: </em>After 2009’s fantastic, deeply emotional Vs Children, where do you see your sound going from here?</p>\n<p><strong>There will most certainly be some horns on the next album that I make.  It won’t be a Casiotone for the Painfully Alone album, though.  I’ll call it Advance Base.</strong></p>\n<p style=\"text-align: center;\"><a href=\"https://www.cftpa.org/\">Official Website</a></p>\n<p style=\"text-align: center;\"><a href=\"https://www.myspace.com/cftpa\">Myspace</a></p>\n","slug":"693-5-minutes-with-casiotone-for-the-painfully-alone","category":"interviews","date":1273310498000,"wpid":693,"isSticky":false,"featured_image":{"width":292,"height":50,"src":"2010/05/casio-292x50.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAACAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAUG/8QAHhAAAwACAQUAAAAAAAAAAAAAAQIDAAQGETEzQVP/xAAVAQEBAAAAAAAAAAAAAAAAAAACBP/EABQRAQAAAAAAAAAAAAAAAAAAAAD/2gAMAwEAAhEDEQA/ANjzm1bcW2UtV6IWkSrMSPIvrLb7u2GPTav3+hxjJDf/2Q=="},"createdAt":1587295293204,"updatedAt":1588443779997,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2010/05/casio-292x50.jpg","categories":["interviews","music"]}