{"id":"5e9c31099b6559241525dc81","artists":["5e9b69447a1236eccfeb2550"],"title":"Review: Solomon’s Hollow – Genre Studies","content":"<p><a rel=\"attachment wp-att-7106\" href=\"https://admin.</p><p>crackintheroad.com/music/6954-review-solomans-hollow-genre-studies/attachment/solomanshollow\"><img class=\"aligncenter size-full wp-image-7106\" title=\"solomanshollow\" src=\"https://api.crackintheroad.com/uploads/2011/04/solomanshollow.jpg\" alt=\"\" width=\"680\" height=\"750\" srcset=\"https://api.crackintheroad.com/images/2011/04/solomanshollow.jpg 680w, https://api.crackintheroad.com/images/2011/04/solomanshollow-260x286.jpg 260w, https://api.crackintheroad.com/images/2011/04/solomanshollow-640x705.jpg 640w, https://api.crackintheroad.com/images/2011/04/solomanshollow-165x181.jpg 165w\" sizes=\"(max-width: 680px) 100vw, 680px\" /></a></p>\n<p>Folk music can be hugely dividing, with numerous people completely ignoring or being repulsed by anything tarred with the dreaded folk brush. There’s still a common misconception that repels many, so I’ll banish that now; not all folk sounds identical to Bob Dylan, in the same way that by listening to Madonna, you haven’t experienced every form of pop music. So when talking about Solomon’s Hollow, I sincerely hope that no one is instantaneously dismissive when I refer to him as folk music.</p>\n<p>After emerging from extremely DIY roots, Nate A aka Solomon’s Hollow began by distributing free home-made CD’s after gigs, featuring several of his lo-fi inspired tracks. Genre Studies is his newest release, and was made available towards the end of last year through Barn Owl Records. This collection of eight tracks is a fantastic introduction to those unsure on the beauty and integrity of folk influenced music; opener Silent Film is a gorgeous sonnet, with Nate’s soothing voice gently guiding the track along it’s course. Building up alongside his vocals, there’s touches of Horse Feathers, Iron & Wine and Devendra Banhart, yet it’s by no means copycat music.</p>\n<p>Elsewhere on the mini-LP, there’s the entirely instrumental In The House Of Mystery, a hauntingly poignant violin, guitar and piano affair. Serving as somewhat of an intro for Dakota, a stunning ode to a mystery girl, featuring the LP’s standout lyric ‘too old to grow, too young to know’. There’s a true sense of longing that emanates from the track, as Solomon’s Hollow delves deeper into the intricate details of his relationship with the alluring Dakota.</p>\n<p>It’s a moving and illustriously indecisive listen, fusing modern lo-fi sounds with more traditional folk driven moments. It remains completely honest and heartfelt throughout, yet never bathes itself in overindulgence, allowing Solomon’s Hollow to develop a true personality of his own. Head over to <a href=\"https://www.barnowlrecords.com/solomonshollow.html\">Barn Owl Records</a> to download Genre Studies.</p>\n","slug":"6954-review-solomans-hollow-genre-studies","category":"music","date":1303578548000,"wpid":6954,"isSticky":false,"featured_image":{"width":680,"height":750,"src":"2011/04/solomanshollow.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAALAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAABwQI/8QAIhAAAQQCAQUBAQAAAAAAAAAAAQIDBBEFIQAGBxIxgRNh/8QAFQEBAQAAAAAAAAAAAAAAAAAABAX/xAAcEQEAAQQDAAAAAAAAAAAAAAABAgADBBEhYaH/2gAMAwEAAhEDEQA/AG6N3AwcrEuzY7zhW20XCytspVobF1R2asE/y+EsnvT1wmQ6Gej8aWgshHnLUDV6v1v5zMsnNZPHZPJxIc6Q3H81teBWVApSolI3foi+Xt5bIutpccnylLWApR/VWyfvJTjTjyaTvdNsFh2THyv/2Q=="},"createdAt":1587294473882,"updatedAt":1588403556755,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/04/solomanshollow.jpg","categories":["music","reviews"]}