{"id":"5e9c31089b6559241525dc7e","title":"Review: Metronomy – The English Riviera","content":"<p><a rel=\"attachment wp-att-6966\" href=\"https://admin.</p><p>crackintheroad.com/music/6962-review-metronomy-the-english-riviera/attachment/metronomy\"><img class=\"aligncenter size-full wp-image-6966\" title=\"metronomy\" src=\"https://api.crackintheroad.com/uploads/2011/04/metronomy.jpg\" alt=\"\" width=\"900\" height=\"577\" srcset=\"https://api.crackintheroad.com/images/2011/04/metronomy.jpg 900w, https://api.crackintheroad.com/images/2011/04/metronomy-260x166.jpg 260w, https://api.crackintheroad.com/images/2011/04/metronomy-640x410.jpg 640w, https://api.crackintheroad.com/images/2011/04/metronomy-165x105.jpg 165w\" sizes=\"(max-width: 900px) 100vw, 900px\" /></a><br />\nPlaces, cities and towns have always had an important place in the  lexicon of pop music, whether it’s Springsteen eulogising his beloved  New Jersey or Morrissey lamenting the grim realities of life in  Manchester. English dance pop group Metronomy also reference the county  and town that band leader Joe Mount grew up in with their exotically titled  third album “The English Riviera”.</p>\n<p>The  coastal town of Torbay in Devon may not have the glamour and style of  the millionaires playboy paradise of the French Riviera yet Metronomy  have created a whole fantasy world to escape to as their own eccentric  English paradise. Opening track “We Broke Free” sees Mount imploring someone to take a trip round his own personal dream world.</p>\n<p>“So get yourself fixed up<br />\nI’ll take you round town<br />\nI swear you’ll never witness anything quite as fine<br />\nThank God the gold is mine”</p>\n<p>Musically  the album is a treasure trove of subtle pleasures and understated hooks  bursting with imagination. In direct contrast to the indie disco  thrills of previous album “Nights Out”  Mount has re-rooted the group into a self assured art pop group. This  is emphasised by the addition of new members; bassist Gbenga Adelakan  and drummer and vocalist Anna Prior. While the new line up only actually  appear on the record on one track, the beguiling, charming “Corrine”  which sounds like an electro pop version of Fleetwood Mac, it is clear  that this records more organic refined musical style has precipitated  the change to a more musically dexterous line up.</p>\n<p>One thing that  immediately strikes you when listening to this record is how wonderfully  coherent it is and how it flows so well. Nothing ever seems forced or  out of place. The record effortlessly flows from the low slung loping  funk of “She Wants” to the quirky electro sounds of “Some Written” and the exuberant bright pop of “The Bay” which tells of the magical “Endless beaches, that flow on and on” referring back to the albums title.</p>\n<p>Mention must also be made of album highlight “Everything Goes My Way”  a duet between Mount and Veronica Falls singer Roxanne Clifford. A  simple rolling melody carries a gloriously sweet love song, both voices  mixing to melodic perfection. It’s eminently charming and loveable.</p>\n<p>“It feels so good to have you back my love<br />\nI’m in love again”</p>\n<p>Some older fans of Metronomy may feel disappointed when hearing this record, that the dance floor sounds and disco dynamics of “Nights Out”  have been eschewed, but over time they will  be placated by the fact  that Metronomy have made the album of their career. Big, dumb obvious  dance floor electro is all well and good but that would have been the  easy option for Joe Mount to go down. This is a clear  progression and a perfect example of cerebral art pop which establishes  Joe Mounts position as one of the UK’s brightest musical talents.  Mercury prize judges take note.</p>\n","slug":"6962-review-metronomy-the-english-riviera","category":"music","date":1303581742000,"wpid":6962,"isSticky":false,"featured_image":{"width":900,"height":577,"src":"2011/04/metronomy.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAGAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAAAAb/xAAfEAACAgICAwEAAAAAAAAAAAABAgMRAAQFEgYhURP/xAAVAQEBAAAAAAAAAAAAAAAAAAACA//EABgRAQEBAQEAAAAAAAAAAAAAAAECABED/9oADAMBAAIRAxEAPwCC192CXjJOR24pJGacw9e9k2bW2NkivRHzJCTybTLsU1yi2aX8EbqPlk+8Yyl+t0HXEkF4b//Z"},"createdAt":1587294472314,"updatedAt":1588403556730,"author":"5e9b68b27a1236eccfeb1d24","old_image":"2011/04/metronomy.jpg","categories":["music","reviews"]}