{"id":"5e9c34399b6559241525e1c1","title":"Interview: Summer Camp","content":"<p style=\"text-align: center;\">\n<div style=\"text-align: center;\">Initial reports pinned <strong>Summer Camp</strong> as originating from Chicago, while others were insistent they were actually a dreamy Swedish duo posting their Scandinavian born synths on MySpace.</p><p> To add fuel to the fire of speculation, <strong>Summer Camp</strong>‘s use of photos of pre-punk 1970’s teenagers, as seen above, on their MySpace confused listeners even further. However once <strong>Summer Camp</strong> began to attract more attention and critical acclaim for their debut single ‘<strong>Ghost Train</strong>‘, the line up was revealed as London duo <strong>Elizabeth Sankey </strong>and <strong>Jeremy Warmsley. </strong>With this veil of anonymity now lifted you’d be wrong to think that the excitement around <strong>Summer Camp</strong> has died down, as their lo-fi chillwave sound has attracted the attention of many established artists, including <strong>Charles Cave </strong>of <strong>White Lies</strong>. The dreamy vocals of <strong>Elizabeth Sankey</strong> descend over echoing synths, and hypnotise even the least attentive of listeners into a spell which only ends with the last beat of every song. Therefore <strong>Crack In The Road </strong>were delighted when <strong>Elizabeth </strong>and <strong>Jeremy </strong>kindly took the time to answer some of our questions.</div>\n<div style=\"text-align: center;\"><em>CITR: </em>If you had to cite one band/artist as a major influence upon you, who would it be?</div>\n<p style=\"text-align: center;\"><strong>Elizabeth: Jane Wiedlin</strong></p>\n<p style=\"text-align: center;\"><strong>Jeremy: David Byrne </strong></p>\n<p style=\"text-align: center;\"><em>CITR:</em> What has been your favourite gigging experience to date?</p>\n<p style=\"text-align: center;\"><strong>Our shows at the Camden Crawl were great.  The first was playing to a packed crowd (packed for The Drums, not us FTR) at the XFM John Kennedy session.  John Kennedy has amazing shoes that were probably given to him by angels, and despite his vestal trainers he’s still a modest and lovely man.  Then at midnight we played The Jazz Cafe, which was awesome, although Elizabeth spent a lot of the set head banging and her neck still hasn’t quite recovered. At one point Jeremy was playing guitar on his knees and couldn’t work out how to get back up.  Amazing.</strong></p>\n<p style=\"text-align: center;\"><em>CITR: </em>There was a great deal of secrecy over ‘Summer Camp’, with many of your publication shots consisting of 1970’s pre punk teenagers. What was the reasoning behind this initial veil of anonymity?</p>\n<p style=\"text-align: center;\"><strong>Well, when we created the MySpace we never expected anyone else would hear it, so we wrote loads of nonsense (lies) about being Swedish and didn’t want to put any photos of ourselves up there. We have a very large collection of vintage photos that we’ve collected over the years, so we uploaded some of them. Hand on heart we never thought anyone would stumble across the one song we had up there, but they did, and now the majority of Sweden probably thinks we’re hateful liars.</strong></p>\n<p style=\"text-align: center;\"><em>CITR:</em> Now that this veil has been lifted, could you enlighten us to how ‘Summer Camp’ originally came into existence?</p>\n<p style=\"text-align: center;\"><strong>We just recorded the cover when we had one weekend free.  It was a Flamingos song that Elizabeth had put onto a mix for Jeremy and we just thought it would be fun to do.  We weren’t even planning on putting it online, but then did on a whim with a MySpace that didn’t say anything about who we were.  This wasn’t a marketing ploy but came from a genuine fear people we knew would somehow find it and mock us. We told no one. Half an hour later we were blogged about on music blog Transparent by THE Sahil Varma. Weird.</strong></p>\n<p style=\"text-align: center;\"><em>CITR: </em>You have been tipped by Charles Cave from ‘White Lies’ as a ‘sure-fire win’ for 2010 due to your ‘shimmering synths, dreamy production and floaty melodies’. Is this a fair assessment of your sound? How would you describe your sound yourselves?</p>\n<p style=\"text-align: center;\"><strong>It’s a very kind assessment, and he’s a pretty wise man so we’d like it to be true.  It’s so hard to describe your own sound; it’s like describing how you cough (OK it’s nothing like that but this is just a really hard question to answer).  We’ll go with twisted pop.</strong></p>\n<p style=\"text-align: center;\"><em>CITR: </em>You have recently released your debut single ‘Ghost Train’, when can we expect to hear what will surely be a beautifully crafted album?</p>\n<p style=\"text-align: center;\"><strong>We have no idea.  We’re writing constantly at the moment, so hopefully there is an album in there somewhere.  We don’t want to leave it too long between our releases (that’s what she said) but we also want the next thing we put out to be perfect.  We’re very anally retentive when it comes to our output (that’s also what she said).  So we’ll say 2020, just to be safe.</strong></p>\n<p style=\"text-align: center;\"><em>CITR: </em>PC or Mac?</p>\n<p style=\"text-align: center;\"><strong>We’re both PCs. </strong></p>\n<p style=\"text-align: center;\"><em>CITR: </em>If you could have any super power, what would it be and why?</p>\n<p style=\"text-align: center;\"><strong>Elizabeth: Flying.  I always waver between flying and invisibility, but with invisibility my moral compass might be pushed completely out of whack, and I’d find myself breaking into banks or something.</strong></p>\n<p style=\"text-align: center;\"><strong>Jeremy: I’d like to be able to catch bullets in my mouth and then spit them back like a machine-gun, like Son-Goku on Dragonball. Good party trick.</strong></p>\n<p style=\"text-align: center;\"><strong><span style=\"font-weight: normal;\"><a href=\"https://www.myspace.com/summercampmusic\" target=\"_blank\">Check out Summer Camp’s MySpace!</a></span></strong></p>\n<p><iframe src=\"https://www.facebook.com/plugins/likebox.php?id=114090381951328&width=292&connections=10&stream=false&header=false&height=255\" scrolling=\"no\" frameborder=\"0\" style=\"border:none; overflow:hidden; width:292px; height:255px;\" allowTransparency=\"true\"></iframe></p>\n","slug":"699-5-minutes-with-summer-camp","category":"interviews","date":1273400940000,"wpid":699,"isSticky":false,"featured_image":{"width":326,"height":400,"src":"2010/05/summercamp2.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAANAAoDASIAAhEBAxEB/8QAFwAAAwEAAAAAAAAAAAAAAAAAAgMFBv/EACYQAAIBAwIEBwAAAAAAAAAAAAECAwQFIQARBhITMRYiJUFRYnH/xAAVAQEBAAAAAAAAAAAAAAAAAAADBf/EABoRAQACAwEAAAAAAAAAAAAAAAIBIQAD8PH/2gAMAwEAAhEDEQA/AG1N8rr7PLa7nULBFCqSHoy+XHtu225ycd9xrKPwy8btGl/ogqnlHqEowPzGgr4aaSsuh6TdOKaNijMDzgup2J2wMnt86tm72wknw9RZ+7aHaaiTXkZUGslSV15//9k="},"createdAt":1587295289705,"updatedAt":1588403568082,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2010/05/summercamp2.jpg","categories":["interviews","music"]}