{"id":"5e9c30fd9b6559241525dc69","artists":["5e9b69377a1236eccfeb2472"],"title":"Weekly Discography Guide: R.E.M.","content":"<p>Whenever I think of R.</p><p>E.M.’s musical career, I automatically split it into three sections, the I.R.S. years, the middle bit, and post-Berry. Catchy tags, I know.</p>\n<p>The imaginatively titled middle bit consists of five albums, released between R.E.M. signing to Warner and the departure of drummer Bill Berry for personal reasons, generally considered to be closely linked to his on-stage collapse due to a brain aneurysm. If you haven’t given R.E.M. much of a listen before, I’d recommend starting with these albums, particularly Out Of Time and Automatic For The People.</p>\n<p><img class=\"size-thumbnail wp-image-7065 alignleft\" src=\"https://api.crackintheroad.com/uploads/2011/04/Green_REM-188x188.jpg\" alt=\"\" width=\"120\" height=\"120\" />To judge by the singles, Green is rather jangly and poppy, but Green as an album is far more balanced, with infectious up-tempo songs like Stand and Pop Song ’89 finding balance with tracks like the dark World Leader Pretend, the dreamlike You Are The Everything, and the scintillating guitar and vocal harmonics of The Wrong Child. Sublime to a degree that earlier R.E.M. never quite attained, Green was the most coherent record yet released by R.E.M.. Check out Pop Song ’89, World Leader Pretend, and Orange Crush.</p>\n<p><img class=\"alignright size-thumbnail wp-image-7070\" src=\"https://api.crackintheroad.com/images/2011/04/Out_Of_Time_REM-188x188.jpg\" alt=\"\" width=\"120\" height=\"120\" />If I was allowed to I would write an essay on every song on Out Of Time here, it’s my favourite R.E.M. album and one of my all-time favourite albums to boot. The album oozes with easy confidence, every track flows into the next beautifully, and the musical landscape is arguably the richest on any R.E.M. record. Out Of Time captures everything I love about alternative rock and R.E.M., a great album to start with. Check out the gorgeous intertwining vocal harmonies of Belong, the Americana wanderlust of Texarkana, and the pleading bitter-sweet finale Me In Honey.</p>\n<p><img class=\"alignleft size-thumbnail wp-image-7081\" src=\"https://api.crackintheroad.com/images/2011/04/Automatic_For_The_People_REM-188x188.jpg\" alt=\"\" width=\"120\" height=\"120\" />Automatic For The People probably needs no introduction, but if you’re like me and subconsciously avoid checking out the sort of albums that always turn up in the top 10 greatest albums lists, allow me to put you off listening to Automatic For The People a little more. Widely considered the pinnacle of R.E.M.’s career, Automatic For The People is dark, morbid, and sheer brilliance. Lyrically some of Stipe’s most accomplished work, there is little worth saying about Automatic For The People that listening through it won’t say a thousand times better. Check out Drive, Sweetness Follows, Nightswimming, and Find The River.</p>\n<p><img class=\"alignright size-thumbnail wp-image-7085\" src=\"https://api.crackintheroad.com/images/2011/04/Monster_REM-188x188.jpg\" alt=\"\" width=\"120\" height=\"120\" />Moving away from the slower-paced, more acoustically based previous albums, Monster is loud and guitar-driven, and heralds a move away from the college/alternative rock sound that becomes more apparent in future releases. Despite the more mainstream rock sound, the lyrics retain a particular alternative rock vibe to them. Let Me In and Bang And Blame stand out as poignant musical tributes to Kurt Cobain and River Phoenix respectively. Check out What’s The Frequency, Kenneth?, King Of Comedy and Let Me In.</p>\n<img class=\"alignleft size-thumbnail wp-image-7089\" src=\"https://api.crackintheroad.com/images/2011/04/New_Adventures_In_Hi_Fi_REM-188x188.jpg\" alt=\"\" width=\"120\" height=\"120\" />\n<p>New Adventures In Hi-Fi was recorded during and after the tour for Monster, and mixes the country feel of Out Of Time with the rockier feel of Monster. Less structured as an album than previous work, at this point I feel that R.E.M.’s albums often fail to find a focal point, feeling more like a collection of songs than an album. Check out E-Bow The Letter, which features the gorgeous vocals of Patti Smith, Leave, and Be Mine.</p>\n<p>During the I.R.S. years, R.E.M. gradually built a huge cult following based on their subdued melodic rock. Since the huge success of albums such as Automatic For The People and Monster, a lot of R.E.M.’s early work has been sadly over-looked, but if you’ve listened to a couple of the classic albums and want to check out more R.E.M., you’re probably better off starting with the early work than with more recent material.</p>\n<p>Key to the early work is Mike Stipe’s characteristic mumbling of poetic lyrics, combined with minimal melodic acoustic guitar led instrumentation. A strong focus on political and environmental is present through much of the early work. A Best Of R.E.M. was released by I.R.S. shortly after the release of Out Of Time, and provides an excellent starting point for listening to earlier R.E.M.. Check out Talk About The Passion, I Believe, The One I Love, and Cuyahoga.</p>\n<p>If you’ve read <a href=\"https://admin.crackintheroad.com/music/5434-review-r-e-m-collapse-into-now\">my review</a> of R.E.M.’s latest effort, my general opinion of later R.E.M. should be fairly clear. There’s some great material among the later releases, but a lot of poor and unnecessary material creeps in, and the band’s ability to produce a tight and coherent album seems to gradually slip away from them. As such, I don’t feel it particularly worth commenting on each albums individual character, but as a brief track suggestion to get a feel for the albums, check out:</p>\n<p>From Up: At my most Beautiful, Why Not Smile, and Daysleeper.</p>\n<p>From Reveal: Imitation Of Life, I’ll Take The Rain, She Just Wants To Be.</p>\n<p>From Around The Sun: I Wanted To Be Wrong, Leaving New York, Wanderlust</p>\n<p>From Accelerate: Supernatural Superserious, Until The Day Is Done, Hollow Man</p>\n<p>From Collapse Into Now: Walk It Back, Mine Smell Like Honey, Blue.</p>\n<p>In terms of rarities and live albums, there’s a fair amount available. R.E.M. Live features mostly later R.E.M. material, whereas Live At The Olympia boasts an excellent blend of material from all periods. Dead Letter Office collects early rarities together, and <a href=\"https://onlineathens.com/rem-hall/jukebox.shtml\">https://onlineathens.com/rem-hall/jukebox.shtml</a> adds a fair amount more to that era, although there is currently no collection of later R.E.M. rarities. A wealth of video recordings are available, I would personally recommend Perfect Square, although the amount of footage on YouTube may discourage all but the keenest fan from actually purchasing the video albums.</p>\n<p>For further listening, check out The Beach Boys, Eels, and Billy Bragg.</p>\n","slug":"7059-weekly-discography-guide-r-e-m","category":"music","date":1303826139000,"wpid":7059,"isSticky":false,"featured_image":{"width":900,"height":451,"src":"2011/04/rem.png","placeholder":"data:image/jpeg;base64, iVBORw0KGgoAAAANSUhEUgAAAAoAAAAFCAIAAADzBuo/AAAACXBIWXMAAA7DAAAOwwHHb6hkAAAApklEQVR4nAGbAGT/AP//9MPDu19fW56emYKCfX5+eG5uaaamoP//9uvq4AD7/PKwsauBgX1vb2uVlpCys61qamWFhX+io5zZ2dAA5OTcTU1JZmZjQ0I/QEA8o6SecHBrVlZSZWVgZGRfAJiZk0NDPxcWFE1MSXNzb05OS4iJgrS0rdDRyW9wawCAf3dRUExnZmIzMi8kIyEvLyzGx77U1Mzf39fZ2dC2MU+Hureg0wAAAABJRU5ErkJggg=="},"createdAt":1587294461898,"updatedAt":1588403556541,"author":"5e9b68b27a1236eccfeb1d35","old_image":"2011/04/rem.png","categories":["music"]}