{"id":"5e9c30f19b6559241525dc4d","artists":["5e9b693e7a1236eccfeb24f6"],"title":"Live Review: Seams","content":"<p><a rel=\"attachment wp-att-7195\" href=\"https://admin.</p><p>crackintheroad.com/music/7194-live-review-seams/attachment/71588_152974091410525_141176365923631_240376_5764145_n\"><img class=\"alignnone size-650home wp-image-7195\" title=\"71588_152974091410525_141176365923631_240376_5764145_n\" src=\"https://api.crackintheroad.com/uploads/2011/04/71588_152974091410525_141176365923631_240376_5764145_n-650x487.jpg\" alt=\"\" width=\"650\" height=\"487\" /></a></p>\n<p>Going to as many gigs as I go to around the UK, in particular Scotland, memorable nights listening to live music seem to be sparse. I always feel obliged to dissect and judge each band or artist in my head even if I am not intending to do a review on it; thus taking from the experience and performance which I am sure is at least adequate. However, I always manage to take time off from almost feeling like I am at work when I go and see a particular band, <strong>Seams</strong><em>, </em>who I first heard when judging a recent battle of the bands contest. At between 16-18 years old they have achieved almost a veteran status across the East of Scotland playing as many gigs and trawling through as many dingy bars as bands twice their age in an attempt to bring their music to the masses. Each member, whilst most still at school doing their Highers (or A levels to the English readers), is always willing to practise, write music and gel with each other whilst at the same age I was hanging around the streets kicking pebbles into manholes. Taking a step back from what has become an entirely saturated indie-pop market to produce the most gloriously intricate and mastered songs, <strong>Seams</strong> have the raw talent I have not ever seen before or since. Although the standard set up of two guitars, bass, drums and the occasional dink of a xylophone; the vocals eclipse that of other young women who are prompted and pushed to stage school in the hopes of an x-factor career. Also, the guitars compliment one another as if they were songbirds chirping to each other across the stage, the bassist (being the oldest and most experienced in the group) guides the songs with well executed chords and the drummer looks as though he was born sitting on a stool with a bass pedal at his feet. Every one a born musician and if I saw them performing at festivals across the UK in the next few years I would be the first queuing up to buy a ticket.</p>\n<p> Their details are in links below so see why this <em>is </em>going to be the start of something great for this highly deserving group of musicians.</p>\n<p>Seams Facebook Available <a href=\"https://www.facebook.com/#!/pages/Seams/141176365923631\">here</a></p>\n<p>Seams Myspace Available <a href=\"https://www.myspace.com/seamsuk\">here</a></p>\n","slug":"7194-live-review-seams","category":"music","date":1304170686000,"wpid":7194,"isSticky":false,"featured_image":{"width":720,"height":540,"src":"2011/04/71588_152974091410525_141176365923631_240376_5764145_n.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAQH/8QAIhAAAQIGAgMBAAAAAAAAAAAAAQIDAAQFERIhBjEiI0FC/8QAFQEBAQAAAAAAAAAAAAAAAAAAAwT/xAAZEQEBAAMBAAAAAAAAAAAAAAACAQADITH/2gAMAwEAAhEDEQA/AMRppo9HamppC3ajNNEOMh1kIZcKSLZC5NtnX3HfcXp4zUXkhxHJpeXSvyDOL3rB/Ok211rUIQCShnct06w25Z5n/9k="},"createdAt":1587294449256,"updatedAt":1588403556302,"author":"5e9b68b27a1236eccfeb1d07","old_image":"2011/04/71588_152974091410525_141176365923631_240376_5764145_n.jpg","categories":["music","reviews"]}