{"id":"5e9c30ea9b6559241525dc43","artists":["5e9b69517a1236eccfeb261f"],"title":"Review: The Middle East – I Want That You Are Always Happy","content":"<p><a rel=\"attachment wp-att-7240\" href=\"https://admin.</p><p>crackintheroad.com/music/7211-review-the-middle-east-i-want-that-you-are-always-happy/attachment/themiddleeast\"><img class=\"alignnone size-900wide wp-image-7240\" title=\"themiddleeast\" src=\"https://api.crackintheroad.com/uploads/2011/05/themiddleeast-900x432.jpg\" alt=\"\" width=\"900\" height=\"432\" /></a>There’s no doubting it; love (or lack there of) is very much the main inspiration behind a vast majority of music. Whether it be wallowing in the caliginous depths of despair, or reveling in the elation of scarcely found requited adoration. Thus, the album title of Australian group The Middle East’s second full length record, gives more than a clue as to it’s content.</p>\n<p>I Want That You Are Always Happy has been over three years and numerous line up changes and a bizarre reformation in the making; the record was released to critical acclaim earlier this month. After witnessing them perform at several festivals around Europe over the past three or four years, I can comprehensively say that they are undoubtedly bewitching as a live act, yet strangely their recorded output has been somewhat shakey.</p>\n<p>As if to throw off any pre-conceptions about their largely acoustically based music, album opener Black Death 1349 sees The Middle East debuting a far more experienced, bolder sound from The Middle East. Merging straight into the hauntingly fragile My Grandmother Was Pearl Hall, a track so perfect with it’s vocal delivery and instrumental sections, that it’s a grievance to hear it end. It’s intimidatingly personal, whilst remaining distantly moving, a simply stunning piece of music.</p>\n<p>Jesus Came To My Birthday Party seals the change of direction that The Middle East have taken, a twee indie number, complete with adorable female vocals and a jagged hook. It tells you everything you need to know about this record that on release it shot straight towards the top of the charts in Australia, a feat they never would have dreamed of in 2008 with the release of their self titled debut.</p>\n<p>The influences are obvious yet all picked up and remoulded into their own form; there’s the folk inspired Land Of The Bloody Unknown, a track humbling in it’s honesty and integrity. Whilst the lo-fi sound may be a treasure of the past, it’s by no means not an still present, particularly in the fragile vocals and the intimate recording techniques. The instrumental Sydney To Newcastle plays upon this theme, sampling everyday train station noises, accompanied by an elegant piano.</p>\n<p>Despite all my previous praise, I Want That You Are Always Happy is not an album clear of blemishes. Mount Morgan is a queer mutilation of their sound, which falls someway wayward of being interestingly creative, and ends up rather grating. Months ups the standard again, a unoffensive acoustic number, however isn’t as emotionally stirring as the tracks that came before. It’s still no chart topping pop masterpiece, yet it’s not intended to be; with Dan’s Silverleaf, a track sure to soundtrack an American sitcom at some point, being the closest they come to recording a mainstream success.</p>\n<p>Intense thought has clearly gone in the tracklist ordering, with Deep Water, one of the records finest moments, filling the penultimate spot on the album. A sensual ten minute affair, led by a remorsefully played acoustic guitar and Jordan Ireland’s subtle vocals. It’s as much Bob Dylan as it is comparable to their previous work. There are touches of bygone Americana strewn amongst the gems hidden on this record, with the latter mentioned track being a fitting example. Countless religious references, all encompassing landscapes and a heavenly love form a measurable sector of the lyrical content, a trait that maybe begins to tire as the record runs it’s hour long course.</p>\n<p>Whilst I Want That You Are Always Happy sees a side to The Middle East that is new to us, it’s desirably welcome and stunning in parts. The likes of Deep Water and My Grandmother Was Pearl Hall in particular stand out as expert examples of combining previous influences with a bolder, more reasoned sound. It’s thoughtful, inspirationally open and, with the exception of two or three tracks, a seamless listen.</p>\n","slug":"7211-review-the-middle-east-i-want-that-you-are-always-happy","category":"music","date":1304276866000,"wpid":7211,"isSticky":false,"featured_image":{"width":188,"height":188,"src":"2011/05/themiddleeast-188x188.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFwAAAwEAAAAAAAAAAAAAAAAABQYHCP/EACMQAQACAQQBBAMAAAAAAAAAAAECAwQABREhBwYSInETMWH/xAAUAQEAAAAAAAAAAAAAAAAAAAAA/8QAFBEBAAAAAAAAAAAAAAAAAAAAAP/aAAwDAQACEQMRAD8Aoe7+bcDbdmlfhYuRuubLInxT7o1wjAnwhMOFOQOu1OXRDF81bFdi02W0ZNNk4EpVyO4Kdxfr9az36EDJ2Dc5ZB+WUc6xi2fJPgvXP9B+w0sN9qq22K9qydB//9k="},"createdAt":1587294442777,"updatedAt":1588443778450,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/05/themiddleeast-188x188.jpg","categories":["music","reviews"]}