{"id":"5e9c30df9b6559241525dc32","title":"Anna Calvi @ Live At Leeds","content":"<p><a rel=\"attachment wp-att-7444\" href=\"https://admin.</p><p>crackintheroad.com/music/7334-anna-calvi-live-at-leeds/attachment/anna-calvi\"><img class=\"aligncenter size-full wp-image-7444\" title=\"anna-calvi\" src=\"https://api.crackintheroad.com/uploads/2011/05/anna-calvi.jpg\" alt=\"\" width=\"650\" height=\"444\" srcset=\"https://api.crackintheroad.com/images/2011/05/anna-calvi.jpg 650w, https://api.crackintheroad.com/images/2011/05/anna-calvi-260x177.jpg 260w, https://api.crackintheroad.com/images/2011/05/anna-calvi-640x437.jpg 640w, https://api.crackintheroad.com/images/2011/05/anna-calvi-165x112.jpg 165w\" sizes=\"(max-width: 650px) 100vw, 650px\" /></a></p>\n<p>In the haunting setting of Holy Trinity Church, Anna Calvi delivered a perfect set to close another hugely successful Live At Leeds festival.  As a fully functioning church, the part-time venue offered an incredibly fresh musical experience, with the echoing acoustics matching perfectly with the vocal decadence of Calvi’s set.  I’ll admit to being originally drawn to the show by the hype surrounding the Londoner, along with the daunting queues for Aloe Blacc at The Faversham, but it couldn’t have been a better decision with the dreamy, Jim Morrison meditation of ‘Rider To The Sea’ signifying the start of something spectacular.</p>\n<p>Drawing on her self-titled debut album, Calvi revels in the tension of the theatrical and the intimate, juxtaposing her powerful, operatic voice with the sensual tenderness of tracks like ‘No More Words’, which owes more to Brigitte Bardot than PJ Harvey.  It is impossible to emphasise the hypnotic magnificence of her voice live, which leaves the album sounding merely restrained when compared to the guttural roar she has mastered.  From little known Elvis covers to the drama of ‘First We Kiss’, you feel fully part of the performance, and a performance is what it is; there is a hyperbole and wealth to the sound, no doubt benefitted by the church setting, which appropriates the music more to a James Bond soundtrack, with the soaring voice and the apocalyptic drumming.</p>\n<p>With my awareness of the artist based solely in ‘Jezebel’, the eventual encore, I was quite frankly stunned by the show; the venue and vocal mastery combined to create one of those special moments you very rarely experience at a gig, especially having been wandering round Leeds for the best part of twelve hours.</p>\n","slug":"7334-anna-calvi-live-at-leeds","category":"festivals","date":1304430381000,"wpid":7334,"isSticky":false,"featured_image":null,"createdAt":1587294431358,"updatedAt":1588441790815,"author":"5e9b68b27a1236eccfeb1d4c","old_image":"generated/293b0ef88f21279c0220df5e280af540cb1d9c2c.jpg","categories":["festivals","music","reviews"]}