{"id":"5e9c30dd9b6559241525dc2f","title":"Cosmo Jarvis @ Live At Leeds","content":"<p>In the confines of the refurbished Faversham, just off the Leeds Uni campus, a rapturous crowd were treated to a raw, acoustic set from the brilliant Cosmo Jarvis.</p><p>  Playing his first solely acoustic show in two years, with various vague reasons for the lack of backing band, it represented the talents that our music scene can offer even without the deserved exposure.  Cosmo Jarvis is an artist who serves to remind a culture which is so insistent on commoditising music that a musician is a creative, independent person, reflected in his explanations and rare mistakes, all of which added to the party atmosphere.  Though ‘Sure As Hell Not Jesus’ (with it’s controversial video below) has been written for a full band, you couldn’t tell as Cosmo’s vocal range carried the depth of the single.</p>\n<p>Constantly apologising for his performance, the delicacy of ‘Sort Yourself Out’ demonstrated the delicacy of Cosmo’s voice, whilst separating him from mere troubadours such as Frank Turner, whilst retaining the passion.  The delivery was more measured than someone like Turner is live, which is an advert for the perfectionism and attention to detail that has come to mark the artist as more than just a musician, as his production and film-making serve to illustrate.</p>\n<p>With the cheap cider increasingly smelling like a bad idea, the set ended on ‘Gay Pirates’, what else? The anthemic chorus and bizarre subject have garnered the track a surprising yet much deserved coverage, and the baying crowd testified to it’s appeal, every word sung back with alarming accuracy and volume.  Cosmo Jarvis is a name that has been drifting around forever, with his second album on the way this summer, but it is live where he excels, with the lack of his Live Ass band proving to be a blessing to the intimacy afforded by the venue, rather than a crutch.  </p>\n<p><iframe width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/jKB1vQSIfRg?feature=oembed\" frameborder=\"0\" allowfullscreen></iframe></p>\n","slug":"7342-cosmo-jarvis-live-at-leeds","category":"festivals","date":1304432338000,"wpid":7342,"isSticky":false,"featured_image":{"width":188,"height":188,"src":"2011/05/picture-441-188x188.png","placeholder":"data:image/jpeg;base64, iVBORw0KGgoAAAANSUhEUgAAAAoAAAAKCAYAAACNMs+9AAAACXBIWXMAAAsTAAALEwEAmpwYAAABf0lEQVR4nB3OvWvUYADA4XeS5trm4/J1aZImueQuuWtMWlvr9WrF1sEWxQ/oCfWqULsUQaGTrYIUOio4iEOdOoibIOoiFMTFSdDRwclB+y90kF+h+zM8QpUVPMsmjSIsXSeLIopGk6qi4Vg2oeujqhqi7vmcGpCoViRMeRBb12jHIaFjkvoO59KAInIRyrDMZE1nf3mK/fsrPHv6hPlWyGo3Z7GIuTtXcqWMEfV6xsaFLh9ud/i5e4//f3+z2VuiP5PT65xmdW6CXidHfP30hb2dV6yNZXzeWufw4D3blzusdAtudQvunB/nxtk24ujfIX++/+DN89d823vJxwd9+meSE3RtMqU/W7BYNhCPHz7i17u3HKxd58VMi0uxw0KZnLzmWwFXxxMutgKEY5osl20226PcLGIW8ojZxCX3LOq2TtM1yQIHMZ3FTKUR02MNJpKAEaOKpsioqoJh6Iy4HqO+j6iZBkHNwq5qDA0OMSBJSJUK8rBM6EU0gwY13eAY4b2qtHCN1RgAAAAASUVORK5CYII="},"createdAt":1587294429873,"updatedAt":1588443778347,"author":"5e9b68b27a1236eccfeb1d4c","old_image":"2011/05/picture-441-188x188.png","categories":["festivals","music","reviews"]}