{"id":"5e9c30d69b6559241525dc24","title":"Review: Live At Leeds 2011","content":"<p><strong>Live at Leeds </strong>is no mean feat, both for those tireless folk who organise it, and those who trek from venue to venue, catching as many bands as they can in a seemingly never ending line up.</p><p> Celebrating it’s 5th year in existence, <strong>Live at Leeds </strong>produced another day of stellar performances and an entertaining and fun atmosphere, both of which make this festival one of the best urban festivals in the country. I was left with blisters and a cracking hangover, however below is a few of the acts I caught on the day.</p>\n<p><strong>Kong</strong> (Pictured):</p>\n<p>Performing to a packed out <strong>Cockpit</strong>, Manchester based trio <strong>Kong </strong>produced a fantastically bizarre and intense set. Donning what appeared to be their now infamous masks and headgear, Kong burst into their raging crescendos of thrashing guitars and head banging percussion with a huge amount of energy that instantly absorbed the crowd. I’m not normally a fan of heavy rock, but <strong>Kong</strong>‘s incredible attention to the timing of their instrumentation, moving one moment from seeming chaos to a sudden climax in complete sync was truly impressive.</p>\n<p><strong>Club Smith:</strong></p>\n<p>Performing at <strong>The Faversham</strong>, <strong>Club Smith </strong>similarly performed to a packed out audience. You could tell <strong>Club Smith </strong>were performing on home turf, as they took no time to ramp up their anthemic sound to match an audience dramatically warmed to the band throughout their set. The band’s debut single, <strong>No Friend of Mine </strong>was a particular hit amongst the audience, though it is fair to say the band’s whole set was a success, performed with a entertaining amount of energy and honesty.</p>\n<p><strong>Slow Club: </strong></p>\n<p><strong> </strong>As a big <strong>Slow Club </strong>fan, I had been incredibly excited to catch their performance at <strong>Live at Leeds</strong>. The band had recently cancelled a series of dates across the UK due to ‘health problems’, therefore their attendance was just as unexpected as it was bewildering. Despite this, I found myself a good spot and prepared myself for what I expected to be another stunning set. How wrong I was. The band, which only consisted of core duo <strong>Charles Watson </strong>and <strong>Rebecca Taylor</strong>, played a series of new tracks that were whole heartedly depressing and boring. Perhaps the largeness of the venue meant that the intimacy of these tracks were lost, however in direct comparison to the band’s older work, the new tracks sounded weak and empty. All was not lost for <strong>Slow Club</strong>, as when the band performed their older tracks, there was a huge spike in interest and energy in the crowd, who, like I, still enjoy the twee pop wares that <strong>Slow Club </strong>can so masterfully create.</p>\n<p><strong>FILMS:</strong></p>\n<p>According to the nifty guide that we were given, <strong>FILMS </strong>originate from South Carolina, USA. However in reality the only connection <strong>FILMS </strong>appear to have with South Carolina is if they happened to collectively go on holiday there once. Actually hailing from Leeds, <strong>FILMS </strong>had been one of the biggest ‘buzz’ bands of the festival, performing to a crammed <strong>Nation of Shopkeepers</strong>. A relatively low key affair, the band produced a sound that was engaging and infectious, utilising two different vocalists to create a harmony that matched the jangly guitars and touches of keyboard in their upbeat tracks. However I couldn’t help but feel disappointed by <strong>FILMS </strong>performance, as it felt they hadn’t lived up to the occasion. Perhaps they were being deliberately subdued, however the show could have benefited from a performance that matched the energy that is present in their songs. Make sure to check out ‘<strong>Breezeblocks</strong>‘, a track I’ve had on repeat for quite a while.</p>\n<p><strong>James Blake:</strong></p>\n<p>Performing in the largest venue of the day, the <strong>o2 Academy</strong>, <strong>James Blake </strong>had unsurprisingly attracted a large awaiting audience. After seeing <strong>James Blake </strong>perform at a <strong>Warehouse Party </strong>gig a while ago, prior to his album release, I wasn’t sure what to expect from a full band <strong>James Blake </strong>performance. In reality, I was largely disappointed by his performance. Each track washed over without really attracting attention, and making it awfully clear that <strong>Blake</strong>‘s voice is lacking in emotion to truly reach the soulful sound he is trying to achieve live. Moreover, it appeared most people had only arrived to ‘<strong>Limit To You Love</strong>‘, and once this had been met with a predictably massive cheer, many of the audience seemed to lose interest. I’m still a big fan of <strong>Blake</strong>‘s music, however on this occasion his performance was left wanting.</p>\n<p><strong>Little Parades:</strong></p>\n<p>Perhaps the best discovery of ‘new music’ of the day, <strong>Little Parades </strong>only formed towards the end of last year as a five piece. Performing the opening slot at <strong>The Well</strong>, things began a bit haphazardly for the band as they prepared, however this is to be expected of any band when their the first to grace a stage that has just been set up. Once they began, <strong>Little Parades </strong>truly demonstrated the huge amount of potential they posses. Their sound is very ambient, with infusions of synths and bass that create a sense of serenity amongst the falsetto vocals that truly elevate the tracks to an absorbing experience. Still rough around the edges, <strong>Little Parades </strong>are by no means the finished product. However I’m glad their not, as the band has a great deal of potential to develop and blossom into something truly special.</p>\n<p><strong>Milk White White Teeth:</strong></p>\n<p>Another highlight from <strong>The Well</strong>, <strong>Milk White White Teeth </strong>performed an entertaining and composed set that provoked a great response from a packed out audience. Having gone through several changes and modifications, it seems now <strong>Milk White White Teeth </strong>have reached a point in which they are comfortable with themselves and their sound. As the band litter the stage, they are a very interesting entity to watch perform, as they create a sense that their different sounds, ranging from the incessant guitars to the off beat percussion, swirl around to reach a focal point in lead vocalist Jon Crabbe’s serene vocals. Make sure to check out their track ‘<strong>Daughters</strong>‘, which is indeed a very beautiful composition.</p>\n<p>All in all, <strong>Live at Leeds 2011, </strong>while it ruined me, was a raging success that once again presented a vibrant showcase of exciting and very talent acts. Bring on 2012!</p>\n","slug":"7353-review-live-at-leeds-2011","category":"festivals","date":1304616936000,"wpid":7353,"isSticky":false,"featured_image":null,"createdAt":1587294422161,"updatedAt":1588441789381,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2011/05/kong-188x188.jpg","categories":["festivals","music"]}