{"id":"5e9c30da9b6559241525dc2b","artists":["5e9b69517a1236eccfeb2624"],"title":"Review: The Neighborhood – The Neighborhood EP","content":"<p><a rel=\"attachment wp-att-7382\" href=\"https://admin.</p><p>crackintheroad.com/music/7372-review-the-neighborhood-the-neighborhood-ep/attachment/the-neighborhood\"><img class=\"aligncenter size-650home wp-image-7382\" title=\"The Neighborhood\" src=\"https://api.crackintheroad.com/uploads/2011/05/The-Neighborhood--650x609.png\" alt=\"\" width=\"650\" height=\"609\" /></a></p>\n<p>Usually a live keyboardist for indie pop group Hockey, Ryan Dolliver decided to begin trialling his own material; this EP being the product of recording in California. Going under the name The Neighborhood, this self titled release contains six tracks of lo-fi heaven; raw, synth laden and a painstakingly honest sounding. There’s the slightly more up tempo tracks like We Make The Same, coming in somewhere between The Cure and The Drums; the majority of it centered around hazy vocals and a tinkling piano.</p>\n<p>Then there’s one of the EP highlights Drive, a Twin Shadow-esque synth heavy number, gloriously recorded, maintaining a distinctive sound. From Me To You And Back Again continues in a similar vein, down beat but wonderfully composed so as to suck the listener entirely into the track. If anything, the EP opener is slightly misleading as to The Neighborhood’s sound, and the slower, more moving songs such as the aforementioned two, leave far more of an emotional impact. Likewise with my personal favourite, Always Make The Time, a reverb filled beauty, that stays entirely the right side of the line between sickeningly-sweet and invigoratingly wholesome.</p>\n<p>Again, Dolliver returns in more optimistic spirits with Check It, yet it pales in comparison to the previous three tracks that preceded it, never really getting going or being utterly convincing. Yet EP closer I Won’t Get You Down more than makes up for it; three and a half minutes of pop perfection, portraying The Neighborhood’s yearning, regretful tones to a heartbreaking extent. With this self titled EP available at his <a href=\"https://theneighborhood.bandcamp.com/album/the-neighborhood\">bandcamp</a>, and a debut full length release expected later this year, I’m waiting on tenterhooks to hear more from Ryan Dolliver. Check out Always Make The Time, my pick of the bunch from the EP below.</p>\n<p><object classid=\"clsid:d27cdb6e-ae6d-11cf-96b8-444553540000\" width=\"100%\" height=\"81\" codebase=\"https://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=6,0,40,0\"><param name=\"allowscriptaccess\" value=\"always\" /><param name=\"src\" value=\"https://player.soundcloud.com/player.swf?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F12117105\" /><embed type=\"application/x-shockwave-flash\" width=\"100%\" height=\"81\" src=\"https://player.soundcloud.com/player.swf?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F12117105\" allowscriptaccess=\"always\"></embed></object> <span><a href=\"https://soundcloud.com/ryandolliver/the-neighborhood-always-make\">the neighborhood – always make the time</a> by <a href=\"https://soundcloud.com/ryandolliver\">ryandolliver</a></span></p>\n","slug":"7372-review-the-neighborhood-the-neighborhood-ep","category":"music","date":1304527438000,"wpid":7372,"isSticky":false,"featured_image":null,"createdAt":1587294426807,"updatedAt":1588441789409,"author":"5e9b68b27a1236eccfeb1d27","old_image":"generated/7880e6831c1b83030a4c261f46386b04003b0a97.jpg","categories":["music","reviews"]}