{"id":"5e9c30c79b6559241525dc0c","title":"Opinion #1 (JD): Tyler, The Creator – GOBLIN","content":"<p><a rel=\"attachment wp-att-7528\" href=\"https://admin.</p><p>crackintheroad.com/music/7417-review-tyler-the-creator-goblin/attachment/tyler-the-creator-of-ofwgkta-2\"><img class=\"alignnone size-full wp-image-7528\" title=\"Tyler-the-Creator-of-OFWGKTA\" src=\"https://api.crackintheroad.com/uploads/2011/05/Tyler-the-Creator-of-OFWGKTA1.jpg\" alt=\"\" width=\"900\" height=\"600\" srcset=\"https://api.crackintheroad.com/images/2011/05/Tyler-the-Creator-of-OFWGKTA1.jpg 900w, https://api.crackintheroad.com/images/2011/05/Tyler-the-Creator-of-OFWGKTA1-260x173.jpg 260w, https://api.crackintheroad.com/images/2011/05/Tyler-the-Creator-of-OFWGKTA1-640x426.jpg 640w, https://api.crackintheroad.com/images/2011/05/Tyler-the-Creator-of-OFWGKTA1-165x109.jpg 165w\" sizes=\"(max-width: 900px) 100vw, 900px\" /></a></p>\n<p>Tyler Okonma has the world at his feet. Sold out shows in every major city in the world, leader of the most hyped rap collective since Wu Tang and numerous musicians gagging for him to guest star on their tracks. All at the age of twenty. Yes, there’s no denying it, Tyler, The Creator is already an icon in his own right, and this Monday sees the release of GOBLIN, his first official record label LP. However the question still remains; underneath the clutter of magazine articles, excitable blog posts and overzealous live shows, does Tyler have genuine talent?</p>\n<p>By now I’m sure many of you are aware of the Odd Future story, yet for those who aren’t, here is a brief recap. A bunch of LA based angst ridden adolescents, united by their love of music, skateboarding and general joie de vivre, form a rap collective under the cryptically ostentatious title Odd Future Wolf Gang Kill Them All Don’t GIve A Fuck Litter Life Loiter Squad Bacon Boys (OFWGKTA for short). Marshalled by charismatic, loudmouthed frontman Tyler, The Creator, the other ten members of the ‘gang’ include live DJ Syd the Kyd, rapper Hodgy Beats and R’nB star Frank Ocean. Over a dozen albums, several high profile feuds and gallons of bodily fluids later, their colossal steam train of hype is pulling into the station that is mainstream success.</p>\n<p>After announcing towards the end of last year that he had signed a one album deal with XL, 9th May was immediately scribbled in thousands of diaries around the world, for the release of GOBLIN. As those of you who have experienced Tyler’s solo record BASTARD will know, it’s famed for it’s uniquely disjointed style. It’s complex in both musical composition and flow, constantly changing moods, topics and even genres, and with GOBLIN there’s no suggestion that Tyler is about to shake this stereotype. Juggling numerous differing and developed persona’s, shown best on lead single Yonkers, as Tyler proclaims ‘I’m Wolf, Tyler put this fucking knife in my hand, I’m Wolf, Ace gonna put that fucking hole in my head’. Using this track almost as an occasion to let the listener in on the schizophrenic fragments of his mind, all of whom will feature throughout the rest of the LP, as well as a new mindset who will appear later on.</p>\n<img class=\"alignnone\" title=\"GOBLIN\" src=\"https://stupiddope.com/wp-content/uploads/2011/05/Tyler-The-Creator-Goblin-Cover-500x500.png\" alt=\"\" width=\"500\" height=\"500\" />\n<p>Another character who features predominantly throughout BASTARD and GOBLIN is Dr. TC, a psychologist almost acting as a narrator for the records, yet there’s an underlying feeling that he himself may be but a figment of Tyler’s troubled imagination. On Inglorious, the final track of his debut record, we hear Tyler at his weakest and most vulnerable, toying with the concept of suicide, ‘now this counselor is trying to tell me that I’m emo, she don’t give a fuck, D-low where’s the trigger, I’ll let this bullet play hero’. So it’s aptly fitting to hear Dr TC opening GOBLIN reassuringly convincing ‘his patient’; ‘You wouldn’t do that Tyler, kill yourself or anyone’. It’s the first of many appearances from the Doctor on GOBLIN, and it’s pretty much the only constant in this twisted behemoth of a sophomore LP.</p>\n<p>There’s certainly a thematically change that is evident from the opening track, however as Tyler himself pointed out in a recent interview, his life has exploded around him, so there should be no surprise at the song topics also adjusting to match his current circumstances. Also found in abundance from the beginning is the inspiration provided by Eminem’s early work, the angst and psychological situations are startlingly similar. Yonkers is a modern day Way I Am, openly personal, aggressive whilst remaining relatable on some levels. The countless references to rape are gone, replaced with open rants against organised religion and capitalist society, ‘wolves I know you heard of us, we’re murders and young enough to get the fuckin’ priests to come and flirt with us’, jokes Tyler on Tron Cat.</p>\n<p>This is a record born out of frustration, the persona’s which haunt the album showcase various frames of mind that Tyler moves through. On Transylvania there’s Wolf, the violent, sexual predator, ‘Goddamn I love bitches, especially when they only suck dick and wash dishes’ portraying this volatile side to the LA rapper. Although as easy as it was to keep this image up on BASTARD, it comes across far more humorous and tongue-in-cheek on GOBLIN, a perfect example being only seconds later, ‘bitch keeps bringing me garlic, how many times have I got to say I’m allergic’, carefully molded to fit the rhyming sequence. So we’ve already met Tyler, Wolf Haley and Ace, and with GOBLIN brings another persona, in the form of Tron Cat, a clever, wistful criminal, sure to feature on future Tyler, The Creator tracks.</p>\n<p>An obvious and welcome difference to this album is the honest and lovestruck Tyler, who features on LP highlight Analog, which takes his music in an R’n’B infused direction. Also making an appearance on Her, a blunt and heartwarming narrative, in which Tyler loses out on love, not a concept he has experimented with before. These tracks are still a long way from being chart suitable, both in sound and themes, yet it’s a testament as to the songwriting talent that Odd Future possess. Frank Ocean appears on several tracks, including his stunning chorus section on She, a track about stalking made wonderfully elegant.</p>\n<p>My main criticism of BASTARD was the similarity amongst some of the musical compositions, which is all but extinguished on GOBLIN. Yonkers showcases one of the most innovative beats in memory, whilst Sandwitches is set to tear apart festivals across the world this summer with it’s punk inspired origins. Another of the stronger tracks Radicals features one of the numerous OFWGKTA ‘slogans’, in ‘Kill People Burn Shit Fuck School’, which coming from anyone else would appear contrived or hugely offensive.</p>\n<p>On my first few listens I struggled with the disjointed feeling that the entire record houses, although with further listens I began to accept that it’s merely a revealing insight into the genius mind of Tyler. Despite all the hype and money thrown at Odd Future, they have remained entirely true to their roots, with no guest appearances from anyone other than ‘gang’ members. It’s offensive, raw, jagged and beautifully fragile in equal measures, all of which allow GOBLIN to support the progression of Tyler, The Creators career, one which is sure to be highly successful and creatively productive.</p>\n<p><a href=\"https://admin.crackintheroad.com/music/7544-opinion-2-jc-tyler-the-creator-%E2%80%93-goblin\">Joel wasn’t quite as keen on GOBLIN…</a></p>\n","slug":"7417-review-tyler-the-creator-goblin","category":"music","date":1304878081000,"wpid":7417,"isSticky":false,"featured_image":null,"createdAt":1587294407705,"updatedAt":1588441789288,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/05/tyler-the-creator-of-ofwgkta1-292x50.jpg","categories":["music","reviews"]}