{"id":"5e9c30c99b6559241525dc0d","title":"Live Review: Grandfather Birds, Let’s Buy Happiness & Baskin’s Wish (Newcastle)","content":"<p><a href=\"https://admin.</p><p>crackintheroad.com/music/7466-live-review-grandfather-birds-lets-buy-happiness-baskins-wish-newcastle/attachment/grandfatherbirds\" rel=\"attachment wp-att-7699\"><img src=\"https://api.crackintheroad.com/uploads/2011/05/GrandfatherBirds.jpg\" alt=\"\" title=\"GrandfatherBirds\" width=\"900\" height=\"463\" class=\"aligncenter size-full wp-image-7699\" srcset=\"https://api.crackintheroad.com/images/2011/05/GrandfatherBirds.jpg 900w, https://api.crackintheroad.com/images/2011/05/GrandfatherBirds-260x133.jpg 260w, https://api.crackintheroad.com/images/2011/05/GrandfatherBirds-640x329.jpg 640w, https://api.crackintheroad.com/images/2011/05/GrandfatherBirds-165x84.jpg 165w\" sizes=\"(max-width: 900px) 100vw, 900px\" /></a></p>\n<p>Before starting this review I’ll admit that I’m not by any means profoundly knowledgeable when it comes to the music scene in the North East, despite having lived here for the past eighteen years. However, I was reliably informed that these three bands are all key ingredients to the vibrant local music scene. I had also never been to the infamous venue that is the Bridge Hotel, 5 minutes walk from Central Station, yet far enough out the way to avoid it becoming full of ‘lads’ on nights out and women in the middle of hen parties. Tucked away up a narrow flight of the stairs, the venue itself was a hastily converted function room, however was none the less comfortable and desirably intimate.</p>\n<p>Baskin’s Wish</p>\n<p>Taking to the stage first to a rapidly growing crowd, and appearing rather timid which was understandable in such circumstances. However any nerves were quickly shaken off as they launched into a stellar set of Pavement inspired indie-pop tunes. The likes of Bill Murray Is Funny, But I’m Still Sad and You Had Me At Areet being particular highlights, coming in somewhere between The Cribs and Surfer Blood. My main criticism being that the complexity of their lyrics at times, left quite a bit to be desired, especially Growing Pains, ‘once we were young, but now we are old’, the prime offender of this crime. For a band who play relatively few live shows, Baskin’s Wish were enjoyably self assured and set highlight Everybody Do The Panda Swim perfectly showcased the energetic, invigorating and all too real side to the band which, on the whole, made their performance so entertaining. </p>\n<p>Let’s Buy Happiness</p>\n<p>This quirky five piece are one of the ‘buzz’ bands from the North East at the moment, and with this performance it’s not difficult to see why. Their twee inspired pop made for an engaging performance, with the likes of recent single Fast Fast, and 2010’s release Six Wolves standing out from a strong set. Asides from the music, lead singer Sarah Hall is a dead-cert to be a future indie pin-up girl with her devilish good looks and heart-meltingly charming stage persona, whilst the rest of the band (all males) aren’t too shabby either, with their unique sense of style and immaculate etiquette. With performances set for Radio 1’s big weekend, Great Escape Festival, plus numerous other live dates over the summer, Let’s Buy Happiness have a bright and exciting future ahead of them.</p>\n<p>Grandfather Birds</p>\n<p>With the lights dimmed and a sideshow of flickering images of Newcastle projected onto the wall behind the stage, Grandfather Birds stepped out to a now eagerly waiting, packed out crowd. Making the most of the intimate settings by conversing heavily with fans throughout the set, yet still taking it seriously enough to put in a tight and atmospheric performance. The likes of last year’s single The Woods and recent B-side She Likes It On The Left showing a fragile but self-assured side to the group. However the highlight of the evening was undoubtedly Higher Bridges, their fantastic new single which was performed with confidence and sincerity, striking a chord with the crowd whom are were all too familiar with the songs inspirations. It may still be a while before these three bands are recognised throughout the rest of the UK, however from these three performances, it’s merely a question of when, not if.</p>\n","slug":"7466-live-review-grandfather-birds-lets-buy-happiness-baskins-wish-newcastle","category":"music","date":1304859579000,"wpid":7466,"isSticky":false,"featured_image":null,"createdAt":1587294409294,"updatedAt":1588441789313,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/05/grandfatherbirds-292x50.jpg","categories":["music","reviews"]}