{"id":"5e9c30c49b6559241525dc08","title":"Opinion #2 (JC): Tyler, The Creator – Goblin","content":"<p><a rel=\"attachment wp-att-7545\" href=\"https://admin.</p><p>crackintheroad.com/music/7544-opinion-2-jc-tyler-the-creator-%e2%80%93-goblin/attachment/tyler-the-creator2\"><img class=\"aligncenter size-full wp-image-7545\" title=\"TYLER-THE-CREATOR2\" src=\"https://api.crackintheroad.com/uploads/2011/05/TYLER-THE-CREATOR2.jpg\" alt=\"\" width=\"900\" height=\"540\" srcset=\"https://api.crackintheroad.com/images/2011/05/TYLER-THE-CREATOR2.jpg 900w, https://api.crackintheroad.com/images/2011/05/TYLER-THE-CREATOR2-260x155.jpg 260w, https://api.crackintheroad.com/images/2011/05/TYLER-THE-CREATOR2-640x384.jpg 640w, https://api.crackintheroad.com/images/2011/05/TYLER-THE-CREATOR2-165x99.jpg 165w\" sizes=\"(max-width: 900px) 100vw, 900px\" /></a></p>\n<p>By now you’ll have heard <em>Goblin</em>. Jesus, by now your fucking mum will have heard <em>Goblin</em>. Perhaps without intending to <strong>Tyler, The Creator</strong>, leader of oddball L.A rap crew/gang/collective<strong> OFWGKTA</strong>, has given birth to a musical movement that has no intention of slowing down anytime soon. The bucket load of hype dumped on Tyler is by no means undeserved; his 2009 release <em>Bastard</em> gave modern day hip-hop a much-needed kick in the balls. It was obnoxious, insulting, mismatched, inconsistent and at times utterly perfect. So why, I repeat WHY, is <em>Goblin</em> such an insultingly bad LP?</p>\n<p>The problems, and believe me there are problems, are fundamentally linked to the records ambition. It tries to do everything at once. Tyler tries desperately to make you feel every emotion a human is physically capable of. From the feeble attempt to continue the therapist narrative strand from bastard, to his pitiful attempts to shock and disturb, the record is ultimately mismatched. If he’d picked a clear style or theme perhaps this would have been the masterpiece we all wanted, but instead all we get is an album that asks us to ‘swag out’ and then be enthralled in a supposedly clever schizophrenia plot strand.</p>\n<p>Regardless of the LP’s disjointed narrative strand, Tyler is an interesting guy, after all that’s why you’re reading this in the first place. Sadly it might as well be Steve Harvey rapping, because Tyler spends the whole record bitching, and not in a good way. Tyler if you’re reading this: I don’t care about blogs who hate on you, how difficult it is dealing with fame and I certainly don’t care about some article that was written about you months ago that 90% of your listeners won’t have read anyway. It’s all so self involved, with the self we’re staring in at coming across as self-obsessed and deluded. Title track ‘<em>Goblin</em>’ as an example sounds like a badly written diary parody, there’s just nothing new or exciting being said. Now and again we’re given something that’s free from the drama and bullshit, his frustration at missing his best friend <strong>Earl </strong>and not seeing his mum enough on track ‘<em>Golden</em>’ genuinely pulls at the heartstrings. But that’s 2 lines in an album that’s over an hour long.</p>\n<p>At times it’s plain awful. <em>Bitch Suck Dick</em> is insultingly bad; the flows are poorly rapped with derivative and boring lyrics being the final nail in the coffin. Talk about fucking bitches by all means, I can get on that shit but please at least try to be clever while you’re doing it. Now and again we’re jolted back to Tyler’s schizophrenia plot strand, a plot strand even Tyler seems to get bored of. It’s embarrassing to watch him attempt to make the idea work; you’ll be laughing by the time the ‘twist’ is revealed in <em>Window</em>. Spoilers: the therapist turns out to be Tyler the whole time, yes Tyler that’s how schizophrenia stories work, that isn’t a fucking twist.</p>\n<p>Now and again we are reminded of why we’re listening, tracks like <em>Radicals, Yonkers</em> and <em>Sandwiches</em> are great examples of LP’s potential, but again nowhere near enough for an album of this sort of length.</p>\n<p>Out of all this LP flaws, its beat production is the worst. If you asked your mum to produce beats in the style of ‘swag as fuck L.A rap’, she’d probably come up with something that’s at least easier on the ears. Maybe he should collaborate with his mum? After all he did say he doesn’t see her enough. Just a thought. Every beat hangs there, does nothing and then leaves. Every synth tone sounds cheap and tinny, the result is a set of beats that sound amateurish and lazy.</p>\n<p>I wanted to like Goblin I really did. When it leaked earlier this week my heart skipped a beat, so it’s sad that this album turned out to be one of the biggest disappointments I’ve ever felt on an albums release. It’s self obsessed, badly produced, boringly written and lacks the attitude I was seduced by back in 2010. If only.</p>\n<p><a href=\"https://admin.crackintheroad.com/music/7417-review-tyler-the-creator-goblin\">Josh liked GOBLIN slightly more…</a></p>\n","slug":"7544-opinion-2-jc-tyler-the-creator-goblin","category":"music","date":1304884938000,"wpid":7544,"isSticky":false,"featured_image":null,"createdAt":1587294404683,"updatedAt":1588441789260,"author":"5e9b68b27a1236eccfeb1d24","old_image":"2011/05/tyler-the-creator2-188x188.jpg","categories":["music","reviews"]}