{"id":"5e9c30be9b6559241525dbff","artists":["5e9b68ec7a1236eccfeb1ffa"],"title":"Review: EMA – Past Life Martyred Saints","content":"<p><a rel=\"attachment wp-att-7810\" href=\"https://admin.</p><p>crackintheroad.com/music/7606-review-ema-past-life-martyred-saints/attachment/ema-thegreyshipsb_wkindheart-22632-2\"><img class=\"aligncenter size-full wp-image-7810\" title=\"ema-thegreyshipsb_wkindheart-22632\" src=\"https://api.crackintheroad.com/uploads/2011/05/ema-thegreyshipsb_wkindheart-226321.jpg\" alt=\"\" width=\"900\" height=\"675\" srcset=\"https://api.crackintheroad.com/images/2011/05/ema-thegreyshipsb_wkindheart-226321.jpg 900w, https://api.crackintheroad.com/images/2011/05/ema-thegreyshipsb_wkindheart-226321-260x194.jpg 260w, https://api.crackintheroad.com/images/2011/05/ema-thegreyshipsb_wkindheart-226321-640x480.jpg 640w, https://api.crackintheroad.com/images/2011/05/ema-thegreyshipsb_wkindheart-226321-165x123.jpg 165w\" sizes=\"(max-width: 900px) 100vw, 900px\" /></a></p>\n<p>Screw your Katy Perry’s, your Cheryl Cole’s and your Pippa Middleton’s; Erika M. Anderson is a real woman. Dynamic, authoritative yet remarkably sensuous. Her debut solo record under the moniker EMA, summarizes all of those traits in a passionate and alluring style, drawing the listener in to her intoxicating world. Past Life Martyred Saints is the amalgamated remains of a both a shattered relationship and the splintered remnants of previous band Gowns.</p>\n<p>Album opener Grey Ship begins as a fragile, sincere ode, a Karen O inspired acoustic number, before it spirals messily out of control, into an intense whirlwind of pained vocals and vicious guitars. Being able to gravitate from epically beautiful, to harshly exasperated, is one of the greatest strengths this record upholds. Recent single California being a prime example of this, with it’s honest yet poignant lyricism. ‘Fuck California, you made me boring’ bemoans Anderson on the track’s first line, in a tone so open and veracious that’s it’s impossible not to feel something. Then there’s the real tearjerker, ‘What does failure taste like? To me it tastes like dirt, I’m begging you please to look away!’ weeps Erika; this is an artist clearly in touch with her emotional demons.</p>\n<p>It’s this dignified raw emotion that inspires the most distinguished moments of Past Life Martyred Saints. The powerfully expressive Marked, with Anderson weeping ‘I wish that everytime he touched me left a mark’, leaving the listener wondering whether it’s a Wuthering Heights style love story or an abusive relationship that she is precariously documenting. The gorgeously perplexing innocence maintained throughout the record is stiflingly beautiful at times, such as the closing moments of Anteroom, with EMA wailing ‘if this time through, we don’t get it right, I’ll come back to you, in another life.’</p>\n<p>Although EMA also proves she’s not just an emotionally strewn one trick pony, on the Yeah Yeah Yeah’s like Milkman, a catchy as hell indie pop tune. With the breakdown of Gowns came the demise of her relationship with boyfriend Ezra Buchla, another member of said group. However on this record they’ve pushed any differences to one side, and Buchla plays a key role in the success of this album, with backing vocals on Coda, as well as giving a helping hand with numerous instrumental sections. It’s peculiar to envision that segments of Past Life Martyred Saints are possibly heartwrenching odes to their failed love, yet it’s this honest and all-too-real trait that allows their on album persona’s to breath so effortlessly.</p>\n<p>The subject matter is at times dark and foreboding, Butterfly Knife seemingly retelling a suicide of a distant friend. EMA’s strained vocals expertly portraying the lucid pain felt in such circumstances, it’s tortuously dramatic and achingly gripping. Red Star, a six minute epic closes EMA’s debut record in spectacular style, mirroring the slow burning feeling found on opener Grey Ship. Gradually building into a cascade of soaring guitars and clattering cymbals, before closing on the elegantly delivered line ‘like a red star . . . like a blue scar’. With Past Life Martyred Saints, EMA has created one of the records of 2011 so far, relentlessly moving, remarkably bewitching and above all, vivaciously reputable.</p>\n<p><a href=\"https://cameouttanowhere.com/\">Check out EMA over at her website.</a></p>\n","slug":"7606-review-ema-past-life-martyred-saints","category":"music","date":1304975627000,"wpid":7606,"isSticky":false,"featured_image":null,"createdAt":1587294398372,"updatedAt":1588441789180,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/05/ema-006-292x50.jpg","categories":["music","reviews"]}