{"id":"5e9c30bf9b6559241525dc00","title":"Art Review: Jesper Just (The Baltic, Gateshead)","content":"<p><a rel=\"attachment wp-att-7623\" href=\"https://admin.</p><p>crackintheroad.com/visual/7608-art-review-jesper-just-the-baltic-gateshead/attachment/bliss-and-heaven-2-2\"><img class=\"aligncenter size-full wp-image-7623\" title=\"bliss-and-heaven-2\" src=\"https://api.crackintheroad.com/uploads/2011/05/bliss-and-heaven-21.jpg\" alt=\"\" width=\"900\" height=\"391\" srcset=\"https://api.crackintheroad.com/images/2011/05/bliss-and-heaven-21.jpg 900w, https://api.crackintheroad.com/images/2011/05/bliss-and-heaven-21-260x112.jpg 260w, https://api.crackintheroad.com/images/2011/05/bliss-and-heaven-21-640x278.jpg 640w, https://api.crackintheroad.com/images/2011/05/bliss-and-heaven-21-165x71.jpg 165w\" sizes=\"(max-width: 900px) 100vw, 900px\" /></a></p>\n<p>Entering a dark room surrounded by three thirty foot wide screens is an intimidating feat in itself, so when the only other comforting furniture present is several mysteriously organised wooden benches, it merely serves to appear more daunting. This threatening sounding scene was the platform for the latest Jesper Just exhibition at The Baltic Art Gallery, down at Gateshead Quayside. Being almost entirely a short film artist, Jesper Just has received plaudits all around the world for his stunning pieces which combine visual and sonic effects with a moving and thoughtful result.</p>\n<p>A Vicious Undertow, 2007</p>\n<p>Being the first of the three shorts, there was a greater pressure upon A Vicious Undertow to be captivating, whilst without losing any emotional integrity. Opening in a 1960’s style French bar, with a fragile yet alluring elderly woman smoothly whistling to herself, setting a delicately silky mood. Joined later by a younger couple, which the older woman looked on upon with mellow jealously and subdued sadness. One aspect that excelled throughout was the fantastic use of music; from melancholic drones to shuddering drum beats, all creating a beautiful atmospheric reaction.The vivid relationship between the characters, was one of longing and regret, as if the protagonist was viewing a younger, more elegant version of herself. Culminating in her climbing a spiraling, transcendental tower, possibly a metaphor for her own imminent rise into the heavens.</p>\n<p><iframe width=\"480\" height=\"390\" src=\"https://www.youtube.com/embed/PgsrPn0F754\" frameborder=\"0\" allowfullscreen></iframe></p>\n<p>Bliss and Heaven, 2004</p>\n<p>Bliss and Heaven, the oldest of the three films, again focuses almost solely on the relationship between two characters, whilst using the landscape and props as a proverbial background. A young, weather beaten man crouches eagerly in a wind-blown wheat field, awaiting the arrival of an as of yet unknown person. As a heavy load truck pulls up, a single bead of sweat runs precariously down his face, building the suspense to a climax. The pony tailed man who steps from the truck has harsh, foreboding features, however without giving away too much, this illusion if quickly shattered, and replaced with far more spectacular and moving sentiments, again through the brilliant use of music.</p>\n<p>Sirens of Chrome, 2010</p>\n<p>The final film is possibly the most complicated to interpret, due to it’s seemingly every day familiarities. Four African-American women taking a car ride in complete silence through the near deserted streets of a stereotypical neighborhood. The tension is fraught and imposing inside the car, reflecting the expansive atmosphere experienced outside the confines of the vehicle. As they pull into a dreary multi-story care park, another character appears and a bizarre yet enthralling encounter is played out. Just again uses the concept of confinement and freedom, mimicking the movements with elaborate musical compositions.</p>\n<p>Three entirely different films in their make up, however all work as an emotionally hardhitting testimony’s to Just’s creative mindset. Through visuals and sonic effects, Just manages to paint a realistic and relatable version of life, without the frills and temptations of over-generalizing or exaggeration. The exhibition runs until this Sunday.</p>\n","slug":"7608-art-review-jesper-just-the-baltic-gateshead","category":"arts","date":1304957692000,"wpid":7608,"isSticky":false,"featured_image":{"width":292,"height":50,"src":"2011/05/bliss-and-heaven-2-292x50.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAACAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAUG/8QAHRAAAgIBBQAAAAAAAAAAAAAAAQIAAwQFERIhQf/EABUBAQEAAAAAAAAAAAAAAAAAAAME/8QAFhEAAwAAAAAAAAAAAAAAAAAAAAQy/9oADAMBAAIRAxEAPwDOaHk3vRko91rI1rEqXJBPI+S4ANh0IiTKQMzR/9k="},"createdAt":1587294399733,"updatedAt":1588443778061,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/05/bliss-and-heaven-2-292x50.jpg","categories":["arts"]}