{"id":"5e9c34339b6559241525e1b5","title":"Film Review: The Losers","content":"<p><a href=\"https://admin.</p><p>crackintheroad.com/uploads/2010/05/thelosers.jpg\"><img class=\"aligncenter size-full wp-image-771\" src=\"https://api.crackintheroad.com/wp-content/uploads/2010/05/thelosers.jpg\" alt=\"\" width=\"740\" height=\"492\" srcset=\"https://api.crackintheroad.com/images/2010/05/thelosers.jpg 740w, https://api.crackintheroad.com/images/2010/05/thelosers-300x199.jpg 300w, https://api.crackintheroad.com/images/2010/05/thelosers-494x328.jpg 494w, https://api.crackintheroad.com/images/2010/05/thelosers-165x109.jpg 165w\" sizes=\"(max-width: 740px) 100vw, 740px\" /></a></p>\n<p><strong>The Losers</strong> creates an unsettling amalgamation of feelings. Clichéd, misogynistic and overblown; this latest comic book to silver screen adaptation is a car crash of a film yet still manages to entertain. The premise seems fun enough; five members of an elite United States Special Forces team are sent into the Bolivian jungle on a search and destroy mission. Of course the mission doesn’t go to plan; leaving the team standard in Bolivia, presumed dead and at war with a global arms dealer known as Max. The film certainly has the plot of a comic book and carries with it a certain A-team style. In many ways the style of the film is also true to the undiscovered <strong>Vertigo </strong>classic; the film’s quick cuts and vivid colours giving the picture a decidedly comic book aesthetic. This is however when the film’s actual merits run dry, leaving only accidental blemishes and ultimately an overblown mess.</p>\n<p>At its core <strong>The Losers</strong> is an ensemble piece, which of course relies on the characters of the film to be interesting enough to carry the narrative. In <strong>The Losers</strong> case they simply aren’t, descending too quickly into stereotypes and clichés, the film’s cast become padding to the at best shaky plot. <strong>Jeffrey Dean Morgan</strong> does his best as the film’s lead and <strong>Chris Evans</strong> is solid as the film’s comic foil <em>Jake Jensen</em>, however there simply isn’t enough substance here to make anything they achieve work.<br />\nThe very sensibility that runs through the film can also be criticised, <em>Aisha al-Fadhil</em> (<strong>Zoe Saldana</strong>) is the only notable female role in the film, and the other characters’ interactions with her are questionable at best, in many ways the film’s director <strong>Sylvain White</strong> seems to know movie’s target demographic a bit too well; a depressing thought. The script, if you can even call it that, tries it’s very best to be witty and snappy but ultimately fails. There are laugh out loud moments in the more dialogue focused scenes, however they often seem embarrassingly accidental if anything, the assumedly ‘post modern’ ‘your mum’ joke half way being through, a notable example.</p>\n<p>Despite all the film’s flaws for some reason the picture has a ‘car crash’ charm that just about carries it along its way. In some cases the film is inventive; <em>Jake Jensen</em> pretending he has telekinetic powers using his hands as guns, while really a sniper takes out the guards he’s mocking, is both funny and dare I say it ‘off beat’. As the film hits its final third the tired characters by some stroke of luck manage to create something resembling a cast, so when the eventual ‘twist’ comes the film as a whole may just stay with you longer than the walk to the exit.</p>\n<p style=\"text-align: center;\"><a href=\"https://www.youtube.com/watch?v=IEeQEa6SZQM\">Watch the Trailer</a></p>\n","slug":"770-the-losers","category":"arts","date":1273567383000,"wpid":770,"isSticky":false,"featured_image":{"width":740,"height":492,"src":"2010/05/thelosers.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAMH/8QAIRAAAgIBBAIDAAAAAAAAAAAAAQIDBAUAERIhBiIxUWH/xAAUAQEAAAAAAAAAAAAAAAAAAAAF/8QAGREBAAIDAAAAAAAAAAAAAAAAAQACERIi/9oADAMBAAIRAxEAPwDKvJ6WHxOdkq17Ed6hXZYnlgrtGV25dMGI5ONx2Oj+aosmPRQqYjFSKBsHkqnkw+z7/Ommik5qxlNrOZ//2Q=="},"createdAt":1587295283640,"updatedAt":1588403567980,"author":"5e9b68b27a1236eccfeb1d24","old_image":"2010/05/thelosers.jpg","categories":["arts"]}