{"id":"5e9c30b09b6559241525dbea","artists":["5e9b69637a1236eccfeb272d"],"title":"Weekly Discography Guide: XTC","content":"<p>XTC might not ring any bells for most people, but chances are you’ve heard a couple of their tracks before – Making Plans For Nigel still seems to crop up on the radio now and then, Dear God enjoys a certain notoriety (The usual religious controversy, coupled with a student in the US forcing his college to play the song over the PA at knifepoint), and Sgt.</p><p> Rock (Is Going To Help Me) featured on the sound track for Hot Fuzz.</p>\n<p>However, for a band with a career spanning 29 years, there is little evidence of their work in the charts or in general musical awareness. A large part of this stems from the fact that XTC stopped playing gigs entirely in 1982 following singer Andy Partridge’s breakdown, after being forced off valium having first been prescribed it as a young teenager. With little activity supporting releases, public interest and media attention inevitably trailed off. Another factor may be the difficulty in placing XTC in a particular genre. To quote the wikipedia page on XTC, “a unique brand of hyperactive pop mixed with funk, punk, ska, reggae, baroque pop, and art rock”. XTC have derided the music media’s obsession with genre since their third single, This Is Pop?, so I will be keeping clear of that particular subject.</p>\n<p>Check out: <a href=\"https://www.youtube.com/watch?v=tqDFGpd845Y\">Respectable Street</a>, <a href=\"https://www.youtube.com/watch?v=zm4gm9bmypg\">Easter Theatre</a>, <a href=\"https://www.youtube.com/watch?v=W9GIxfbfob0\">Complicated Game</a></p>\n<p>Moving on from my perhaps unnecessary preamble, the actual music.</p>\n<p><img class=\"alignleft size-thumbnail wp-image-7730\" src=\"https://api.crackintheroad.com/uploads/2011/05/XTC_White_Music-188x188.jpg\" alt=\"\" width=\"113\" height=\"113\" />XTC’s first LP, White Music was released in 1978, and two things are immediately apparent: punk’s influence on the band at this point, and their desire for experimentation. It’s a pretty lo-fi debut, and doesn’t hold up in comparison to later albums, but it does neatly showcase XTC’s originality and energy. Check out This Is Pop?, Atom Age, and All Along The Watchtower.</p>\n<p><img class=\"alignright size-thumbnail wp-image-7758\" src=\"https://api.crackintheroad.com/images/2011/05/XTC_Go_2-188x188.jpg\" alt=\"\" width=\"113\" height=\"113\" />Released in the same year as White Music, Go2 is perhaps slightly more refined, but still very much shows a band finding their musical feet. Check out Meccanik Dancing, I Am The Audience, and Are You Receiving Me?</p>\n<p><img class=\"alignleft size-thumbnail wp-image-7777\" src=\"https://api.crackintheroad.com/images/2011/05/XTC_Drums_and_Wires-188x188.jpg\" alt=\"\" width=\"113\" height=\"113\" />However, with the release of Drums & Wires the following year, XTC’s reputation for eccentric genius was cemented. As jagged and driven as the title suggests, additional studio and production time allowed their unusual musical structuring to shine. Emphasis placed on percussion in the mix makes the complex drumming stand out, a fantastic record and a great place to start with XTC. Check out Making Plans For Nigel, Scissor Man, and Complicated Game.</p>\n<img class=\"alignright size-thumbnail wp-image-7780\" src=\"https://api.crackintheroad.com/images/2011/05/XTC_Black_Sea-188x188.jpg\" alt=\"\" width=\"113\" height=\"113\" />\n<p>Black Sea continues in much the same musical vein, with the exception of No Language In Our Lungs, a more ponderous track about the difficulty of communication, ironically one of a very small number of tracks where Partridge found himself satisfied that he managed to convey his meaning. Partridge’s humanitarian interests and dislike for religion and politic’s Machiavellian ways have an increasing influence on lyrical content. Check out Generals & Majors, No Language In Our Lungs, and Towers Of London.</p>\n<p><img class=\"alignleft size-thumbnail wp-image-7785\" src=\"https://api.crackintheroad.com/images/2011/05/XTC_English_Settlement-188x188.jpg\" alt=\"\" width=\"113\" height=\"113\" />Listening to English Settlement after White Music and Go2, it seems almost incredible how refined XTC had become in 4 years, producing an album of intricate and stormy songs capturing a great slice of English national identity. Tight and intelligent, English Settlement was a defining album for XTC. Check out Senses Working Overtime, Jason & The Argonauts, and No Thugs In Our House.</p>\n<img class=\"alignright size-thumbnail wp-image-7787\" src=\"https://api.crackintheroad.com/images/2011/05/XTC_Mummer-188x188.jpg\" alt=\"\" width=\"113\" height=\"113\" />\n<p>Pastoral and relaxed by comparison, Mummer is worth listening to for certain key tracks, but of less interest than as an album, understandable after Partridge’s recent breakdown, and the departure of drummer Terry Chambers. Check out Beating Of Hears, Love On A Farmboy’s Wages, and Funk Pop A Roll.</p>\n<img class=\"alignleft size-thumbnail wp-image-7790\" src=\"https://api.crackintheroad.com/images/2011/05/XTC_The_Big_Express-188x188.jpg\" alt=\"\" width=\"113\" height=\"113\" />\n<p>Returning to slightly more hard-edged music than recent releases, but still less tight as an album than Drums & Wires or English Settlement, The Big Express may fail to impress some, but is definitely worth a listen. Check out Seagulls Screaming Kiss Her Kiss Her, You’re The Wish You Are I Had, and Reign Of Blows.</p>\n<p>Suffering from cash-flow problems at this point, XTC decided to produce an album sending up 60s psychedelia under the name The Dukes Of Stratosphear. Ostensibly released as a previously undiscovered gem from the 60s, it quickly became apparent that XTC were behind 25 O’Clock, but the moderate success of the album, coupled with the minimal expenses incurred allowed them to focus more on serious work. A second release, Psonic Psunspot, was later grouped with 25 O’Clock under the title Chips From The Chocolate Fireball, highlights of which include Bike Ride To The Moon, Brainiac’s Daughter, and The Mole From The Ministry. Tongue-in-cheek and just downright silly, but surprisingly tolerable to listen to.</p>\n<img class=\"alignright size-thumbnail wp-image-7793\" src=\"https://api.crackintheroad.com/images/2011/05/XTC_Skylarking-188x188.jpg\" alt=\"\" width=\"113\" height=\"113\" />\n<p>With more money for studio time, XTC worked with produced Todd Rundgren on Skylarking, a melodic and hypnotic album that focused far more on personal relationships than previous releases. Despite arguments between Partridge and Rundgren on tracklisting, it holds together well as an album, and was arguably their best release since English Settlement. Check out Summer’s Cauldron, Earn Enough For Us, and Another Satellite.</p>\n<img class=\"alignleft size-thumbnail wp-image-7795\" src=\"https://api.crackintheroad.com/images/2011/05/XTC_Oranges_and_Lemons-188x188.jpg\" alt=\"\" width=\"113\" height=\"113\" />\n<p>Time spent messing about with psychedelia as The Dukes Of Stratosphear is apparent on Skylarking, and perhaps even more so on Oranges & Lemons. Rich instrumentation and anxious lyrics define this essential album. Check out Garden Of Earthly Delights, The Mayor Of Simpleton, and Hold Me My Daddy.</p>\n<img class=\"alignright size-thumbnail wp-image-7799\" src=\"https://api.crackintheroad.com/images/2011/05/XTC_Nonsuch-188x188.jpg\" alt=\"\" width=\"113\" height=\"113\" />\n<p>With Andy Partridge’s lyrics maturing further, Nonsuch is quite a subtle album, with few obvious hooky pop songs on it. Meandering and thoughtful, it’s a great album, but probably not the best place to start listening to XTC. Check out My Bird Performs, The Disappointed, and Then She Appeared.</p>\n<p>After the release of Nonsuch, several years of bitter dispute with Virgin issued, and XTC were finally released from contract in 1998 and paid considerable outstanding royalties, allowing them to focus on recording the swathe of material that they had written since the release of Nonsuch. The material was loosely organised into two albums, Apple Venus, and Wasp Star (Apple Venus vol. 2).</p>\n<p>Apple Venus is primarily an orchestral album, nostalgic and wistful. With some fantastic sweeping arrangements, it is perhaps their most musically accomplished album, although some may find several tracks of it a bit stale. Check out Easter Theatre, Frivolous Tonight, and I Can’t Own Her.</p>\n<p>Wasp Star is arguably the closest XTC came to releasing a traditional rock album. Many of the sentiments and themes are shared with Apple Venus, but the far livelier electric sound of the album gives it more kick, although possibly at the cost of some of the sincerity of Apple Venus. Check out Stupidly Happy, In Another Life, and Standing In For Joe.</p>\n<p>For those curious about some of the odd album titles, it was noted by a fan that Nonsuch was a lyric from previous album Oranges & Lemons which was in turn a lyric from previous album Skylarking. Partridge maintained that this was unintentional, but used the lyric Apple Venus from Nonsuch in recognition of this. Wasp Star didn’t feature anywhere on Apple Venus, but was the name that the Aztecs gave Venus.</p>\n<p>For more fan trivia than even I care to remember, as well as a comprehensive guide to everything about XTC, check out <a href=\"https://chalkhills.org/\">Chalkhills</a>.</p>\n<p>For further listening check out Wire, Dogs Die In Hot Cars, and Thomas Dolby.</p>\n","slug":"7725-weekly-discography-guide-xtc","category":"music","date":1305213198000,"wpid":7725,"isSticky":false,"featured_image":null,"createdAt":1587294384719,"updatedAt":1588441789103,"author":"5e9b68b27a1236eccfeb1d35","old_image":"2011/05/xtc-292x50.jpg","categories":["music"]}