{"id":"5e9c342c9b6559241525e1ab","title":"Interview: My Tiger My Timing","content":"<p style=\"text-align: center\">Signed to the Parisian electro label <strong>Kitsune Records, My Tiger My Timing </strong>have created an upbeat electro-pop sound guaranteed to get you dancing.</p><p> Their debut EP ‘<strong>I Am The Sound</strong>‘, which benefited from the production duties of electro-pop heavyweights <strong>Joe Goddard (Hot Chip) </strong>and <strong>Andy Spence (New Young Pony Club)</strong>, is a mixture of melodic synths and beautifully blended vocals. While there are many bands which will attempt to fly the electro-pop flag, <strong>My Tiger My Timing</strong> create a cool sense of detachment in their light yet complex electro sound that doesn’t scream for attention but will inevitably leave you asking for more. Currently on a mini-tour of Germany, <strong>Anna </strong>from the band kindly took some time out to answer some of our questions.</p>\n<p style=\"text-align: center\"><em>CITR: </em>If you had to cite one band/artist as a major influence upon you, who would it be?</p>\n<p style=\"text-align: center\"><strong>One band we all agree on is Blur – I guess they were important for all of us when we were kids and it’s a great example of a band who are contemporary, very much from the UK and who sound like themselves and no one else.</strong></p>\n<p style=\"text-align: center\"><em>CITR</em>: What has been your favourite gigging experience to date?</p>\n<p style=\"text-align: center\"><strong>Both times we’ve played at La Flèche d’Or in Paris – it’s an electric atmosphere and the audience are really into music so it’s a very rewarding and memorable place to play.  Venues and promoters in Europe take good care of bands as well</strong>.</p>\n<p style=\"text-align: center\"><em>CITR: </em>What was the inspiration behind the creation of MTMT?</p>\n<p style=\"text-align: center\"><strong>We’d all spent time in other bands not really doing anything too special and I think we collectively woke up one day and realised the music we wanted to make and how to make it.  MTMT is all about songs which get to the point and don’t pussyfoot around.</strong></p>\n<p style=\"text-align: center\"><em>CITR:</em> Your sound has been described as ‘Classic. Perfect. Pop.’ With ‘Pop’ acting as such an encompassing term for a spectrum of different music, where and how does MTMT’s sound fit in?</p>\n<p style=\"text-align: center\"><strong>Our goal has always been to make modern music – we all love stuff from the past and of course this influences us as writers, but we hate retro – it’s such a cop-out, I don’t see why anyone would want to do that.  There’s so many bands now pretending to be from the 80s or early 90s, it’s all been done before.  To me, pop music has to be contemporary, rhythmic and exciting, but within that framework it can also be dark, experimental and raw – that’s where I feel our sound lies.</strong></p>\n<p style=\"text-align: center\"><em>CITR: </em>How has it been working as a band which includes two siblings? Have there been regular doses of sibling rivalry, or do you feel this connection strengthens the band?</p>\n<p style=\"text-align: center\"><strong>James and I have always made music together so it’s just a natural progression to being in this band, we didn’t even question it. We do sometimes fight but actually, I feel like we’re all brothers in this band – any of us can fall out with the others but underneath we’re a really tight group.</strong></p>\n<p style=\"text-align: center\"><em>CITR:</em> You’ve recently released your debut EP ‘I Am The Sound’. What was the inspiration behind this title?</p>\n<p style=\"text-align: center\"><strong>It’s about finding that point on the horizon which keeps you going forward when things around you are falling apart – for us it’s music, and that’s what defines us, hence the title, but it could be anything really – quantum physics, needlework, digging the garden…</strong></p>\n<p style=\"text-align: center\"><em>CITR:</em> It is reported you’re currently recording your debut album, how’s it all going? Was your debut an EP simply an introduction to the album, or should we expect any modifications in your sound?</p>\n<p style=\"text-align: center\"><strong>It’s something we’ve all wanted to do for a long time so to finally be making an album is a great feeling.  It’s early days but going well – we’ve written loads of new songs so I don’t know yet whether anything from the EP will make it into the final 10. In terms of sound, we’ll still use the studio to add sparkle and detail but we’re definitely approaching these songs a bit more naturalistically – we’re a real live band and we want the record to reflect this too.  I keep waking up in the middle of the night with ideas so I’m not getting much sleep these days!</strong></p>\n<p style=\"text-align: center\"><em>CITR:</em> PC or Mac?</p>\n<p style=\"text-align: center\"><strong>Mac.  I’m kind of addicted to mine. </strong></p>\n<p style=\"text-align: center\"><em>CITR: </em>Which artists, past or present, would make up you ‘Super Band’?</p>\n<p style=\"text-align: center\"><strong>Matt Safer from The Rapture on bass, Graham Coxon from Blur on guitar, Chris Frantz from Talking Heads on drums and Liz Bougatsos from Gang Gang Dance on vocals.  I’m not sure what the music would sound like though..!</strong></p>\n<p style=\"text-align: center\"><em>CITR: </em>What piece of trivia might we not know about MTMT?</p>\n<p style=\"text-align: center\"><strong>The official band drink is tequila and lemonade.</strong></p>\n<p style=\"text-align: center\"><strong><span style=\"font-weight: normal\"><a href=\"https://www.myspace.com/mytigermytiming\" target=\"_blank\">Check out My Tiger My Timing’s Myspace!</a></span></strong></p>\n","slug":"793-5-minutes-with-my-tiger-my-timing","category":"interviews","date":1273837300000,"wpid":793,"isSticky":false,"featured_image":{"width":604,"height":403,"src":"2010/05/my-tiger-my-timing.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAIG/8QAIBAAAgEEAgMBAAAAAAAAAAAAAQMCAAQREgUhBjFBUf/EABUBAQEAAAAAAAAAAAAAAAAAAAID/8QAGBEAAwEBAAAAAAAAAAAAAAAAAAECIUH/2gAMAwEAAhEDEQA/AMFbc75C5TbRVoiSosGrC3WZx894wR2Rj8qDxvJTO7bkQZLuUYrBET9AO3qlKrb4GNR//9k="},"createdAt":1587295276845,"updatedAt":1588403567901,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2010/05/my-tiger-my-timing.jpg","categories":["interviews","music"]}