{"id":"5e9c309a9b6559241525dbba","artists":["5e9b69517a1236eccfeb25eb"],"title":"Review: The Antlers – Burst Apart","content":"<p><a rel=\"attachment wp-att-8218\" href=\"https://admin.</p><p>crackintheroad.com/music/7944-review-the-antlers-burst-apart/attachment/the-antlers-portraits-2\"><img class=\"aligncenter size-full wp-image-8218\" title=\"The Antlers - Portraits\" src=\"https://api.crackintheroad.com/uploads/2011/05/The+Antlers.jpg\" alt=\"\" width=\"900\" height=\"600\" srcset=\"https://api.crackintheroad.com/images/2011/05/The+Antlers.jpg 900w, https://api.crackintheroad.com/images/2011/05/The+Antlers-260x173.jpg 260w, https://api.crackintheroad.com/images/2011/05/The+Antlers-640x426.jpg 640w, https://api.crackintheroad.com/images/2011/05/The+Antlers-165x109.jpg 165w\" sizes=\"(max-width: 900px) 100vw, 900px\" /></a></p>\n<p>Following up one of the most critically acclaimed records so far this century is no easy feat. Hospice was emotionally diverse, instrumentally beautiful and above all, powerful on a transcendent level. Countless bands who have been faced with a similar dilemma have on the whole opted for one of two options; either produce a strikingly similar yet half-hearted copycat attempt at a ‘Part II’ or, as proves the more popular choice, churn out an unlistenable album of cringe-worthy daytime Radio 1 tracks, e.g. Snow Patrol.</p>\n<p>However after witnessing The Antlers live performances since the 2007 release of Hospice, it was clear they had no intention of following either route. New tracks were played sporadically, yet with a vivid distinction between the songs that featured on differing albums. For me, their live shows were distinctly average, and failed to capture the essence of Hospice, as an intimate and deeply personal record. So it’s no surprise to find that on Burst Apart, the majority of tracks are very much molded to their more invigorating, bolder live sound.</p>\n<p>Those of you familiar with Hospice will know the concept upon which it evolved around; almost a hazily configured documentary of a cancer patient’s diagnosis, battle and death, covering the various stages of all encompassing grief. It’s a harrowing, and all too feasible situation, covered with an impeccable sense of reality, so for Burst Apart to open with I Don’t Want Love, is a bizarre albeit noble move. A track that sees The Antlers frontman Peter Silberman at his most sexually provocative, the equivalent of Bright Eyes’s Lover I Don’t Have To Love. It’s a sordid and sensual affair, with Silberman bemoaning a chaotic and regretted night, ‘We wake up with pounding heads, bruised down below. I should have built better walls, or slept in my clothes’. The fame their previous album brought them, has clearly opened The Antlers up to new experiences, which are plainly documented on Burst Apart.</p>\n<p>The Antlers have certainly taken it upon themselves to show their diversity as a group, with musical stylings ranging from the hook heavy Parentheses, to the delicately composed Corsicana. In truth, there are no moments that come close to reaching the surreal heights of beauty that were so elegantly captured on Hospice; the aforementioned track Corsicana proving to be the most successful. The electronically based No Widows showcases a lo-fi based sound, with an up tempo and jagged beat, however it never fulfills it’s potential and leaves the listener yearning for slightly more. It’s undeniably safe, a trait that was previously unbeknown to The Antlers, there’s no emotional boundaries pushed,  leaving the track relying almost solely upon Silberman’s untouchable falsetto vocals.</p>\n<p>Several tracks merely float by listlessly; Rolled Together comes across as a poor attempt at mimicking an ethereal Sigur Ros styled landscape, whilst Every Night My Teeth Are Falling Out stumbles clumsily over ground already so expertly covered by The National. Where Hospice was largely centred around loss, Burst Apart finds it’s inspiration in ‘the dream state’ with the heavenly Corsicana being far and away the album highlight, toying with the concept of sleep patterns between partners. When The Antlers decide to touch a nerve, they don’t stop there. Corsicana forcefully rips the listener apart, limb by limb , ‘We lost our chance to run, now the door’s too hot to touch, we should hold our breath with mouths together now’ weeps Silberman on the standout lyric from Burst Apart. It’s by no means a failure as an album, and will no doubt delight, comfort and provide solace for countless listeners, yet I can’t help longing for a return to days gone by.</p>\n","slug":"7944-review-the-antlers-burst-apart","category":"music","date":1306091609000,"wpid":7944,"isSticky":false,"featured_image":{"width":900,"height":600,"src":"2011/05/the+antlers.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAQH/8QAIBAAAgEDBQEBAAAAAAAAAAAAAQIDAAQRBQYSITFBB//EABQBAQAAAAAAAAAAAAAAAAAAAAH/xAAUEQEAAAAAAAAAAAAAAAAAAAAA/9oADAMBAAIRAxEAPwDLrT9B1EbYm006tdWsTRR8Ud3cIuQpJI+H3AHWftWw7g3JHDGkFzEYlUKhe4kLcQOsnHtKUF//2Q=="},"createdAt":1587294362004,"updatedAt":1588403555144,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/05/the+antlers.jpg","categories":["music","reviews"]}