{"id":"5e9c342b9b6559241525e1a8","title":"Interview: Shrag","content":"<p style=\"text-align: center\">Already receiving plaudits from the likes of <strong>Ryan Jarman (The Cribs)</strong>,<strong> </strong>it won’t be long until <strong>Shrag </strong>bring their unique blend of indie post-punk to a town near you.</p><p> Despite having only come into existence almost by accident, <strong>Shrag </strong>have already<strong> </strong>released  a self-titled album last year and are in the process of releasing their sophomore effort in September. On listening to <strong>Shrag</strong>‘s previous releases, you are immediately drawn in by the fun yet rebellious attitude contained within the lead vocals of <strong>Helen King</strong>. This coupled with fantastic indie guitar riffs and the occasional synth, <strong>Shrag</strong> have produced a sound which displays a great deal of integrity while still making you want to dance. <strong>Helen</strong> from the band kindly agreed to answer some of our questions.</p>\n<p style=\"text-align: center\"><em>CITR: </em>What has been your favourite gigging experience to date?</p>\n<p style=\"text-align: center\"><strong>That’s a tricky one. We had an amazing show with the Cribs in Coventry a year or so ago; we were meant to be the opener but got shifted up to main support at the last minute and everyone went wild, it was so much fun. In fact, the tours we’ve done with the Cribs have all been awesome – they’ve been very good to us, enabling us to play these massive venues we wouldn’t get a sniff at otherwise – Glasgow Barrowlands, London Astoria, etc…dead exciting for us. Indietracks 2008 was a whole lot of fun (we’re playing again this year and really looking forward to it). Oh and in December we played on this beautiful boat in Lyon as part of our weird European tour and that was definitely one of the highlights.</strong></p>\n<p style=\"text-align: center\"><em>CITR: </em>Where did the inspiration for the band name ‘Shrag’ come from?</p>\n<p style=\"text-align: center\"><strong>Oh, it was kind of an accident that dug its heels in….We used to hang out a lot together in Brighton before we were ever a band, we’d put on shows and stuff. We had this stupid name for ourselves floating around – the ‘Sussex Heights Roving Artists’ Group’ (‘Sussex Heights’ was the name of the block of flats Bob lived in and where we all met). Anyway when we started making music together it condensed to ‘Shrag’, and kind of stuck….</strong></p>\n<p style=\"text-align: center\"><em>CITR:</em> Ryan Jarman, of the Cribs, has declared himself a fan of your music as you ‘operate in a very DIY way’. Would you agree? If so, how do you think this affects your sound?</p>\n<p style=\"text-align: center\"><strong>Well, I guess we operate in a DIY way by default – this band came about almost by accident, we don’t have any money, and we’re certainly not and never have been careerist about it — all we want is to have fun and make music that we’re proud of. I think our music tells you we’re not totally proficient or anything, but we try to sound as good as we possibly can, there’s no pointed attempt at sounding lo-fi or DIY.</strong></p>\n<p style=\"text-align: center\"><em>CITR:</em> You have already released your self-titled debut album last year, and it is reported your sophomore effort is to be released this year. In what ways is this new album a development on the first?</p>\n<p style=\"text-align: center\"><strong>Yep our new album will be out in September. The first album was actually a collection of the five 7″ singles we’d released over a two year period, so we didn’t think of it as an album so much as a document of what we’d done so far. Life! Death! Prizes! was written over a shorter period of time and with a view to it being a self-contained record, I think this will be a noticeable difference. Also – we’ve just had more practice at being a band, we know what we’re about a bit more and maybe have been a little braver or more confident – but people may not agree, who knows. It has just felt like a different process for us, we’ve enjoyed it.</strong></p>\n<p style=\"text-align: center\"><em>CITR:</em> Your lyrics all appear to be carefully crafted, presented very much at the forefront of your songs. How important do you feel meaningful lyrics are?</p>\n<p style=\"text-align: center\"><strong>I think lyrics are important. I’m not sure all of ours are carefully crafted, they’re bound to be flawed in some way, but hopefully they are honest, and hopefully interesting. On the first album there was a certain amount of feeling we needed a definite notion behind the lyrics – “this one is about shoplifting, this one is about all our friends getting pregnant, this one is about the people who made school even more miserable than it already was” etc – which can work, for sure, but I think to a certain extent was about not feeling totally confident, hiding behind the ideas a little bit. With the newer stuff, there is more of a sense of allowing the lyrical content to not be so pinned down, realising words are often more interesting if you allow them to articulate ideas/feelings/situations that are themselves confusing, unexpected, difficult to describe. Which is not to say that the new songs are not ‘about’ anything – far from it – but more that the way we approach them lyrically is perhaps closer to how things feel in real life. Not sure if that makes any sense. I find most things in life confusing.</strong></p>\n<p style=\"text-align: center\"><em>CITR: </em>Mac or PC?</p>\n<p style=\"text-align: center\"><strong>I doubt anyone would be interested in my views on this…</strong></p>\n<p style=\"text-align: center\"><em>CITR:</em> If you could have any super power, what would it be and why?</p>\n<p style=\"text-align: center\"><strong>Immunity from habit forming. I have too many bad habits and they are disabling.</strong></p>\n<p style=\"text-align: center\"><em>CITR: </em>Why are rabbits sinister?</p>\n<p style=\"text-align: center\"><strong>Ha, there’s a combination of reasons. At primary school I was something like chief ‘Pet Monitor’ which meant I was in charge of all the animals the school had in the ‘Pet Room’…the smaller kids used to come in during lunchtime and I had to hand out the animals for them to hold. We had hamsters and gerbils etc,  but it was these two rabbits called Thumper and Bambi who really troubled me. Thumper was this HUGE matriarch rabbit who had been there for years and spawned all the other ones. She was forced to live in this tiny hutch and then be basically mauled on a daily basis by a load of seven-yr-olds who had no clue as to how to handle animals, they’d drop her and bend her ears the wrong way etc….and she was just completely passive, like a stuffed toy, obviously miserable but kind of inert in her misery. Also, one time she had one of her tiny babies in her tiny hutch with her, and when we came in the next day she had rolled onto it in the night and crushed it to death and seemed completely unbothered. I came to hate her. Bambi was her son, he also never protested but was obviously completely paralysed with fear, eyes all white and rolling back into his head and trembling but never did anything about it. These things created this weird aversion to rabbits in my mind.</strong></p>\n<p style=\"text-align: center\"><strong>Also, I was really obsessed with Watership Down as a kid –  the book and the film –  and I was really disturbed by it. That scene when Holly, I think it is, finds Hazel and Fiver and tells them all about the gassing of the rabbits who stayed behind in the condemned warren, and then you see these images of them being gassed, they are all blue and choking, I thought that was one of the most terrifying things I had ever seen. Also when Fiver has his fevered vision of the blood pouring out of the forest and down the hill, and then the ‘black rabbit’ who comes to dance with the others when they die – all this really got to me. So, rabbits have bad associations for me, the way they make no sound or protest and multiply and are total breeders = SINISTER.</strong></p>\n<p style=\"text-align: center\"><strong><span style=\"font-weight: normal\"><a href=\"https://www.myspace.com/shrag\" target=\"_blank\">Check out Shrag’s Myspace!</a></span></strong></p>\n<p><iframe src=\"https://www.facebook.com/plugins/likebox.php?id=114090381951328&width=292&connections=10&stream=false&header=false&height=255\" scrolling=\"no\" frameborder=\"0\" style=\"border:none; overflow:hidden; width:292px; height:255px;\" allowTransparency=\"true\"></iframe></p>\n","slug":"798-5-minutes-with-shrag","category":"interviews","date":1273908406000,"wpid":798,"isSticky":false,"featured_image":{"width":573,"height":843,"src":"2010/05/shrag.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAPAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAABQYH/8QAJRAAAgIABAUFAAAAAAAAAAAAAQIDBAAREiETMTJRoQUGIlKB/8QAFQEBAQAAAAAAAAAAAAAAAAAABgf/xAAeEQACAQMFAAAAAAAAAAAAAAABAgMABAUREkGBof/aAAwDAQACEQMRAD8AIm93rRuLcuUq1hDXCO0q6eGylFXNV6gcyuoc8u4IwYs/HUSyxxxSSDU0f1J3I/MZLHDeZFtmVmZptTtr2+J5Hv1eTimHq8uQ38YPz26qAI+6oGEuHbeZyeNPa//Z"},"createdAt":1587295275108,"updatedAt":1588403567876,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2010/05/shrag.jpg","categories":["interviews","music"]}