{"id":"5e9c30a69b6559241525dbd8","title":"Review: The Great Escape 2011","content":"<p>Arriving in <strong>Brighton </strong>for my first<strong> Great Escape </strong>experience, the city was alive with fans and delegates alike walking from street to street, venue to venue.</p><p> Marketed by some as Britain’s answer to <strong>SXSW</strong>, <strong>The Great Escape </strong>promised to provide a weekend packed with exciting bands and copious amounts of over priced lager. On the whole, and certainly for the latter, <strong>The Great Escape </strong>delivered wholeheartedly, standing as the finest urban festival that the UK has to offer. Brighton acts as the ideal host, structured by streets of vintage shops, cool cafes and bars, fantastic venues and of course being located right next to the beach. What’s more, the separate afternoon and evening set times were warmly welcomed (especially as the festival progressed), as an opportunity to recover from hangovers and plan which venues we would dodge to and from in the evening.</p>\n<p><strong>Thursday</strong>:</p>\n<p>However while I came away from <strong>The Great Escape </strong>with heavy heart for having to leave behind such a phenomenal experience, it started very differently. My hotel was just around the corner from the <strong>Queens Hotel</strong>, a venue which stood as a small room with a low ceiling and improvised stage. Acting out on an urge of convenience, I headed around to the <strong>Queens </strong>for Norwegian alternative rock quartet <strong>22 </strong>as my first gig of <strong>The Great Escape</strong>. Described in the official programme as combining ‘the mathematical and downright progressive insanity of Mars Volta, Muse, and Refused with a keen pop sensibility and strong desire to experiment’, <strong>22 </strong>could have helped save valuable paper and described themselves as ‘a rocky tribute to The Wanted’. Impeccably presented and painfully well choreographed, the only highlight of <strong>22</strong>‘s performance was the guitarist’s ability to jump up and perform a 360 without destroying the ceiling tiles. There was also a distinct lack of ‘experimenting’ in <strong>22</strong>‘s sound, which was in fact full of pitiful cliches and mock rock that was frankly embarrassing to watch. Moving on to the vintage clothing shop cum venue <strong>Beyond Retro</strong>, <strong>Cloud Control </strong>performed a mildly enjoyable set which was met by a mostly positive response from the awaiting audience. Incredibly up beat and aesthetically pleasing, I can see why many people enjoy the psychedelic inspired indie rock musings of <strong>Cloud Control, </strong>especially as they do perform it well. However there seemed to be very little distinction both in their sound and their attitude, as each track seemed to fall back on to elongated vocals and over enthusiastic rattles of a tambourine.</p>\n<p>Later that evening at one of the stand out venues of the festival, <strong>Young British Artist </strong>took to darkened stage in the belly of <strong>Jam</strong>. Intense and burgeoning with crashing percussion, <strong>Young British Artist </strong>performed a set which steadily developed with confidence as the band mastered their epic recorded sound into a well crafted and entertaining live performance. Only an hour earlier we had witnessed previous <strong>Crack In The Road <span style=\"font-weight: normal;\">sessionees </span>Big Deal </strong>(you can watch our session with them <strong><a href=\"https://api.crackintheroad.com/music/7574-exclusive-session-big-deal\" target=\"_blank\">here</a>) </strong>perform<strong> </strong>their anti-twee set at <strong>Horatios</strong>. Located at the end of <strong>Brighton Pier</strong>, <strong>Horatios </strong>felt like a slightly inappropriate venue for the stripped back nature of <strong>Big Deal</strong>‘s sound, however the boy/girl duo impressed the awaiting crowd with their subtle and melancholic music.</p>\n<p>Finding ourselves back at <strong>Horatios</strong>, it was the turn of indie pop heroes <strong>Cults</strong> to perform their NME stage slot. Hailed by Pitchfork on several occasions as Best New Music, <strong>Cults </strong>fuller band set up lent to an entertaining and energetic performance which demonstrated the likability of their sound. Some have critcised the band as mundane and ‘ready made’, however not all music must be revolutionary and defined by it’s flaws and potential. <strong>Cults </strong>produce their indie pop sound with a great deal of confidence and zeal, and as such were one of the highlights of the festival. On the note of the experimental, the final act of what now felt like a very long day was <strong>Gang Gang Dance</strong>. To describe their performance as phenomenal would be an understatement, as the band produced a set full of crescendos of energy, donned masks, waving flags and demonstrating how far it is possible for sound to be experimented with to create something truly remarkable.</p>\n<p><strong>Friday:</strong></p>\n<p>Providing somewhat of a lull at the midpoint of the festival, <strong>Friday </strong>saw three fantastic performances by <strong>Dog Is Dead</strong>, <strong>Ghost Poet</strong>, and <strong>Friendly Fires</strong>. As I have mentioned in the past, maybe I’m not the best person to review <strong>Dog Is Dead </strong>as I think they’re brilliant. However this is honestly only bourn out of the fact they are genuinely a hugely promising and talented band. Performing in <strong>Above Audio</strong>, <strong>Dog Is Dead </strong>look like a vastly more confident and established act than they were this time last year, demonstrating a great level of progress. Moreover, the band’s newer tracks make the older, but still well loved, tracks sound weaker. This is definitely not a criticism, rather it only furthers this demonstration that the band have progressed and developed their incredibly enjoy choral pop sound.</p>\n<p>Set in the atmospheric surroundings of <strong>Digital</strong>, the much hyped <strong>Ghost Poet </strong>fulfilled expectations with a great set, somewhat marred by poor sound that meant his vocals were lost amongst the music. After listening to <strong>Ghost Poet </strong>on record his vocals are embedded on your consciousness, latching onto your mind and replaying themselves over and over. Therefore when they were somewhat drowned by the surrounding sound, you could substitute them in your listening mind, however this certainly did stop a great set becoming a truly stunning set. Regardless, <strong>Ghost Poet </strong>provided an exciting gig during a weekend full of new music, in which it can be very difficult to stand out from all the other budding artists and bands.</p>\n<p>The only headliner I managed to catch over the course of the weekend was <strong>Friendly Fires</strong>, and it was certainly worth it. Performing to a sold out audience, the band lived up to every expectation by producing a set that was incredibly fun and energetic while remaining whole heartedly professional. Set to a background of perfectly choreographed 80’s disco lights, the band managed to capture the salsa rhythms of their euphoric tracks and incite roars of cheers and near contstant dancing amongst the hundreds of fans. No one track seemed to let the whole set down as a whole, and has certainly made me excited about their new album ‘<strong>Pala</strong>‘, due out on <strong>XL Recordings</strong>.</p>\n<p><strong>Saturday:</strong></p>\n<p>Waking with an almighty hangover, I had overcome my initial trauma of the <strong>Queens Hotel </strong>and <strong>22</strong>, and decided to make my way down to the fantastic <strong>Generator Showcase</strong>. As a huge fan of the work <strong>Generator </strong>does in the North East, I was elated when two of the brightest acts from Newcastle performed blistering sets.<strong> Polarsets </strong>(who have contributed to our Covers Compilation which can be found <strong><a href=\"https://admin.crackintheroad.com/music/7835-citr-and-youth-music-present\" target=\"_blank\">here</a><span style=\"font-weight: normal;\">) demonstrated why they have recently signed to uber trendy </span>Kitsune Records. </strong>The band produced an interwoven genius of synths, upbeat percussion and lead singer <strong>Rob Howe</strong>‘s falsetto vocals, which created a very accessible and enjoyable sound. However it was <strong>Mammal Club </strong>that produced one of the highlights of the festival with their truly epic set. Dizzying pop melodies and emphatic drums were the state of play for <strong>Mammal Club</strong>, who managed to produce a sound that far surpassed the small room they were playing in. <strong>Painting</strong>, the band’s final track, stands out as a stunning example of the band’s very firm grasp on the technically magnificent while creating a sound that gets your head bopping enthusiastically 5 seconds before you’ve even realised it’s happening.</p>\n<p>One of the few acts I caught during the <strong>Alternative Escape </strong>was <strong>ANR </strong>at <strong>Shipwrights Yard</strong>. Hailing from <strong>Miami</strong>, <strong>ANR </strong>(a.k.a. <strong>Awesome New Republic</strong>) were another one of those buzz bands that many were labeling as a ‘must see’ , and they weren’t far wrong. Despite being plagued by sound problems throughout, <strong>ANR </strong>still managed to produce a set that did their crazy indie pop, driven by synths, juxtaposed lyrics and even moments of classical piano, justice. While <strong>ANR </strong>won’t be for everyone as a lot of their subtleties are lost amongst the sheer euphoria of their sound, there is certainly a lot more promising talent to come out of the rightly named republic.</p>\n<p>Buried in the depths of <strong>Audio</strong>, James Welch, a.k.a. <strong>Seams</strong>, provided the second major highlight of the day after <strong>Mammal Club</strong>. Many have made comparisons to <strong>Gold Panda</strong>, especially as <strong>Seams </strong>was support on his tour, and rightly so, however in my opinion <strong>Seams </strong>goes even further and produces a stunning level of post-electronica that is instantly absorbing. No one track is similar as <strong>Seams </strong>creates a perpetuating state of intrigue amongst his audience, building a slow and steady intensity as each track feels as if its a collage of still image captures of experiences, providing an intimate window into this and beyond.</p>\n<p>Walking the long walk to <strong>Concorde 2</strong>, our final gig of <strong>The Great Escape 2011 </strong>was set to be indie rock trio <strong>The Antlers</strong>. With a new album release only days before the festival, I was excited to witness the band perform for the first time after listening to a great deal of their older material. However I was left sadly disappointed as the gig fell on a hugely flat note, feeling rather dull in a haze of sound. Perhaps it was the size of the venue, and my positioning within it, however there were only sparks of brilliance in a set that should have stood as mind blowing. Moreover, the band’s newer material is notably weaker than their older work, and when it was played it lacked a necessary level of distinction and atmosphere that ‘<strong>Hospice</strong>‘ provided. By no means an awful set, though <strong>Antlers </strong>set felt criminally disappointing.</p>\n<p><strong>The Great Escape </strong>is by no means a British version of <strong>SXSW</strong>, but it never should be compared as such. Sure, it is an urban festival brimming with new and hugely exciting music set amongst a cool city, however it has it’s entirely own and original feel that ultimately provided three days that will remain in many people’s memories, fans and bands alike, for the rest of the year.</p>\n","slug":"7981-review-the-great-escape-2011","category":"festivals","date":1305644293000,"wpid":7981,"isSticky":false,"featured_image":{"width":650,"height":781,"src":"2011/05/great-escape1.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAMAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAwQH/8QAIhAAAgEEAgEFAAAAAAAAAAAAAQIDAAQGEQUSITFRU5Kh/8QAFAEBAAAAAAAAAAAAAAAAAAAAAf/EABgRAAIDAAAAAAAAAAAAAAAAAAARAQJB/9oADAMBAAIRAxEAPwBU5jBDf2XIpNktvLaOJkjLyhO2+2mAXRG6E3WDsSRkXNjfnRmfx+Vn94zCVtO3r71P3k+WT7GiavQZ/9k="},"createdAt":1587294374851,"updatedAt":1588403555409,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2011/05/great-escape1.jpg","categories":["festivals","music","reviews"]}