{"id":"5e9c30a19b6559241525dbcc","title":"Review: Wild Beasts – Smother","content":"<p>It’s a very rare thing in pop; for a band to release an excellent debut  record is commendable, to follow it up with an outstanding sophomore  record is then a tremendous achievement but for a band’s third record to  be arguably their greatest work is a remarkable feat.</p><p> Well, this is  just what Kendal’s pop eccentrics Wild Beasts have achieved with  “Smother”.</p>\n<p>“Smother” is the culmination of a triptych of albums  that have established Wild Beasts as one of the UK’s most interesting,  progressive and exciting bands and, like it’s predecessors “Limbo,  Panto” and the Mercury nominated “Two Dancers”, it is an album rich in  florid lyrical wit and wordplay, subtle grooves and subversive pop  hooks.</p>\n<p>“Smother” , however, is the record which best captures  Wild Beasts whole musical oeuvre. They have always been a unique band,  never bound to one style or musical convention and characterised by the  phenomenal swooping voice of Hayden Thorpe, sometimes sweet and angelic,  sometimes a low guttural growl. “Smother” again sees Thorpe’s voice to  the fore but the growls and yelps are for the most part eschewed in  favour of a deep low hum or a beautiful falsetto. The vocal restraint,  rather than being a hindrance, actually fits the mood and sound of the  record perfectly and is a testament to Thorpe’s skill as a vocalist.</p>\n<p>Throughout  the course of their previous two records Wild Beasts have created their  own unique world full of ribald sex, romanticism and classically  English eccentricity. “Smother” pushes these themes further and deeper.</p>\n<p>Opener  “Lions Share”  is ushered in by balletic piano and Thorpe’s quivering  bare voice and establishes the dark sensuous, sexual undercurrent that  underpins the record: “I wait until you’re woozy, I lay low until you’re lame, I take you in my mouth like a lion takes it’s game”</p>\n<p>The  nature of relationships and desire is investigated further in  contrasting styles in both “Deeper” and “Plaything” the former is a  heartfelt (in Wild Beasts terms) ode to a relationship and new  beginnings beautifully crooned by the warm baritone of bass player Tom  Fleming who again provides a perfect counter to the flamboyant vocals of  Hayden Thorpe: ,“Deeper, deeper, the smile across my face, deeper, deeper, the fires inside you race” The later is an altogether darker example of explicit desire: “New squeeze, take off your chemise, and I’ll do as I please.”</p>\n<p>There  is no other group in the UK who can tackle such themes without sounding  crass and crude and Wild Beasts characterise their treatises on sex and  carnal desires with an esoteric charm all underpinned by their  evocative wordplay. No indie musicians have been so adept at discussing  matters of the heart since Morrissey.</p>\n<p>What strikes you most when  listening to “Smother” is how exceptionally coherent and measured it  is. The pace rarely goes beyond sedate but the instrumentalism is  perfectly paced and realised and there is not one ounce of fat on the  record, nothing sounds out of place. Credit must be given to guitarist  Ben Little and drummer Chris Talbot for their exceptionally unobtrusive  but meticulous playing. You may think that an album as one paced as this  may be a tad boring but after repeated plays it still remains utterly  captivating and compelling. This is an album of hidden treasures and  subtle pleasures.</p>\n<p>Anyone who is looking for pop thrills and a  hit single in the vein of “Hooting and Howling” will be sated by the  glorious “Reach a bit Further” A duet between the contrasting vocal  talents of Thorpe and Fleming it is an undoubted album highlight, the  propulsive drums, throbbing, humming synths and twinkling guitars  combine to lovely effect with the best chorus of the record. This has to  be a single.</p>\n<p>In recent interviews Wild Beasts have spoken of  their relief at losing out in last years Mercury Prize and not having to  carry the burden of the poisoned chalice of the Mercury’s, well with  “Smother” they have made such a staggeringly good record that it may  well be impossible for the Mercury judges to deny them a second time  around. They better get ready to accept that chalice.  Wild Beasts have  firmly established themselves as the best band in the UK and a perfect  example of innovative, progressive, idiosyncratic British music.</p>\n","slug":"7995-review-wild-beasts-smother","category":"music","date":1305740824000,"wpid":7995,"isSticky":false,"featured_image":{"width":900,"height":600,"src":"2011/05/wildbeasts.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAQG/8QAHhAAAgEFAAMAAAAAAAAAAAAAAQIDAAQFESEGBzH/xAAVAQEBAAAAAAAAAAAAAAAAAAADBP/EABcRAQEBAQAAAAAAAAAAAAAAAAEAAhH/2gAMAwEAAhEDEQA/AMdi/JrK0zKRSxGeydtwxIoVyuh9Yjnd1TN7HxazSKuJRQGIAJJ12lKnMk/W/9k="},"createdAt":1587294369661,"updatedAt":1588403555304,"author":"5e9b68b27a1236eccfeb1d33","old_image":"2011/05/wildbeasts.jpg","categories":["music","reviews"]}