{"id":"5e9c309d9b6559241525dbc0","title":"Film Review: Attack The Block","content":"<p>Director: Joe Cornish</p>\n<p>Length: 88 minutes</p>\n<p>Language: English</p>\n<p>In Attack The Block, a group of youths, their dealer, and a woman they mugged face attack by aliens and the threat of the law.</p><p></p>\n<p>Initially, I was pretty sceptical about Attack The Block, yet another film which may as well have borne the tag-line “Somehow related to Shaun Of The Dead!”. OK, Shaun Of The Dead was fantastic, but the whole awesome by association thing gets wearing.</p>\n<p>Plot similarities between Shaun Of The Dead are fairly conspicuous. Group of people in the suburbs of London are attacked by mysterious enemy, a tongue-in-cheek struggle by ordinary people ensues, a bizarre safe-house is utilised (Although a heavily protected weed-room is probably a lot safer than The Winchester), and Nick Frost is an unhelpful and fairly useless idiot.</p>\n<p>Despite the similarities and associations, Attack The Block was excellent in its own right. A fantastic balance between comedy and horror, the light relief of Ron’s (Nick Frost) cowardice and Brewis’ (Luke Treadaway) stoned antics provides the right atmosphere for the couple of jumps in the film to catch you off-guard. Focusing mainly on the characters and their relationship, he aliens were kept simple, making them far more effective than some complicated CGI monstrosity drawing attention from the drama would have been. The shots are decent, but the colours are fantastic, and combined with the style of the aliens give the film a pleasant arcade feel to it.</p>\n<p>On the other hand, any intended social commentary on the feral youth that roam council estates is pretty much lost. After a dark and unflinching mugging, the muggers are humanised more and more, a point about the basic humanity of everybody that is essentially lost when they tell their former victim that they wouldn’t have mugged her if they had known she was also from the block. A vein of commentary such as this runs through the film, but is overshadowed by the invasion of aliens and the comedy that pervades Attack The Block.</p>\n<p>Attack The Block is definitely worth seeing, fast-paced and thrilling, with some fantastic début performances, as well as Nick Frost’s ever-welcome presence.</p>\n<p>As an aside, if you enjoyed Attack The Block, you may enjoy The Horde. Far darker and grittier, warring police and gangs are trapped in a tower block by zombies and forced to bond to survive. Brutal and violent, and not as silly as it sounds, I promise.</p>\n","slug":"8056-film-review-attack-the-block","category":"arts","date":1305899357000,"wpid":8056,"isSticky":false,"featured_image":{"width":941,"height":520,"src":"2011/05/attach_the_block.png","placeholder":"data:image/jpeg;base64, iVBORw0KGgoAAAANSUhEUgAAAAoAAAAGCAIAAAB1kpiRAAAACXBIWXMAAA7DAAAOwwHHb6hkAAAAwklEQVR4nGOwsDX1jEsJqZ2eMn1HwuRtPln1RkYGupqqgZ6mbqbiDAaGqsbWlhZu/on1E2OL6yMy8m3NdAK9rCqLIiKcFRm0VSRUVeSlBLl01eTMdOUdjGSs9GXD3EzL80OcjSQZ9JTFpEUFuDm4hHg5TLQlzTTFhYW4EuXEmtWljXQkGXQURSWF+QSExLTVFfzdTWOCHGTlpPW4Ob34ODWUxBg0laSlpGXVdQysrKxaW+ubmqqtrK2kFZWERASFBfgAipgntt5nYaAAAAAASUVORK5CYII="},"createdAt":1587294365095,"updatedAt":1588403555198,"author":"5e9b68b27a1236eccfeb1d35","old_image":"2011/05/attach_the_block.png","categories":["arts"]}