{"id":"5e9c342a9b6559241525e1a5","title":"Film Review: Eyes Wide Open","content":"<p><a href=\"https://admin.</p><p>crackintheroad.com/uploads/2010/05/eyeswideopen_03.jpg\"><img class=\"aligncenter size-full wp-image-807\" src=\"https://api.crackintheroad.com/wp-content/uploads/2010/05/eyeswideopen_03.jpg\" alt=\"\" width=\"700\" height=\"375\" srcset=\"https://api.crackintheroad.com/images/2010/05/eyeswideopen_03.jpg 700w, https://api.crackintheroad.com/images/2010/05/eyeswideopen_03-300x160.jpg 300w, https://api.crackintheroad.com/images/2010/05/eyeswideopen_03-494x264.jpg 494w, https://api.crackintheroad.com/images/2010/05/eyeswideopen_03-165x88.jpg 165w\" sizes=\"(max-width: 700px) 100vw, 700px\" /></a></p>\n<p>Since its showing in Cannes in 2009, <em>Haim Tabakman’s</em> first film <strong>Eyes Wide Open</strong> has created quite a stir. Its restrained; understated and ultimately daring take on modern homophobia and religion has created one of the most engaging movies this year.</p>\n<p>The story is beautiful in its simplicity; Aaron (<em>Zohar Strauss</em>), a married, Orthodox Jewish father of four falls in love with a nineteen year old, homeless Yeshiva student named Ezri (<em>Ran Danker</em>). Aaron hires Ezri to work as his apprentice at his butchershop, where they form a close friendship which eventually develops into an emotional and sexual relationship. The world around Aaron slowly starts to crumble as the community that surrounds him begins to condemn him for his acts of ‘lust’, a condemnation that is very much felt by the audience. The film’s musical score, written by <em>Haim Tabakman</em> himself, serves as a constant reminder of the ‘ungodliness’ of their acts. This is uncomfortable thought provoking cinema at its very best.<br />\nAlthough minimalist and understated in its style, the picture’s cinematography for example aims for simple presentation, when the community eventually turns on the couple <em>Tabakman </em>doesn’t shy away from the shame and indeed the condemnation. Simple and elegant set pieces such as newspapers blowing in the wind, literally shows the fragments of the men’s life blowing away from them. The source of the condemnation is also never hidden from, however rather than simply portraying them as hate filled and backward, religion is used to explain their views. To them homosexuality simply doesn’t exist, seen as a moment of ‘evil’ rather than a state of being or even a lifestyle choice. In many ways the realisation of this is the saddest moment of the film, the couple’s situation is truly impossible. Zohar Strauss and Ran Danker are wonderful in their roles, reserved and quintessential the pair show flashes of passion that ignite the screen.</p>\n<p>Although one of the film’s main strengths, the movie’s reserved and subtle quality is sometimes too much, when the film reaches its climax some may feel frustrated they don’t feel more for the situation as a whole. Despite this, <strong>Eyes Wide Open</strong> will undoubtedly stay with you beyond the initial running time. Ultimately the film is still immensely relevant and in many ways the realisation of this is what elevates this film to such an important level.</p>\n<p style=\"text-align: center;\"><a href=\"https://www.youtube.com/watch?v=rwBaS6m3q5c\">Watch The Trailer</a></p>\n","slug":"806-eyes-wide-open","category":"arts","date":1273912279000,"wpid":806,"isSticky":false,"featured_image":{"width":700,"height":375,"src":"2010/05/eyeswideopen_03.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAFAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAMG/8QAIhAAAAYCAAcAAAAAAAAAAAAAAAECAwQRBRIGBxQhQVFh/8QAFAEBAAAAAAAAAAAAAAAAAAAAA//EABkRAAIDAQAAAAAAAAAAAAAAAAABAgMRMf/aAAwDAQACEQMRAD8Ax/PHKb8U5mIqLHVq9FNLqk24SSbUet+r7iUUm+matB3oXn4AALFwSD0//9k="},"createdAt":1587295274391,"updatedAt":1588403567851,"author":"5e9b68b27a1236eccfeb1d24","old_image":"2010/05/eyeswideopen_03.jpg","categories":["arts"]}