{"id":"5e9c309d9b6559241525dbc3","title":"Primavera Sound: A Guide","content":"<p> </p>\n<p>It’s official: in under a week, anyone attending Primavera Sound will be sat by the sea, taking in the sun and good music.</p><p> Or at least be by the sea with good music. Indeed, the Spanish weather hasn’t been the greatest this Spring, with flooding even hitting parts of Barcelona a month ago, so who knows how it will turn out. All signs do indicate, though, that the northern coastline is finally starting to embrace the Mediterranean summer climate that thousands will be coming to enjoy.</p>\n<p>Having been afforded a degree of access that is not normally given to websites of its size (we’re just that great), Crack in the Road will be roaming the many areas of the festival site, armed with just a bottle of cheap honey-rum and a camcorder. We’ll also be providing a number of tips in the coming days of the bands you may otherwise overlook who are playing the festival (if you need us to tell you again about artists like <strong>Sufjan, Islet</strong> and<strong> Cults </strong>being must sees, then you’re going to be missing some pretty amazing performances). As well, given the large number of clashes on such a wide lineup, we’ll also be noting a few we feel it might be worth warning might be worth giving a miss, because there is nothing worse than watching an artist you love fall flat live (we’re looking at you <strong>Ariel Pink</strong>).</p>\n<p>So, below, is a fairly comprehensive set of information, compiled using the help of residents in the area, past visitors and the Primavera organisers themselves. Pay attention class!</p>\n<p><span style=\"text-decoration: underline;\"><strong>The Stages</strong></span></p>\n<p>Whilst you can get a feel for each venue’s style from the type of bands they have in their lineups, there are other various differences:<span style=\"text-decoration: underline;\"><br />\n</span></p>\n<p><strong>San Miguel stage</strong>: This is the main stage of the festival, located in the centre of the site. As you’d expect, this is where the headliners and bigger bands will play.</p>\n<p><strong>Llevant stage</strong>: This is a brand new stage for 2011, located in an area of the Forum that has never been used for Primavera Sound in past years. It will share the larger band roster with the San Miguel stage- think of it as the <em>Other Stage</em> at Glastonbury.</p>\n<p><strong>Ray-Ban stage</strong>: This stage presents a programme of long standing international bands and includes performances by bands which the festival themselves enjoy. Located in front of the sea, this stage allows many people to watch the concerts seated, thanks to the large terracing of the amphitheatre.</p>\n<p><strong>All Tomorrow’s Parties stage</strong>: Also located in front of the sea this stage will be commissioned by All Tomorrow’s Parties festival for the fourth year running. As you’d expect with an ATP stage, the music on show here is usually slightly more eclectic, meaning past shows have either been must sees, or slight flops.</p>\n<p><strong>Pitchfork stage</strong>: Sponsored by Pitchfork, this stage promotes new bands from the international independent scene, together with the most recent bands of the Spanish pop and rock scenes. Ends with electronic artists, who will play into the early hours each night.</p>\n<p><strong>Jägermeister VICE stage</strong>: Arranged by VICE since 2007, this is a medium sized stage featuring an assortment of national and international bands of various styles and genres. It is reinventing itself this year, by joining the ATP and Ray-Ban stages next to the sea.</p>\n<p><strong>Rockdelux stage</strong>: Featuring acoustics that are the envy of every patron to festivals with poor soundsystems (read: Leeds and Reading), this is the Auditorium of the Forum and hosts the more intimate performances of the festival. Be aware, performances here are restricted and it is strongly advised you reserve your entry for the headline acts ahead of your arrival at the festival (in the past queues for entry have reached a 2 hour wait in length).</p>\n<p><strong>adidas Original stage</strong>: This is a small stage, designed for new artists to showcase themselves for the general public, as well as for the music industry professionals of <em>PrimaveraPro, </em>who centre on this area.</p>\n<p><span style=\"text-decoration: underline;\"><strong>Alternative Entertainment</strong></span></p>\n<p><strong>Beefeater Theatre </strong>(Cine Beefeater)<br />\nFor the first time, Primavera will be home to the Beefeater In-Edit festival, which has been travelling Spain and South America for the past 8 years, showcasing a series of music documentaries. There will be six movies displayed over the course of the festival, including the Story of Creation Records and biopics of Bob Dylan and Nina Simone.</p>\n<p><strong>MiniMúsica</strong></p>\n<p>This will be the fifth year for minimusica and, speaking for myself, I’m jealous. The mindset for the organisers of this children’s activity, is that there is no such thing as ‘childrens music’, rather exposure to different types of sounds is vital. So in past year children have witnessed family orientated performances from such artists as <em>Dirty Projectors</em>.</p>\n<p>It is an interactive performance in which the children learn to classify different instruments and learn to distinguish the qualities of the sound (pitch, speed, intensity, duration and timbre) and to give their opinions as listeners.<br />\nThis year’s theme will be “Means of Transport” and the minimúsica area will be noticeably bigger than in previous editions, with a “minigarden” of games and ar-<br />\ntificial grass, as well as a stage for the concerts, and magazine Naif will put the icing on the cake by making sure that nothing is missing by supplying hundreds of the latest toys.</p>\n<p>(I’m 21 years old and jealous of this. Don’t lie and say you’re not)</p>\n<p><strong>Salón Myspace Smint</strong></p>\n<p>This is a small stage which features a roster of the most popular independent artists listed on Myspace. As well, Myspace has organised a competition for new bands, whose winner will be win the opportunity to play on this stage for the public of the festival.</p>\n<p><strong>Ray-Ban Unplugged</strong></p>\n<p>An acoustic stage, where a variety of artists will perform, do interviews and greet  fans.The lineup includes Suicide, Avi Buffalo, Male Bonding and Julian Lynch.</p>\n<p><strong>Record Fair</strong></p>\n<p>A retail space for national and international independent labels to display their products to all visitors. A number of labels will have smaller bands on their roster performing in this area.</p>\n<p><span style=\"text-decoration: underline;\"><strong>Accommodation</strong></span></p>\n<p>There is no camping (well, official camping) site at Primavera, so you will need to arrange your own hostel or hotel for the duration of your stay. If you are yet to sort this out, you’re pushing it close, and the majority of nearby hostels sold out <em>months</em> ago. However, there are still some budget places to be found a little further out. If you bear in mind that the metro system in Barcelona is generally in a far better state than other Spanish cities, probably on a par with the London Underground, then it should be obvious that your best option is to study maps of the metro system (we even included one below!). By following the <em>Yellow </em>line, number 4, you can see that Poble Nou could theoretically be reached easily from places as far as Trinitat Nova, though any further than Girona is probably not going to be an enjoyable journey after a night at the festival. As a general rule when planning, allow 2 minutes between each stop and 6 for each change you need to make.</p>\n<p><span style=\"text-decoration: underline;\"><strong>Maps</strong></span></p>\n<p>Whilst common sense will help out most of the time, the fact is it is easier to get lost at Primavera than most festivals because, a) it’s in a city. b) everything’s in Spanish. c) EVERYTHING’S IN CATALAN. So to help, we’ve compiled together a couple of handy maps to help you on your way:</p>\n<p><a href=\"https://api.crackintheroad.com/uploads/2011/05/Plano-recinto-Parc-del-Forum_hi.pdf\">The Parc del Forum site</a></p>\n<p><a href=\"https://www.tryp-apolo.com/img/metromapbcn.gif\">The metro line of Barcelona</a></p>\n<p>Stay awake in the coming days for more information and, if you’re English, please don’t add an ‘o’ to the end of English words. As a nationality, we will disown you in front of the Spanish if you do. Thank you.</p>\n","slug":"8061-primavera-sound-a-guide","category":"festivals","date":1305898210000,"wpid":8061,"isSticky":false,"featured_image":{"width":500,"height":333,"src":"2011/05/ambiente_01_chus_sanchez-e1305821854979.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAUG/8QAIxAAAgEDAwQDAAAAAAAAAAAAAQIDAAQFBhESBxMhMRQiUf/EABQBAQAAAAAAAAAAAAAAAAAAAAH/xAAcEQABAwUAAAAAAAAAAAAAAAACAAMhAQQSYfD/2gAMAwEAAhEDEQA/AKGntSRNqO1wWVMpluXMC9pFCRExc1Q/v1Hv0C21ZrIdO8RHf3KfFnPGVhuGTz5NKU0aEkW7xTlPaX//2Q=="},"createdAt":1587294365746,"updatedAt":1588403555225,"author":"5e9b68b27a1236eccfeb1d0b","old_image":"2011/05/ambiente_01_chus_sanchez-e1305821854979.jpg","categories":["festivals","music"]}