{"id":"5e9c34919b6559241525e24e","artists":["5e9b68d47a1236eccfeb1e58"],"title":"Review: Black Bear – The Cinnamon Phase","content":"<p>Way back when, in the hazy summer of ’06, Sam Beebe, better known to the world as Black Bear released his debut ‘The Cinnamon Phase’.</p><p> This twee album, hailing from the depths of Canada takes its name from a colour phase of the young black bear, and in doing so appropriately captures a phase in the life of the artist. In similar stylings to artists such as Conor Oberst or Elliot Smith; Beebe lays his emotions out painfully bare to the audience. However, unlike the aforementioned artists, this is done without the need to hide them under complicated allegories and double meanings, each song conveys and captures a different emotion. This is seen with the opening track ‘Black Bear’ displaying Beebes desire to be the animal, with a haunting synth and drum beat underlying his voice it feels almost as if he is telling a story rather than singing a song. Further insight into the songs are given from the liner notes, which are stylised like a diary providing the events that led to their production and what they aim to convey along with coinciding Polaroids snapshots.</p>\n<p>After a far too brief journey through these memoirs we are left with the closing track ‘Like Venice’, this minute long monologue conveys a musing that will still strike a chord long after you have taken the album off repeat.</p>\n<p>Try:</p>\n<p><a href=\"https://api.crackintheroad.com/uploads/2010/04/12-Like-Venice.wav\">Black Bear – Like Venice</a></p>\n<p>Buy:</p>\n<p><a href=\"https://www.myspace.com/blackbear\">https://www.myspace.com/blackbear</a></p>\n","slug":"81-black-bear","category":"music","date":1270930503000,"wpid":81,"isSticky":false,"featured_image":{"width":500,"height":336,"src":"2010/04/cinnamp.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAUH/8QAIBAAAgIBBAMBAAAAAAAAAAAAAQIDEQAEEiFBBQYxcf/EABQBAQAAAAAAAAAAAAAAAAAAAAT/xAAaEQACAgMAAAAAAAAAAAAAAAABAgAhAwQT/9oADAMBAAIRAxEAPwCL6nqZZfJQzONLFpGNKAhaRNpok9Hrj5mktuDGndhfBUgA/li6xjCtqY3NiL7MLE//2Q=="},"createdAt":1587295377047,"updatedAt":1588403569252,"author":"5e9b68b27a1236eccfeb1d25","old_image":"2010/04/cinnamp.jpg","categories":["music","reviews"]}