{"id":"5e9c30859b6559241525db9f","artists":["5e9b69577a1236eccfeb2678"],"title":"Interview: Toro Y Moi","content":"<p><strong>Toro Y Moi</strong>, a.</p><p>k.a. <strong>Chazwick Bundick<span style=\"font-weight: normal;\">,</span> </strong>descended on the glorious North West with performances at both <strong>Friends of Mine Festival </strong>and <strong>The Deaf Institute</strong>, and demonstrated why the good folk at <strong>Pitchfork </strong>labeled ‘<strong>Underneath The Pine</strong>‘ as <strong>Best New Music</strong>. <strong>Crack In The Road </strong>caught up to Chaz prior to his set at <strong>The Deaf Institute </strong>to discuss his influences, plans for the summer and the now infamous ‘chillwave’ tag.</p>\n<p><strong>CITR: </strong>Which artist has influenced you the most, and why?</p>\n<p><strong>Chaz: </strong>Not sure how I’d pick one! Most recently I’d guess it’d be <strong>Dan Snaith</strong>. The way he works really inspires and influences me, especially as he always changes. It’s always good to keep changing, and I find that we’re both in similar positions where we both work on the record by ourselves, and then we have a live band. So I think I can relate to that really well.</p>\n<p><strong>CITR: </strong>Funny you should mention that as I interviewed Dan not too long ago, and he mentioned the importance of the live work coming after the production.</p>\n<p><strong>Chaz: </strong>Same here! I feel like moving on to the live band was the best step, to get away from the laptop alone as it was never how I wanted to perform my music on stage. When it came to start playing as Toro Y Moi, developing the live element was the first thing that came to mind as I was just on my own.</p>\n<p><strong>CITR: </strong>You played in bands prior to forming Toro Y Moi, how much of those experiences influence your current live performances?</p>\n<p><strong>Chaz: </strong>Being in bands previous to this was almost like practicing to be in this band. I feel like being in those bands helped me learn the essential skills of what it takes to be in a band, in terms of performing and how to make a job out of it.</p>\n<p><strong>CITR: </strong>What would you say has been your favourite gig, and why?</p>\n<p><strong>Chaz: </strong>There’s a handful of good ones to be honest! I mean, last week in Paris was one of my favourite shows. It had a great light show, a loud and responsive audience, and I felt like we all played really well.</p>\n<p><strong>CITR: </strong>So it’s a case of when everything just clicks?</p>\n<p><strong>Chaz: </strong>Yeah! I mean, I think it just takes a second for everything to get into the groove of things. Usually at the beginning it’s always a bit groggy, but towards the second or third track you start getting into things and start going with the flow.</p>\n<p><strong>CITR: </strong>Can you think of your worst ever gig?</p>\n<p><strong>Chaz: </strong>Well, recently when we played at home my laptop screwed up on stage, that was pretty rough! It was embarrassing as all our friends and families were there. However on the other hand, it was just our friends and families so they don’t really care! So we just carried on and started over.</p>\n<p><strong>CITR: </strong>How did you find Friends of Mine Festival?</p>\n<p><strong>Chaz: </strong>It was cool! It went really well, but we were rushing to get there and literally got there just in time. We finished just before the rain and hail, so it was pretty good timing!</p>\n<p><strong>CITR: </strong>I hear Deaf Institute is one of your favourite venues?</p>\n<p><strong>Chaz: </strong>Yeah! It sounds great, and the accommodation is pretty amazing! It’s pretty ballin’, especially as it has beds and a washer/dryer. The room itself is pretty awesome, as it’s got that great amphitheatre feel with the dome and the decor. I think there’s some other amazing venues too, such as the 40 Watt in Athens, Georgia. It’s got so much great history, and it’s got an awesome back room too!</p>\n<p><strong>CITR: </strong>I love how impressed you are by back rooms .. !</p>\n<p><strong>Chaz: </strong>It’s important! It’s your home for the day, so it’s really nice to have a place to zone out and not be in the van. What’s even better about this place is that you can spend the night here, so you can completely unpack.</p>\n<p><strong>CITR: </strong>You’ve recently released <strong>Underneath the Pine</strong>, how do you feel it differs from your debut?</p>\n<p><strong>Chaz: </strong>Well from a personal point of view, I’ve been writing songs with instruments the whole time. I think this was the first time that fans and audiences got a chance to see that I write music without a laptop. In a way it was another debut, as I was just waiting to see what people’s reactions were going to be. I feel like there’s two halves, as there’s what I like to do with electronics and what I like to do with instruments. I know that my first album will always be my debut, however with <strong>Underneath The Pine</strong> it feels like a completely new start; no laptop and there’s a live band.<strong> </strong></p>\n<p><strong>Toro Y Moi</strong> as a name is getting bigger, so it’s obviously a smarter way to go keeping the band and the live performance. I think the next record is going to definitely keep going down the same vein. Just because I’m so scatter brained I still have stuff I like writing on the laptop too!</p>\n<p><strong>Chaz: </strong>How do you produce records/what is your creative process?</p>\n<p><strong>CITR: </strong>It’s very spontaneous. I’m really not thinking about the live show that much, as I like creating and hearing the music more, as I don’t think about how it’s going to work live. It has it’s advantages and disadvantages. I have stuff I’m working on and I’m not sure how I’m going to work it live yet!</p>\n<p><strong>CITR: </strong>What are Toro Y Moi’s plans for the rest of the year?</p>\n<p><strong>Chaz: </strong>There’s going to be a lot more shows. We’re doing another US tour, with festivals over there. After a short break we’re back over here and Australia.</p>\n<p><strong>CITR: </strong>Anything in particular you’re looking forward to?</p>\n<p><strong>Chaz: </strong>Well after Europe we’re going to Asia, and we’ve never been there before! We’re playing Japan and Korea.</p>\n<p><strong>CITR: </strong>Finally, what do you think of the now infamous chillwave tag?</p>\n<p><strong>Chaz: </strong>I’ve totally accepted it, and labels and genre names are totally ok. It makes sense to use them to be honest. Sometimes it sounds silly, and sometimes it sounds appropriate. Knowing how chillwave came to be as a joke from a blog, it’s funny thinking about how big its gotten. I don’t know what exactly it is, because I’m just writing the music I like to make, so it’s hard to say. Obviously some people are still calling it chillwave, but for this record I don’t really agree.</p>\n<p><strong>CITR: </strong>What would you label your own music as?</p>\n<p><strong>Chaz: </strong>I guess, I’d probably say RnB and psychedelic. But I don’t know how you’d put those two together, maybe RnPsychedelic? RnPsych? Who knows!</p>\n","slug":"8210-interview-toro-y-moi","category":"interviews","date":1306508735000,"wpid":8210,"isSticky":false,"featured_image":{"width":805,"height":1050,"src":"2011/05/toro-y-moi.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAANAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAABQQG/8QAJBAAAgECBQQDAAAAAAAAAAAAAQIDBAUABhESISIjMVFBUuH/xAAUAQEAAAAAAAAAAAAAAAAAAAAE/8QAGREBAAIDAAAAAAAAAAAAAAAAAQAxAxES/9oADAMBAAIRAxEAPwC6hyxa6aCjpLrTUSRTJJKZF7ih0527tT8A8YOaPKcrGSKyM8bHcrLV8EHwR1eMYS75juEtNWo0zBZXLOAdAW+2g0GvHPvBLGfce8fPr9wQwurjOVtn/9k="},"createdAt":1587294341757,"updatedAt":1588403554906,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2011/05/toro-y-moi.jpg","categories":["interviews","music"]}