{"id":"5e9c30819b6559241525db93","title":"Festival Review: Evolution Festival Saturday (Newcastle/Gateshead)","content":"<p><a href=\"https://admin.</p><p>crackintheroad.com/uploads/2011/05/Iggy-Pop-0021.jpg\"><img class=\"alignnone size-full wp-image-8267\" title=\"Iggy\" src=\"https://api.crackintheroad.com/wp-content/uploads/2011/05/Iggy-Pop-0021.jpg\" alt=\"\" width=\"900\" height=\"675\" srcset=\"https://api.crackintheroad.com/images/2011/05/Iggy-Pop-0021.jpg 900w, https://api.crackintheroad.com/images/2011/05/Iggy-Pop-0021-260x194.jpg 260w, https://api.crackintheroad.com/images/2011/05/Iggy-Pop-0021-640x480.jpg 640w, https://api.crackintheroad.com/images/2011/05/Iggy-Pop-0021-165x123.jpg 165w\" sizes=\"(max-width: 900px) 100vw, 900px\" /></a>Founded back in 2005 and undergoing various name changes through the years, Evolution Festival is now the biggest music festival in the North East. Having boasted the likes of Hard-Fi, Maximo Park and The Streets as headliners, it’s very much focused around chart orientated indie music. With Iggy Pop, Two Door Cinema Club and The Kills on the bill for Saturday, as well as newcomers Vinyl Jacket and Bravestation; the wealth of talent on display was sure to be phenomenal. Despite having my two sealed bottles of orange juice confiscated, the first day of Evolution was an unprecedented success. Here’s a summary of my highlights from Saturday.</p>\n<p>Vinyl Jacket</p>\n<p>0pening the mainstage of this festival was a real testament to just how far Vinyl Jacket have come in the year since they formed. In true rock and roll style, seconds before the guys took to the stage they realised they had left a crucial guitar capo in their van, thus inducing a frantic /rush to source the vital item. Luckily visiting Canadian friends Bravestation were more than happy to help the Newcastle five piece out. Playing to their largest crowd to date, Vinyl Jacket certainly kicked the weekend off in style, ripping through their set of indie-pop gems. Running through the likes of recent single Painting Stations and new track Lucky Solider, they certainly acted as brilliant introduction to the rest of the days music. Vinyl Jacket also filmed the video for next single, Koala, so look out for that over the coming months!</p>\n<p>Mammal Club</p>\n<p>On the back of the release of Au, their debut EP, Mammal Club played to a rather subdued crowd at the Baltic Mills. However the size of the audience wasn’t going to deter them from racing through their set, comprised largely of material from Au, as well as showcasing the track currently penciled in to be their next single. Wilson Astley was on typically jovial form, joking with the watching crowd about the ‘imaginary city’  NewcastleGateshead seemingly invented by the festival organisers. Personal highlight for me proved to be Otter, a jagged guitar number that also stood out from the Au EP.</p>\n<p>Bravestation</p>\n<p>Already championed as the artist who had traveled the furthest distance to play Evolution Festival, Canadian four piece Bravestation played a set blighted by technical issues. However it still proved popular amongst the NewcastleGateshead crowd, even prompting a mosh pit, somewhat bizarre for a largely folk inspired group. With the howling wind already muffling the sound at times, it was rather unfortunate when an equipment failure forced the guys to start a track again, although it was an unpreventable issue in an otherwise invigorating and enjoyable set.</p>\n<p>Hercules & Love Affair</p>\n<p>With a debut album received to such critical appraisal, it was somewhat bizarre when Hercules & Love Affair announced that several of the members sadly no longer wanted to be part of the group. Relying on a set predominantly composed of tracks from their classic self-titled album, it was a shame that although Hercules were arguably the most danceable act of the day, it didn’t seem to initiate much of a response from the crowd. There were moments when the three lead singers appeared distant and confused, although with the lack of crowd reaction that their soulful vocals and catchy hooks prompted, it was entirely understandable.</p>\n<p>The Kills</p>\n<p>At festivals such as Evolution, it’s rather difficult for The Kills; as a vast majority of the crowd appeared to just be there to see Kate Moss’s other half, Jamie Hince. Creating a fairly (phenomenal) degree of sound for a two piece backed only by a standard drum machine, The Kills raced through a set comprised mainly of tunes from their most recent LP Blood Pressures. Unfortunately, due to the severe winds and rather static crowd, much of the set was lost upon the festival audience. Although, truth be told, it was a rather soulless performance, saved only by Hince’s infectious jagged guitar riffs. Lead singer and indie pin up Alison Mosshart didn’t perform with any real gusto, and lacked the cutting edge to make it a memorable set.</p>\n<p>Two Door Cinema Club</p>\n<p>I don’t bare any bones about the fact that I’m not a huge fan of Irish indie pop outfit Two Door Cinema Club. I find their music soulless and criminally uninspiring, living off the dying embers of the guitar revival of the early 2000s. However, with this opinion I appeared to be very much in the minority at Evolution Festival, with the four piece drawing one of the largest crowds of the weekend. Their set was tight and expertly rehearsed, using the opportunity to showcase a couple of B-sides, along with singles Eat It Up It’s Good For You and I Can Talk from their debut full length Tourist History. So whilst I found it hard to release to their danceable set, I fully appreciate that there are certainly those who thoroughly enjoyed the performance.</p>\n<p>Iggy Pop</p>\n<p>By far the oldest musician playing Evolution, Iggy Pop gave a stellar lesson in Rock and Roll, showing the likes of Two Door Cinema Club and The Kills how to embody true spirit and energy. By this time, a vast proportion of the Evolution crowd had headed over to the Baltic Stage to see rising star Katy B; a shocking decision in my opinion, yet this didn’t prevent Iggy from thrilling the eager fans. Prompting a stage invasion early on in the set, as well as snapping several microphone stands, Iggy certainly put on the most memorable display of the evening. Despite omitting the likes of Lust For Life and Passenger, The Stooges proved that age matters very little, and still played a set packed full of hits. The vicious I Wanna Be Your Dog saw Iggy crawling on all fours around the photographer pit, whilst he told the crowd ‘your pretty face is going to hell!’. All in all, Iggy and the Stooges put on the finest, most exciting performance of the day, proving them to be worthy festival headliners.</p>\n<p>So with the Saturday over, it was time to head home and catch some much needed sleep, in preparation for the more pop orientated line-up, featuring Plan B, Tinnie Tempah and Caribou</p>\n","slug":"8222-festival-review-evolution-festival-saturday-newcastlegateshead","category":"festivals","date":1306846664000,"wpid":8222,"isSticky":false,"featured_image":{"width":165,"height":165,"src":"2011/05/iggy-pop-002-165x165.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAABwEG/8QAJhAAAgIABAQHAAAAAAAAAAAAAQIDBAAGESEFEkFRBxUxMjNCYf/EABQBAQAAAAAAAAAAAAAAAAAAAAD/xAAUEQEAAAAAAAAAAAAAAAAAAAAA/9oADAMBAAIRAxEAPwCVvDmrwbINzL1rMFWtamgM9hZ4dVWccrqyMD7QdtfU9O2B/wAxsj5IuBmT7F6jMxPXU67n9wh8CkezlPObWHaVg8SgyHmOnKu2/TGWexMjFElkVVOgAYgAdsB//9k="},"createdAt":1587294337394,"updatedAt":1588403554802,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/05/iggy-pop-002-165x165.jpg","categories":["festivals","music","reviews"]}