{"id":"5e9c30789b6559241525db85","title":"Festival Review: Evolution Festival Sunday (Newcastle/Gateshead)","content":"<p>After possibly the most enjoyable start to an <strong>Evolution Festival</strong> I’d ever experienced, the weight of expectation fell onto the Sunday and it’s line up of <strong>Radio 1 Heroes</strong>.</p><p> The likes of <strong>Plan B</strong>, <strong>Tinie Tempah, </strong>and <strong>Example</strong> were set to fill the same slots that only 24 hours earlier had been occupied by the likes of <strong>Iggy and the Stooges</strong>, <strong>The Kills</strong>, and<strong> Bravestation</strong>.</p>\n<p>As we entered the festival, it was painfully obvious that today was the dreaded ‘get-as-drunk-as-you-can-15-year-old-day’. Far busier than the day before, the crowds arrived earlier to make sure they got to the front of the main stage and start as many half hearted mosh pits as possible. In an attempt to avoid darkening our sterling opinion of <strong>Evolution Festival </strong>thus far, we decided to limit the number of bands we’d make it to. This had nothing to do with having a hangover and having 5 hours sleep on a sofa.</p>\n<p>Beginning over in the <strong>Baltic Square Stage, Mount Kimbie </strong>produced a stellar performance of their post-dubstep sound. Having seen the electronic duo perform on several occasions in the past, this particular set stood out as one of their tighter performances as they steadily mastered the balance between their ambient samples and bass driven loops to produce a sound that is identifiably unique. Wandering over to the main stage allowed us to catch <strong>Darwin Deez</strong>, who performed his light hearted indie stylings to a baying audience. I’ve never been a fan of Darwin’s music (‘if freckles dont’ mean anything, does anything mean anything’  – far too profound for me), however this certainly was a very appropriate booking for <strong>Evolution Festival </strong>and appeared to be a hit amongst the crowd.</p>\n<p>As the sun set over the NewcastleGateshead quayside back drop, <strong>Plan B </strong>took to the stage to meet arguably the largest audience of the weekend. A clever entertainer, the half of <strong>Plan B</strong>‘s set we managed to catch certainly lived up to the expectation of a modern day headliner. Slick, well choreographed and energetic, <strong>Plan B </strong>provided a great deal for the crowds to cheer about, while performing powerful renditions of his hip hop and soul infused tracks. Though in direct comparison to <strong>Iggy and the Stooges </strong>headline slot, I couldn’t help but feel disappointed that large performances have lost the utter chaos the likes of <strong>Iggy Pop </strong>could master.</p>\n<p>Our final act of the day and the weekend, and one of my highlights, was Canadian musician/maths genius/demi God <strong>Dan Snaith</strong>, a.k.a. <strong>Caribou</strong>. Performing a relatively intimate set on the <strong>Baltic Square Stage</strong>, <strong>Caribou </strong>produced a superbly energetic and tight performance that never faltered. The accompanying light show matched the intensity of the sound, and the band’s centered positioning on stage only emphasised how sublime the synchronicity of the band’s separate core essences really are. An encore of ‘<strong>Sun</strong>‘ provided a truly epic end to a set that I could have easily watched for several more hours into the night.</p>\n<p><strong>Evolution Festival </strong>is aptly named in many ways, as each year has seen the festival evolve into another stage of development. Beginning very humbly, the festival now attracts some of the largest and most respected acts in modern music, and it shows no sign of plateauing any time soon.</p>\n","slug":"8270-festival-review-evolution-festival-sunday-newcastlegateshead","category":"festivals","date":1307033097000,"wpid":8270,"isSticky":false,"featured_image":null,"createdAt":1587294328500,"updatedAt":1588441789047,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2011/05/caribou-188x188.jpg","categories":["festivals","music","reviews"]}