{"id":"5e9c30429b6559241525db20","title":"Festival Review: Dot to Dot (Manchester)","content":"<p><strong>Dot to Dot Festival </strong>in Manchester held special significance for <strong>Crack In The Road </strong>and myself, as it stood as the first festival we ever covered.</p><p> in 2010 <strong>Dot to Dot </strong>sprung from it’s humble beginnings and included Manchester in it’s journey for the first time. Returning in 2011, <strong>Dot to Dot </strong>had a lot to live up to after some fantastic performances only a year earlier, including <strong>Dog is Dead </strong>and <strong>Mystery Jets</strong>.</p>\n<p>My <strong>Dot to Dot </strong>day began with <strong>Veto</strong> in Manchester’s fantastic <strong>Club Academy</strong>. These Danish indie rockers attracted a sizable, and enthusiastic, audience, however the band’s attempt to create a dark, almost harrowing, sound all felt rather two dimensional. While their performance was committed, the band’s set up of melancholic vocals and driven guitars sounded more like a tutorial on how to create <strong>Hurts</strong>-esque music, insofar as including the key elements but lacking any real creative flair or individuality.</p>\n<p><strong>Braids </strong>followed later that evening and stood out as the clearest highlight of the festival. Hailing from the picturesque surroundings of Calgary, Alberta, the band produced a set which was truly inspiring. Set up like a typical indie rock outfit, <strong>Braids </strong>employed each individual component of their sound to create something wholly unique and absorbing. There were no breaks as track after track flowed through emphatic percussion and pulsating vocals, demonstrating the genius that can evolve out of a genuine sense of experimentation. We were lucky enough to catch up with the band prior to their show, so make sure to watch out for our interview in the coming days!</p>\n<p>Fearing my <strong>Dot to Dot </strong>experience had climaxed prematurely with <strong>Braids</strong>, <strong>Cults </strong>took to the stage with their usual sense of enthusiasm and symbolic indie pop. I’d already seen <strong>Cults </strong>perform at <strong>The Great Escape </strong>and been won over by their confident and entertaining set. However on this occasion, while the band still performed with the same zeal they displayed in Brighton, the atmosphere echoed of that of a run through. Maybe this was because I’d just watched <strong>Braids</strong>, or perhaps it demonstrates the fatal flaw in <strong>Cults</strong>‘ sound having a very limited shelf life. Only time will tell</p>\n<p>A noticeable development in <strong>Dot to Dot</strong>‘s presence in Manchester this year was the greater inclusion of notable headliners. One of the few I managed to catch was <strong>The Naked and Famous </strong>(pictured), who have had less than favourable reviews here at <strong>Crack In The Road </strong>in the past. However on this occasion they performed an energetic set that entertained a packed out <strong>Academy 1</strong>. While some may label them <strong>MGMT-Lite</strong>, there is obviously a demand for <strong>The Naked and Famous </strong>amongst certain audiences, though they will always force others to utter those eternal words, ‘they’re good at what they do’.</p>\n<p>Last year <strong>Dot to Dot</strong>‘s centralisation around the <strong>Acadmies </strong>left outlying venues like <strong>The Deaf Institute </strong>barren of crowds most of the day. Unfortunately this was the case again this year. Performing to a criminally small audience, <strong>Colourmusic </strong>produced a close second performance to that of <strong>Braids</strong>, with their hardcore stylings bringing my ear drums near to a joyful bleed. Full of reverb and inaudible lyrics, <strong>Colourmusic </strong>aren’t the most easily accessible of bands, but they’re all the more interesting and exciting for it. The band claim their music is inspired by <strong>Sir Isaac Newton</strong>‘s theory on the relationship of colour and sound, and following in <strong>Newton</strong>‘s steps <strong>Colourmusic </strong>have indeed created something revolutionary.</p>\n<p>A year on from their first foray into <strong>Manchester</strong>, <strong>Dot to Dot </strong>is still experiencing growing pains as it continues to develop and evolve. While outlying venues such as <strong>Deaf Institute </strong>and <strong>Sound Control </strong>suffered from sub par audiences, this year saw the establishment of a greater line up and organisation. However most importantly <strong>Dot to Dot </strong>left enough of a good taste on the musical palette to make me excited about their return next year, and for many years to come.</p>\n","slug":"8294-festival-review-dot-to-dot-manchester","category":"festivals","date":1308407063000,"wpid":8294,"isSticky":false,"featured_image":{"width":165,"height":110,"src":"2011/06/dot-to-dot-festival-165x110.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAYH/8QAIhAAAQMDAwUAAAAAAAAAAAAAAQIDEQAEBQYTIRIVMTJx/8QAFAEBAAAAAAAAAAAAAAAAAAAAAv/EABURAQEAAAAAAAAAAAAAAAAAAAEA/9oADAMBAAIRAxEAPwDN8FrPtujcVZIurt9hLW4u2UAWwvcKSnkT6iZB88VH3WrHlXLykYzH9JWSJaExP2lKApJv/9k="},"createdAt":1587294274447,"updatedAt":1588403553847,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2011/06/dot-to-dot-festival-165x110.jpg","categories":["festivals","music","reviews"]}