{"id":"5e9c30729b6559241525db79","artists":["5e9b69447a1236eccfeb2563"],"title":"Interview: Sparrow And The Workshop","content":"<p><a href=\"https://admin.</p><p>crackintheroad.com/uploads/2011/06/highres_7.jpg\"><img class=\"alignnone size-full wp-image-8341\" title=\"Sparrow & The Workshop\" src=\"https://api.crackintheroad.com/wp-content/uploads/2011/06/highres_7.jpg\" alt=\"\" width=\"900\" height=\"600\" srcset=\"https://api.crackintheroad.com/images/2011/06/highres_7.jpg 900w, https://api.crackintheroad.com/images/2011/06/highres_7-260x173.jpg 260w, https://api.crackintheroad.com/images/2011/06/highres_7-640x426.jpg 640w, https://api.crackintheroad.com/images/2011/06/highres_7-165x109.jpg 165w\" sizes=\"(max-width: 900px) 100vw, 900px\" /></a>My first encounter involving quirky three piece Sparrow & The Workshop was almost exactly a year ago, in the sweaty yet homely confines of Captains Rest in Glasgow, for the Scottish section of Stag and Dagger. With their fantastic debut album Crystals Fall released through Distiller Records last year to vast critical acclaim, including a 9/10 from Clash Magazine, the weight of expectation grew steadily for their follow up attempt. Sophomore album Spitting Daggers was released earlier this week therefore shortly before their headline set in Newcastle, Crack in the Road caught up with Jill, Nick and Gregor to get a few questions answered.</p>\n<p><em>CitR: So you’ve just played a few gigs in Scotland, how did those go?</em></p>\n<p><strong>Nick: Yeah it was good, obviously Glasgow was our home crowd, and that was packed out and Edinburgh was sold out, which was really good. It was strange for us, playing these big shows, as we are playing a lot of new material; and because our album isn’t even out yet, we were a little bit concerned that people maybe didn’t know some of the new material.</strong></p>\n<p><em>CitR: I suppose it’s a good chance to debut new tracks, and for people to hear what you’ve been up to?</em></p>\n<p><strong>Nick: Yeah, totally. We’ve always considered ourselves as a live band, so we’re really comfortable showcasing new tracks.</strong></p>\n<p><em>CitR: With the new album, did you find much difficulty having to record a follow up to your debut which received so much positive coverage?</em></p>\n<p>Jill: We didn’t feel any pressure, I don’t know if we just ignored it and didn’t pay attention. We already had a body of material that we were happy with and when our label approached us saying ‘Do you have any demos?’, we were able to say ‘Well actually we have quite a few.’ So we picked the ten strongest, the ones that we thought worked the best together, and we wanted it to have that continuity. In a way it’s weird because we were quietly working away, and people were asking ‘Where are you guys? Why aren’t you playing any shows?’, then next thing they knew, we were saying “Oh by the way our album is coming out in a month.’ It felt nice in a way, because we’d had our heads down working on it, but I don’t think we really felt any pressure. Our label wanted another album, but they weren’t restrictive on dates.</p>\n<p><em>CitR: In terms of influences on the new album, were they any different from the debut record?</em></p>\n<p>Gregor: I’d say that the influences were more about meeting people and seeing the way that they go about their live shows. We were probably more influenced by the confidence and behavior of other bands, and maybe becoming slightly less shy about the music we create.</p>\n<p><strong>Nick: Obviously just like anyone, over the course of the last year we’ve discovered new albums, new pieces of music, new bands, and I guess all of these influence you. </strong></p>\n<p>Jill: I think that frustrates the printed press, they try to pin us down to a sound or genre, which isn’t quite the same with the online press. I don’t want to speculate, but I get the impression online press is younger people, and musicians as well, they seem to give albums more time. People are always trying their best to pigeon-hole us, which is funny, because I can hear certain bands in our sound, like Black Sabbath gets mentioned all the time.</p>\n<p><strong>Nick: It’s strange actually, with Snakes In The Grass I think the biggest influence was a lady at a hotel in Glasgow being such a cunt. (laughs)</strong></p>\n<p>Jill: Yeah, I mean you get people who piss you off, and I started writing this track, then we just thrashed it out.</p>\n<p><em>CitR: So if you had to describe your own music, how would you go about it?</em></p>\n<p>Jill: Ooh that’s hard, what does visceral mean? I feel like it’s that, but I don’t know what it means. (laughs)</p>\n<p><strong>Nick: I don’t know, we could all really embarrass ourselves. </strong></p>\n<p><em>CitR: You’ve got quite a long tour coming up now, are there certain cities or venues that you get a particularly good response from?</em></p>\n<p><strong>Nick: Yeah, it’s never really cities that you expect though. Manchester is good, we’re not playing Leeds this time, but that’s always great. Preston, Bristol and Brighton are always really fun to play. We’ve only played Newcastle as support before, so we don’t really know what it’s going to be like here!</strong></p>\n<p>Jill: We always seem to struggle in Liverpool.</p>\n<p><strong>Nick: It’s quite nerve racking in a way; you don’t know how many people even know who you are.</strong></p>\n<p><em>CitR: I guess that really gives you a stage to impress upon?</em></p>\n<p><strong>Nick: Yeah, completely, support bands can really make it work to their advantage. The support we’ve got for this tour is a band called Meursault who are awesome, genuinely really really good.</strong></p>\n<p><em>CitR: And finally, if you could have any super power what would it be?</em></p>\n<p>Jill: Gregor should answer this, he’s the one who reads comic books!</p>\n<p><em>CitR: We’ve had some interesting answers in the past, including a big Smurf penis.</em></p>\n<p><strong>Nick: Surely if it was a big blue penis it wouldn’t have any blood in it?</strong></p>\n<p>Jill: I would just have the gift of foresight, because that’s something that I lack</p>\n<p><strong>Gregor: I’m going to be boring and say flight.</strong></p>\n<p>Jill: I thought you were going to say X-ray vision?</p>\n<p><strong>Nick: Surely if you had X-ray vision you’d just see bones? Ah well.</strong></p>\n<p><em>CitR: Thanks guys for the brilliant answers! Best of luck with the rest of the tour and album release.</em></p>\n<p>Order their new record Spitting Daggers over at their <a href=\"https://sparrowandtheworkshop.co.uk/\">Official Site.</a></p>\n","slug":"8298-interview-sparrow-and-the-workshop","category":"interviews","date":1307147149000,"wpid":8298,"isSticky":false,"featured_image":{"width":292,"height":50,"src":"2011/06/highres_7-292x50.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAACAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAAAAf/xAAeEAADAAIBBQAAAAAAAAAAAAABAgMABFEUIzJCcf/EABQBAQAAAAAAAAAAAAAAAAAAAAD/xAAUEQEAAAAAAAAAAAAAAAAAAAAA/9oADAMBAAIRAxEAPwCXytWZ1lnR0U64YhWIBPP3Jjt7Fuqt3aebex5xjA//2Q=="},"createdAt":1587294322383,"updatedAt":1588443777828,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/06/highres_7-292x50.jpg","categories":["interviews","music"]}