{"id":"5e9c307b9b6559241525db87","artists":["5e9b68f27a1236eccfeb2040"],"title":"Interview: Fatherson","content":"<p><a rel=\"attachment wp-att-8301\" href=\"https://admin.</p><p>crackintheroad.com/music/8300-interview-fatherson/attachment/164069_164050206972184_160018514042020_320033_597241_n\"><img class=\"alignnone size-650home wp-image-8301\" title=\"164069_164050206972184_160018514042020_320033_597241_n\" src=\"https://api.crackintheroad.com/uploads/2011/06/164069_164050206972184_160018514042020_320033_597241_n-650x557.jpg\" alt=\"\" width=\"650\" height=\"557\" /></a></p>\n<p>Ideal venue, aspiring band, great performance, woeful turnout. Another Friday night questioning why bands even bother to come north of Edinburgh. Its getting tiring inviting a friend to a gig in order to almost double the turnout in Dundee especially after being confirmed to play on the prestigious T-Break stage at this year’s T in the Park festival. Cracking support at usual from the likes of Seams, Whigs and Rakes and We Follow Signs at Dexter’s in Dundee but its a damned shame that a band of Fatherson’s calibre did not get scores more people through to door. They played many of the songs that managed to convince the judges that they were in the top 16 best unsigned acts in Scotland such as Waves and their new single Hometown, the stand-out song from the set in my opinion. As the first stop on their tour of Scotland before the festival season rolls around proper I can only hope that their gigs since last Friday have been in front of a much more responsive audience than they had in Dundee. If you get a chance to catch these guys before T in the Park they are currently playing throughout Scotland and are well worth keeping an eye out for at the Festivals in Scotland this year, you will be in for a treat to see these guys live. Luckily for myself I managed to get a few words with all three guys, Ross Marc and Greig, before going on stage. I hope you all enjoy reading their answers:</p>\n<p><strong>CitR: Standard opening question for an interview here; what bands and artists would you say influenced you the most</strong></p>\n<p>We started singing with Scottish accents about the same time as the likes of Biffy Clyro when we started playing around Kilmarnock area so we could say that but it does not mean we copied them in any respects. We started playing at the Monkey Club and Grand Hall in Kilmarnock where we cut our teeth which was good.</p>\n<p><strong>CitR: How did you find out you were asked to play the T-Break stage this year and what were your emotions when you got told the news?</strong></p>\n<p>Ross: I was helping my flatmate with his dissertation, all three of us here at at Uni in Glasgow, and I got a phone call saying that we’d been picked for it and I just rand about the place I was so pleased with the news!</p>\n<p><strong>CitR: Why would you say you were picked by the judges to perform ahead of other acts at T in the Park this year?</strong></p>\n<p>Well we have done gigs with the likes of Idlewild which was great and I suppose that put us in good stead, but its mostly down to hard work, we have been gigging for ages now and we just got fortunate. I must add the judges have a shite time of it to be honest, they have a very difficult job and its shame so many bands cannot be chosen too.</p>\n<p><strong>CitR: Have you played any other festivals in the past and are there any more in the pipeline this year for you guys?</strong></p>\n<p>Last year we played a festival at King Tut’s which we are lucky enough to headline it this time around and this year we are doing a few small things and maybe Wickerman too, but nothing is certain.</p>\n<p><strong>CitR: What are the best band you have supported and are there any bands who have supported you that deserve a mention?</strong></p>\n<p>Well we have supported Idlewild who are amazing, I would have to say them overall and two bands come to mind that have supported us; Fires Attract and He Slept on 57 who are both great bands.</p>\n<p><strong>CitR: What is your favourite song of all time would you say?</strong></p>\n<p>Ross: Joni Mitchell, A Case of You</p>\n<p>Greg: Nizlopi, Disarmed</p>\n<p>Marc: Manchester Orchestra, all of the 2<sup>nd</sup> album to be honest!</p>\n<p><strong>CitR: If you could have any superpower what would it be?</strong></p>\n<p>Ross: The ability to lose weight</p>\n<p>Greg: To be able to have any food on demand</p>\n<p>Marc: Not ever <em>have </em>to go to the toilet, only go when I chose to</p>\n<p><strong>CitR: and finally…how do you eat your steak?</strong></p>\n<p>Ross: Medium</p>\n<p>Greg: Rare/sometimes Blue</p>\n<p>Marc: Medium Rare</p>\n<p>Check out their facebook <a href=\"https://www.facebook.com/#!/fathersonband\">here</a></p>\n<p>Check out their official site <a href=\"https://fatherson.co.uk/\">here</a></p>\n","slug":"8300-interview-fatherson","category":"interviews","date":1306952016000,"wpid":8300,"isSticky":false,"featured_image":{"width":165,"height":165,"src":"2011/06/164069_164050206972184_160018514042020_320033_597241_n-165x165.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFwAAAwEAAAAAAAAAAAAAAAAABAYHCP/EACIQAAIBBAEEAwAAAAAAAAAAAAECBAMFESEABgcSEyJh0f/EABQBAQAAAAAAAAAAAAAAAAAAAAD/xAAUEQEAAAAAAAAAAAAAAAAAAAAA/9oADAMBAAIRAxEAPwB/m96LPHp+u2x2mRaSgVnLimqnxGhkfLJIXGNcl0nvNUkyatcWSxD2uXw9B2bZzs42fvmh41gs71JKPabeyI1LwUxkIXOM41rhL9N2MuxNmtpJOSTFp/nA/9k="},"createdAt":1587294331283,"updatedAt":1588403554697,"author":"5e9b68b27a1236eccfeb1d07","old_image":"2011/06/164069_164050206972184_160018514042020_320033_597241_n-165x165.jpg","categories":["interviews","music","reviews"]}