{"id":"5e9c30759b6559241525db7f","artists":["5e9b69637a1236eccfeb271b"],"title":"Exclusive Unplugged Session + Review: Wolf Gang","content":"<p><a rel=\"attachment wp-att-8334\" href=\"https://admin.</p><p>crackintheroad.com/music/8329-exclusive-unplugged-session-review-wolf-gang/attachment/wolfgang02\"><img class=\"alignleft size-900wide wp-image-8334\" src=\"https://api.crackintheroad.com/uploads/2011/06/wolfgang02-900x1144.jpg\" alt=\"\" width=\"900\" height=\"1144\" /></a></p>\n<p>What we have here, then, is two things in one: firstly, it is the next in our series of acoustic unplugged sessions by some of the top musical talent around; secondly, it is a warning against ever setting up and recording an acoustic session next to a railway line and a building site on a windy day. Nonetheless, and despite the wind gods interfering, London-based pop rock band Wolf Gang were kind enough to sit down and deliver a fantastic acoustic variation on their next single, <em>The King and All of His Men</em>. Check it out below.</p>\n<p><iframe src=\"https://player.vimeo.com/video/24591311\" width=\"500\" height=\"281\" frameborder=\"0\" title=\"Crack in the Road Unplugged Session: Wolf Gang - The King and all of his Men\" webkitallowfullscreen mozallowfullscreen allowfullscreen></iframe></p>\n<p>Their show itself, at Newcastle’s Cluny, was an absolute triumph. Supports came from old CITR friends Mammal Club, who delivered the sort of white knuckle, energetic set that we’ve really come to expect from them, and singer-songwriter Kyla La Grange, whose powering vocals and instrumentation proved a hit with the crowd (though, if truth be told, didn’t quite reach the heights that were provided by Mammal Club and Wolf Gang themselves).</p>\n<p>Wolf Gang themselves took to the stage shortly after and played through their upcoming album, <em>Suego Faults. </em>It was the little things in particular that proved to be so impressive here – from the lighting, to the smoke, to the dandy-like stage presence of founder and frontman, Max McElligott, who played the crowd right into his palm. Much like their <a href=\"https://admin.crackintheroad.com/music/5740-review-wolf-gang-dancing-with-the-devil-ep\">debut EP</a>, where certain songs were good, others were truly great. It is the big, anthemic, singalong tracks where Wolf Gang really triumph live – from the (quite shocking) raw power of opener <em>Dancing with the Devil</em>, through to <em>The King and All of His Men</em>, my new personal favourite <em>Stay and Defend</em>, right up to the truly epic closer of <em>Lions in Cages</em>. Even certain tracks from that EP, such as <em>Something Unusual</em> and <em>Back to Back</em>, which I initially thought fell slightly short of the standard set by these songs, were delivered with such intensity live that any criticisms I had simply evaporated. But it is the former songs that not only worked so well live (and I maintain would work even better in a large venue or at a festival), but actually got the whole crowd moving – not easy to do in an intimate venue. And then, right at the end of it, having spent 45 minutes acting more of a rock star than most rock stars today, singer/frontman Max McElligott strolled right out of the band room and started chatting to fans.</p>\n<p>The band’s tour continues on through the rest of this month, with a couple of festival dates this Summer. Go see them now – because if there’s any justice in the world, Wolf Gang are destined for greatness.</p>\n","slug":"8329-exclusive-unplugged-session-review-wolf-gang","category":"music","date":1307095983000,"wpid":8329,"isSticky":false,"featured_image":{"width":292,"height":50,"src":"2011/06/wolfgang02-292x50.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAACAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAAAAT/xAAgEAABBAEEAwAAAAAAAAAAAAACAAEDBBEFBhMxFEJh/8QAFAEBAAAAAAAAAAAAAAAAAAAABP/EABcRAAMBAAAAAAAAAAAAAAAAAAABQXH/2gAMAwEAAhEDEQA/AIX1G6W6aRFcsuXIT5eUu/HP6r5JZHkLMh9v7OiITgmvT//Z"},"createdAt":1587294325463,"updatedAt":1588443777854,"author":"5e9b68b27a1236eccfeb1d16","old_image":"2011/06/wolfgang02-292x50.jpg","categories":["music","reviews"]}