{"id":"5e9c30739b6559241525db7c","title":"Live Review: Pete & The Pirates (Edinburgh/Sneaky Pete’s 22/05/11)","content":"<p><img class=\"alignnone\" title=\"Pete & Pirates\" src=\"https://barrygruff.</p><p>files.wordpress.com/2011/05/pete-and-the-pirates-stolen-recordings-come-to-the-bar-video-shoot-2.jpg\" alt=\"\" width=\"995\" height=\"696\" />Taking to the stage Pete and the Pirates front man Tom Sanders states  that it has been a long time since the band were in Edinburgh, indeed it  has also been a long time since the release of 2008’s debut album  “Little Death,” but tonight in Edinburgh the band appear to have not  been forgotten one jot as the tiny sweatbox of Sneaky Pete’s is fit to  burst with a sold out crowd eager to get their first taste of the bands  eagerly awaited new material.</p>\n<p>Tonight’s show sees the Pirates in  celebratory mood on the eve of the release of their second album “One  Thousand Pictures” and ,in keeping with the progressive, stronger sound  and dynamics of the album, their live show has also progressed  significantly. Pete and the Pirates have always been an endearingly  charming and ramshackle live band but it appears their time away has  beefed up their live sound considerably and to great affect. The band  are ridiculously tight and the musicianship is impeccable. The strong  strident sound also reinvigorates the old favourites from “Little Death”  with sing along renditions of old favourites “She Doesn’t Belong To Me”  “Knots” and “Come on Feet” all delivered with an effortless flourish by  the captivating, witty front man Sanders.</p>\n<p>The main purpose of  the show, however, is to showcase, “One Thousand Pictures” and despite  the more expansive, rockier sound of the new record the bands knack for  great pop hooks and melodies shines through, particularly on the  plaintive lament of “Motorbike” and the anthemic latest single “United.”   Perhaps the most interesting new track played this evening, however,  is “Winter 1”,  with it’s beguiling, motorik melody and pulsing rhythmic  sound it stands out a mile from the rest of the bands material but in  an entirely good way.</p>\n<p>After some hi-jinks about the futility of  stepping off stage for an encore when the venue is so small that there  is actually no where else to go the band pause for a moment and launch  into a final rapturously received run through of “Mr Understanding ( a  sure fire indie number 1 that never was) and a storming finale of “Blood  Gets Thin”</p>\n<p>Despite “Little Death” appearing over 3 years ago  Pete and the Pirates seem to have lost no momentum whatsoever and the  sold out crowd leaving Sneaky Pete’s after having seen the band perform a  perfect mix of the old and the new are testament to a promising future  for a band who are only interested in looking forward.</p>\n","slug":"8338-live-review-pete-the-pirates-edinburghsneaky-petes-220511","category":"music","date":1307133758000,"wpid":8338,"isSticky":false,"featured_image":{"width":188,"height":188,"src":"2011/06/pete-and-the-pirates-stolen-recordings-come-to-the-bar-video-shoot-2-188x188.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAABQQI/8QAIxAAAgECBQUBAAAAAAAAAAAAAQIDABEEBSEyQRITMVGhsf/EABUBAQEAAAAAAAAAAAAAAAAAAAME/8QAFhEBAQEAAAAAAAAAAAAAAAAAAQAh/9oADAMBAAIRAxEAPwDO6ZPNNh1kURBVQFijXO7W49i/HAqWXKcVHK6BUYKxF+tRf7SORswSNQxAY6gHzRsxPek1O4/tEVq5f//Z"},"createdAt":1587294323921,"updatedAt":1588403554613,"author":"5e9b68b27a1236eccfeb1d33","old_image":"2011/06/pete-and-the-pirates-stolen-recordings-come-to-the-bar-video-shoot-2-188x188.jpg","categories":["music","reviews"]}