{"id":"5e9c306f9b6559241525db75","artists":["5e9b69377a1236eccfeb24b0"],"title":"Festival Preview: Rockness","content":"<p><a rel=\"attachment wp-att-8362\" href=\"https://admin.</p><p>crackintheroad.com/music/8361-rockness-preview/attachment/rn-line-up-april-new\"><img class=\"alignnone size-650home wp-image-8362\" title=\"RN-line-up-APRIL-NEW\" src=\"https://api.crackintheroad.com/uploads/2011/06/RN-line-up-APRIL-NEW-650x656.png\" alt=\"\" width=\"650\" height=\"656\" /></a></p>\n<p>As the festival season of 2011 begins, the first of the big players, Rockness, has been regarded by many via social-networking sites to have a line-up superior to several of their competitors, and personally I’d be inclined to agree. I myself am somewhat of a Rockness veteran, traveling yearly from Orkney to the glorious banks of Loch Ness and being a proud owner of all the memorabilia available I cannot praise the atmosphere, the acts and the venue enough. Sticking in part to their dance roots which began in 2006 with mega-headliners The Chemical Brothers (who also played in 2007) as well as a host of other artists within that spectrum of music such as Simian Mobile Disco and Magnetic Man, both of whom are without a doubt going to be major crowd-pleasers.</p>\n<p>Rockness also proudly supports the glowing music scene in Scotland with Sunday headliner and chart-mainstay Paulo Nutini taking to the stage straight after Scottish favourites Glasvegas, which will perfectly accompany one another, despite the differences in styles. However, possibly the biggest coup is the addition of Kasabian who are headlining the main stage on Friday; on after comparative new boys Two Door Cinema Club whose substantial rise to popularity in recent months has been due to cracking tunes and a lot of hard work.</p>\n<p>Although the above all indicates the making of a festival with the potential to surpass many of its rivals, there are some hidden gems who have been added to the line-up, and the best shall be highlighted here in the coming days up to the event itself. Representing Crack in the Road I would like to emphasis my excitement at seeing the likes of Frightened Rabbit on the Goldenvoice Stage on Saturday, The Cribs who I saw there in 2008 and The Wombats who are promoting their massive new album, This Modern Glitch. Other artists who are due to play at this phenomenal event that we believe are great additions to the line-up include a Mark Ronson DJ set and Niki and the Dove.</p>\n<p>I cannot put into words the palpable excitement I have felt whilst browsing the Facebook pages of my friends who are going; status updates have been counting down the days for weeks now and for good reason. Rockness may well be the festival this year that will be spoken about by as the stand-out event of the summer, with a perfect mix of old and new artists, from dance and trance DJs to aspiring indie-pop. Fingers crossed the weather will be kind for the entire 3 day weekend of it!</p>\n<p>Remember to keep checking this site daily up until the event where we will be posting daily tips on which artists we believe will be the ones to look out for and we hopefully might be able to catch a few words with them at the event. One is also available now for The Cribs!</p>\n<p>The official Rockness site is available <a href=\"https://www.rockness.co.uk/\">here</a>, for more information and the sensational full line-up.</p>\n","slug":"8361-rockness-preview","category":"festivals","date":1307212395000,"wpid":8361,"isSticky":false,"featured_image":{"width":165,"height":165,"src":"2011/06/rn-line-up-april-new-165x165.png","placeholder":"data:image/jpeg;base64, iVBORw0KGgoAAAANSUhEUgAAAAoAAAAKCAYAAACNMs+9AAAACXBIWXMAAAsTAAALEwEAmpwYAAABV0lEQVR4nCVQ2y/DUBz+nNMV4cFdt7a/X+sSRjYEa9eds2NzibAwYQmbkohLPHiS8OjVo/iLpfX83T8AxgKAUS924UQn6+b6e1X3flGsdW2ur2ZYzil4ccXylJFsjgWpZ0xU7jG9lYpQP0o2XUn1ts1RGfCTkk1qDV7bLYSqWjlI+xvt+y5ofwFOi21uljMOgC+Ru3vxqOT4wtvq/NDu+ad0kxN48dR/NATGnc3ZkaDO0k+OBDceUIpe4dRepK/P7VKyMhK0eGyhPgeQ2hZB805wqy9DdQVSPRmajmBzIwKTCjKp5Sc7wNLxMDLFovYxF1canaeX6kH6jvkoQNHMgHQR2C4A1cOxrITtRsuWl3wUWF0Pk3oTlNyCjZNvmDXjsNxGLAN9JEgPRGhuJelLyft7gpsPgvYGklTPcmtxZjYEUpPgqGyRTqTfPJOkTy2/oZDfli8f+gPWFDn9g5AZiwAAAABJRU5ErkJggg=="},"createdAt":1587294319312,"updatedAt":1588403554562,"author":"5e9b68b27a1236eccfeb1d07","old_image":"2011/06/rn-line-up-april-new-165x165.png","categories":["festivals","music"]}