{"id":"5e9c30699b6559241525db6b","artists":["5e9b69577a1236eccfeb264f"],"title":"Rockness Tip: The Wombats","content":"<p><a rel=\"attachment wp-att-8389\" href=\"https://admin.</p><p>crackintheroad.com/music/8386-rockness-tip-the-wombats/attachment/thewombatsthe_wombats_191-2\"><img class=\"alignnone size-650home wp-image-8389\" title=\"The+Wombats+the_wombats_191\" src=\"https://api.crackintheroad.com/uploads/2011/06/The+Wombats+the_wombats_1911-650x916.jpg\" alt=\"\" width=\"650\" height=\"916\" /></a></p>\n<p> Changing your style and approach to music for your second album is very risky business, especially with how new music is being spewed out by almost everyone nowadays. Despite this, <strong>The Wombats</strong> have proved to be much more tenacious than many had given them credit for after their first album, <em>A Guide to Love, Loss and Desperation</em>. <em>This Modern Glitch</em> has somehow managed to keep <strong>The Wombats’ </strong>old fans as well as drawing in a substantially large new crowd keen on their unique take on electro-pop. They are playing the main stage on Sunday as <strong>Rockness</strong> and their presence at this great festival is both a tribute to their hard work and the people responsible for getting them on board as I know several people heading to this years <strong>Rockness</strong> primarily to see <strong>The Wombats</strong> perform.</p>\n<p>They will no doubt play tracks from their highly energetic and bouncy first album as well as songs from their new album which has been held in high regard by many music buffs. I was lucky enough to meet them and watch them perform new songs just over a month ago and if that is anything to go by, <strong>The Wombats </strong>will be one of the outstanding performers at this years <strong>Rockness</strong>.</p>\n<p>Stay tuned for more daily updates and tips for this weekends <strong>Rockness</strong>.</p>\n","slug":"8386-rockness-tip-the-wombats","category":"music","date":1307359593000,"wpid":8386,"isSticky":false,"featured_image":null,"createdAt":1587294313139,"updatedAt":1588441788993,"author":"5e9b68b27a1236eccfeb1d07","old_image":"2011/06/the_wombats-292x50.jpg","categories":["music"]}