{"id":"5e9c30619b6559241525db5f","title":"Review: Emmy The Great- ‘Virtue’","content":"<p>Following the widespread success of ‘First Love’, Emmy The Great has finally returned after a long, long two year wait with a poignant, cathartic record that follows the further development of a hugely important artist.</p><p>  Written in the aftermath of the widely circulated breakdown of her engagement -as her atheist partner left for a life of religious conversion- Emma-Lee Moss chronicles personal tragedy through allegory and euphemism, as the sombre and contemplative record retains a scarcely voiced optimism throughout, with the richly produced acoustics embellishing the album with the necessary sense of interiority and sobriety.</p>\n<p>Whilst ‘First Love’ retained a fiercely guarded independence in the dominance of Emmy’s solo acoustic work, ‘Virtue’ is a gloriously lavish record, as her backing band become more than a sole instrument to fill the breaks in rhythm.  In particular, Euan Hinshelwood’s input has become more apparent; though Emmy is still the focal artist of the album, there is an increased sense of collectiveness in the sound, with the individual nuances of the piano and the harp perfectly accentuated through the production work of Gareth Jones.  Though ‘Virtue’ is still resolutely the delicate child of Emmy The Great’s heartache and desperation, the sound is not as isolated as her debut, with the lush depth to the record inspiring the lyrics with a hopeless optimism.  The delicacy of the rapid vocal delivery is retained, but the soaring harmonies of tracks such as ‘Exit Night/Juliet’s Theme’ allow Moss to demonstrate the full capacity of the impossibly beautiful voice she possesses.  </p>\n<p>As opposed to the arguably insecure ‘First Love’, ‘Virtue’ represents the artist’s natural development as she transposes the dramatic poetry of Regina Spektor on ‘A Woman, A Woman, A Century Of Sleep’, with the imperious country lilt of Caitlin Rose on ‘Creation’.  There is a sense of innocent intrigue to the album, as Moss looks within for comfort, rather than the bleak pessimism of similar themes recently explored by Noah and the Whale.  The devastatingly bare conclusion of ‘Trellick Tower’ is a bleak recollection of “kneeling to address the sky”, implausibly voicing the anguish of her break-up, yet retaining an honesty and accessibility outside of the rife metaphors which hide much of the despair of the album.</p>\n<p>‘Paper Forest’ is a haunting song that recalls the early demos of Emmy in the swift delivery that became her trademark, with the pendulous strings informing the urgency of the track.  It also features the wonderful poetry of “the afterglow of rapture”, which comes to encapsulate the overall theme of the record, as a broken poet coming to terms with loss.  The first official release is ‘Iris’, which builds on a simple, rumbling bass line, courtesy of a militaristic drum repeat, to builds to a crescendo in the release of the next verse.  It is catchy and joyous in equal measure, and serves as a healthy reminder that this isn’t necessarily a melancholy record to serve as a eulogy for a past relationship.  The shimmering harp cascades throughout, infusing the track with a confidence that forms a benchmark for the album.</p>\n<p>After waiting for what feels like forever in eager anticipation for ‘Virtue’, it would have been so easy to dismiss it and be scathing, but the truth is that there is absolutely no weakness to the album, and represents a genuinely fantastic sophomore effort for an artist who is determinedly fulfilling her limitless potential.</p>\n","slug":"8425-review-emmy-the-great-virtue","category":"music","date":1307620698000,"wpid":8425,"isSticky":false,"featured_image":null,"createdAt":1587294305118,"updatedAt":1588441788909,"author":"5e9b68b27a1236eccfeb1d4c","old_image":"2011/06/emmy-the-great-photo-credit-alex-lake-188x188.jpg","categories":["music","reviews"]}