{"id":"5e9c305a9b6559241525db50","title":"Review: WU LYF (Liverpool)","content":"<p><strong>WU LYF.</p><p> World Unite Lucifer Youth Foundation/Love You Forever</strong>.</p>\n<p>Over the past several months there has been an overwhelming sense of hype around the band that we were all meant to be part of. This communal feel held it’s counterweight in the four piece being shrouded in secrecy, sending out nonsensical emails and releasing photos of masked youths, sometimes including the band themselves, on a rampage amongst coloured smoke. As interest and curiousity built around <strong>WU LYF</strong>, a polarisation of opinion swiftly followed as fans and critics either took to the mystique as refreshing and intriguing, or lambasted it as hollow PR that became stale rather quickly. With the upcoming release of their debut album <strong>Go Tell Fire To The Mountain</strong>, the record has received a huge spectrum of ratings from every major music publication. Some ignore the music, some focus entirely on it, however <strong>WU LYF </strong>were never going to please everyone. Instead, it is this controversy and dividing of opinions that form part of the genius, manufactured or not, of <strong>WU LYF</strong>.</p>\n<p>Walking into the fantastic <strong>Kazimier</strong>, you are made immediately aware you are at a <strong>WU LYF </strong>gig. The stamp upon entry is that of three inch disfigured cross, now widely recognised as the official logo of the band. Now I don’t mean to over analyze something as seemingly mundane as an entry stamp, however it is important when talking about a band as well crafted as <strong>WU LYF</strong>. Stamped on a significant portion of the back of your hand, the stamp felt more like an official branding as opposed to a necessary part of entry. I make note of this as it could have quite easily been smaller, or in the imprint of the band’s name, or even the simple cross of a marker pen. By choosing their disfigured cross, so blatantly obvious to see on your hand, you became part of the <strong>WU LYF </strong>society. I say society loosely, however <strong>WU LYF </strong>are attempting to sell a shared consciousness as well as their music.</p>\n<p>Far from sold out, the gig still attracted a significant enough audience to display that <strong>WU LYF </strong>are on a steady path out of their obscurity into the main stream acknowledgement. Beginning somewhat flatly, the performance fell into rhythm as both band and audience began to engage one another and the resulting energy was felt in the tracks. Taking <strong>WU LYF </strong>on their music alone, the live performance managed to transmit the immense amount of soul and passion that can be found in <strong>Ellery Roberts</strong>‘ vocals and the almost tribal percussion that transcends each track. However it wasn’t until the now familiar tracks of <strong>Dirt</strong>, <strong>LYF</strong>, and <strong>Heavy Pop </strong>appeared in the set that it all felt accessible enough to truly enjoy. Moreover, <strong>Ellery</strong>‘s vocals, while strong, were lost in a haze of distortion throughout the set, and while this is to be expected in a live arena, it left me craving even a few brief moments of lyrical clarity to bridge the gap between live performance and recorded tracks.</p>\n<p>Both the noticeably stronger tracks and at times haphazard performance demonstrate that <strong>WU LYF </strong>still have a lot of development ahead of them. There are many areas which could be refined without becoming restricted, however, in part due to the instant nature of the world we live in, many will not give the band this time to further their sound. Instead, as many people have already done, <strong>WU LYF </strong>will be written off for a plethora of reasons and justifications, some fair, and some not so. This potential of vocal disdain was inadvertently symbolised as one of the members complained to the audience that someone had thrown a glass on stage, and that whoever it was should ‘fuck off out’. In fact the glass had been <strong>Ellery</strong>‘s half filled drink that had rested on the top of a hollowed out piano and simply fallen and bounced on the ground. A somewhat easy mistake to make in the dark surroundings of a gig, however it made it obvious the band, perhaps overly so, were aware of the negative criticism and it’s ability to lash out at them. By no means am I saying a reasoned but negative review of their music is the same as launching a projectile at the band, but it does echo a sentiment.</p>\n<p>Approaching the end of the set, <strong>WU LYF </strong>could have considered their evening in Liverpool a success. Their performance was engaging and energising, and they really did appear to be offering something different and exciting to the modern music scene. However the one track encore turned into a painfully orchestrated stage invasion, almost as if they were secretly rerecording the video to their track <strong><a href=\"https://www.youtube.com/watch?v=3QWxviSD79c\">LYF</a></strong>. Constructed by the first four or five rows of the audience, who in themselves appeared to be made up of a considerable number of band friends, the stage invasion was simply quietly observed by a majority of the audience. This clear divide in the audience meant the band’s performance sadly became tainted as caricature of the <strong>WU LYF </strong>shared consciousness, highlighting how clearly choreographed what once may have been a genuine sentiment of communality can be.</p>\n<p><strong>WU LYF </strong>stand at a cross roads with the release of their debut album. While their music has the potential to further develop along the soulful yet upbeat musings they have created, they must survive their own hype to create an enduring legacy, and that is something not many bands of today will ever be able to boast.</p>\n","slug":"8467-review-wu-lyf-liverpool","category":"music","date":1307803992000,"wpid":8467,"isSticky":false,"featured_image":{"width":950,"height":633,"src":"2011/06/wu-lyf-950x633.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAQG/8QAIRAAAgEDBAMBAAAAAAAAAAAAAQIDABEhBAUGEgcIE2H/xAAVAQEBAAAAAAAAAAAAAAAAAAADBP/EABgRAQADAQAAAAAAAAAAAAAAAAEAAjER/9oADAMBAAIRAxEAPwDFzebuSTadIJt81sbiIozBQDm2cDJqgeyPJUHU7ZsspXH0eKTs36bPa5pSgKDsobdMn//Z"},"createdAt":1587294298402,"updatedAt":1588403554273,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2011/06/wu-lyf-950x633.jpg","categories":["music","reviews"]}