{"id":"5e9c30489b6559241525db2f","artists":["5e9b68cd7a1236eccfeb1dd0"],"title":"Review: Arctic Monkeys – Suck It And See","content":"<p><img class=\"alignnone\" title=\"Arctic Monkeys\" src=\"https://www.</p><p>weallwantsomeone.org/uploads/2011/03/Arctic-Monkeys-NME.png\" alt=\"\" width=\"876\" height=\"580\" />Before launching into this review, let me clear up a common misconception surrounding Arctic Monkeys that appears to feature predominantly in a vast majority of misinformed and poorly researched articles. Arctic Monkeys were not a product of the embarrassingly titled ‘myspace revolution’, in fact, the now infamous website previously used to distribute free downloads of their early demos, was in no way related to the Sheffield four piece. The only method the group adopted to promote their music was via handing out home-made CD’s, now affectionately known as ‘Beneath the Boardwalk’. So with my mind at rest on that subject, I can continue with writing a review of their latest work.</p>\n<p>With Suck It And See, the fourth full length release from //// Arctic Monkeys, they have a vast amount of ground to make up to their loyal, cult following, after the widespread disappointment of 2009’s garage-rock inspired Humbug. Whilst it had moments that elevated it above the mundane indie drivel attempting to penetrate the charts, it fell short of the high standard set by their previous two efforts. The subdued response to their third record Humbug assured that the wave of hype typically experienced before a new release from Alex Turner & Co. was somewhat diminished when it came to the release of the provocatively titled Suck It And See.</p>\n<p>Announcing their return with the grungy, classic rock Brick by Brick, a track that hardly convinced the doubters that they had well and truly shaken off the Humbug cobwebs. Their time out in the barren desert with Josh Homme clearly brought about some positives, yet this track proved questionable at best, coming across as a poor attempt at mimicking the Queens of the Stoneage. Don’t Sit Down ‘Cus I’ve Moved Your Chair, the first proper single to be taken from Suck It And See was an improvement, yet still stuttered somewhat, lacking the gusto and kick that had previously made Arctic Monkeys so vibrant and engaging.</p>\n<p>Only a few listens through the entirety of the record and it’s immediately striking that those two aforementioned tracks are far and away the weakest moments of the record. Opening number She’s Thunderstorms shows Arctic Monkeys at their seductive best; Turner’s tantalizing vocals and the sleazy guitars forming a solid foot upon which to begin Suck It And See. The time spent with Homme clearly left a lasting impact on the four piece, allowing them to switch seamlessly between glorious indie tunes and grunge laden rock, a formula that benefits them hugely on this record.</p>\n<p>Rumoured next single The Hellcat Spangled Shalalala is an ingeniously orchestrated slice of pop, outclassing the entirety of Humbug within a few minutes. It’s a bold and entirely enjoyable track, possessing all the invigorating and witty traits of their live shows. Turner’s lyrics have grown ever more bizarre as his career has blossomed, almost as if to throw off the ‘voice of a generation’ tag that initially was thrust upon him. ‘Home sweet home, home sweet booby trap’ croons the Monkey’s frontman, in a fashion so 60’s inspired that it’s impossible to not make the connection.</p>\n<p>In typically Arctic Monkey’s style, Suck It And See is an album of two differing halves, the brash and sludgy rock tunes found in the first half a dozen tracks, then the more down tempo, melody driven latter section of the record. All My Own Stunts drifts by rather listlessly, aiming to mimic Favourite Worst Nightmare, yet falling someway short. However Library Pictures is another notch on their bedpost of fantastically engaging tracks, vivacious and ever-so-skewed, again finding Turner at his most lyrically puzzling, ‘give me an eenie meenie mo, an ip-dip dog shit rock and roll’ being the finest example.</p>\n<p>Up until this point, Suck It And See is relatively inconsistent, yet nonetheless an enjoyable listen. So with only seventeen minutes of the record remaining, the four piece pull their finger out and prevent the album from fading into mediocrity, as the final five tracks step it up several gears, with their stellar brand of 60’s inspired indie pop, the likes of Reckless Serenade and title track Suck It And See are sure-fire future festival singalongs. The heartwrenching Love Is A Laserquest finds Turner in a wistful mood, pinning ‘for a minute it gets easier, to pretend that you were just some lover’. It’s the Suck It And See equivalent of 505 or Cornerstone, a standout track sure to draw the plaudits. So whilst it may have taken the Monkey’s longer than they may had envisioned to perfect their sleazy garage rock sound, it appears that amongst the rubble of Humbug, a fantastically exciting and forward-thinking record has been produced in the form of Suck It And See.</p>\n","slug":"8474-review-arctic-monkeys-suck-it-and-see","category":"music","date":1308262121000,"wpid":8474,"isSticky":false,"featured_image":{"width":900,"height":596,"src":"2011/06/arctic-monkeys-nmeuse.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAUH/8QAHhAAAQQDAQEBAAAAAAAAAAAAAQIDBBEABSEGYZH/xAAUAQEAAAAAAAAAAAAAAAAAAAAC/8QAGBEAAwEBAAAAAAAAAAAAAAAAAAECESH/2gAMAwEAAhEDEQA/AM79T6PdtyZbG5lITs0yg23IbKrQgAp4QeXSf0/cvRHNzLisyW9Vrih5CXElUl0EgixdGr7jGOpWgT4f/9k="},"createdAt":1587294280923,"updatedAt":1588403553977,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/06/arctic-monkeys-nmeuse.jpg","categories":["music","reviews"]}