{"id":"5e9c30559b6559241525db47","title":"Style: The PlayButton","content":"<p><a rel=\"attachment wp-att-8487\" href=\"https://admin.</p><p>crackintheroad.com/music/8486-style-the-playbutton/attachment/playbutton\"><img class=\"aligncenter size-full wp-image-8487\" title=\"playbutton\" src=\"https://api.crackintheroad.com/uploads/2011/06/playbutton.jpg\" alt=\"\" width=\"900\" height=\"494\" srcset=\"https://api.crackintheroad.com/images/2011/06/playbutton.jpg 900w, https://api.crackintheroad.com/images/2011/06/playbutton-260x142.jpg 260w, https://api.crackintheroad.com/images/2011/06/playbutton-640x351.jpg 640w, https://api.crackintheroad.com/images/2011/06/playbutton-165x90.jpg 165w\" sizes=\"(max-width: 900px) 100vw, 900px\" /></a>For those of you who are regular readers of the site, you’ll no doubt be aware that the state of the music industry as a whole, as well as the nature of the music we listen to and enjoy, are two things that occupy our minds a lot of the time. Take Josh Dalton’s <a href=\"https://admin.crackintheroad.com/music/6465-feature-why-i-dont-care-about-rick-martin\"><strong>article</strong></a> around record store day, which argued that we must never lose sight of the importance of owning and promoting a physical copy of a piece of music.</p>\n<p>Regardless of Dalton’s article, which happened to be a response to a particularly ignorant article on the NME blog, for a lot of people it’s just a little too late. There’s no doubt that CDs are soulless and MP3s unsatisfying, but in an age where functionality and ‘quick fixes’ are the name of the game, for a lot of people a digital collection is the most efficient way of listening to the music that they want.  Makes sense, until you realise that almost no one listens to an album the whole way through anymore; we’re musical whores, picking and choosing from a vast library of content at our fickle leisure.  I’m ashamed to say I’m one of those whores. I have a huge Itunes library and I’m ashamed to say I can’t remember the last time I bought a physical copy of anything. I was given a free copy of a Let’s Buy Happiness EP a few months ago, but apart from that I’m as soulless as the rest of them.</p>\n<p>A few weeks ago however I received a package from New York, inside was a rather quaint little device called a PlayButton.  It was essentially a record that played itself. Now of course these are nothing new, back in the 70’s some records came with a primitive gramophone attached. As cool as it sounds, they were a bit shit. The record that was sent to me was a copy of The XX’s debut LP, all contained on a little button that could be attached to a garment. I have to say the device did exactly what it set out to do, for the first time in a little while I was in awe of the object itself as well as the music coming from it. I listened to the record in full that morning on my way to the office; it was a rather nostalgic experience, like listening to a relic of some kind. What is so clever about them is not only the very concept, but also the fact they come with a little USB lead, the music can be ripped and put on a player of any kind. If priced correctly, there’s no reason to not to believe that these things couldn’t be a regular purchase at gigs and festivals.</p>\n<p>Only time will tell, but for now I’m going to go back and listen to The XX’s first album for something like the 50<sup>th</sup> time in a week.</p>\n<p><a href=\"https://shop.playbutton.co/\"><strong> Buy a PlayButton.</strong></a></p>\n","slug":"8486-style-the-playbutton","category":"life","date":1307822144000,"wpid":8486,"isSticky":false,"featured_image":{"width":900,"height":494,"src":"2011/06/playbutton.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAFAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAMI/8QAIBABAAAGAgMBAAAAAAAAAAAAAQACAwQFEQcSIUGRof/EABQBAQAAAAAAAAAAAAAAAAAAAAD/xAAUEQEAAAAAAAAAAAAAAAAAAAAA/9oADAMBAAIRAxEAPwCmc5Qv8VzJnWnZUZ5LMp4/zO9mVqB2HWhGooaT7uNKlrVAG8qqe2STb+QhAf/Z"},"createdAt":1587294293137,"updatedAt":1588403554191,"author":"5e9b68b27a1236eccfeb1d24","old_image":"2011/06/playbutton.jpg","categories":["life","music"]}