{"id":"5e9c304a9b6559241525db32","title":"Review: Rockness 2011","content":"<p><a rel=\"attachment wp-att-8589\" href=\"https://admin.</p><p>crackintheroad.com/music/8588-review-rockness-2011/attachment/rn-line-up-april-new-2\"><img class=\"alignnone size-650home wp-image-8589\" title=\"RN-line-up-APRIL-NEW\" src=\"https://api.crackintheroad.com/uploads/2011/06/RN-line-up-APRIL-NEW1-650x656.png\" alt=\"\" width=\"650\" height=\"656\" /></a></p>\n<p>After another year of fantastic artists, venue and weather <strong>Rockness</strong> shall not be quickly forgotten in the minds of the thousands of people who traveled miles to the banks of Loch Ness just outside Inverness. Here are the highlights of the weekend, as seen by <strong>Crack in the Road</strong>.</p>\n<p>Friday: Although the Main Stage headliners <strong>Kasabian</strong> had by far the largest support, I feel that comparative new boys <strong>Two Door Cinema Club </strong>were the biggest surprise of the first day. Looking a bit daunted initially at the prospects of playing in front of the Rockness crowd they managed to pull it back and become one of the top performers across the entire weekend playing fan favourites <em>Cigarettes in the Theatre </em>and <em>Something Good Can Work</em> and it’s a real testament that since Friday night the album has shot up the ‘most played’ list on my iTunes. Another artist I was glad to see was <strong>Nero </strong>on the Golden Voice Stage; granted I only managed to catch the last few songs from his set. As the first big act of the weekend, he was on at 5pm, he appeared to have the crowd eating out of the palm of his hand and well prepared the large crowd for what turned out to be a great weekend.</p>\n<p>Saturday: After a personal tip from <strong>Jim Gellatly </strong>the night before<strong> </strong>I managed to get up in time for <strong>Strawberry Ocean Sea </strong>who played in the Rock ‘n’ Roll Circus Stage at 12.30 and their brilliant set made it worth the hours of a horrific hangover that ensued. After that I managed to find a place to lie on the hill with <strong>Laidback Luke</strong><em><strong> </strong></em>performing in the background after hearing from fellow campers it was worth catching some of, and it was; from what I remember of it anyway! I made a promise after that to remain sober for the rest of the weekend, and I was very glad for it as well as it made the rest of the weekend far more memorable. <strong>Bombay Bicycle Club</strong>, <strong>Frightened Rabbit </strong>and <strong>The Cribs </strong>were possibly the best collection of acts that followed one after another all weekend, Especially <strong>Frightened Rabbit</strong>, who I should add drew in astounding support considering <strong>Magnetic Man</strong>,<strong> Example</strong> and<strong> The Chemical Brothers </strong>were performing back-to-back on the Main Stage at the same time. I managed to catch a few of the latter three artists songs but felt the desire to keep heading back to the Golden Voice stage where the performers of the weekend were playing, with <strong>The Cribs</strong><em><strong> </strong></em>opening with the line ‘We might not be the Chemical Brothers, but we are the Jarman Brothers’. Overall, the artists on the Golden Voice stage on Saturday evening were damn near perfect in my opinion. Scottish heroes <strong>Frightened Rabbit </strong>especially proved to the audience why their rise to fame in recent months has been deserved with a phenomenal on-stage performance unmatched throughout the entire weekend.</p>\n<p>Sunday: The first artist I stumbled across on the Sunday was American act <strong>Afghan Raiders</strong> whose unusual combination of two iMacs and drums, transfixed what small crowd they managed to achieve. However, I felt as though those who didn’t watch them missed out and they are well worth a look. The same feelings apply for Glasgow based group <strong>Sparrow and the Workshop </strong>whose recent exposure in high profile magazines did not help draw in what turned out to be a lacklustre crowd, but nevertheless their set greatly impressed those who did venture to the Rock ‘n’ Roll tent to watch them. <strong>The Twilight Sad</strong>, a band that I tipped before the festival, overcame some lyrical problems to create something of an event as opposed to a set as the band made such an effort to bring the crowd together and used the large stage to their advantage, covering nearly all of it during the half hour time spent they were on stage. Other than those artists the only other time I left the Main Stage was to see a personal favourite of mine, <strong>Simian Mobile Disco</strong> who played on the Golden Voice stage and I have never seen a crowd as ‘in to’ an artist as this. It was also during this set that I experienced possibly the highlight, or for the individual probably lowlight, of the weekend when an punter next to me bit open a large glowstick and then proceeded to pour it on his face. Being sober at the time made the experience much more surreal than for the majority of people around me and I do believe the individual received medical treatment, but still it was a rather half-witted thing to do. To end the weekend off was the trio of <strong>The Wombats</strong>,<strong> Glasvegas </strong>and <strong>Paulo Nutini </strong>all of whom impressed on different levels. <strong>The Wombats </strong>were professional as ever and their particularly adoring fans loved every minute of their performance as they played their now classic songs from their first album including, <em>Moving to New York </em>and <em>Kill the Director</em> as well as <em>Techno Fan</em>, their newest single which has received some great reviews<em>. </em>Scottish artists<em> </em><strong>Glasvegas </strong>and <strong>Paulo Nutini </strong>polished off the weekend on a high note with both performing exceptionally, drawing in easily the largest crowd of the weekend and leaving the crowd wanting more. Only around 360 days until they will feel the magic of <strong>Rockness </strong>again though, and I can’t wait.</p>\n","slug":"8588-review-rockness-2011","category":"festivals","date":1308251805000,"wpid":8588,"isSticky":false,"featured_image":{"width":950,"height":960,"src":"2011/06/rn-line-up-april-new1.png","placeholder":"data:image/jpeg;base64, iVBORw0KGgoAAAANSUhEUgAAAAoAAAAKCAYAAACNMs+9AAAACXBIWXMAAAsTAAALEwEAmpwYAAABVUlEQVR4nCWOzU/CQBBHf+62KCbGr4NC250WRBSMQSGRttsuxRK16kGCCoZojPHjYOTghZsnY/yvzeJtMvPy5gFQBgDkLWVzJ+xth4Pvqrz54ZY/gHVU0bcZY9r+nuFKxcvqlAn5jNXDF6y3xsyL3rkXX3KKEwhZw0I5ckxL7qOUihylu63scdzKnvrzW0kZIvLgJHUUQqG9czN7obnIKTzbbGS/hcb5hFOQwG6v/b/WjN22QCcupyAzhPyA7X8yy5/mPHkNJ6xDmyttCyYFDUbxHaf4ilOScSFTLqKunhmpIXM7tygGDaB2nQOpTYjjko4+6N2/1tRoCtcneN0NWMoGmuasTUfkikHVcPzp6k46Wqp2J8yWI4ioMCu023kYFPvcUxeM5Ii5nQcUg1sIlRoUvTE3emAkh4aQoeYZSs1l0wnrRjkJOCV9Xor7WqB3ILUCfLE/i8Q6IxEgX44AAAAASUVORK5CYII="},"createdAt":1587294282384,"updatedAt":1588403554005,"author":"5e9b68b27a1236eccfeb1d07","old_image":"2011/06/rn-line-up-april-new1.png","categories":["festivals","music","reviews"]}