{"id":"5e9c30409b6559241525db1d","artists":["5e9b69637a1236eccfeb2725"],"title":"Review: WU LYF – Go Tell Fire To The Mountain","content":"<p><a href=\"https://admin.</p><p>crackintheroad.com/uploads/2011/06/WU_LYF.jpg\"><img class=\"alignnone size-full wp-image-8656\" title=\"WU LYF\" src=\"https://api.crackintheroad.com/wp-content/uploads/2011/06/WU_LYF.jpg\" alt=\"\" width=\"900\" height=\"598\" srcset=\"https://api.crackintheroad.com/images/2011/06/WU_LYF.jpg 900w, https://api.crackintheroad.com/images/2011/06/WU_LYF-260x172.jpg 260w, https://api.crackintheroad.com/images/2011/06/WU_LYF-640x425.jpg 640w, https://api.crackintheroad.com/images/2011/06/WU_LYF-165x109.jpg 165w\" sizes=\"(max-width: 900px) 100vw, 900px\" /></a>Few bands generate anywhere near as much hype as unconventional Mancunian quartet Wu Lyf, and even fewer completely ignore it once it’s been thrust upon them. From refusing high-profile interview requests, providing misleading photographs and allegedly neglecting the advances of several major labels; numerous opinions have been aired over whether Wu Lyf are either a marketing sensation or truly the emancipated kids that they claim. Either way, they’ve caused a noticeable stir.</p>\n<p>With their debut album Go Tell Fire To The Mountain, they have a fantastic opportunity to prove that they are more than just a PR gimmick. After shifting 50 copies of their first ‘official’ release for a minimum £50 each, they retreated to an abandoned church in their hometown of Manchester to record their first full length record. WU LYF (standing for World Unite Lucifer Youth Foundation) are clearly oozing with ideas, from their intense music to their self-run website, they posses all the components for encouraging an underground cult following.</p>\n<p>Album opener LYF which they showcased earlier this year with a somewhat bizarrely camp video, forms a stellar introduction to WU LYF, proving both unashamedly brash and wildly exuberant. One frequent criticism of the group are lead singer Ellery Robert’s vocals; which are formed entirely by yelps that echo extravagantly throughout the entire record, yet personally I find it hugely refreshing to hear a raw and untampered voice in modern music. Roberts almost wails ‘I woke up today, my baby said ‘we can’t live this way, can’t live this way’ over an infectious guitar riff, with touches of Talking Heads and Arcade Fire amongst their unique sound. Not since The Libertines have a band adopted their musical themes with such a vivid and wholesome approach, closing LYF with Roberts chanting “L Y F, how many (of) you kids are scared of death?’. There’s no denying that it’s powerful.</p>\n<p>Roughly based around an idea for a film that Roberts had, the thematic elements are obvious and unmissable. Teenage rebellion and spiritual liberation reoccur frequently throughout Go Tell Fire…, in both the music and the accompanying videos. The visuals released alongside DIRT a little over a month ago were a poignant interpretation of the London student protests, whereas the video for the epic Spitting Blood documents a tribal communication with mother-nature. Back to the music however, and WU LYF portray a diverse ability when it comes to songwriting; the likes of heartwrenching Such A Sad Puppy Do<img class=\"alignleft\" title=\"Go Tell Fire\" src=\"https://mushroomgroup.files.wordpress.com/2011/05/go-tell-fire-to-the-mountain.jpg?w=300&h=300\" alt=\"\" width=\"300\" height=\"300\" />g and the ethereal Concrete Gold slow the tempo down whilst maintaining the Lucifer spirit. The vocal delivery from Roberts is impeccable; these aren’t intended to be songs where the lairy crowd bellows every word back to the stage. It’s the emotion in the delivery that makes it so special and untouchable, ‘but she comes now in the light, a blind baby walk into the light, a life spent waiting for a volcano to blow, so the mountain can go and fall’ practically weeps Roberts on Concrete Gold.</p>\n<p>Two of the newer tracks Summas Bliss and We Bros form an integral section of the album, with their Foals-esque jerky guitar parts and tribal-like percussion. Focusing again on the materialistic, capitalistic society which we live in today, showcased through the lyrics in Summas Bliss – ‘there’s children in the street, watching the concrete turn to gold, man in the wild, you were so young, but this cities made you old’. Flowing seamlessly into album highlight We Bros, an upbeat number with by far the most festival friendly feel. The ‘chorus’ as such, is insanely catchy, with Roberts wailing ‘it’s a sad song, that makes a man put, money before life, it’s a sad song, that makes a man for sale’, WU LYF clearly have a vast repertoire of styles and are far from afraid to show it.</p>\n<p><object classid=\"clsid:d27cdb6e-ae6d-11cf-96b8-444553540000\" width=\"100%\" height=\"81\" codebase=\"https://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=6,0,40,0\"><param name=\"allowscriptaccess\" value=\"always\" /><param name=\"src\" value=\"https://player.soundcloud.com/player.swf?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F16873976\" /><embed type=\"application/x-shockwave-flash\" width=\"100%\" height=\"81\" src=\"https://player.soundcloud.com/player.swf?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F16873976\" allowscriptaccess=\"always\"></embed></object> <span><a href=\"https://soundcloud.com/bangkokerror/wu-lyf-we-bros\">Wu Lyf – We Bros</a> by <a href=\"https://soundcloud.com/bangkokerror\">bangkokerror</a></span></p>\n<p>Previous singles Concrete Gold and Spitting Blood have been re-recorded  and form a perfect accompaniment either side of DIRT. The angst of  Spitting Blood and the elegance of Concrete Gold summarise exactly why  these lads are generating such hype. With dull, opaque pop being regurgitated at such a rapid rate, it’s even more exciting to experience a group performing and recording within their own moral boundaries, as well as rejuvenating a sense of spirit belief.</p>\n<p>Closing track Heavy Pop comes complete with luxurious two minute intro, and provides an appropriate and exquisite end to Go Tell Fire,,. The vocals are as dramatic and sharp as ever, the organ echo’s sumptuously, and the guitars are precise and faultless. It’s not an anthem in the traditional sense, yet for me, it’s one of those decade defining tracks. Robert’s pleads ‘and if the world unites, sets the mountain on alight, then outside your house will become your home’, it’s simultaneously alluring and bewitching, captivating the attention of the listener.</p>\n<p>Any PR stunts aside, Go Tell Fire To The Mountain is everything we wanted and expected from WU LYF; engaging, invigorating and otherworldly at points, cementing itself as an early contender for album of the year. Being youthful, wayward and reckless has never been so desperately romantic.</p>\n<p><object classid=\"clsid:d27cdb6e-ae6d-11cf-96b8-444553540000\" width=\"100%\" height=\"81\" codebase=\"https://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=6,0,40,0\"><param name=\"allowscriptaccess\" value=\"always\" /><param name=\"src\" value=\"https://player.soundcloud.com/player.swf?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F8919693\" /><embed type=\"application/x-shockwave-flash\" width=\"100%\" height=\"81\" src=\"https://player.soundcloud.com/player.swf?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F8919693\" allowscriptaccess=\"always\"></embed></object> <span><a href=\"https://soundcloud.com/notmanyexperts/wu-lyf-heavy-pop\">Wu Lyf – Heavy Pop</a> by <a href=\"https://soundcloud.com/notmanyexperts\">Not Many Experts</a></span></p>\n","slug":"8618-review-wu-lyf-go-tell-fire-to-the-mountain","category":"music","date":1308437805000,"wpid":8618,"isSticky":false,"featured_image":{"width":900,"height":598,"src":"2011/06/wu_lyf.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAQH/8QAIhAAAQMEAAcAAAAAAAAAAAAAAQIFEQADBCEGEhMUQUJR/8QAFAEBAAAAAAAAAAAAAAAAAAAAAP/EABQRAQAAAAAAAAAAAAAAAAAAAAD/2gAMAwEAAhEDEQA/AMDZmxltuOKXe+q1iddC9oUpa0H0PLoRAJjwdGdVU4cONqs/JOJ3BxzdUbRKwCUyY1HylKD/2Q=="},"createdAt":1587294272856,"updatedAt":1588403553820,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/06/wu_lyf.jpg","categories":["music","reviews"]}