{"id":"5e9c303a9b6559241525db11","title":"Review- Cats and Cats and Cats: Motherwhale","content":"<p><a rel=\"attachment wp-att-8697\" href=\"https://admin.</p><p>crackintheroad.com/music/8691-review-cats-and-cats-and-cats-motherwhale/attachment/catsandcats\"><img class=\"aligncenter size-full wp-image-8697\" title=\"catsandcats\" src=\"https://api.crackintheroad.com/uploads/2011/06/catsandcats.jpg\" alt=\"\" width=\"650\" height=\"432\" srcset=\"https://api.crackintheroad.com/images/2011/06/catsandcats.jpg 650w, https://api.crackintheroad.com/images/2011/06/catsandcats-260x172.jpg 260w, https://api.crackintheroad.com/images/2011/06/catsandcats-640x425.jpg 640w, https://api.crackintheroad.com/images/2011/06/catsandcats-165x109.jpg 165w\" sizes=\"(max-width: 650px) 100vw, 650px\" /></a></p>\n<p>Being released on July 4<sup>th</sup>, <strong>Cats and Cats and Cats</strong> new album, <em>Motherwhale</em>, follows on from last year’s debut album, <em>If I’d Had an Atlas</em>. I have been lucky enough to have a listen of this new album and it is more chaotic, more fractured and more mental than the majority of their older songs; and its great. The first full length song on the album, <em>Return to Castle Danger</em>, sets the scene of what is to follow on the album with chaotic, yet catchy lyrics and a mix of heavy brass influences which at times gets overthrown by shouting, all over a manic drumbeat. This idea is carried on in the next song, <em>The Projectionist</em>, as it opens with an accordion solo and gradually descends into madness once again by the end of the track.</p>\n<p><em>A Song For My Brother, The Whale</em>, sounds ideal for an opening song for a live set, consisting of a long, slow build-up which contrasts with the more lighthearted songs as it contains dark background notes throughout up until the last section where the track ends on laughter, odd. However, my favourite track comes around halfway through the album and is called <em>O’Science</em> where the song revolves around a great trumpeting performance and is overall much less chaotic than most of the album and is easily recognisable as its impossible not to tap your toes to it.</p>\n<p><em>Celebration</em> appears to be an unusual song for this album, it sounds like it would make an incredible live song to play but it doesn’t appear to record as well as some of the other songs. <em>Olympus, </em>although it contains no lyrics, emphasises the aspects of folk that this band possess and it acts as a nice introduction to the calm penultimate track <em>Zoomercroom. </em>The last song on the album, <em>Come Home</em>, is extremely long and is a fitting conclusion to the album as it tries to squeeze in all the different elements and styles used but does so without the chaos that is apparent in parts.</p>\n<p>Overall, <em>Motherwhale</em>, is an album completely different to what the band have previously recorded; however i believe that this new music will allow them to retain the fans they have accumulated in the past whilst bringing in new fans who want a break from the standard pop-folk music that will undoubtedly be released throughout this summer. Well worth a listen.</p>\n<p>Cats and Cats and Cats Myspace available <a href=\"https://www.myspace.com/catsandcatsandcats\">here</a></p>\n<p>Cats and Cats and Cats Facebook page available <a href=\"https://www.facebook.com/#!/catsandcatsandcats\">here</a></p>\n<p>Cats and Cats and Cats Official site available <a href=\"https://www.catsandcatsandcats.com/\">here</a></p>\n","slug":"8691-review-cats-and-cats-and-cats-motherwhale","category":"music","date":1308657319000,"wpid":8691,"isSticky":false,"featured_image":{"width":450,"height":300,"src":"2011/06/l.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAAAAf/xAAfEAACAAYDAQAAAAAAAAAAAAABAgADBBESIQUGQRb/xAAUAQEAAAAAAAAAAAAAAAAAAAAB/8QAFhEBAQEAAAAAAAAAAAAAAAAAABEh/9oADAMBAAIRAxEAPwCydl+6puxvUcJT0Ezi5TKUltOs01MTkpBACm4G93uLEbtQlRSoyVcvdewhAbkf/9k="},"createdAt":1587294266714,"updatedAt":1588403553714,"author":"5e9b68b27a1236eccfeb1d07","old_image":"2011/06/l.jpg","categories":["music","reviews"]}