{"id":"5e9c34229b6559241525e196","title":"Harrys Gym","content":"<p><a href=\"https://admin.</p><p>crackintheroad.com/uploads/2010/05/DSC_0145.jpg\"><img class=\"alignnone size-large wp-image-888\" src=\"https://api.crackintheroad.com/wp-content/uploads/2010/05/DSC_0145-1024x687.jpg\" alt=\"Harrys Gym\" width=\"800\" height=\"536\" srcset=\"https://api.crackintheroad.com/images/2010/05/DSC_0145-1024x687.jpg 1024w, https://api.crackintheroad.com/images/2010/05/DSC_0145-300x201.jpg 300w, https://api.crackintheroad.com/images/2010/05/DSC_0145-165x110.jpg 165w, https://api.crackintheroad.com/images/2010/05/DSC_0145-950x637.jpg 950w, https://api.crackintheroad.com/images/2010/05/DSC_0145.jpg 1448w\" sizes=\"(max-width: 800px) 100vw, 800px\" /></a></p>\n<p>Combining elements of electronica with indie pop, Harrys Gym have gained considerable success in Norway over the past year and a half, touring in support of their 2008 self-titled album. Having conquered their homeland, the four piece Norwegian band have now turned their attention to the UK, where their debut album has only just been released. I meet the songwriter of the band, Anne Lise Frøkedal, at the Yardbird Jazz Club in Birmingham, before their show there that evening, as part of a UK tour to promote <em>Harrys Gym</em>.</p>\n<p>As we sit down, Anne Lise answers a question I hadn’t even asked yet. “Britain has a reputation for being pretty hard to tour in.” But has this been true for Harrys Gym? “Not this time.” She explains that previously they have had some bad experiences in the UK, but that this time things have been different: “I don’t know whether our tour manager’s done a good job or whether the world’s just become nicer…I don’t know.” And compared to Norway? Anne Lise laughs. “It’s different,” she says. “There’s been a lot of money support for venues in Norway…they all have great equipment. I think that a lot of British bands get really shocked when they come over to Norway.” In contrast, Anne Lise seems quite surprised by Birmingham. “I didn’t know it was this big city. I would have thought it was like York or whatever,” referring to the previous stop on their tour.</p>\n<p>Why have they only tried to crack the UK now? “We didn’t really think outside of Norway [at the time].” Their critical success then, it seems, has come as a surprise, after gaining praise in British music publications such as <a href=\"https://www.nme.com/blog/index.php%3Fblog%3D15%26p%3D3380%26more%3D1%26c%3D1\" target=\"_blank\">NME</a> and <a href=\"https://drownedinsound.com/in_depth/3022531\" target=\"_blank\">Drowned in Sound</a> for their performance at by:Larm 2008. So how will the British press react to the album? “It’s had some good feedback already. Apart from the biggest magazines we don’t really know much about UK press…but it’s always nice for people to like [the music].”</p>\n<p>Another difference between reactions in Norway and reactions over here seems to be over artists that Harrys Gym allegedly sound like. I ask her about the comparison many have made to Danish band Mew. “I think obviously there’s some Scandinavian or Nordic sound that people hear that we can’t hear ourselves. We’ve never, ever found ourselves similar to Mew at all. In Norway, no-one’s ever mentioned Mew. That’s the weird thing.” So are there any artists they would compare themselves to? “A lot of people compare us to Blonde Redhead.” Anne Lise also mentions that many have compared their more electronic elements to The Knife. “But maybe that’s just because they’re from Sweden.”</p>\n<p>With the band’s debut release only being available to UK residents for a week, is there any plans for album #2? Maybe surprisingly for some, the band have already recorded the follow up. “We’re mixing it right now,” says Anne Lise. But unlike last time, they now have the funding of Universal Music, after signing to them earlier this year. “We actually have a budget this time. The last album we made, we mixed it ourselves.” Whereas this time, they have the help of producer James Rutledge and are mixing the album in London, after recording it in Norway. Anne Lise seems pleased about this. “[With mixing the first album] we were very close to killing each other,” she jokes.</p>\n<p>Later on in the evening, I watch Anne Lise and the rest of her band take to the stage. The venue has filled up since the previous act and there is a sense of excitement that was missing before. They are playing under the lo-fi folk of Peggy Sue, but as they launch into their set they soon show that they could easily be worthy headliners of venues much larger than this one. They also show a new depth – a spine-tingling darkness – to their music that is hinted at on record, but easily discarded due the album’s poppier moments. Whether we will be hearing more of this on their new record or whether they will stay with their catchy pop hooks remains to be seen, but regardless, there is a lot of people who walked away from the Yardbird show, as with all their UK shows so far, who are waiting for whatever Harrys Gym conjure up next with much anticipation.</p>\n","slug":"872-harrys-gym","category":"interviews","date":1274183811000,"wpid":872,"isSticky":false,"featured_image":{"width":1448,"height":972,"src":"2010/05/dsc_0145.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAQI/8QAIBAAAQMDBQEAAAAAAAAAAAAAAQACERMhUQMEEiIx8P/EABUBAQEAAAAAAAAAAAAAAAAAAAME/8QAGREAAgMBAAAAAAAAAAAAAAAAAQIAESHw/9oADAMBAAIRAxEAPwDNR2mn1dLeNMuvIMR79hR08XCIjUnZWyrQzsn/2Q=="},"createdAt":1587295266504,"updatedAt":1588403567723,"author":"5e9b68b27a1236eccfeb1d14","old_image":"2010/05/dsc_0145.jpg","categories":["interviews","music"]}