{"id":"5e9c34249b6559241525e199","title":"Interview: Alan Pownall","content":"<p style=\"text-align: center\">For an artist to be best friends with <strong>Jay Jay Pistolet </strong>and <strong>Ted</strong> from <strong>Mumford & Sons, </strong>it seems odd that <strong>Alan Pownall </strong>has said that he ‘never intended to make folk music’.</p><p> Therefore many, in a constant compulsive behaviour to associate one artist with another, have compared <strong>Alan Pownall </strong>to American singer/songwriter <strong>Jack Johnson</strong>. However this is a pitfall best avoided as <strong>Alan Pownall </strong>shares very little in common with the Hawaiian surfer cum musician. This can be heard in the more vintage and distinctly British sound that <strong>Alan Pownall</strong> has managed to create, especially after only discovering his talent of writing in his late teens. This late blossoming of his musical endeavours has allowed <strong>Alan Pownall </strong>to retain a great deal of freedom in his creative processes, which is born out into a sound that has an upbeat melodic quality that will certainly be the soundtrack of the summer for many. With his debut album ‘True Love Stories’ being released on the 12th July, <strong>Alan Pownall </strong>kindly took some time out to answer our questions.</p>\n<p style=\"text-align: center\">\n<p style=\"text-align: center\"><em>CITR: </em>If you had to cite one band/artist as a major influence upon you, who would it be?</p>\n<p style=\"text-align: center\"><strong>Just one? Hmm … Tom Petty. Though his music sounds nothing like us! (Laughs)</strong></p>\n<p style=\"text-align: center\"><em>CITR: </em>What has been your favourite gigging experience to date?</p>\n<p style=\"text-align: center\"><strong>The first time I played Shepherd’s Bush, when I was supporting Paloma Faith. I thought that was pretty special as I came out as the first support act, played a song on my own and just thought ‘fuck me, this is huge’. So yeah, I’d definitely say that was a special moment.</strong></p>\n<p style=\"text-align: center\"><em>CITR: <span style=\"font-style: normal\">On your Myspace blog, you talk about your admiration of art as ‘creating something out of nothing’. What was it that made you choose music as your artistic platform?</span></em></p>\n<p style=\"text-align: center\"><strong>This is going to sound dreadful, but it chose me! (Laughs) Everything I’ve sort of done I’ve always tried to act on inclination and instinct, without feeling like I’m trying to contrive anything. It’s like when you’re at school, when someone tells you you’re good at something, you excel at it, or when they tell you you’re not good at it, you don’t. But then other people may do the inverse of that, however for me music was very much something I was naturally drawn to. Writing music was something that made me happy and it was something that I wanted to pursue. Simple as that really.</strong></p>\n<p style=\"text-align: center\"><em>CITR: <span style=\"font-style: normal\">As you’ve developed your musical form, every review I’ve read about you makes a comparision to Jack Johnson. What do you make of this?</span></em></p>\n<p style=\"text-align: center\"><strong>I’ve never really given it too much thought, though I think its off the basis of one song. Maybe it has something to do with the instrumentation, but I really don’t think it sounds that much like it. At the end of the day people are going to say what they say and there’s nothing that I can do about it. I definitely didn’t sit down listening to Jack Johnson albums when I was writing my own album! (Laughs)</strong></p>\n<p style=\"text-align: center\"><em>CITR: <span style=\"font-style: normal\">Again in your Myspace blog, you refer to the fact you never intended on making ‘folk music’. Therefore how would you describe your sound?</span></em></p>\n<p style=\"text-align: center\"><strong>I never consciously sat down and tried to make any type of music. If someone was to ask me what type of music I make, the answer would be: I don’t know, you tell me! I know people who have a clear idea of what they want to make and before they write an album they sit and they revise what they want to sound and look like. I on the other hand wake up everyday with a different idea of who I want to be and how I want to sound. I guess that comes with being young and stupid (laughs). My second album will definitely be more considered, however when I wrote my first album I was given the opportunity to go into the studio and record an album so that’s what I did. It had to be instinctive, and I’m sure there will be flaws in the album and charm as a result of that. So to answer your question I didn’t sit down and try to write folk music. Then again I didn’t sit down and try to make rock music or blues music etc.</strong></p>\n<p style=\"text-align: center\"><em>CITR: <span style=\"font-style: normal\">When you came back to London and witnessed the music scene, you say in your blog that ‘to be honest I seldom liked the music itself but I was taken in by the philosophy of the middle class Londoners with talent, good looks, vintage clothes and a cultured take on music’ …</span></em></p>\n<p style=\"text-align: center\"><strong>There was some sort of tongue in cheek-ness to that! (Laughs) Basically what I was referring to was that at the end of the day when you have grown up in West London you have to laugh at yourself a little bit. I definitely saw in a lot in the artists that I perhaps hadn’t seen in the artists I had grown up listening to. I related to them in a way I couldn’t relate to Kurt Cobain. Like I said in the blog it was real, it was people like me, it was friends of friends of mine and that was the most inspiring thing. When you see someone who has achieved everything there is to achieve, its too big a mountain to adjust your eyes to. If you see the next link in the chain, these are people my age who are from university or still at university, and you think they’re doing it so why cant I.</strong></p>\n<p style=\"text-align: center\"><em>CITR: <span style=\"font-style: normal\">I’ve read that you were once part of a band called ‘Sex Face’ with Ted from Mumford & Sons. Can you shed some light on what sounded like a fantasic musical endeavour?</span></em></p>\n<p style=\"text-align: center\"><strong>(Laughs). I always describe it as we had to break up as it was too brilliant. I think the real reason why we had to break up was because it wasn’t good enough! It was me and Ted, I was trying to learn how to play the bass and he was playing the guitar, and we had a friend on drums. We were going to be this magical three piece but  in reality there was just no direction (laughs). It was fun nonetheless. The idea was to shave our heads and be punks, but we couldn’t find any clippers!</strong></p>\n<p style=\"text-align: center\"><em>CITR: <span style=\"font-style: normal\">In your gigs, do you try to maintain a sense of the serene and intimate style of a singer/songwriter, or do things get turned up a notch? Hearing an artist on an album is one thing, but to hear them live can sometimes be completely different.</span></em></p>\n<p style=\"text-align: center\"><strong>Yeah definitely, I hope so! Our album was written and produced by me and one other guy, so when we were playing it live it was a completely new process. When we first started it kind of almost sounded like a covers band playing what was on the record, which didn’t really work. Then I spent a lot of time trying to emulate the sounds on the record, and because theres a real vintage sound to it (lots of compression, valve amps, old microphones), I ended up going so far trying to develop it that it ended up sounding like it was coming through a really bad quality PA! I had to revaluate the whole thing, but now I hope that when performed live, it is a sort of a progression from the album. Whereas when we first started it sounded like an awful regression! (laughs) But yeah, I wanted it to be a bit bigger and more entertaining as I want it to be a bit of a show as performing live is a completely different avenue. If we had sat down as a band and written and recorded the album, it would have made more sense to go on the road and record it as we were playing it. However its not that kind of album. We had to reinvent it, which I was quite excited about it as there are so many tracks on all of the songs, that to play it live and give it the same justice as on the record you’d need 12 or 14 people on stage!</strong></p>\n<p style=\"text-align: center\"><em>CITR: <span style=\"font-style: normal\">You recently recorded at the Maida Vale recording studios, how was that as an experience?</span></em></p>\n<p style=\"text-align: center\"><strong>It was a great experience, though in some ways it was a bit premature. Like I was saying, the feeling in the band is almost like we’ve made an album and now we have to start again creating a live performance version. The Maida Vale gig was worth noting as it was the first gig I played with my band, we only had two rehearsals before hand!</strong></p>\n<p style=\"text-align: center\"><em>CITR: </em>You are on the set list to perform on the BBC Introducing Stage at the Radio 1 Big Weekend. Does playing on such a relatively new platform mark the beginning of wider recognition?</p>\n<p style=\"text-align: center\"><strong>To be honest I probably wont see it as that! (laughs) I remember when I went on tour with Mr Hudson, and he is someone that has had two albums out and signed to same label as me, therefore I was quite interested to know how things came about for him. So I said to him, ‘was it the Jools Holland show that marked when it all kicked off?’, and he said no not really, it was every little thing that had to come together at once. It’s never one thing. I<span style=\"font-weight: normal\"><strong>f you look at a band like Mumford & Sons, the stars aligned, everything went very well for them from the word go. I’m not suggesting it was luck in any way shape or form, they are a great live band, but things just came together for the</strong><strong>m.</strong></span></strong></p>\n<p style=\"text-align: center\"><em>CITR: </em>PC or Mac?</p>\n<p style=\"text-align: center\"><strong>Mac definitely.</strong></p>\n<p style=\"text-align: center\"><em>CITR: </em>Could you tell us some Alan Pownall trivia we may not know?</p>\n<p style=\"text-align: center\"><strong>Hmm .. I am all but deaf in my right ear!</strong></p>\n<p style=\"text-align: center\">\n<p style=\"text-align: center\"><a href=\"https://www.myspace.com/alanpownall\" target=\"_blank\">Check out Alan Pownall’s Myspace!</a></p>\n<p style=\"text-align: center\">\n<p><iframe src=\"https://www.facebook.com/plugins/likebox.php?id=114090381951328&width=292&connections=10&stream=false&header=false&height=255\" scrolling=\"no\" frameborder=\"0\" style=\"border:none; overflow:hidden; width:292px; height:255px;\" allowTransparency=\"true\"></iframe></p>\n","slug":"874-5-minutes-with-alan-pownall","category":"interviews","date":1274165587000,"wpid":874,"isSticky":false,"featured_image":{"width":450,"height":300,"src":"2010/05/alan_pownall.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAII/8QAIhAAAgAFAwUAAAAAAAAAAAAAAQIAAwQFIQYHERITQVGR/8QAFQEBAQAAAAAAAAAAAAAAAAAAAgP/xAAXEQEBAQEAAAAAAAAAAAAAAAABAAIx/9oADAMBAAIRAxEAPwCbVrm6WPb/AG1kW0L3aiqae7kkdSLMYOhGMFX+8eo02JiuA6AFWyOR4hCAVtnG/9k="},"createdAt":1587295268261,"updatedAt":1588403567748,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2010/05/alan_pownall.jpg","categories":["interviews","music"]}