{"id":"5e9c348f9b6559241525e24b","artists":["5e9b69577a1236eccfeb26a7"],"title":"Review: Uffie – Mc’s Can Kiss","content":"<p style=\"text-align: left;\">With the ‘Synth Soaked Bitch’ genre already saturated by the likes of the utterly soulless Ke$ha or the nostalgic Ladyhawke, there was always the fear that Uffie would be swamped by her own impersonators.</p><p> Despite this chart insecurity, Uffie’s latest slice of impulsive, obnoxious funk-filled electro is quite marvelous.</p>\n<p>‘Mc’s Can Kiss’ from the EP of the same name see’s Uffie collaborate with record label partner Mr. Oizo, the results are safe but still utterly engaging. Oizo’s production as always is flawless, his synths pulsate and chime over a beat that’s so minimalist you’d be forgiven for thinking he’s missed the point. The point, as you might expect is Uffie herself. As always her words are pertinent and obnoxious and delivered with an attitude that only Uffie could conjure, however this latest offering is laced with a level of introspection that was missing from her other work. The title itself suggests a rather one dimensional level of arrogance, however underneath is so much more as we see Uffie comment on her own middle weight mainstream status; it seems that Uffie may have heard of the likes of Ke$ha “If I get popular, I know that ain’t fair”. If course any hint at chart insecurity is quelled by her signature level of arrogance, however it reveals a level self awareness and more importantly a strong degree of empowerment; Uffie simply doesn’t care. Uffie also seems to have become less brutal as she gathers her years. Gone is brash attacks found in ‘Pop the Glock’, in its place is a more focused aggression that’s far more likely to get under the skin as we see Uffie comment on the cruelty of her own industry while also reveling in the freedom her relatively underground status gives her, “I don’t have any job to attend in the morning, no boss at my shoulder to check how I’m doing”.</p>\n<p style=\"text-align: center;\">Despite Uffie’s new found lyrical maturity, half of ‘Mc’s Can Kiss’s’ charm is it’s ability to simply be taken as a stomping pop record, a perfect progression for the princess of electro. A perfect blend of pop, humour and artistic insight; let’s just hope the music listening public respects her title.</p>\n<p style=\"text-align: center;\"><a href=\"https://www.myspace.com/uffie\">https://www.myspace.com/uffie</a></p>\n<p style=\"text-align: center;\"><a href=\"https://api.crackintheroad.com/uploads/2010/04/Uffie-MCs-Can-Kiss-.mp3\">Uffie – MC’s Can Kiss</a></p>\n","slug":"88-uffie-mcs-can-kiss","category":"music","date":1270952021000,"wpid":88,"isSticky":false,"featured_image":{"width":165,"height":165,"src":"2010/04/uffie-165x165.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAABgf/xAAhEAABBAICAgMAAAAAAAAAAAABAgMEEQUGABIWITFSYf/EABQBAQAAAAAAAAAAAAAAAAAAAAD/xAAUEQEAAAAAAAAAAAAAAAAAAAAA/9oADAMBAAIRAxEAPwAjrepbRrOu5DGIZx0xU9BbYQhXZYUqkkqBFhA7E2TVjh93Q9IiuLjy9rkCQ0S26EtorsPRr8vllxa1ebZA9jYhRAPfwCpy+RLMxI5zE4mOySX3LJQPseB//9k="},"createdAt":1587295375201,"updatedAt":1588403569226,"author":"5e9b68b27a1236eccfeb1d24","old_image":"2010/04/uffie-165x165.jpg","categories":["music","reviews"]}