{"id":"5e9c302f9b6559241525dafc","title":"Review: Benjamin Barker Sessions- Stephen Flavahan","content":"<p><a rel=\"attachment wp-att-8890\" href=\"https://admin.</p><p>crackintheroad.com/music/8889-review-benjamin-barker-sessions-stephen-flavahan/attachment/248779_220974647931961_177073365655423_823101_1962158_n\"><img class=\"alignnone size-650home wp-image-8890\" title=\"248779_220974647931961_177073365655423_823101_1962158_n\" src=\"https://api.crackintheroad.com/uploads/2011/06/248779_220974647931961_177073365655423_823101_1962158_n-650x433.jpg\" alt=\"\" width=\"650\" height=\"433\" /></a></p>\n<p>After an opening night a couple of months ago with native Dundonians, <em>The View</em>, headlining there is one new music venue that has been hot on the lips of many people around the city, <strong>Benjamin Barker Barber & Shop</strong>. Unusual name for a venue, right? Well it is because it is a <em>real </em>barber shop by day who opens its doors at night roughly once a month for lucky clients to see some of the best live music bands and artists in Scotland. With a capacity of around 40 it epitomises the meaning of ‘intimate’, but that doesn’t stop some of the big names in music declaring their interest in performing there. Last week Perth based artist <em>Stephen Flavahan</em> performed with great support from his favourite bands, <em>Happy Vandals </em>and <em>Poor Things</em> and the night was a huge success. From what I can gather and predict it won’t be long until some of the biggest names in Scottish music will be knocking on the barber’s door to play. If you want to know any more about these exclusive events go to the shop on Perth Road in Dundee and get yourself a haircut, a chat about future gigs, and a free beer too if you’re lucky!</p>\n<p>I got the chance to speak to both the artist <em>Stephen Flavahan </em>and his drummer before their performance on the night and also with the proprietors of the barbers, Keith and Jeff, about their aspirations of the building becoming a highly sought-after music venue in Dundee.</p>\n<p><em>Stephen Flavahan Interview:</em></p>\n<p>CitR: What do you think of the concept of the Benjamin Barker Sessions?</p>\n<p><strong>I helped come up with the concept behind it, as I knew of a similar thing that started up in Ayr. I think it is a really exciting thing to be doing, especially with The View playing the opening night, and I myself were in a band with a couple of the guys before The View began.</strong></p>\n<p>CitR: What are your influences in creating your music?</p>\n<p><strong>I bought most of my records in the post-Brit-Pop era which is fairly recent so some of that stuff has influenced my music. However, I listen to a lot of hip-hop, especially modern stuff such as Jay-Z but I don’ suppose much of that comes out in the music I write and perform.</strong></p>\n<p>CitR: What are the best band/artist you have supported or been supported by in the past?</p>\n<p><strong>Well we played with Bombay Bicycle Club a while ago which was good for us but there was little contact between us and them so I kind of prefer smaller gigs where the artists mingle and have a laugh together. The bands supporting us tonight, Happy Vandals and Poor Things are great and I would say they were the best support I could have got tonight as I am not even sure if I can improve on their performances!</strong></p>\n<p>CitR: You have a new EP out, What would you say your favourite song was from the collection you have in it?</p>\n<p><strong>My favourite used to be The Walls as it is frantic and it has a lot of pop influences then it ends with a lot of soul to it. Now I don’t really know what my favourite song is to be honest. </strong></p>\n<p>CitR: What do you think the best song ever written is, personal opinions aside?</p>\n<p><strong>Eleanor Rigby by The Beatles I think, and most stuff from the Revolver album as a whole, as it has an entire string movement and is incorporated in one pop song and has really simple, beautiful harmonies. </strong></p>\n<p><strong>Doug (Drummer): I don’t really know to be honest, I like different takes on original songs to be honest, not covers however, like real different versions of songs. </strong></p>\n<p>CitR: If you could have any superpower what would it be and why?</p>\n<p><strong>I am trying to work out what would be something that would never get old, perhaps teleportation, it would save on so much time. </strong></p>\n<p><strong>Doug: I don’t think I am responsible enough for a superpower to be honest!</strong></p>\n<p><em> </em></p>\n<p><em>Keith and Jeff Interview on the Benjamin Barker Sessions:</em></p>\n<p>CitR: How did the Benjamin Barker Sessions come about?</p>\n<p><strong>Well the way the shop is set out, the wooden flooring looks like a venue and the raised platform at the end of the shop looks just like a stage. We thought it was a good way to get guys into the shop and to say thanks to regular customers who are into the same sort of music we are in to.</strong></p>\n<p>CitR: What do you hope to achieve from these Sessions?</p>\n<p><strong>Brand awareness to a certain extent I think, we want people to start talking about us as a barber as a place you can go for a quality cut and a free beer and a place to go at night sometimes for some great live music to promote bands from across Scotland. We feel at our age we have missed the vein of really good Scottish music and we believe bands enjoy playing small gigs like this with stripped back acoustic sets.</strong></p>\n<p>CitR: Are there any bands of artists coming up that you are excited about performing here?</p>\n<p><strong>Our next session is on July 2</strong><sup><strong>nd</strong></sup><strong> and overall we have some cracking artists we are hoping to get in but we can assure you the one on July 2</strong><sup><strong>nd</strong></sup><strong> is going to be a belter, and we hope people will talk about us more after it. </strong></p>\n<p>CitR: If you could have any artist or band performing in here, who would you love to see?</p>\n<p><strong>The top of the food chain to be honest, the likes of Liam Gallagher and artists like that, but so far that is somewhat of a dream.</strong></p>\n<p>Remember, if you want to be part of this brilliant new concept and have the chance to coming to these invite-only gigs which include some of Scotland’s best live music then get down to the shop, get a top quality haircut, and get yourself known to the guys down there!</p>\n","slug":"8889-review-benjamin-barker-sessions-stephen-flavahan","category":"music","date":1309006939000,"wpid":8889,"isSticky":false,"featured_image":{"width":720,"height":480,"src":"2011/06/248779_220974647931961_177073365655423_823101_1962158_n.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAYH/8QAIhAAAgEDAgcAAAAAAAAAAAAAAQIDAAQFITEGBxESE0FR/8QAFAEBAAAAAAAAAAAAAAAAAAAABP/EABcRAQEBAQAAAAAAAAAAAAAAAAEAAhH/2gAMAwEAAhEDEQA/AM+4JwqZJo2ubdZoWYIfI2hJ9faq7jl1gjPIVUIpY9FDMe3XbalKMr2VkEv/2Q=="},"createdAt":1587294255560,"updatedAt":1588403553522,"author":"5e9b68b27a1236eccfeb1d07","old_image":"2011/06/248779_220974647931961_177073365655423_823101_1962158_n.jpg","categories":["music","reviews"]}