{"id":"5e9c30229b6559241525dae4","artists":["5e9b695d7a1236eccfeb26e0"],"title":"Review: Washed Out – Within And Without","content":"<p>Chillwave.</p><p> The mere thought of the word sends shivers down the spines of music bloggers all over the world. Pupils narrow, fingertips begin to sweat and Twitter goes into meltdown. With the underground community heralding 2010 as the year chillwave exploded, it’s no surprise that the shoegaze influenced sound is beginning to sweep it’s way into mainstream consciousness. The forefront of the hugely contentious movement has seen the likes of Panda Bear, Neon Indian and Toro Y Moi at the helm of the ship, all originally pioneered as one piece outfits. Another solo project to lead the chillwave charge was Ernest Greene’s Washed Out, conceived back in mid-2009, his first full length LP Within And Without is set to be released next Monday.</p>\n<p>After a string of singles and EP’s, Greene appeared to be honing his sound, ridding his tracks of the raw, haphazard feel experienced on his original bedroom recordings, and replacing it with a more muscular, outwardly pop element. One aspect of his sound that remained true however was the rap inspired backing beats; simplistic yet entirely fitting to the atmosphere of the tracks. Album opener and first single Eyes Be Closed is one of Washed Out’s most accessible tracks to date, reverb soaked and gloriously upbeat. The tribal inspired drum beat hold the track together, whilst Greene’s echoed vocals float effortlessly over the top of the swirling synths.</p>\n<p>If there’s one aspect that Washed Out excels upon, it’s finding catchy and infectious sections for the synthesizers, as portray excellently on the heavenly Amor Fati, translated as ‘love of ones fate’. After continuous listens to this track, the true beauty of it struck me; it’s the equivalent of Slowdive’s career defining When The Sun Hits. Simply put, it’s an astonishingly perfect record for listening to on a warm summers day, relaxing as background music but still engaging when scrutinized. The shoegaze influence is evident throughout the entirety of Within and Without, most obviously on the languidly delivered vocals, that drift seamless in with the music.</p>\n<p><object width=\"100%\" height=\"81\" classid=\"clsid:d27cdb6e-ae6d-11cf-96b8-444553540000\" codebase=\"https://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=6,0,40,0\"><param name=\"allowscriptaccess\" value=\"always\" /><param name=\"src\" value=\"https://player.soundcloud.com/player.swf?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F17580109\" /><embed width=\"100%\" height=\"81\" type=\"application/x-shockwave-flash\" src=\"https://player.soundcloud.com/player.swf?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F17580109\" allowscriptaccess=\"always\" /></object> <span><a href=\"https://soundcloud.com/subpop/washed-out-amor-fati\">Washed Out – Amor Fati</a> by <a href=\"https://soundcloud.com/subpop\">subpop</a></span></p>\n<p>In fact, much of the emotional content is showcased through the vocal intonations, such as the melancholic Far Away and the sample led You And I. Title track Within and Without drifts by rather placidly, proving neither offensive or especially immersing. It’s this trait that proves the records main stumbling block, in so far as the lack of variety experienced; it’s ‘chillwave’ epitomized. The latter half of You And I features Caroline Polachek of Chairlift, and offers a fresh approach to the rest of the tracks, with her soothing vocals proclaiming ‘Under unnatural circumstances, I forget about your vain pretenses. But if you want to recreate the sea, another sky for me, I got you.’ A standout moment from Within and Without.</p>\n<p>When Greene does choose to mix his sound up, it pays off, and leaves you wondering why there aren’t more instances of this on his debut record. Album highlight A Dedication is a heartfelt ballad, devoid of the dominating mystical synths and impersonal computer generated beats; leaving the track stripped back and relying almost solely upon Greene’s exceptional vocals and the effervescent piano. It’s far and away the most emotionally poignant moment of the record, and possibly hints at Washed Out’s future direction. Whilst Within And Without is ideal for the current climate, it’s not quite reaching the expectations originally placed upon Greene, and leaves you feeling perhaps the best is yet to come.</p>\n<p><object width=\"100%\" height=\"81\" classid=\"clsid:d27cdb6e-ae6d-11cf-96b8-444553540000\" codebase=\"https://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=6,0,40,0\"><param name=\"allowscriptaccess\" value=\"always\" /><param name=\"src\" value=\"https://player.soundcloud.com/player.swf?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F17945583\" /><embed width=\"100%\" height=\"81\" type=\"application/x-shockwave-flash\" src=\"https://player.soundcloud.com/player.swf?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F17945583\" allowscriptaccess=\"always\" /></object></p>\n","slug":"8995-review-washed-out-within-and-without","category":"music","date":1309806853000,"wpid":8995,"isSticky":false,"featured_image":{"width":165,"height":165,"src":"2011/07/washed-out1-165x165.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAABAYI/8QAIxAAAQMDBAIDAAAAAAAAAAAAAQIDBAAFEQYSITETI0JE0v/EABQBAQAAAAAAAAAAAAAAAAAAAAP/xAAZEQEAAgMAAAAAAAAAAAAAAAABACECEVH/2gAMAwEAAhEDEQA/ALmTquzxItsRaJxdDkltE0vSHXNkfB3KTtUMK6weaW5cNMFasTLgeT9lf6rMmniSxKyScNp7pjb73jT7XOh8jSOVD2EF6n//2Q=="},"createdAt":1587294242532,"updatedAt":1588403553308,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/07/washed-out1-165x165.jpg","categories":["music","reviews"]}