{"id":"5e9c30249b6559241525dae7","artists":["5e9b69447a1236eccfeb2537"],"title":"Review: Slime – Increases","content":"<p>For those that haven’t had the pleasure of entering<strong> Slime</strong>’s cramped south London studio, what motivates and provokes the sounds of Will Archer (slime), have remained a mystery.</p><p>  This is how <strong>Slime</strong> prefers it, far from entering a world of anonymity as a marketing scheme; he simply finds more value focusing on the music alone, something he happens to be rather good at creating.</p>\n<p>In many ways his sound is difficult to define, from the intriguingly casual album opener to the perfectly pitched vocal slithers that pierce and caress each tune, its most amicable quality is its fleeting unbiased attitude to genre, <strong>Slime</strong> simply isn’t concerned with it. Yet despite this, he finds a sound, and perhaps more importantly; he explores and bears open a tone that is as fascinating as it is raw.</p>\n<p style=\"text-align: center;\"><a rel=\"attachment wp-att-8999\" href=\"https://api.crackintheroad.com/music/8997-review-slime-increases/attachment/increases/\"><img class=\"size-full wp-image-8999\" title=\"increases\" src=\"https://admin.crackintheroad.com/uploads/2011/07/increases.jpg\" alt=\"\" width=\"140\" height=\"140\" srcset=\"https://api.crackintheroad.com/images/2011/07/increases.jpg 200w, https://api.crackintheroad.com/images/2011/07/increases-165x165.jpg 165w\" sizes=\"(max-width: 140px) 100vw, 140px\" /></a></p>\n<p style=\"text-align: left;\">The album is unashamedly sad, lonesome and imperfect. This is not a tale with a happy ending, despite the EP being almost entirely instrumental, the verdict is clear; no one is getting out of this love affair alive. <em>Caffeine</em> is a perfect example; wind samples and a mournful guitar riff are stark backdrops for the screeches and howls of pain, yet despite the clear emotive message it never seems to revel in self-pity. <em>Caffeine</em> has a remarkable crescendo that almost, if not completely, breaks free from the sadness, if only for a moment. What makes the album palatable, fuck that, enjoyable, is that <strong>Slime</strong> never shies away from a groove. Slime produces jams, even if these jams are for the love struck youth of today.</p>\n<p><em>2Player</em> takes similar instrumental ideas from <em>Caffeine</em> and forms something close to the records only pop-tune, full of eerie guitar slides and that ever present vocal howl, it manages to make you cry while you dance, singing along to a hopeful lovers inner-monologue. “<em>For a little while, would you stay a while, would you come around, for a little while</em>?” sings <strong>Vondelpark</strong>, it ‘s almost pathetic, but it’s remarkably real; it’s uncoordinated relationship surgery at its rawest. All the while, a simple beat claps with a bitter venom that gives the track a much more perverse undertone.</p>\n<p><em>Gals</em> is <em>Increases</em>’ second vocal based tune and is perhaps the most accomplished on the record. Here sadness is muffled, awkward and haunting; the vocals swirl and mutate, forming a state of consciousness that finds solace within a forced state of delirium.  The track’s cogs are simple, despite the ambitious intentions, when <strong>Vondelpark</strong> admits “<em>I’m falling down</em>” so does the track, when <strong>Vondelpark</strong> powers on “<em>look it’s over now</em>”, the whistles and steady beats do their very best to keep on plodding. It’s a delightful example of sound perfectly mirroring sentiment.</p>\n<p>There are moments of alienation within the record however, <em>Break Fall</em> for example seems like an after thought, the synth chimes lacking textural depth while the overall journey amounting to very little. It perhaps lacks a clear tone like the rest of the EP.</p>\n<p>Regardless, with one slightly less accomplished track comes 2 of the EPs sonic highlights, <em>First Cape</em> and <em>Next Time</em>. <em>First Cape</em> is a delicate escalation of noise; the basic clarinet and voice samples are looped almost to obsession and combined with the eventual additions of chimes and vocal blemishes, it forms a tangled and confused cry for help, but again all with a beat that pops to a groove. <em>Increases’</em> final track <em>Next Time</em> is the EP’s only clear attempt at moving on, and it strikes the balance well. The hooks is carefree, the beat sturdy and confident but again <strong>Slime</strong> always has an eye for the tear, with the wall of vocal chanting almost tempting the character back to self loathing.</p>\n<p>Ultimately Increases is a confident and in places exceptional debut record. Tonally it comes close to perfection, capturing loss and pain without the need for words or clear-cut messages. Sonically it also flourishes, it’s the organic, home-recorded samples that give the pieces a level of craftsmanship that works perfectly when exploring these themes. Ultimately it will dare you to believe in the human again, no matter how imperfect, self loathing and love-struck the human is, you will believe again.</p>\n<p><object width=\"100%\" height=\"225\"><param name=\"movie\" value=\"https://player.soundcloud.com/player.swf?url=http%3A%2F%2Fapi.soundcloud.com%2Fusers%2F3074931&fb_sig_time=1309732465.2626&fb_sig_ss=1a8ad62e4ce4145a691c2c24fee31b80&fb_sig_in_new_facebook=1&height=225&color=3b5998&fb_sig_locale=en_GB&fb_sig_api_key=61261ce0407b2ccb568641b513098e18&width=520&fb_sig_app_id=19507961798&fb_sig_user=571431417&fb_sig_profile=128346203902140&fb_sig_session_key=01711ecf935fd980b68c59c6.0-571431417&fb_sig_expires=0&fb_sig_ext_perms=status_update%2Cphoto_upload%2Cvideo_upload%2Coffline_access%2Cemail%2Ccreate_note%2Cshare_item%2Cpublish_stream%2Cmanage_pages%2Cuser_birthday&fb_sig_profile_update_time=1301293283&fb_sig_country=gb&fb_sig_added=1&fb_local_connection=_id4e10ee71401889188941974&fb_sig_cookie_sig=4271b56cf54f2c91a19daa4d3e5ab9df&fb_sig=8f4eafa5cb0fef2ad58284227f2a6f38\" /><param name=\"allowscriptaccess\" value=\"always\" /><embed type=\"application/x-shockwave-flash\" width=\"100%\" height=\"225\" src=\"https://player.soundcloud.com/player.swf?url=http%3A%2F%2Fapi.soundcloud.com%2Fusers%2F3074931&fb_sig_time=1309732465.2626&fb_sig_ss=1a8ad62e4ce4145a691c2c24fee31b80&fb_sig_in_new_facebook=1&height=225&color=3b5998&fb_sig_locale=en_GB&fb_sig_api_key=61261ce0407b2ccb568641b513098e18&width=520&fb_sig_app_id=19507961798&fb_sig_user=571431417&fb_sig_profile=128346203902140&fb_sig_session_key=01711ecf935fd980b68c59c6.0-571431417&fb_sig_expires=0&fb_sig_ext_perms=status_update%2Cphoto_upload%2Cvideo_upload%2Coffline_access%2Cemail%2Ccreate_note%2Cshare_item%2Cpublish_stream%2Cmanage_pages%2Cuser_birthday&fb_sig_profile_update_time=1301293283&fb_sig_country=gb&fb_sig_added=1&fb_local_connection=_id4e10ee71401889188941974&fb_sig_cookie_sig=4271b56cf54f2c91a19daa4d3e5ab9df&fb_sig=8f4eafa5cb0fef2ad58284227f2a6f38\" allowscriptaccess=\"always\"></embed></object><span><a href=\"https://soundcloud.com/slime-music\">Latest tracks by Slime Music</a></span></p>\n","slug":"8997-review-slime-increases","category":"music","date":1309728881000,"wpid":8997,"isSticky":false,"featured_image":{"width":165,"height":165,"src":"2011/07/slimereview-165x165.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAABQj/xAAjEAACAQQBAwUAAAAAAAAAAAABAgMEBREhAAcSQQYTImGR/8QAFAEBAAAAAAAAAAAAAAAAAAAAAv/EABgRAQADAQAAAAAAAAAAAAAAAAEAAiER/9oADAMBAAIRAxEAPwBi/UVBe+sF49Rm+tSS2xoFpI4G2OxMMzb2vdkFRnIb75QK1FFIocSU5DDIPevnkfdQQILpZ5oR7czzurOmmYYGifI3x0SPgfNv3gs2txWLDAn/2Q=="},"createdAt":1587294244013,"updatedAt":1588403553336,"author":"5e9b68b27a1236eccfeb1d24","old_image":"2011/07/slimereview-165x165.jpg","categories":["music","reviews"]}