{"id":"5e9c301d9b6559241525dadb","artists":["5e9b68fe7a1236eccfeb20f7"],"title":"Review: Guerre – Darker My Love","content":"<p><a href=\"https://admin.</p><p>crackintheroad.com/uploads/2011/07/4119031026-1.jpg\"><img src=\"https://api.crackintheroad.com/wp-content/uploads/2011/07/4119031026-1.jpg\" alt=\"\" title=\"Guerre - Darker My Love\" width=\"350\" height=\"350\" class=\"alignleft size-full wp-image-9042\" srcset=\"https://api.crackintheroad.com/images/2011/07/4119031026-1.jpg 350w, https://api.crackintheroad.com/images/2011/07/4119031026-1-165x165.jpg 165w, https://api.crackintheroad.com/images/2011/07/4119031026-1-260x260.jpg 260w\" sizes=\"(max-width: 350px) 100vw, 350px\" /></a></p>\n<p>In the immediate hype that surrounded Jame Blake, one aspect that numerous publications picked up on to pursue was the lo-fi fusion of dubstep orientated beats with soulful, classical-esque vocals. However, when the time arrived for the young London musician to release his debut LP, it proved rather underwhelming and stale, almost as if he’d become trapped between forging a commercially successful career or sticking to his guns. Yet one positive that arose from Blake’s fur-fore into the unknown, was the belief it seemingly instilled in other male songwriters, both to sing and perform their own music as a solo act.</p>\n<p>Australian Lavurn Lee appears very much shaped in this mould, with his seductively atmospheric project Guerre. Barely a year ago, Lee dipped his toe in the forever rippling waters of internet recognition, by releasing a collection of bedroom recorded R’n’B influenced tracks. Their honest home-produced sound attracted the attention of numerous blogs all across the world, including two of my personal favourites <a href=\"https://lifeaquaticblog.com/\">Life Aquatic</a> and <a href=\"https://easttowestau.blogspot.com/\">East to West</a>, both based in Guerre’s country of residency.</p>\n<p>At the end of last month, Guerre released a new EP titled Darker My Love via Yes Please Records on a pay-what-you-like basis. The Guerre track that originally caught my attention was the softly delivered You Were With Me, so it’s refreshing to hear that his new EP is no huge departure sound wise. Piano led opener Care 4 Me is a lush sensual affair, with Lee’s vocals proving wistful and engaging; without the simplistic yet effective beat becoming drowned out. ‘and I know that you care for me’ laments Guerre in a tone so far from contrived that it can only be viewed as entirely sombre.</p>\n<p>See The Birds allows for a more musically creative outlet, and takes a slightly enhanced upbeat resonance. On Darker My Love, Guerre documents young love and sexual urges in a way that only one who had truly experienced such events could do, but in way that never appears self indulgent. The silences are a key element to the overall aesthetic, allowing the tracks to breathe and build sensational atmospheres. My personal favourite, Millennium Blues features a dubstep inspired beat and vocals so desperately light that they appear to float mystically alongside the track, only participating in the track when need be.</p>\n<p><iframe width=\"400\" height=\"100\" style=\"position: relative; display: block; width: 400px; height: 100px;\" src=\"https://bandcamp.com/EmbeddedPlayer/v=2/track=3710340649/size=venti/bgcol=FFFFFF/linkcol=4285BB/\" allowtransparency=\"true\" frameborder=\"0\"><a href=\"https://yespleaserecords.bandcamp.com/track/millenium-blues\">Millenium Blues by yes please</a></iframe></p>\n<p>Where Blake slipped up on his debut album was the lack of real emotional connection, and on Guerre’s Darker My Love there is certainly no lack of personal input and insight. This record encapsulates all that is brilliant and woeful about relationships, be they sexual or spiritual, resplendent or harrowing. At times it verges towards the repetitive, however the musical composition prevents Darker My Love from fading into obscurity, and instead marks Guerre out as one of the most exciting artists to come from Australia in recent years.</p>\n","slug":"9032-review-guerre-darker-my-love","category":"music","date":1309899658000,"wpid":9032,"isSticky":false,"featured_image":{"width":165,"height":165,"src":"2011/07/4119031026-1-165x165.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAABQMH/8QAIhAAAQIFBAMAAAAAAAAAAAAAAQIDAAQFBiERFSJBMTNx/8QAFAEBAAAAAAAAAAAAAAAAAAAABf/EABgRAQADAQAAAAAAAAAAAAAAAAEAAhES/9oADAMBAAIRAxEAPwDRLfbokzL1GWJCkyaQFrwBqQfB7g/ZaSrkl10A5AKMxOzOVvSpVklsak9wi57FfTD+FLOQhOg2f//Z"},"createdAt":1587294237925,"updatedAt":1588403553230,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/07/4119031026-1-165x165.jpg","categories":["music","reviews"]}