{"id":"5e9c341b9b6559241525e18a","title":"Review & 5 Minutes With: Admiral Fallow","content":"<img class=\"alignnone\" title=\"Admiral Fallow\" src=\"https://www.</p><p>redhotvelvet.co.uk/uploads/453d652c50.jpg\" alt=\"Admiral Fallow\" width=\"640\" height=\"426\" />\n<p>With numerous outstanding records from Scottish acts over the last few years, including <strong>Frightened Rabbit</strong>, <strong>The Twilight Sad </strong>and <strong>The Xcerts;</strong> Glasgow based rockers <strong>Admiral Fallow </strong>are looking to add their name to this prestigious list. Combining their anthemic folk songs with brooding, contemplative hooks, adding to the already exceptional, distinguished vocals of lead singer <strong>Louis Abbott</strong>, they have a perfect recipe for success as well as producing stunning melodic rock music. Forming from the ashes of <strong>Brother Lewis Collective,</strong> <strong>Admiral Fallow</strong> released their debut album titled<em> Boots Met My Face</em> on the 26th of April this year.</p>\n<p>Right from the first shrill clarinet note, this album is an altogther epic and momentus affair, ranging from the moving, heartwrenching lullaby’s like <em>Delivered,</em> and the brash but tuneful anthems such as crowd favourite <em>Squealing Pigs.</em> Lazy comparisions will be made to the <strong>The Twilight Sad</strong>, however, upon further listens of the album, you begin to realise that <strong>Admiral Fallow</strong> are taking an entirely different approach, relying far more on a sweeping, orchestral sound, rather than unique and bold guitars. Illustrated brilliantly in the thoughtful<em> These Barren Years</em>, where the breakdown includes a joyful and uplifting flute solo, with <em>Abbott </em>crooning over the top “how long, will this last?”.</p>\n<p>The varied but controlled use of instruments is a refreshing experience, especially in todays current climate, and is a great beacon to the fact that whilst guitar driven indie bands may be yesterday’s news, there is still room for exciting, soulful music, albeit primarily composed on guitars. Piano led<em> Old Balloons</em> builds up to a rousing and energetic end, with all instruments joining together to support <strong>Abbott’s</strong> prominent, gifted voice. Album highlight however is the tender, passionate duet which is <em>Bomb Through The Town</em>, which sees <strong>Sarah Hayes</strong> put down her flute and join Abbot in a stirring, emotional encounter. Exaggerated violins battle furiously with the steady, harsh drum beat, to control the song, which ultimately ends in an apocalyptic finale.</p>\n<p>Managing to expertly fuse ballads and balls-out-rock is the undoubted strength of the album, alongside the hauntingly reminiscent lyrics of <strong>Abbott</strong>, delivered with precision. This impressive collection of tracks is a fitting sound for the unusually warm weather we have been receiving as of late, and will certainly go a long way in launching <strong>Admiral Fallow</strong> to the dizzy heights of their blossoming Scottish counterparts.</p>\n<p><strong>Sarah </strong>from Admiral Fallow generously took some time out to answer a few questions for us.</p>\n<div><em>CITR: </em>The Scottish music scene at the moment appears to be the strongest it has been for a long time, with the likes of The Twilight Sad, Glasvegas and We Were Promised Jetpacks all getting mainstream coverage, to name but a few. What reasons do you think has seen the resurgence of the vibrant music scene in Scotland?</div>\n<div><strong>We’re all too young to remember an earlier ‘golden era’ of the Scottish music scene (and I grew up in Northumberland). Since I moved up here the thing that has struck me about the music scene in Glasgow in particular is its variety, and the fact that people are always up for going to gigs, and taking a chance on acts they may not have heard of. In our experience so far, the local bands help each other out by going to each other’s shows as well, which makes for a supportive atmosphere.</strong></div>\n<div><em>CITR: </em>What has been your most memorable gig experience to date?</div>\n<div><strong>The Glasgow show of our album launch tour in April this year was really special – we were amazed at how many people came. In our very early days we were lucky enough to open for Guillemots on a couple of occasions, and I’ll never forget those gigs – we were really jammy to get the support slot, and it was so exciting.  Aside from that we once accidentally did an acoustic trio show in a community hall in Glasgow for Chinese New Year – there must have been a communication breakdown in the booking because no-one was expecting us and we were in between a sword wielder and some middle-aged female line dancers.</strong></div>\n<div><em>CITR: </em>What would you cite as your main influences, both musical and otherwise?</div>\n<div><strong>Our musical influences include Elbow, The Dears, Tom Waits, Low, Nick Cave, The Boss, Rufus Wainwright amongst hundreds of others. Recently people seem to think we’ve been influenced by Deacon Blue but they’ve never featured prominently in any of our record collections – just to clear that up!</strong></div>\n<div><em>CITR: </em>If you could chose to be any animal, what would you be and why?</div>\n<div>\n<div><em> </em><strong>If you are a dog you get almost guaranteed frequent hugs, which would be brilliant. I would also enjoy being a Kakapo, with his ‘Victorian gentleman’s face’: <a href=\"https://www.youtube.com/watch?v=9T1vfsHYiKY\" target=\"_blank\">https://www.youtube.com/watch?v=9T1vfsHYiKY</a></strong></div>\n<div><strong>And sea cucumbers don’t have to worry about anything.</strong></div>\n<div style=\"text-align: center;\"><a href=\"https://www.myspace.com/admiralfallow\">Check Out Their Myspace</a></div>\n<div style=\"text-align: center;\"><a href=\"https://www.amazon.co.uk/s/ref=nb_sb_noss?url=search-alias%3Daps&field-keywords=admiral+fallow+boots+met+my+face&x=0&y=0\">Purchase Boots Met My Face (Amazon)</a></div>\n</div>\n","slug":"904-review-5-minutes-with-admiral-fallow","category":"interviews","date":1274375625000,"wpid":904,"isSticky":false,"featured_image":{"width":640,"height":426,"src":"2011/06/453d652c50.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAAAAb/xAAkEAACAQIDCQAAAAAAAAAAAAABAwIAEQQFEgYHCCEiMUFhcf/EABUBAQEAAAAAAAAAAAAAAAAAAAEC/8QAFhEBAQEAAAAAAAAAAAAAAAAAAQAC/9oADAMBAAIRAxEAPwCfXv8AdpcvzBC1yw7orgFPjJZiBMExJiAbHlY3I7+KqU8RObFKyMBgZjSOpipaj7NpAX+AClKjWkBJv//Z"},"createdAt":1587295259363,"updatedAt":1588403567620,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/06/453d652c50.jpg","categories":["interviews","music","reviews"]}