{"id":"5e9c301c9b6559241525dad8","artists":["5e9b68da7a1236eccfeb1e9d"],"title":"Interview: British Sea Power","content":"<p><a href=\"https://admin.</p><p>crackintheroad.com/music/9044-interview-british-sea-power-2/attachment/british_sea_power01_website_image_gallery_wuxga/\" rel=\"attachment wp-att-9045\"><img class=\"alignleft size-singlepost wp-image-9045\" title=\"British Sea Power\" src=\"https://api.crackintheroad.com/uploads/2011/07/british_sea_power01_website_image_gallery_wuxga-950x633.jpg\" alt=\"\" width=\"950\" height=\"633\" srcset=\"https://api.crackintheroad.com/images/2011/07/british_sea_power01_website_image_gallery_wuxga-950x633.jpg 950w, https://api.crackintheroad.com/images/2011/07/british_sea_power01_website_image_gallery_wuxga-260x173.jpg 260w, https://api.crackintheroad.com/images/2011/07/british_sea_power01_website_image_gallery_wuxga-640x426.jpg 640w, https://api.crackintheroad.com/images/2011/07/british_sea_power01_website_image_gallery_wuxga-925x616.jpg 925w, https://api.crackintheroad.com/images/2011/07/british_sea_power01_website_image_gallery_wuxga-165x109.jpg 165w, https://api.crackintheroad.com/images/2011/07/british_sea_power01_website_image_gallery_wuxga.jpg 1800w\" sizes=\"(max-width: 950px) 100vw, 950px\" /></a></p>\n<p>Now, it’s quite important to note that this interview was not a very well-thought out one: what follows is the result of an interview in which the interviewer had no questions to ask, was missing a Flaming Lips set, and could only actually find two members of British Sea Power. Nevertheless, Jan Scott Wilkinson (or Yan, vocals and guitar) and Phil Sumner (cornet and keyboards) sat down under the shadow of the Lovell telescope in Cheshire to discuss a variety of crucial issues which had very little to do with the world of music.</p>\n<p><strong>CitR: So.</strong></p>\n<p><em>Phil: </em>[immediately distracted by a 2 year-old pushing a suitcase of beers] <em>That’s inspiration. Look at him! If you’ve ever seen inspiration, there it is. You’re a good lad, you are. He’s got beers in it, look! Sorry.</em></p>\n<p><strong>CitR: If you could send a personal message into space, what would it be?</strong></p>\n<p><em>Yan: I’d say “look after the monkeys”. </em></p>\n<p><em>Phil: In particular Monkey World, towards Dorset in the South.</em></p>\n<p><em>Yan: Nobby went there recently, our guitarist, and said it’s highly recommended. He said that the monkeys that live in Monkey World are all monkeys people didn’t want to look after. The reject monkeys. Where did they get them from? Where do people come from that had these monkeys and didn’t want them? So yeah. “Obliterate the monkeys”. No! “Obliterate the people, re-energize the monkeys” and start again.</em></p>\n<p><strong>CitR: What’s the weirdest thing that’s ever happened to you onstage?</strong></p>\n<p><em>Yan: I was halfway through a gig in Glastonbury, and then King Arthur came over and started talking to me, and I had a chat with him. He was a lovely man.</em></p>\n<p><em>Phil: Yan, or Scott, or whatever you wanna call him, his brother dressed up as a robot.</em></p>\n<p><em>Yan: He punched you in the face.</em></p>\n<p><em>Phil: He only punched me in the face the next day. He came onstage as a robot, and I was so scared by seeing this robot, I picked up his guitar and smacked the robot right in the head with the full weight of the back of the guitar. No shit, it knocked him clean out. The next day I apologised to him and he said “thank you”, and knocked me on the floor.</em></p>\n<p><em>Yan: To sum up, we used to take a lot of drugs, but now we don’t really need them anymore.</em></p>\n<p><strong>CitR: Which of you is actually the most out of touch with reality?</strong></p>\n<p><em>Phil: I think it’d have to be Neil </em>[Hamilton, bassist and second vocalist]<em>, Scott’s brother. </em></p>\n<p><em>Yan: He barely understands anything. Neil doesn’t know what day of the week it is.</em></p>\n<p><em>Phil: At the same time, he’s got such a soothing personality, that the most mental people gravitate towards him and with just a small touch, be becalmed.</em></p>\n<p><strong>CitR: Ask each other a question.</strong></p>\n<p><em>Yan: Phil, what are you doing?</em></p>\n<p><em>Phil: I am currently about to have a new baby. Yeah, that’s what I’m doing. I’m married and my wife’s pregnant, that’s what I’m doing. What are you doing? </em></p>\n<p><em>Yan: I’m doing the opposite of you. I’m not married, not having a baby, and unlikely to have a baby in the foreseeable future. </em></p>\n<p><strong>CitR: What’s your favourite album, ever?</strong></p>\n<p><em>Yan: Best of Serge Gainsbourg.</em></p>\n<p><em>Phil: Probably, uh…</em></p>\n<p><em>Yan: Best of Queen.</em></p>\n<p><em>Phil: I’d say the best album ever is Trans Am’s “Futureworld”.</em></p>\n<p><strong>CitR: If you could be any animal, what would it be?</strong></p>\n<p><em>Yan: </em>[laughs, then thinks]<em> I’d be a human being.</em></p>\n<p><em>Phil: I thought you’d be a monkey. I think I’d be a cat. Not that I’m a selfish person, but I think cats are quite selfish. I quite like them, not because they’re selfish, but because they’re enjoyable. </em></p>\n<p><em>Yan: In a simple statement, without knowing, Phil has identified himself as a non-psychopathic person.</em></p>\n<p><em>Phil: How’d you know that?</em></p>\n<p><em>Yan: If you were pyshcopathic you’d be a dog.</em></p>\n<p><strong>CitR: What’s the best place you’ve ever done a show?</strong></p>\n<p><em>Yan: Gdansk, Poland. Yesterday. Abi, our viola player, helped out Pulp because their viola player is scared of flying. So she went on and did “Common People” with them last night in the pouring rain.</em></p>\n<p><em>Phil: Yeah. Poland is the best place we’ve ever done a show. That’s a fact. And you can report that. It’s the best place that Sea Power have done shows. </em></p>\n<p><em>Yan: And it’s full of intelligent, enthusiastic people. The more Polish people we get in England, the better.</em></p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>  </p>\n","slug":"9044-interview-british-sea-power-2","category":"interviews","date":1309946850000,"wpid":9044,"isSticky":false,"featured_image":{"width":165,"height":165,"src":"2011/07/british_sea_power01_website_image_gallery_wuxga-165x165.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAABwUG/8QAIBABAAIBAwUBAAAAAAAAAAAAAQIDBAAFEQYSIUFRof/EABQBAQAAAAAAAAAAAAAAAAAAAAD/xAAUEQEAAAAAAAAAAAAAAAAAAAAA/9oADAMBAAIRAxEAPwAas2pxNvg2mFbn318wpZI0+/K+OU+feNRGmCq4EFfZSv771p+pJSq26trkwYU1EWLx2nbHwfNGtmXkyskuRcqqrN0H/9k="},"createdAt":1587294236365,"updatedAt":1588403553203,"author":"5e9b68b27a1236eccfeb1d16","old_image":"2011/07/british_sea_power01_website_image_gallery_wuxga-165x165.jpg","categories":["interviews","music"]}