{"id":"5e9c341d9b6559241525e18d","artists":["5e9b69117a1236eccfeb225f"],"title":"Review: LCD Soundsystem – This is Happening","content":"<img class=\"alignnone\" title=\"LCD Soundsystem\" src=\"https://crystalwolves.</p><p>files.wordpress.com/2009/10/lcd-soundsystem.jpg\" alt=\"LCD Soundsystem\" width=\"477\" height=\"358\" />\n<p>With the announcement by <strong>James Murphy</strong> that this is to be the final <strong>LCD Soundsystem</strong> record, expectations have been raised to phenomenal levels. Being the follow on from 2007’s imperious <em>Sound of Silver</em> has increased those expectations even further.<br />\nWhen you proclaim your forthcoming record to be your final release whilst your previous album has been hailed as a masterpiece, the pressure is truly on to deliver a landmark groundbreaking album. So, has <strong>James Murphy</strong> made his career defining epochal record with <em>This Is Happening</em>? Unfortunately the answer is no. While <em>Sound of Silver</em> was indisputably great and a true leap forward both sonically and in terms of song writing. <em>This is Happening</em> is merely a good record, no shame in that but after what has gone before it is a slight let down.<br />\n<em>This is Happening</em> is the sound of a man trying to recapture past glories in a similar style as before. Having hit upon a winning formula of thrilling dance floor dynamics aligned to heart wrenching emotional laments with <em>Sound of Silver</em>, <em>This Is Happening</em> uses much the same template and tricks, the<strong> Bowie </strong>pastiches are in place, the art rock retreads are there, as are the propulsive techno tracks and witty diatribes. There is nothing here that <strong>LCD</strong> fans have not heard before, the law of diminishing returns very much applies. Where the previous album sparkled and was full of rich emotional depth and subtly, many of the tracks here just drift by in a haze of mundanity. Only two tracks are less than seven minutes long, this is a record to test the patience of even the most ardent fan.</p>\n<p>Despite the feeling that much of the music here is a retread of what has gone before, make no mistake there is some outstanding music on this record. The album is bookended by two tracks that show both sides of the <strong>LCD </strong>oeuvre, both genius in terms of their style and execution. <em>Dance Yrself Clean</em> stars in a low key manner with the sound of what appears to be rattling pots and pans alongside bare bones percussion, <strong>Murhpy</strong>’<strong>s</strong> typically oblique lyrics ramble on about friends being mean, people being jerks and various other phrases while lilting backing vocals coo around him. The song is then pulverised by a massive techno explosion as synths blast and drums thud and kick, it is genuinely striking and by far the most exciting moment of the album. <em>Dance Yrself Clean</em> is unique in being the only really truly original track on the album and it shows why <strong>James Murphy</strong> has one of the greatest dance music minds on the planet. The final track <em>Home </em>shows the other side of the <strong>LCD</strong> coin, it is a truly beautiful record full of heart and soul, distilling the music to its pure beauty with no need for pointless witticism or an over egged synthy pudding. A simple hymn to accepting life for what it is, it is a really sweet track and perhaps the only point in the record that comes close to the emotional majesty of career highpoint <em>All My Friends</em>.<br />\nWhile many points of the album appear to lack innovation, one area where there is clear development is <strong>Murphy’s</strong> voice, it sounds superb throughout the whole album, most apparent on the lovely electro ballad <em>I Can Change</em>.<br />\nDespite the excellence of the previously mentioned tracks, far too much of the album is mired in mediocrity, in particular the interminable bad joke of <em>You Wanted A Hit </em>and the throwaway electro dance punk of <em>Drunk Girls </em>it is a malaise that severely drags the record down.<br />\nAfter listening to <em>This Is Happening,</em> it is quickly apparent that the dissolution of the <strong>LCD Soundsytem </strong>name is perhaps not such a bad thing and if he is ever to reach the heights of <em>Sound of Silver </em>again<strong> James Murphy </strong>has to look forward and expand his musical palette, as there is no doubt he is one of the most talented and creative musicians on the planet but from the sound of this record it appears <strong>LCD Soundsystem </strong>may not the be best outlet for his talent anymore.</p>\n<p style=\"text-align: center;\"><a href=\"https://lcdsoundsystem.com/thelimitedpack/\">Official Site</a></p>\n<p style=\"text-align: center;\"><a href=\"https://www.myspace.com/lcdsoundsystem\">Check Out LCD Soundsystem’s Myspace</a></p>\n","slug":"910-review-lcd-soundsystem","category":"music","date":1274265938000,"wpid":910,"isSticky":false,"featured_image":{"width":477,"height":358,"src":"2011/06/lcd-soundsystem.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAUI/8QAIBAAAQMEAgMAAAAAAAAAAAAAAQACAwQFETETISJR0f/EABUBAQEAAAAAAAAAAAAAAAAAAAQF/8QAHhEAAgEDBQAAAAAAAAAAAAAAAQIAAwRRBRKBsdH/2gAMAwEAAhEDEQA/AM12eKocQGQtfHIQ05I739VqejrOeTNuYPI6kb7REO8qlHHPcr6Om9mHmTkGf//Z"},"createdAt":1587295261243,"updatedAt":1588403567645,"author":"5e9b68b27a1236eccfeb1d33","old_image":"2011/06/lcd-soundsystem.jpg","categories":["music","reviews"]}