{"id":"5e9c30089b6559241525dab1","title":"Review: Live from Jodrell Bank","content":"<p><a rel=\"attachment wp-att-9145\" href=\"https://admin.</p><p>crackintheroad.com/music/9143-review-live-from-jodrell-bank/attachment/live_from_jodrell_bank40_website_image_ljwu_standard/\"><img class=\"alignleft size-singlepost wp-image-9145\" title=\"live_from_jodrell_bank40_website_image_ljwu_standard\" src=\"https://api.crackintheroad.com/uploads/2011/07/live_from_jodrell_bank40_website_image_ljwu_standard-950x632.jpg\" alt=\"\" width=\"950\" height=\"632\" srcset=\"https://api.crackintheroad.com/images/2011/07/live_from_jodrell_bank40_website_image_ljwu_standard-950x632.jpg 950w, https://api.crackintheroad.com/images/2011/07/live_from_jodrell_bank40_website_image_ljwu_standard-260x173.jpg 260w, https://api.crackintheroad.com/images/2011/07/live_from_jodrell_bank40_website_image_ljwu_standard-640x426.jpg 640w, https://api.crackintheroad.com/images/2011/07/live_from_jodrell_bank40_website_image_ljwu_standard-925x615.jpg 925w, https://api.crackintheroad.com/images/2011/07/live_from_jodrell_bank40_website_image_ljwu_standard-165x109.jpg 165w, https://api.crackintheroad.com/images/2011/07/live_from_jodrell_bank40_website_image_ljwu_standard.jpg 960w\" sizes=\"(max-width: 950px) 100vw, 950px\" /></a>A strange one, this. Classified, I suppose, as a one-day festival, Live from Jodrell Bank (or, to give it its other name, Transmission_001) is a shiny new annual event – or that’s the plan, at least – to showcase some of the world’s best bands under the shadow of the Lovell telescope, the world’s third largest radio telescope. For the first ever Transmission, the organisers pulled out all the stops – some terrific acts were on display, both new and old, all universally in awe of the immense dish above them, and all perfectly fitting (be it coincidentally or purposefully) the spacey-sciencey theme of the event.</p>\n<p>The honour of being the first artist to ever grace the Jodrell Bank stage went to up-and-coming London talent Alice Gold. Despite delivering a tight, well-performed set and showing off some impressive indie pop tunes, it was her closing song which both cemented her performance and made clear one of the reasons she had been picked to open the festival-thing. Debut single “Orbiter”, as well as being incredible well-suited for the event (I mean, really – it’s around the point where Gold’s vocals plead “<em>Search for me satellite/For transmission”</em> where one must wonder if she wrote the song especially for Jodrell Bank), boasts an infectious, White Stripes-esque bassline and some awesome vocals. As I write this, she herself is onstage at the iTunes Festival, supporting the Naked and Famous and White Lies. Hopefully, Transmission_001 gave her that extra boost to push her into the success she deserves.</p>\n<p>Unfortunately, this event was over a week ago. My memory, therefore, is not perfect when it comes to each artist. It says something, however, if I can remember very little of second act Wave Machines. On record, they seem to be pretty impressive – “Keep the Lights On” and “The Greatest Escape We’ve Ever Made” in particular are fantastic tracks, but from what I remember, their live performance left something to be desired. It was not bad, per se, but compared to the quirks and eccentricities behind the other acts, Wave Machines fell somewhat into the shadow of the day’s other artists.</p>\n<p>Artists such as OK Go, for example. Clad in red, green, yellow and blue suits, the Chicago rockers utterly lived up to their hype – their songs were decent, well-performed, etc. etc. But it was that little spark of weirdness that just managed to elevate them to brilliantness. From those suits to performing an entire song with cowbells in order to, in their words, bring diversity to the music that was being listened to by aliens, the sheer bravery of the band coupled with some great songs for a sunny day meant that OK Go, if not quite pushing themselves to the sheer insanity of the acts to follow, proved to be as entertaining as they were talented.</p>\n<p>British Sea Power were up next. We’re no strangers to the band ourselves (our not-completely-serious interview with them at Jodrell Bank can be found <a title=\"Interview: British Sea Power\" href=\"https://admin.crackintheroad.com/uncategorized/9044-interview-british-sea-power-2/\" target=\"_blank\">here</a>), who showcased an impressive enough mixture of classic songs from “I Am A Cider Drinker” to “Waving Flags” and tracks off their newest album, <em>Valhalla Dancehall</em> – most specifically, “Observe the Skies” – arguably one of the better tracks on the album, and one which, like Alice Gold’s “Orbiter”, proved itself to be a suitably apt choice of song for the Lovell Telescope. Building on OK Go’s eccentricity, BSP decided to delve into outright surreality thanks to the appearance of a robot and a bear wreaking havoc onstage and some overtly sexual behaviour between band-members, brief as it was.</p>\n<p>And then, headlining the event, was the Flaming Lips. I’ve <a title=\"Review: ATP\" href=\"https://admin.crackintheroad.com/music/9065-review-all-tomorrows-parties-deerhoof-dinosaur-jr-and-the-flaming-lips/\" target=\"_blank\">already done a review</a> this week fawning over them enough, so I shall refrain from doing so here. As expected, however, they were completely and utterly mind-blowingly fantastic, and that brilliance was exaggerated even further in the company of such a marvellous venue (it seemed to help that Wayne Coyne himself, who was given the opportunity to pilot the satellite, seemed to be having the time of his life), and that is all that needs to be said.</p>\n<p>And despite these acts, brilliant as they were, it was the location of the event that was really the star. It made a real, genuine change to be in such a grand and surreal place – it wasn’t an impersonal arena, or an overcrowded festival site. Instead, it was 5000 people listening to great music under the shadow of a staggeringly imposing structure, and, honestly, nothing else like it exists. The brilliance of the bands on show was to be expected – but the idea behind it was both awe-inspiring and  educational – from chants of “Science!” from the crowd and speeches from Dr. Tim O’Brien, to displays from astrophysicists throughout the day.  A truly unique event, then, unlike any festival in the country (and perhaps, even, the world) and, hopefully, one that lasts as long as the observatory for which it is named.</p>\n","slug":"9143-review-live-from-jodrell-bank","category":"festivals","date":1310579869000,"wpid":9143,"isSticky":false,"featured_image":{"width":165,"height":165,"src":"2011/07/live_from_jodrell_bank40_website_image_ljwu_standard-165x165.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAABgIH/8QAJBAAAgEDAwMFAAAAAAAAAAAAAQMCAAQRBRIhBgdBIzFCUmH/xAAUAQEAAAAAAAAAAAAAAAAAAAAD/8QAGREAAgMBAAAAAAAAAAAAAAAAAQIAAxEh/9oADAMBAAIRAxEAPwA/0r0Nofc+z2rvk6ay2BMGTjGJOfgfJHn8rOtR7eMtNQubcPjMJbJe6PIlgkZBorYtYpVuVTlAk87TjPNVN7t8vVZ7/Y0djuWOGIqjOz//2Q=="},"createdAt":1587294216971,"updatedAt":1588403552857,"author":"5e9b68b27a1236eccfeb1d16","old_image":"2011/07/live_from_jodrell_bank40_website_image_ljwu_standard-165x165.jpg","categories":["festivals","music","reviews"]}