{"id":"5e9c2fd19b6559241525da51","title":"Live Review: Bright Eyes (The Sage, Gateshead / 12/07/11)","content":"<p>It may come as a surprise that as one of my all time favourite artists, I had never seen Bright Eyes live before two weeks ago.</p><p> So it was rather fitting that my first experience of Conor & Co performing would be in the exquisite setting of The Sage, Gateshead, with it’s unrivaled acoustic qualities and worldclass facilities, the perfect habitat for one of the great songwriters of our generation.</p>\n<p>In recent years having washed away the alcohol and drug fueled demons that previously hounded him, Conor’s output has been as prolific as ever, if not slightly disappointing at times. Cassadaga occasionally felt weary and self-indulgent and his work with The Mystic Valley Band was inconsistent and lacked the emotional integrity that was previously so crucial to his music. Yet none of this deterred me from going to see Bright Eyes perform, as their back catalogue of music is almost unprecedented amongst modern day musicians</p>\n<p>Support artist Jenny & Johnny appeared to be the ideal choice, setting a relaxed yet enjoyable tone. Communicating regularly with the audience and expressing their delight at playing such a fantastic venue, they certainly won over many Bright Eyes fans with their twee inspired brand of folk.</p>\n<p>Taking to the stage shortly after eight thirty, Bright Eyes appeared to be in a jovial mood, and certainly having cast away any previous personality differences. Opening with Four Winds and with the set leaning slightly towards the newer material, the raw edge experienced on early Bright Eyes tracks was banished, and replaced with a grander, more all encompassing sound. The surroundings lended themselves marvelous to the atmosphere that the group sought to create, allowing Conor’s vocals to flourish, especially on the likes of older tracks The Calender Hung Itself and Lover I Don’t Have To Love.</p>\n<p>All in all, Bright Eyes effectively played a greatest hits set, spanning their illustrious and varied career, including tracks from this years The People’s Key, all the way to their earliest releases. A rare appearance for First Day Of My Life brought about a stunning reaction from the audience, whilst the effervescently fragile Ladder Song was an undeniable highlight, witnessing Conor performing the track as the lone figure on the stage. If this performance showed anything, it was that Bright Eyes deserve to be viewed as one of the most important and consistent acts of the past decade, regardless of their well documented pitfalls.</p>\n","slug":"9154-live-review-bright-eyes-the-sage-gateshead-120711","category":"music","date":1311951235000,"wpid":9154,"isSticky":false,"featured_image":{"width":500,"height":339,"src":"2011/07/bright-eyes.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAYH/8QAIRAAAgEDAwUAAAAAAAAAAAAAAQIRAAMEBRIxFCFigZH/xAAVAQEBAAAAAAAAAAAAAAAAAAADBP/EABkRAQACAwAAAAAAAAAAAAAAAAEAAhESIf/aAAwDAQACEQMRAD8AwPV7uJf0hcUMiZSQ7Ha0s8kEE8dhEcD3U10V3x+0pRnJTY3cs//Z"},"createdAt":1587294161368,"updatedAt":1588403552008,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/07/bright-eyes.jpg","categories":["music","reviews"]}