{"id":"5e9c30029b6559241525daa5","artists":["5e9b69377a1236eccfeb2475"],"title":"New: Ra Cailum – Bite Marks","content":"<p>Sometimes when beginning to listen to a new artist, it’s better to cut the bullshit and just listen.</p><p> Regardless, context, or at the very least a story of some kind, goes a long way. With <strong>Ra Cailum</strong> I believe I struck the perfect balance. My only frame of reference was two pieces of writing from the man himself. The first was taken from <strong>Cailum</strong>’s bandcamp:</p>\n<p>“I recorded this album from January – June 2011. The album is dedicated to Delia. This was her album before it was a Ra Cailum album. Every track on this album was recorded with her, with her instruments, in her house, etc., except for Reminders of You, which I recorded in my home. The album is comprised of Nine memories, a reaction, and a response.</p>\n<p>I miss you.”</p>\n<p>The second from his Facebook page as his album dropped, “eh fuck it! Here is the album! I don’t want to wait until tomorrow or Wednesday. I hope you like it!”</p>\n<p>It’s times like this when I get truly excited by the online, digital space in which we now share and enjoy music. The ability to receive an undiluted message from the artist is a rather poignant thing, especially when it comes to an album as emotionally turbulent as this one. At times it dresses itself like an early <strong>Bibio</strong> record, lush acoustic guitars fragment and loop over open spaces and rich ambience. In others it pushes the envelope of what a dark beat driven album can achieve. But free from genres and waves, <em>Bite Marks</em> is what it fucking is; it’s raw, uncompromised and audacious. Perhaps like Delia herself.</p>\n<p> </p>\n<p><iframe width=\"400\" height=\"100\" style=\"position: relative; display: block; width: 400px; height: 100px;\" src=\"https://bandcamp.com/EmbeddedPlayer/v=2/album=3960153405/size=venti/bgcol=FFFFFF/linkcol=4285BB/\" allowtransparency=\"true\" frameborder=\"0\"><a href=\"https://racailum.bandcamp.com/album/bite-marks\">Bite Marks by Ra Cailum</a></iframe></p>\n","slug":"9168-new-ra-cailum-bite-marks","category":"music","date":1311020368000,"wpid":9168,"isSticky":false,"featured_image":{"width":165,"height":124,"src":"2011/07/ra-cailum-165x124.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAIAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAIG/8QAHRABAAICAgMAAAAAAAAAAAAAAQACAxIRIQQxUf/EABUBAQEAAAAAAAAAAAAAAAAAAAEC/8QAGBEBAAMBAAAAAAAAAAAAAAAAAQACESH/2gAMAwEAAhEDEQA/AMLhecuyOndjGPs4+yrZtbNbeKCdI2iIGLJtpU7P/9k="},"createdAt":1587294210841,"updatedAt":1588403552748,"author":"5e9b68b27a1236eccfeb1d24","old_image":"2011/07/ra-cailum-165x124.jpg","categories":["music","reviews"]}