{"id":"5e9c34169b6559241525e181","title":"5 Minutes With: Will Atkinson","content":"<p><a href=\"https://admin.</p><p>crackintheroad.com/uploads/2010/05/Will-Press-Pic-use.jpg\"><img class=\"alignnone size-full wp-image-933\" src=\"https://api.crackintheroad.com/wp-content/uploads/2010/05/Will-Press-Pic-use.jpg\" alt=\"\" width=\"720\" height=\"480\" srcset=\"https://api.crackintheroad.com/images/2010/05/Will-Press-Pic-use.jpg 720w, https://api.crackintheroad.com/images/2010/05/Will-Press-Pic-use-300x200.jpg 300w, https://api.crackintheroad.com/images/2010/05/Will-Press-Pic-use-494x329.jpg 494w, https://api.crackintheroad.com/images/2010/05/Will-Press-Pic-use-165x110.jpg 165w\" sizes=\"(max-width: 720px) 100vw, 720px\" /></a></p>\n<p>Being brought up in Orkney, a community awash with endless fields and equally endless folk music erupted someone who has now become a dance sensation, leaving behind the older generations to restring their bows. <em>Until Next Time</em> is <strong>Will Atkinson’s</strong> latest release and promises to become the single that will achieve the success he has worked tireless for since his first production at the age of 12. Playing in such venues as Digital in Newcastle and live to millions on Radio 1 he has amassed accolades from fellow DJs as <strong>Anne Savage </strong>calling him a ‘future legend in the making’ and his popularity is showing no signs of deteriorating any time soon, especially after setting up his own label Wa-X records and topping download charts across the internet. Even his old productions continue to get massive airplay on Radio 1 and features in compilations such as <strong>Dave Pearce’s</strong> <em>Trance Anthems </em>and also <em>Gatecrasher’s Classics.</em></p>\n<p>His blend of trance and hard dance is coupled with influences from bands such as <strong>Biffy Clyro </strong>and <strong>Kraftwerk </strong>which produces his unique style that will leave trance-sceptics reeling. The time is now for people who generally avoid music created without guitars to have a listen to <strong>Will Atkinson</strong>, he will change many peoples’ opinions and prove that great dance music requires massive talent and dedication, both of which he has in abundance.</p>\n<p><strong>Will Atkinson </strong>also was kind enough to answer a few questions for <em><strong>CitR</strong></em>:</p>\n<p><em>CitR: </em>Being brought up in such a rural environment such as Orkney, have you found your surroundings a help or a hindrance in creating and developing your music career?</p>\n<p><strong>Orkney’s stunning environment definitely has a huge significance in most of my tracks/remixes. It adds an extra, symbolic vibe into each production – something I feel very lucky to have.</strong></p>\n<p><em>CitR: </em>I understand you have a great respect for Radio 1 DJ Judge Jules who has even played some of your songs on air, however have you had other inspirations and if so who are they?</p>\n<p><strong>Jules is a fantastic guy. He’s like a musical connoisseur for me, and has sat down and listened to every track of mine from my first dabble in production! As I mentioned, Orkney is obviously a big inspiration for me. Other Dance artists like Simon Patterson, Eric Prydz and Activa are massive heroes of mine. I also draw a lot of inspiration from bands like Biffy Clyro, Sigor Ros and Kraftwerk! I’ve also started sampling loads of old hip-hop records: there’s a track I’ve just finished called “Lights Out” – I think there’s about 7-8 different samples in there I’ve ripped! Shhh!</strong></p>\n<p><em>CitR: </em>What do you prefer doing musically, producing your own songs or remixing other people’s works?</p>\n<p><strong>It’s always fun to remix a track – the chance of moulding the original into a vibe you envision. But with remixes come deadlines, so it can sometimes turn into a ‘race to the finish’ scenario. There’s absolutely no boundaries when I’m producing a track of my own – I feel a lot of my tracks hold a more sentimental value and I know that it won’t be released until I’m 100% happy with it!</strong></p>\n<p><em>CitR: </em>Which town or city in the UK have you found the people to be most enthusiastic about your specific brand of trance music?</p>\n<p><strong>Playing Newcastle in March was absolutely wicked. But I think Glasgow definitely brings in the most loud crowds – the atmosphere, the chants – totally electric!</strong></p>\n<p><em>CitR: </em>To anyone not generally interested in trance and minimalistic music before now, myself included, what do you think makes you different from artists that these people may have listened to and disliked in the past?</p>\n<p><strong>Let me see… how can I sell it? Haha. Well, with my sound, you can expect euphoric, uplifting moments, surrounded by energetic percussion and ballsy basslines! It’s all from the heart, so you know and I know that 100% effort has gone in! The last couple of years have been really positive for Dance music – artists like Deadmau5, David Guetta and Eric Prydz have been responsible for some of the biggest commercial hits over the last couple of years, so it’s really exciting to see the genre receiving that sort of attention again!</strong></p>\n<p><em>CitR: </em>If you could have any superpower, what would it be?</p>\n<p><strong>The ability to divide by zero</strong>.</p>\n<p><em>CitR: </em>What is your most embarrassing moment either performing live or in the studio?</p>\n<p><strong>Hmm, thankfully I’ve managed to steer clear of those moments so far. Perhaps one of my first gigs when I was 15, where the club had belt-driven turntables (which were on their last legs) and I had to manually keep the record up to speed during my last few tracks with my hand! Hahaha!</strong></p>\n<p style=\"text-align: center\"><a href=\"https://www.myspace.com/willatkinson1\">Will Atkinson’s Myspace</a></p>\n<p style=\"text-align: center\"><a href=\"https://www.new-wavemanagement.co.uk/\">New-Wave Management</a></p>\n","slug":"932-5-minutes-with-william-atkinson","category":"interviews","date":1274422099000,"wpid":932,"isSticky":false,"featured_image":{"width":720,"height":480,"src":"2010/05/will-press-pic-use.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAMH/8QAIhAAAQMDAwUAAAAAAAAAAAAAAQIDEQAEBRIhMQcTFWFx/8QAFQEBAQAAAAAAAAAAAAAAAAAAAwT/xAAbEQABBAMAAAAAAAAAAAAAAAABAAIDESFR8P/aAAwDAQACEQMRAD8Alk8j5rM2rtrmL13Q0bpZcKkENqTAjSRuCRHyZkb6Erps4CQq+adUOVr7upXswrk0pUsrjjtJ2CiaX//Z"},"createdAt":1587295254489,"updatedAt":1588403567543,"author":"5e9b68b27a1236eccfeb1d07","old_image":"2010/05/will-press-pic-use.jpg","categories":["interviews","music"]}