{"id":"5e9c2fd69b6559241525da5a","title":"Preview: Beacons Festival 2011","content":"<p>Okay, so it’s new festival time.</p><p> Yes, yes, new festival time is seemingly every day in recent summers and it’s all pretty much reaching saturation. The issue is, though, that the vast majority of new festivals are just okay. Not bad. C+. Stick on a few folk bands, add a couple of DJs, put The Futureheads as headliner and voilà, you’ve got a festival. So lets do this the easy way- what reasons should you have to seriously consider Beacons Festival (and by the way, we strongly advise you do consider it seriously, because it’s looking fantastic)</p>\n<p><strong>1)</strong> The lineup reads like a whos who of the ‘just shy of mainstream fame’ crowd. <strong>Emmy the Great, Jamie XX, Willy Mason, Mr Scruff, Mount Kimbie, Ramadanman etc. </strong>– all names that you will definitely know and love (if you don’t, you clearly know of their existence and that they are kind of renowned for their talent). Indeed Beacons seems to exist as a haven for all of those artists-who-recently-toured-probably-for-DiS-but-you-completely-missed-them, as well as one guy who hasn’t toured recently…</p>\n<p><strong>2) Tom Vek. </strong>Those two words have one of two possible effects on you. First case, you shrug and just think “not everyone has your taste, stop acting hyperbolic about a few indie bands”. Second case? You buy tickets and stop reading here. 6 years away, a debut that still gets occasional listens, a sophomore that will easily sit in the top ten records of the year, his live show is not to be missed.</p>\n<p><strong>3) </strong>Truly independent market stalls. Most festivals will make a peacemeal attempt at this, with a few ‘quirky’ ostrich burger bars and the requisite hippy-and-incense emporiums, but Beacons sees a wide variety of independent stalls set up shop, ranging from a store composed entirely of goods made from waste products (<strong>Zinc White</strong>) to a sweets and socks shop (<strong>Super Fat Laces)</strong>.</p>\n<p><strong>4) </strong>Thoughtful extra activities and art. Whether you are interested by the academics of the 72 hour long <strong>Impossible Lecture, </strong>interested in a non-binding wedding ceremony at <strong>Tit-Tat</strong> or the ever expanding crop circles of <strong>Woolgather, </strong>Beacons offers a wide range of activities and art installations.</p>\n<div>Being in its first year, Beacons could fail. Indeed, there are no guarantees that this will ultimately be any different to the countless other festivals that appear each summer, however Beacons’ real distinction is its prestigous pedigree that includes the Moor Music Festival, Iron Wagon, Leeds’ 580 Collective and the folks behind Field Day in London. It’s safe to say, on that history, that it likely will live up to expectations.For further coverage both before and after the festival, watch this space. For more information and to buy tickets, visit <a href=\"https://www.greetingsfrombeacons.com/tickets/\">https://www.greetingsfrombeacons.com/</a><canvas width=\"50\" height=\"13\"></canvas><canvas width=\"54\" height=\"13\"></canvas><canvas width=\"71\" height=\"13\"></canvas><canvas width=\"42\" height=\"13\"></canvas><canvas width=\"64\" height=\"13\"></canvas><canvas width=\"41\" height=\"13\"></canvas><canvas width=\"37\" height=\"13\"></canvas><canvas width=\"42\" height=\"13\"></canvas><canvas width=\"86\" height=\"13\"></canvas><canvas width=\"50\" height=\"13\"></canvas><canvas width=\"54\" height=\"13\"></canvas><canvas width=\"71\" height=\"13\"></canvas><canvas width=\"42\" height=\"13\"></canvas><canvas width=\"64\" height=\"13\"></canvas><canvas width=\"41\" height=\"13\"></canvas><canvas width=\"37\" height=\"13\"></canvas><canvas width=\"42\" height=\"13\"></canvas><canvas width=\"86\" height=\"13\"></canvas></p>\n</div>\n","slug":"9375-preview-beacons-festival-2011","category":"festivals","date":1311895382000,"wpid":9375,"isSticky":false,"featured_image":{"width":865,"height":608,"src":"2011/07/announced.png","placeholder":"data:image/jpeg;base64, iVBORw0KGgoAAAANSUhEUgAAAAoAAAAHCAYAAAAxrNxjAAAACXBIWXMAAAsTAAALEwEAmpwYAAAAxklEQVR4nDWPzU5CUQyET8JCl7rlns7051wUUTeiJEDixoREBNTA+78K6VUWTdPJN81MKaWMAJhVe3VgldObfTTVd3efk9RTKaNCcurkr5OfIXoI0b0BXw04NZGdAUeS96WhPTh8a2I7B7aDoerm37j3yp9JgoF4yQ8XMFQPw666icrvP9ifCgB3kfUlX04Ay0ETWWfWGIeU1tqVdfacZe5c5lbrW4K96iLLhMiM5HWWuWki0ZPTFCNi5u6PedvYJt51PYDbMzUjKM73znlaAAAAAElFTkSuQmCC"},"createdAt":1587294166289,"updatedAt":1588403552086,"author":"5e9b68b27a1236eccfeb1d0b","old_image":"2011/07/announced.png","categories":["festivals","music"]}