{"id":"5e9c2fd49b6559241525da57","artists":["5e9b68f87a1236eccfeb208d"],"title":"Interview: Frightened Rabbit","content":"<p> </p>\n<p>Although still in its infancy as a quirky and unique venue, Benjamin Barker Barber Shop in Dundee pulled off a massive coup this month when it staged a secret, private gig with the headline act being Scottish band <strong>Frightened Rabbit</strong>.</p><p> Playing in front of around 30 people as usual, it made for a wonderful evening with three members of the band playing a stripped down set in front of a captivated crowd. The band are increasingly becoming a household name cross Scotland after success in the past few years with songs such as <em>Living in Colour</em> and <em>Swim Until You Can’t See Land</em>, both of which they performed on the evening. It was a night that the people present will never forget, as many people did not know which band were performing on the night, after being invited because of their loyalty to the shop; so when the guys walked onto the makeshift stage the room began to have an air of disbelief. The band hung around afterwards to chat to the crowd and I managed to have a few quick words with them in the storage cupboard. Glamorous.</p>\n<p> </p>\n<p>CitR: So what made you decide to perform a Benjamin Barker Session?</p>\n<p> </p>\n<p><strong>Well we get free haircuts for a start, and they’re really good too! Haha. We just really like the way the shop looks, its a really nice place to come and visit and play.</strong></p>\n<p> </p>\n<p>CitR: The majority of your songs seem to be very meaningful and deep; are they from personal experience or is it purely storytelling?</p>\n<p> </p>\n<p><strong>Its from personal experience mostly, it all started when I was going through a break up with an ex-girlfriend which really hammered me so I decided to write about it in songs.</strong></p>\n<p> </p>\n<p>CitR: The band started off with just yourself Scott, what made you decide to expand the group past just yourself?</p>\n<p> </p>\n<p><strong>Well it soon came to light that he was shit on his own (not Scott’s words), haha. Na actually, the expansion just came naturally as the songs gradually grew and became more layered.</strong></p>\n<p> </p>\n<p>CitR: What is the best band you have supported and been supported by during your time as a band?</p>\n<p> </p>\n<p><strong>I really enjoyed playing with Modest Mouse and Biffy Clyro but the best band we have been supported by I reckon is We Were Promised Jetpacks who we really enjoy. </strong></p>\n<p> </p>\n<p>CitR: What is your favourite song to play live?</p>\n<p> </p>\n<p><strong>Scott: </strong><em><strong>Keep Yourself Warm </strong></em><strong>I think is my favourite live song to play?</strong></p>\n<p> </p>\n<p>CitR: One final lighthearted question….How do you order steak in a restaurant or cook at home?</p>\n<p> </p>\n<p><strong>Medium-Rare is how I usually order steak, but I would try and tend to go to more rare than medium if it came to it. </strong></p>\n<p> </p>\n<p> </p>\n<p> </p>\n","slug":"9382-interview-frightened-rabbit","category":"interviews","date":1311926805000,"wpid":9382,"isSticky":false,"featured_image":{"width":165,"height":127,"src":"2011/07/rabbit_0011-edit-165x127.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAIAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAIF/8QAIRAAAQQCAgIDAAAAAAAAAAAAAQIDBAUAEQYSByExQXH/xAAUAQEAAAAAAAAAAAAAAAAAAAAC/8QAGBEAAgMAAAAAAAAAAAAAAAAAAAESEzH/2gAMAwEAAhEDEQA/AIvfIXJGrGfAiWEEVyF9o/RskoBCQkKUfnXvf7m9VcosXauG49fMB1bKFLBVrRKRv6xjBY0KKw//2Q=="},"createdAt":1587294164648,"updatedAt":1588403552060,"author":"5e9b68b27a1236eccfeb1d07","old_image":"2011/07/rabbit_0011-edit-165x127.jpg","categories":["interviews","music","reviews"]}