{"id":"5e9c2fc69b6559241525da39","artists":["5e9b694b7a1236eccfeb258a"],"title":"Review: Stray Kites – Mieux","content":"<p>Friendship has and always will be a key element in the creation of music.</p><p> Whether it be the idyllic connection between Lennon & McCartney, the tumultuous pairing of Doherty & Barat or the now bitter relationships found in ABBA, inspiration seems to take on a transcendental form when boosted by the energies of a passionate, understanding friendship. The quality of the creative output seems to increase exponentially when the addition of an invaluable bond is brought into the equation, and this is entirely the case with Virginia duo <strong>Stray Kites</strong>.</p>\n<p>Drawn together after missing a bus, <strong>Max Detrich</strong> and <strong>Junior Roseboro</strong> released their debut LP last year and have recently made their sophomore album<em><strong> Mieux</strong></em> available for download from their bandcamp. Recording primarily by their own methods and produced entirely by themselves, <em><strong>Mieux</strong></em> is a more mature, yet darker predecessor to <em><strong>One Day, Earth Time</strong></em>. Whilst the recording quality of previous material has lended itself to a intimate and personal sound, <strong>Stray Kites’</strong> second album explores even more secluded corners of <strong>Roseboro’s</strong> private life, mainly through the individualistic and unique lyrics.</p>\n<p><iframe style=\"position: relative; display: block; width: 400px; height: 100px;\" src=\"https://bandcamp.com/EmbeddedPlayer/v=2/track=3829915385/size=venti/bgcol=FFFFFF/linkcol=4285BB/\" frameborder=\"0\" width=\"400\" height=\"100\"></iframe></p>\n<p>Opener <em>Aside/Ideal Deaths</em> sets the melancholic lyrical tone whilst the instrumental sections remain relatively upbeat. Much of <em><strong>Mieux</strong></em> is centred around three elusive characters; Noelle, Fuehrer and Phantom Friend, who appear sporadically throughout the record; it’s not quite a concept album yet there are certainly repetitive themes.<em> Mirror Talk</em> toys with suicidal thoughts, seemingly brought on by low self esteem or a troublesome relationship, with lines such as ‘<em>Now you are the devil, on a funeral bed, but there’s no point in crying, because we know you aren’t dead’</em> exemplifying the bleak atmosphere that <strong>Roseboro</strong> and <strong>Detrich</strong> conjure up.</p>\n<p>The integrity and composure found on <strong><em>Mieux</em></strong> far exceeds that of <strong>Stray Kites’</strong> previous work; previous free download<em> Misanthrope</em> has <strong>Los Campesinos!</strong> plastered all over it, with it’s admirably honesty and intelligent youthful insights. Elsewhere, <em>Talking Plaster Walls pt.3</em> sees them drawing influence from<strong> Neutral Milk Hotel</strong> and <strong>Noah & The Whale</strong>, a intriguing hybrid in anyone’s books. The raw sound allows the record to breath and the lyrics to excel, such as on the latter mentioned track, <em>‘Staring into the eyes of a lobotomized, version of myself. We’re still in good health, but we’re in the same rut an in our lives and in our wrists, there’s the same shortcuts.’</em> proving one of the standout moments on the record.</p>\n<p><iframe style=\"position: relative; display: block; width: 400px; height: 100px;\" src=\"https://bandcamp.com/EmbeddedPlayer/v=2/track=351186490/size=venti/bgcol=FFFFFF/linkcol=4285BB/\" frameborder=\"0\" width=\"400\" height=\"100\"></iframe></p>\n<p>Having had the pleasuring of witnessing the growth of <strong>Stray Kites</strong> makes <strong><em>Mieux</em></strong> an even more rewarding listen, as they fulfill the potential shown on <em><strong>One Day, Earth Time</strong></em>. The lyrics are maturer, the instrumentation is diverse and vastly improved, and as mentioned earlier in the review, the bond between friends has clearly allowed <strong>Roseboro</strong> and <strong>Detrich</strong> to express themselves openly as <strong>Stray Kites</strong>. Whilst the tone of the album appears melancholic and sombre, every now and then a faint laugh is heard, such as on <em>Dust To Dust To Dust To Dust</em>, and the round of applause heard at the end of title track<em> Mieux</em>, summarising the slightly tongue in cheek approach that Roseboro takes to his lyrics. If there’s one thing <strong><em>Mieux</em></strong> portrays above anything else, is that music is best enjoyed and created amongst friends; and <strong>Stray Kites</strong> clearly understand this.</p>\n<p> </p>\n","slug":"9414-review-stray-kites-mieux","category":"music","date":1312314974000,"wpid":9414,"isSticky":false,"featured_image":{"width":165,"height":165,"src":"2011/08/stray-kites-165x165.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAABgQF/8QAJxAAAQMDAgQHAAAAAAAAAAAAAgEDBAAFERIhBhNRcRQjJDEyQUL/xAAUAQEAAAAAAAAAAAAAAAAAAAAF/8QAGREAAgMBAAAAAAAAAAAAAAAAAQIAAxEh/9oADAMBAAIRAxEAPwA7BtsiRcYkcTaHmAJopFkcruqd09u9JHeHQZdNopw5BVFfSl9bdaktLYK/ZjUR1rKJNWN8aRrdlyHvFPec58y/S9aGrVWXSIsFLnhyf//Z"},"createdAt":1587294150009,"updatedAt":1588403551796,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/08/stray-kites-165x165.jpg","categories":["music","reviews"]}