{"id":"5e9c2fc99b6559241525da42","artists":["5e9b68da7a1236eccfeb1ea9"],"title":"Review: Viva Brother – Famous First Words","content":"<p><a href=\"https://admin.</p><p>crackintheroad.com/uploads/2011/08/brothermain_1173873a.jpg\"><img class=\"alignleft size-homepage wp-image-9474\" title=\"Viva Brother\" src=\"https://api.crackintheroad.com/wp-content/uploads/2011/08/brothermain_1173873a-660x435.jpg\" alt=\"\" width=\"660\" height=\"435\" /></a>Earlier this year I found myself kicking back in a rather quirky backstage bar at one of the summers many festivals, when a bunch of sheep-skin clad, bowl cut sporting lads arrogantly strolled into the otherwise peaceful room. Walking like they’d just come back from a night out with Boy George and Alan Carr, unashamedly aiming to catch the eyes of the numerous industrious journalists who were hunched over laptop screens. Appearing much like that guy you see down the bus station who once had a walk on part in Eastenders fifteen years ago and views himself as a slightly better looking, less annoying Brad Pitt, these guys clearly had personality issues, either that or they were the hapless descendents of Liam and Noel Gallagher. In fact, the whole scene came across as rather tragicomic, with each of them eventually taking a seat near the bar and gazing out dejectedly from behind their Lennon-style glasses.</p>\n<p>I soon discovered that this group of try hard wannabe’s were Brother, a Slough based band with monstrously self inflated opinions, who weeks before had expressed their dislike of CitR via their Twitter page. After watching lead singer Lee Newell sidle up to the bar with all the attitude of a fourteen year old going clubbing for the first time, my colleagues and myself decided there was only one viable course of action. Grabbing the closest iPhone, and logging onto Twitter, we ‘tweeted’ “@VIVAbrother Liam Gallagher would never pay for a pint”. Cue the three twitchy band members who were seated on the couch across from us, pulling out their phones and exchanging slightly concerned glances. Classic.</p>\n<p>After reportedly signing a six figure contract with a major label last year, Brother have rapidly gone from ‘NME Wonderkids’ to this years punching bag. From being forced to change their name from Brother to Viva Brother by a relatively obscure Australian band of the same name, to failing to break into the top 40 with any of their three singles to date, the year is only going from bad to worse. So with the release of their debut record Famous First Words, will the tables turn and Brother prove all their critics wrong?</p>\n<p>Album opener and recent single New Year’s Day is about as good a start as Fernando Torres had to his Chelsea career, all speculation and no final product. The lyrics go from repetitively mundane to … well… even more repetitively mundane, with Lee Newell pronouncing ‘I’m feeling closer to hell, yeah it’s burning like a big space rocket’. Profound. The Oasis style rumble of Still Here is a slight improvement, yet that’s not saying much, as it passes by rather uneventfully. I recommend ditching the Famous from the title, and just going with First Words, as it has the same lyrical quality to that strung together by a young child, except without the charming innocence experienced with babies. For a band who are so purposefully outspoken, they say little of any meaning or worth.</p>\n<p>Electric Daydream is laughable in both it’s lyrical content and vocal delivery, sounding like a parody of a shambolic Oasis cover’s band, drifting by so aimlessly that any scent of sincerity is well and truly extinguished. Famous First Words doesn’t make for pleasant listening; even when they try their hand at a ‘love song’ such as on Time Machine (ironically they appear to be stuck in 1994), it’s searingly grating and unattractively forced. The appalling Darling Buds Of May is so utterly unbearable that I couldn’t out last the full three minutes, therefore skipped to Otherside, only to find what appeared to be a carbon copy of the previous track, and the track before that. It’s disappointing because I want to like these guys; they’re undeniably hardworking, and have a sterling sense of self belief, however this doesn’t make up for a lack of songwriting ability.</p>\n<p>I can just picture a couple of suit wearing guys lounging about in a major label headquarters in central London, brainstorming ideas for ‘the next big thing’, stereotyping Oasis fans as pint swilling, polo shirt wearing, lairy lads with a fancy for fighting. ‘Re-inventing Britpop upon exactly the same themes and concept as previously, is surely an ingenious idea, no?’ It’s verging upon glaringly offensive. It’s for this reason that I pity Viva Brother, who are either a puppet band with no control over their own musical output, or are genuinely unbelievably naive. Which ever way it is, with music like this, I can’t imagine the Viva will be sticking around for very long.</p>\n","slug":"9466-review-viva-brother-famous-first-words","category":"music","date":1312237927000,"wpid":9466,"isSticky":false,"featured_image":{"width":165,"height":165,"src":"2011/08/brothermain_1173873a-165x165.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAABgMI/8QAIxAAAgEDBAEFAAAAAAAAAAAAAQIDBBEhAAUGEiIHEyMxQf/EABUBAQEAAAAAAAAAAAAAAAAAAAME/8QAGhEAAgIDAAAAAAAAAAAAAAAAAQIAERMhIv/aAAwDAQACEQMRAD8AZ7Zwii5ZFtm41VRVpWTQRVjyCANETbqVa5N+w/ARbOqNwvYKImkblcUbQfEUf2+y9cWOfvGivHNyrovQ0NFW1KNHD4FZWBW0q2tnGs+1JL1Erv5MzkknJJvoMSHkjQl6Kzk0an//2Q=="},"createdAt":1587294153756,"updatedAt":1588403551876,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/08/brothermain_1173873a-165x165.jpg","categories":["music","reviews"]}