{"id":"5e9c2fc99b6559241525da3f","title":"Day 1&2 – Get out of Norway","content":"<p>This will be somewhat of an indulgent post, however I felt like CITR would be an ideal forum to provide brief recounts of an adventure a few friends and I are currently on.</p><p> Beginning in Norway we are driving a Reliant Robin (not too dissimilar from the one posted above) down through the Baltic states to eventually reach Ukraine and their premier dance festival, Kazantip. Entitled the Black Sea Run, the journey involves several other teams who have cars ranging from a Pink Trabant (google it) to a leopard print limousine. Below are a few highlights of a trip so far, however the side effects of a plethora of overpriced drinks last night may make it sound like a bit of a ramble.</p>\n<p>Beginning in Norway, we traveled away from the airport a few hundred KM south of Oslo in the direction of Stockholm. As I’m sure many of you reading this will know, Norway is a fantastically beautiful place. With stretches of tarmac blazoning into the horizon we drove an epic 600KM in our bid to distance ourselves from the extortionate prices that Norway presented us with – 10 quid for a regular McDonalds and 6 quid for a Beer may give you a bit of an indication. However not being ones for materialism, we stopped off just south of Norway at a Fjord and swam in the refreshing waters of a small harbour. This was not before we spent an hour trying to find our reference point of Drammen, a small town, only to realise we had been circumnavigating said town in a bid to find it.</p>\n<p>Pushing on, we traveled around Norway to head across country and to reach the border with Sweden. Our first sight of Sweden was a ‘Tocks Free’ shopping centre, and after several hours of driving it could not have been more welcome. In a spark of genius we decided to buy the ingredients for a BBQ and 1KG of Sweden’s finest confectionery. Our reasoning was that we were surrounded by phenomenal countryside – there had to be a place to set up camp and go all rural. The rest of this journey felt like a blur after passing one campsite that (surprisingly) charged ridiculous rates. By about midnight we called it a day and ended up in thew most pleasant motel I will probably ever visit. Over breakfast the next morning we renewed our efforts to make the final 150KM to Stockholm and have our BBQ. After pulling over to a piece of land next to a river we discovered the grave error in our logic as our burgers had turned to mush, and the 1KG brick of cheese Hector insisted on buying was on it’s way to becoming a liquid.</p>\n<p>Realising we only had an hour and a half to get to the ferry we once again plowed on and made it with just enough time to spare. Upon boarding the ‘Baltic Queen’ we met up with the other teams, which included a couple of Americans and some Swedes, and spent the rest of the evening drinking solidly (if you’re reading this Peter, I know you’d be proud). An eventful night was had on the Baltic Queen, however I’m honour bound by ‘Tour Rules’ not to go into any more detail. Essentially you’re going to have to wait until the photos inevitably make it on to Facebook.</p>\n<p>Today we’re planning on driving down to Riga, so I must leave my ramblings here. If you’ve gotten this far – well done!</p>\n","slug":"9478-day-12-get-out-of-norway","category":"life","date":1312276229000,"wpid":9478,"isSticky":false,"featured_image":{"width":165,"height":165,"src":"2011/08/1974.reliant.robin_.arp_-165x165.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFwAAAwEAAAAAAAAAAAAAAAAAAwQFBv/EACUQAAICAAUCBwAAAAAAAAAAAAECAwQABRESIQYUFUFRYXGRwf/EABUBAQEAAAAAAAAAAAAAAAAAAAME/8QAHBEBAAEEAwAAAAAAAAAAAAAAAQIAAwQRBROx/9oADAMBAAIRAxEAPwBSXqqLMq3a5fJHTmGgStKNhQeobzI9/vE9XzBgD4nprzp2zn8xm7MMb1wzxozLIu0lQSPjBlp1mALV4STySUHOChy1stj0m6iceUnbN8r/2Q=="},"createdAt":1587294153053,"updatedAt":1588403551848,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2011/08/1974.reliant.robin_.arp_-165x165.jpg","categories":["life","opinion"]}