{"id":"5e9c33f39b6559241525e144","title":"Interview: Revolver","content":"<p>Strolling listlessly through the crowded streets of Dundee on an unusually sunny Tuesday afternoon, a little bit lost for what to do with ourselves, fate graciously decided a direction for us to go in.</p><p> As we crossed the road outside the infamous <strong>Groucho’s</strong> independent record store, three fashionably dressed, instrument carrying guys overtook us in a hurry. Naturally curious as to the rush they were in, and the guitar cases they were carrying, we stopped them and asked where they were heading to, as coincidence would have it, the record store we were about to enter was their intended destination. After a short conversation with them, we discovered they were none other than <strong>French </strong>“chambre de pop” outfit <strong>Revolver</strong>, who achieved phenomenal success in their home country with catchy single <em>Get Around Town</em>. When asked why they were over in the UK, they told us of their plans to play a short acoustic set in <strong>Groucho’s</strong> as well as performing later in the evening at newly opened Dundee hot spot <strong>Dukes Corner</strong>.</p>\n<p>So after the band unpack their two acoustic guitars and upright bass, they quickly get down to business, launching into numbers from last years <em>Music For A While</em>. There is a certain <strong>Bon Iver</strong>-esque quality to the way in which the vocal harmonies in the band swoop and elegantly intertwine. Playing stripped down acoustic versions of radio favourite <em>Get Around Town </em>as well as recent single <em>Balulalow;</em> what really stands out is the fragility which they band are able to so perfectly conjure up.</p>\n<p>So after a quick change of clothes, I headed back down to <strong>Duke’s Corner </strong>along with two other members of the <strong><em>CitR </em></strong>team, to have a short chat with the band. Whilst not coming across by any means as shy, there is a certain modesty and innocence to the band which makes it both enjoyable and effortless to converse with them. <strong>Ambroise </strong>and <strong>Christophe</strong> keep the conversation flowing, and speak excitedly and passionately about their music as well as experiences, however cello player <strong>Jérémie</strong> struggles more with his use of the English language, but still much to his credit, managed to sustain an input.</p>\n<p>When asked about musical influences, <strong>Ambroise </strong>needs no second asking to respond, and immediately launches into a description of his hero; troubled singer/songwriter <strong>Elliott Smith</strong>, putting the power of his songs down to the fact that <strong>Smith</strong> was just “one voice, one guitar”. <strong>Christophe </strong>is quick to agree and backs up the claim of the groups frontman by confirming “his lyrics are very very personal, very strong”. A commodity the band seem to share is their love of talented albeit distressed songwriters, citing <strong>Bob Dylan</strong>, <strong>Mark Linkuous</strong> and <strong>Vic Chesnutt </strong>as huge inspirations upon their style of song writing. The connection between them is described by <strong>Ambroise</strong> as “brilliant”, whilst he also comments on the fact that <strong>Smith</strong>, <strong>Linkuous</strong> and <strong>Chesnutt</strong> all began by recording “really hard music at the beginning” before they assertted themselves as more personal and autobiographical poets. However, <strong>Jérémie’s</strong> story is entirely different, raised in music school, he was largely unaffected by the majority of popular music during his upbringing, and instead took influence from classical composers. <strong>Ambroise </strong>tells me how at the bands first practice, <strong>Christophe </strong>and himself begin by singing <em>Hey Jude</em>, expecting<strong> Jérémie </strong>to accompany them, but to their surprise he didn’t know any of the infamous words, let along who the song was by. They don’t talk of <strong>Jérémie’s </strong>lack of knowledge of popular culture as a burden, but more as a stepping stone for the band to achieve a broader and wider influenced sound from, especially as <strong>Christophe</strong> describes the cello player as “knowing everything about classical [music]”. He then tells us how he was the late comer to the band, with <strong>Ambroise </strong>and <strong>Jérémie </strong>having known each other since they were kids (at which point <strong>Ambroise </strong>interupts to correct him with the exact age of six), yet all three are almost like brothers in their attitudes to each other, finishing each others sentences and playfully quaryling over petty facts.</p>\n<p>Coming to the end of their current UK tour, the guys fondly look back upon their experiences on the other side of the channel, including an acoustic show in Glasgow’s<strong> Love Music</strong> recordstore. Playing stripped down versions of their songs is not unbeknown to the band, as Ambroise tells me they have “played thousands of shows in France… even in gardens, we played in every Parisian garden!”. He then goes on to describe his two rules for testing whether a song he has written is good; whether it works “only one voice and one guitar and when it works in reggae”, at which point I stiffled a laugh, only to be told by <strong>Christophe </strong>that it “it is not a joke, it’s very scientific!”.</p>\n<p><strong>Revolver</strong> then go on to tell us how they began writing and performing songs in a small apartment in Paris, however after a few months they felt the need to expand to larger venues, as well as expanding the sound the band were producing. Ambroise tells us how originally they tried to tour with just the three of them, but “we need percussion, like drums, I had a tambourine at my left feet” and <strong>Christophe</strong> tell us how he was “playing bass drum with my left hand”, so it became far too much for the band to cope with live on stage. At this point they drafted in a drummer to perform both on the recordings and live, and within a week they had laid down several songs in the studio.</p>\n<p>When <strong>Revolver </strong>talk about their success in France, they are quick to compare it to the apparent obscurity they faced when travelling to England, describing the transition back from playing bigger venues in France to smaller ones in the UK as “amazing… like a year and a half ago, and we start everything from the beginning”. Throughout the conversation, <strong>Revolver</strong> really come across as charming, intelligent guys, focused solely upon creating and performing the music that they so very much love.</p>\n<p>Their show in the evening is a startling contrast to the impromptu gig we had seen earlier in the record shop, with Patrice on the drums really adding a new vibrancy and layer to the sound. It is fantastic to see a band being able to maintain the fragility and beauty of the songs on a personal level, as well as being able to convert the songs into being suitable for playing on large stages and to great numbers of people. Throughout the entire set, <strong>Revolver </strong>are in an energetic and playful mood, conducting sing-a-longs with the crowd, as well as high fiving each other during songs, whether you enjoy the music or not, it is brilliant to see three young lads having such a thrilling and inspiring time.</p>\n<p>Having released<em> Music For A While</em> midway through 2009, <strong>Revolver </strong>are currently in the process of writing and recording new material, be sure to check out their myspace on the links below, as well as catching them on any UK tours in the future.</p>\n<p style=\"text-align: center;\"><a href=\"https://www.myspace.com/popdechambre\">Check out their Myspace</a></p>\n<p style=\"text-align: center;\"><a href=\"https://www.revolvermusic.tv/\">Check out their Official Site</a></p>\n<p style=\"text-align: center;\">\n","slug":"956-oui-love-featuring-revolver-curry-coco-and-bella-diem","category":"interviews","date":1275472816000,"wpid":956,"isSticky":false,"featured_image":{"width":3888,"height":2592,"src":"2010/05/img_1322.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAYH/8QAIBABAAEEAQUBAAAAAAAAAAAAAQIAAwQREwUVITJBof/EABUBAQEAAAAAAAAAAAAAAAAAAAID/8QAFxEAAwEAAAAAAAAAAAAAAAAAAAEhEf/aAAwDAQACEQMRAD8Ax6zjdKhdx+4ZWbxQg88LUT2H4r5NI/lTN03dmmwVQ3SlCqlY1mH/2Q=="},"createdAt":1587295219169,"updatedAt":1588403567012,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2010/05/img_1322.jpg","categories":["interviews","music"]}