{"id":"5e9c2fb69b6559241525da19","artists":["5e9b68f27a1236eccfeb2062"],"title":"Review: Flatsound – I Clung To You Hoping We’d Both Drown","content":"<p>After seeing<strong> Bright Eyes</strong> at The Sage last month, I embarked on somewhat of a <strong>Conor Oberst</strong> binge, delving deep into his back catalogue of material, and rediscovering the true beauty of the raw and delightfully unrefined tracks that he fashioned.</p><p> It’s a rare ability to be able to dissect and then portray feelings in such a powerful and admirable way; a talent which<strong> Oberst</strong> certainly has. Round about the same time I began recovering from my <strong>Bright Eyes</strong> induced obsession, I discovered another musician whose music speaks realms for emotional honesty;<strong> Flatsound</strong>, the solo project of lo-fi musician<strong> Mitch Welling</strong>.</p>\n<p>Newest release<em><strong> I Clung To You Hoping We’d Both Drown</strong></em> found it’s way to my laptop through hours of trawling <a href=\"https://flatsound.bandcamp.com/\">bandcamp</a> pages, and almost instantaneously I was devastated to discover that all physical copies of the record were spoken for. Upon first listen, the strikingly honest integrity experienced throughout the album forms a slightly formidable diaphanous layer over the tracks, thus proving difficult to create any personal connection with the songs. However, upon further listens, one begins to realise that it’s not the experiences in the record that are relatable, but the feelings and thoughts that are consequences of such events.</p>\n<p>Opening with a four minute introduction, composed of sampled vocals and repeated piano sections, before a female voice announces the title of the album and the artist, much like <strong>Casiotone On The Painfully Alone’s</strong> career defining record<strong><em> Etiquette</em></strong>. So it’s no surprise that next track Old Lumina continues in an <strong>Ashworth</strong> inspired vein, with <strong>Welling</strong> delving into personal and intense issues from the word go. There’s plenty of angst in the near-spoken word vocals, reflecting that of the lyrical content, such as ‘<em>because all i want to do is play Sega, and think about the people that have hurt me</em>‘ on Old Lumina; playfully teetering on the line between contrived and daringly open.</p>\n<p>The influences aren’t hard to pick out, yet far from limit<em><strong> I Clung To…</strong></em> to merely becoming a tribute album. The <strong>Conor Oberst</strong> inspired <em>We’ll Live</em> is a fantastically written song in it’s own right, and album highlight <em>The Cowardly Lion Doesn’t Write Love Songs</em> sees <strong>Welling</strong> tear his own heart out and lay it bare for all to hear. <em>My Heart Goes Bum Bum Bum</em> is the equivalent of <strong>Oberst’s</strong> <em>Haligh, Haligh, A Lie, Haligh</em>, remaining searingly honest whilst being mercilessly polluted with spiteful angst and love-fueled obsessive hatred. The spoken word interludes that litter the record are at times bizarre but welcome and again recall memories of early <strong>Bright Eyes</strong> in their delivery and beauty.</p>\n<p><iframe style=\"position: relative; display: block; width: 400px; height: 100px;\" src=\"https://bandcamp.com/EmbeddedPlayer/v=2/track=344947014/size=venti/bgcol=FFFFFF/linkcol=4285BB/\" frameborder=\"0\" width=\"400\" height=\"100\"></iframe></p>\n<p>In <strong>Welling’s</strong> own words, he describes the record as:</p>\n<p><em>‘a concept album of sorts. it’s about cats and not feeling well and my mother, it’s a portion of my life. it’s saying i’m sorry and i miss you. it’s being too afraid to directly say i hate you. it’s whatever you want it to be.’</em></p>\n<p>Yet this short summary says so little compared to a full listen of the album in question, as the record grabs hold of the listeners consciousness and formulates splinters in our natural emotional defense barriers. At times it feels like a ‘who’s who’ of the finest male songwriters of the past two decades; <em>Live Up</em> revives the enchanting spirit of <strong>Elliott Smith</strong> whilst the electronically driven <em>Macie Lightfood, I’m Broken</em> comes across as a slightly more subtle <strong>Casiotone For The Painfully Alone.</strong> However whilst the influences are undeniable, the beautifully delicate songwriting and poignant lyricism prevents it from becoming monotonous and conventional.</p>\n<p><em><strong>I Clung To You Hoping We’d Both Drown</strong></em> is a record full of intimate allurement and entirely personal moments of clarity, such as standout track <em>We’re Fighting Again</em>. Burrowing deep into the frayed ends of a relationship, <strong>Welling</strong> almost weeps “<em>it isn’t like you ever said that you were committed, to the thought of me and only me when he hasn’t written you, in seven weeks.</em>“. There’s elements of betrayal, adoration and utter emotional devastation, making for a moving and rewarding listened experience, leaving me wondering how I hadn’t discovered the extraordinarily bewitching music of Flatsound earlier.</p>\n<p>Purchase I Clung To You Hoping We’d Both Drown from <a href=\"https://flatsound.bandcamp.com/\" target=\"_blank\">Flatsound’s bandcamp.</a></p>\n<p><iframe style=\"position: relative; display: block; width: 400px; height: 100px;\" src=\"https://bandcamp.com/EmbeddedPlayer/v=2/track=3009854051/size=venti/bgcol=FFFFFF/linkcol=4285BB/\" frameborder=\"0\" width=\"400\" height=\"100\"></iframe></p>\n","slug":"9560-review-flatsound-i-clung-to-you-hoping-wed-both-drown","category":"music","date":1312760930000,"wpid":9560,"isSticky":false,"featured_image":null,"createdAt":1587294134041,"updatedAt":1588441788854,"author":"5e9b68b27a1236eccfeb1d27","old_image":"generated/3487fe447b7c35050c12bd4a6c2858bf3575b6a4.jpg","categories":["music","reviews"]}