{"id":"5e9c2fa99b6559241525da04","artists":["5e9b69377a1236eccfeb24ac"],"title":"Things We Lost in the Fire: Sony DADC Warehouse burns","content":"<p>A three-storey warehouse in Enfield was set alight last night, in the riots that have spread over London since Friday evening.</p><p> The building was owned by Sony DADC, and contained stock belonging to the PIAS Group, who sub-contract their distribution to Sony DADC. The group is the UK’s largest independent distribution company, working with labels like Rough Trade, Beggar’s Banquet, Domino, and <a title=\"PIAS\" href=\"https://company.pias.com/en/distribution/physical/labels\" target=\"_blank\">many more</a>.</p>\n<p>The amount of stock affected is not yet fully known, although thankfully there have been no reports of any injuries or fatalities as yet. Sean Adams at drownedinsound has noted that <a title=\"drownedinsound\" href=\"https://drownedinsound.com/news/4143302-indie-label-distributor-pias-release-short-statement-regarding-fire-at-sonydadc-warehouse\" target=\"_blank\">“stock from the DiS label was destroyed”</a>, while Rob Da Bank tweeted “So looks like all our Sunday Best stock went up last night in the PIAS blaze”. PIAS has released this statement via <a title=\"Pias statement\" href=\"https://www.tweetdeck.com/twitter/piasuk/~2pFkA\" target=\"_blank\">TweetDeck</a>:</p>\n<p>“There was a fire last night at the SonyDADC warehouse which services the physical distribution for PIAS in the UK and Ireland. PIAS is working closely with SonyDADC who are implementing their emergency plans. PIAS’s UK offices in London and all other areas of our business are unaffected. More information will be communicated shortly to all our labels and partners.”</p>\n<p>As a British citizen, I’m ashamed and scared, as stories like <a title=\"blackberry hack\" href=\"https://thenextweb.com/2011/08/09/rims-blackberry-blog-hacked-after-it-cooperates-with-police-over-london-riots/\" target=\"_blank\">this one</a> begin appearing. On a personal note, I’m reeling from the thought that apparently wanton destruction is occurring not an hour from my doorstep, and outside the homes of my friends. And as a music lover, it’s immensely saddening to know that the aftermath of the fire will have a profound effect on the labels involved, and the bands on those labels, and the people in those bands. Obviously, record sales for the labels involved with PIAS will help bolster their recovery – buying that album you downloaded or thought about downloading has never been more important. To a similar end, The 405 writer <a title=\"fion chadd\" href=\"https://twitter.com/#!/fionchadd\" target=\"_blank\">Fion Chadd</a> has set up a fundraising and benefit initiative, which can be found <a title=\"pias benefit\" href=\"https://cognitivedissonancerecords.com/labellove/\" target=\"_blank\">here</a>.</p>\n<p>With PIAS’ website down due to an understandably huge volume of traffic, here’s a full list of the record labels the group is involved with:</p>\n<p>[PIAS] Recordings, [PIAS] Recordings Belgium, 4AD, A Camp, Absynthe Minded, Accidental, AEI Music, Air Recordings, ALC Music, Alsation, Ambush Reality, Ancient & Modern, Angular Recording Corporation, Arcady Records, Ark Recordings, Asthmatic Kitty Records, Atlantic Jaxx Recordings, Bad Magic, Balling The Jack, Banquet Records, Battered Ornaments Records, Beggars Banquet, Best Before, Big Brother, Big Dada, Bird Records, Blackmaps, Bloody Chamber, Blowout Music, Blue Chopsticks, Border Community, Borstal Beats, Boysnoize Records, BPM, Brainfeeder, Brassland, Bright Star Recordings, Brille, Broken Sound Music, Bronzerat, Brothers and Sisters, Brownswood Recordings, Buzzin’ Fly, Cache Cache, Cadenza Records, Celluloid Records, Chalkmark / IE, Chemikal Underground Records, Cocoon, Control Tower, Counter Records, Dance To The Radio, Dead Oceans, Deceptive, Defenders, Ent UK, DESOLAT, Dessous, Different, Dirtee Stank, Divine Comedy Records, Domino Records, Double Six Records, Drag City, Dreambrother, Drive Thru Records, Drowned In Sound, Dummy Records, Duophonic, Eat Sleep Records, Fabric Worldwide, Fake Diamonds, FantasyTrashcan, Fatcat Records, Fence, Feraltone, Finders Keepers Records, Flock Music, Flying Circus, Freerange Records, Friends Vs Records, Full Pupp, Full Time Hobby, Gang Of Four Recordings, Geographic, Ghost Ship, Glaze Recordings, Groenland Records, G-Unit, Hardly Art, Hassle Records, Helpless, Hem Hem Records, HFN Music, Immune, Independiente, Infant, Infectious, Jagjaguwar, Kartel, Kitchenware, Kitsune, KMS Records / Fabric, Laughing Stock, Lex Records, Lipservice, Little Sister Recordings, LO-MAX Records, Loose Music, Lovepump United, Low Life Records, Lucky Number Music, Lucky Seven Records, Mantra, Matador, Memphis Industries, Merok, Metric Music International, Metroline Limited, Model Citizen, Moikai, Motion Audio, MyMajorLabel Ltd, Nation, Ninja Tune, No Quarter, NovaMute, Nusic Sounds, One Four Seven Records Ltd, One Little Indian, Organs, Outcaste, OVNI, P.I.L., Peartree, Records, PeMa, People In The Sky, People Tree, Pirates Blend Records Inc, Planet Function, Play It Again Sam, Playlouder, Poker Flat, Polyvinyl, Records, Poseidon Records, Post Present, Pschent, Raw Canvas, Red Cord Records, REK’D, Rekids, Rekords Rekords, Renaissance, Reveal Records, Riverman Records, Rock Action Records, Roots Records, Rough Trade Records, Rubyworks, Sea Note, Search and Destroy, Secretly Canadian, Setanta, Shape, SideOneDummy Records, Silva Screen, Slam Dunk Records, Smekkleysa, Soma, Sonic Cathedral, Soul Jazz Records, South Paw, Southern Fried Records, Stereo Bang Media, Stolen Recordings, Stranger Records, Streamline, Sub Pop, Suicide Squeeze, Sunday Best, Thrill Jockey, Tirk, Too Pure, Torque Records, Touch & Go Records, Transmission Recordings, Tri Tone, Trouble Records, True Panther, Try Harder, Turnstile, Twisted Nerve Recordings, Universal Sound, Victory Records, Wagram, Wall of Sound, Warp, Watergate, We Love You, Wiiija, Willkommen Records Ltd, Wonderfulsound, XL, Xtra Mile Recordings, Yaala Yaala, Young Turks</p>\n","slug":"9633-things-we-lost-in-the-fire-pias-warehouse-burns","category":"life","date":1312899211000,"wpid":9633,"isSticky":false,"featured_image":{"width":165,"height":165,"src":"2011/08/piasfire-e1313104168845-165x165.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAABgUH/8QAJBAAAgEDBAAHAAAAAAAAAAAAAQIDAAQRBQYSIQcUMkFDgdH/xAAUAQEAAAAAAAAAAAAAAAAAAAAF/8QAHBEAAgICAwAAAAAAAAAAAAAAAQIAAwQREjFh/9oADAMBAAIRAxEAPwDMNP21tzVZ5TDeaj5lxlbNYI41jJOFBcseskA4FQ22pMpKsylh0eMiY+u6a+HMEV1exS3USTSvy5PIoYt37k09i0uwMSZsbX0j4V/KDfKelygOx7Egi2DkR3P/2Q=="},"createdAt":1587294121160,"updatedAt":1588403551370,"author":"5e9b68b27a1236eccfeb1d3c","old_image":"2011/08/piasfire-e1313104168845-165x165.jpg","categories":["life"]}