{"id":"5e9c2fa99b6559241525da07","artists":["5e9b695d7a1236eccfeb26fe"],"title":"Interview: Wheatus","content":"<p>There are very few songs which peaked in the charts around a decade ago that are still a big favourite in nightclubs and on the karaoke stages across the UK.</p><p> Do you think in 2021 people will be shouting ‘tuuuunnee’ when Tinchy Stryder’s ‘<em>Number 1</em>‘ gets played on a night out? No, because (hopefully) in that time he won’t be remembered and popular music will have moved on. <strong>Wheatus, </strong>on the other hand, are a band whose music skims above the peaks and troughs of music fads. Most notable was their noughties hit ‘Teenage Dirtbag’ but they are far from being a one hit wonder (remember Nizlopi or Eamon anyone?)</p>\n<p>Since ’95 Wheatus have been writing, recording and performing music across the pond and are finally returning to the UK. The month long tour starts in Derby on September 14<sup>th</sup>. They will be playing tracks from their recent releases <em>The Jupiter EP </em>and <em>The Lightening EP</em>. Other great songs on these albums, if you’re lucky enough to get tickets to their gigs,  include <em>If You Need a Friend</em> and <em>Freedom Song</em>.</p>\n<p><strong>Crack in the Road</strong> will try to meet up with the band when they are in the UK and have a proper chat but to appease you for now, we managed to get a few questions answered by Brendan Brown himself.</p>\n<p><strong>CitR: I read some of the information on yourself on the site Brendan; you say that at the age of 12 you dressed up as Angus from AC/DC for Halloween; would you ever consider repeating this on stage at one of your gigs?</p>\n<p>Only if it were a Halloween gig.</p>\n<p><strong>CitR: You are playing a lot of gigs in Scotland in this current tour, what has convinced you to go further afield than just Glasgow or Edinburgh as many other bands, especially from the states, tend to do?</strong></p>\n<p>I’m guessing you know there’s a Scottish flag on my guitar? It’s been there for 10 years now. I have always known that Scotland is the legendary epicenter of all that rocks furiously. I found that out on our 1st proper UK Tour. Every Scottish show beat the others by miles…back then I thought, “I wonder what happens when you plan a proper tour of Scotland?” At long last, we’ll find out.</p>\n<p><strong>CitR: Do you listen to music from the UK often and if so, who are your favourite bands/artists that are around at the moment?</strong></p>\n<p>Yes…I’ve been listening to a lot of Richard Ashcroft’s solo records, Stereophonics, Hundred Reasons & Elbow as well…I Love The Streets….And of course, AC/DC, while being an Australian band technically, in my mind Bon made them THEE Scottish Band of record</p>\n<p><strong>CitR: I have heard rumours that you refused to lip-sync for recording on Top of the Pops, can you confirm or deny this and what is your stance on bands or artists miming during their performances?</strong></p>\n<p>I don’t care how other bands do their thing…that’s none of my business…but I refused because I feel like if we do that then we’re cheating our audience. We’ve worked hard to be good at what we do & I think we have a right to showcase it if we’re lucky enough to be invited onto TV.</p>\n<p><strong>CitR: What is your favourite song to play live, and is it the same with the rest of the band or does it differ between you all?</strong></p>\n<p><span style=\"font-family: Times New Roman, serif;\"><span style=\"font-size: small;\">We all have our favorites….Matthew likes Fair Weather Friend, Kevin Likes The Deck…Ken likes Randall & The girls like Whole Amoeba. I’m currently torn between 2 songs, The Story Of The Eggs & Freedom Song.</span></span></p>\n<p><strong>CitR: What is your favourite cover, if you have one, of any of your songs?</strong></p>\n<p>WE HAVE A NEW COVER IN THE SET!  But I’m not allowed to say what it is! 😉 It’s my new fav cover.</p>\n<p><strong>CitR: I can’t go through a whole list of questions without mentioning ‘Teenage Dirtbag’, especially as it reemerged in the UK chart earlier on this year; were you aware of this and if so, what was your reaction to it?</strong></p>\n<p>I was aware…absolutely astonished & chuffed. It’s sort of felt fake at first…but then the BBC was on the phone and it was all very real. So cool…I called everyone I know & told them… As well, I just found out it’s the #4 highest selling rock song of the 21st century. If you’d have told me that in the Autumn of 1986, whilst I was trick-or-treating in an Angus Young costume…I’d have been, well, I may have died right there.</p>\n<p><strong>CitR: Your highest chart position in the UK, #2, was only beaten by a band called Atomic Kitten, have you listened to the song (called Whole Again) that managed to out sell your record or have you avoided listening to it? (On a different note, I think this may have been the last time in the UK chart with the majority of the songs on it were worth listening to, it included Limp Bizkit, Papa Roach and Fun Lovin’ Criminals as well as yourself all in the top 5)</strong><br />\n<span style=\"font-family: Times New Roman, serif;\"><span style=\"font-size: small;\">I love that song, Whole Again….It’s a soulful track…really beautiful. I never avoided it…it’s a great song. Do you know if it’s ever re-entered the top 40 as well?</span></span></p>\n<p><strong>CitR: When you’re reading this Brendan, I don’t believe it has!</strong></p>\n<p><a href=\"https://www.wheatus.com/\">Wheatus’ official site</a></p>\n","slug":"9635-interview-wheatus","category":"interviews","date":1312892077000,"wpid":9635,"isSticky":false,"featured_image":{"width":165,"height":165,"src":"2011/08/wheatus-165x165.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAABQQH/8QAIhAAAgEDBAIDAAAAAAAAAAAAAQIDAAQRBQYhURITMUFx/8QAFQEBAQAAAAAAAAAAAAAAAAAAAwX/xAAcEQACAgIDAAAAAAAAAAAAAAACAwERAAQFcdH/2gAMAwEAAhEDEQA/AJbPc86xaedUmF9ayy+qDyfLKqvyrt8NnBHYyM0jdWdxNdTSwFhC7lkHsAwpPH31WSKxO3NJUklQly4HTGXk/tGNwxxQMbIHI5b1ePF6obdX73n/2Q=="},"createdAt":1587294121947,"updatedAt":1588403551395,"author":"5e9b68b27a1236eccfeb1d07","old_image":"2011/08/wheatus-165x165.jpg","categories":["interviews","music"]}