{"id":"5e9c2f9b9b6559241525d9ec","artists":["5e9b690a7a1236eccfeb219c","5e9b690a7a1236eccfeb21e2"],"title":"Review: Jay Z & Kanye West – Watch The Throne","content":"<p>With combined worldwide album sales exceeding 75 million, several dozen entries in the Billboard Top 100, and the ability to sell out shows in every country across the globe; there’s no doubting the success of <strong>Jay-Z</strong> and <strong>Kanye West</strong>.</p><p> Having both well and truly cemented their names amongst the hip-hop greats, the announcement of a collaboration record was met with sheer adulation. Whilst<strong> Jay-Z’s</strong> most recent attempt <strong><em>The Blueprint III</em></strong> was somewhat underwhelming and out of keeping with his discerning high standards, the same cannot be said of <strong>Kanye West</strong>, whose <strong><em>My Beautiful Dark Twisted Fantasy</em></strong> proved to have all the makings of a career defining record. So with<strong><em> Watch The Throne</em></strong>, not only is it intriguing to witness two artists potentially at opposite ends of their creative careers, but also to experience the competitive friction hopefully stimulated by the clash of two confident, talented musicians.</p>\n<p>Having previously worked together on each others tracks, including <strong><em>College Dropout</em></strong> highlight <em>Never Let Me Go</em> and a fantastic remix of <em>Diamonds From Sierra Leone</em> that far surpassed the original version, expectations were rightly sky high. From merely glancing down the tracklisting, the first point of note that jumps out is the noticeable lack of guest appearances. Aside from a couple of sleazy R’nB moments from<strong> Frank Ocean</strong>, an<strong> Otis Redding</strong> sample, a slot from <strong>Mr Hudson</strong> and a stereotypically soulful chorus from <strong>Beyonce</strong>;<em><strong> Watch Your Throne</strong></em> is almost entirely focused on the Rockefella rappers. A courageous decision, especially when considered alongside the knowledge that a phenomenal total of thirty other artists featured on the respective rappers most recent LP’s. Not only does this ensure that there is no chance of secondary acts stealing the show (see<strong> Nicki Minaj</strong> on <em>Monster</em> and <strong>J.Cole</strong> on <em>A Star Is Born</em>), but also that the focal point is most definitely on the <strong>West</strong> and <strong>Carter</strong>.</p>\n<p>Much like on <strong>My Beautiful Dark Twisted Fantasy</strong>, the premier track on this record provides a platform for one of R’n’B’s finest young talents, with <strong>OFWGKTA’s</strong> <strong>Frank Ocean</strong> stepping up to the plate. The beats are far more pronounced and dare I say it heavier, than on previous output from either performer. The sassy bass section on <em>No Church In The Wild</em> being a fantastic example of this, providing a stark contrast to <strong>Ocean’s</strong> slick vocals. Having years of experience under their belts has clearly aided the production on <strong><em>Watch The Throne</em></strong>, which is smooth and exemplary throughout; whilst remaining sonically varied.</p>\n<p>There are few rappers who can rival the tawdry delivery of <strong>West</strong> or the renowned drawl of <strong>Jay-Z</strong>, however when <strong>West</strong> tries his hand at singing the results are far less consistent, as found on the<strong> Beyonce</strong> featuring<em> Lift Off</em>, where her vocal sections are by far the highlight of the track. However on the latter half of <em>Niggas In Paris</em>, <strong>Kanye’s</strong> singing is vastly improved and fitting to the theme of the track, showing there are benefits of having such a malleable style. Being two of the voices of our generation both in recognition and lyrical content, finding a track like<em> Murder To Excellence</em> on the record was a given. Dark and knowingly enlightened, <strong>Kanye</strong> sits in the driving seat for the majority of the song;<em> ‘Is it genocide? Cause I can still hear his mama cry, know the family traumatized, shots left holes in his face about pirranha-sized’</em>, harrowing, albeit slightly contrived. <strong><em>Watch The Throne</em></strong> has <strong>Dilla</strong> vibes littered throughout the record, from the spliced samples of <em>Otis</em> to the frequent instrumental breakdowns, it’s clear that <strong>West</strong> and <strong>Jay-Z</strong> are attempting to raise the bar through creating prolific and munificent beats. In an age when almost anyone can produce music, the pressure to push proverbial boundaries is building upon those at the height of their game, and<strong><em> Watch The Throne</em></strong> certainly doesn’t disappoint in that sense.</p>\n<p>First single proper <em>Otis</em> is based around a rather repetitive <strong>Redding</strong> sample which nearly proves overly dominating and the flow threatens to become lost beneath it all. Where <em><strong>Watch The Throne</strong></em> slips up is on the lyricism from <strong>West</strong> and <strong>Jay-Z</strong>, which at times is lethargic and uninspired; far befitting the quality of the tracks. For two artists who are so boisterously outspoken both on their music and in real life, they say little of any worth and certainly nothing haughtily profound. Album highlight <em>New Day</em> is one of the exceptions in so far as the lyrical content, yet this is no surprise as the tempo is slower and the beat less pronounced, allowing the duo to breath life into the track.</p>\n<p><object width=\"100%\" height=\"81\" classid=\"clsid:d27cdb6e-ae6d-11cf-96b8-444553540000\" codebase=\"https://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=6,0,40,0\"><param name=\"allowscriptaccess\" value=\"always\" /><param name=\"src\" value=\"https://player.soundcloud.com/player.swf?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F19456444\" /><embed width=\"100%\" height=\"81\" type=\"application/x-shockwave-flash\" src=\"https://player.soundcloud.com/player.swf?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F19456444\" allowscriptaccess=\"always\" /></object> <span><a href=\"https://soundcloud.com/watchthethrone/otis-feat-otis-redding\">Otis feat. Otis Redding</a> by <a href=\"https://soundcloud.com/watchthethrone\">watchthethrone</a></span></p>\n<p>Having collaborated in the past to produce such iconic hip hop tracks, it’s disappointing to find the two in such a seemingly discouraged mood. The competitive feel to the <em>Diamonds From Sierra Leone Remix</em> was undoubtedly what provided the invigorating spark that allowed the track to excel, however this spirit is truly lacking on <em><strong>Watch The Throne</strong></em>. There’s an underlying feeling that perhaps the two rested on their laurels when it comes to the delivery and content of the lyrics, and instead concluded that the beats and production were imperative to the success of the record. As an entirety, it’s far from a disaster, yet it fails to soar to the dizzy heights previously experienced by the duo and that so justifiably fortified<strong> Kanye West</strong> and <strong>Jay-Z</strong> amongst the hip hop greats.</p>\n","slug":"9697-review-jay-z-kanye-west-watch-the-throne","category":"album-reviews","date":1313008331000,"wpid":9697,"isSticky":false,"featured_image":null,"createdAt":1587294107307,"updatedAt":1588441788720,"author":"5e9b68b27a1236eccfeb1d27","old_image":"generated/4912d27d6b01dd790313d8ef76586be6b100550f.jpg","categories":["album-reviews","music"]}