{"id":"5e9c34039b6559241525e160","title":"Interview: Villagers","content":"<p style=\"text-align: left\">\n<p style=\"text-align: center\">\n<p style=\"text-align: center\">\n<p style=\"text-align: left\">\n<p style=\"text-align: center\">\n<p style=\"text-align: left\">First and foremost I should tell you that <strong>Villagers </strong>is just as much a concept as it is a band.</p><p> Created by, and around, <strong>Conor J. O’Brien</strong>, <strong>Villagers</strong> was meant to act as a platform for his musical endeavours after the break up of <strong>The Immediate</strong>. While this much is still true, <strong>Villagers</strong> has become a band powered by a collective of fantastically integrated sounds, rather than a backing band simply supporting a singer/songwriter. Having released their debut album ‘<strong>Becoming a Jackal</strong>‘ on the 24th May,<strong> Villagers </strong>have created a sound that one would immediately associate with Folk. However while there are definite elements of folk, their sound also incorporates sounds ranging from the Classical to the Blues. This, coupled with <strong>O’Brien</strong>‘s mysteriously dark and cryptic lyrics, has led to comparisons to <strong>Bright Eyes, Sparklehorse, </strong>and <strong>Leonard Cohen. </strong>Therefore <strong>Crack In The Road</strong> were delighted when <strong>Conor</strong> took the time out to answer some of our questions.</p>\n<p style=\"text-align: left\">\n<p style=\"text-align: center\"><em>CITR: </em>If you had to cite one band/artist as a major influence upon you, who would it be?</p>\n<p style=\"text-align: center\"><strong>Faith No More. I have particularly vivid memories of listening to Faith No More every morning on the bus to school and sucking it all in like a sponge.</strong></p>\n<p style=\"text-align: center\"><em>CITR:</em> What has been your favourite gigging experience to date?</p>\n<p style=\"text-align: center\"><strong>We played a show in Kilkenny a few days ago which was a completely blissful experience. We were all in shock afterwards – everyone in the room was in a state of shock.</strong></p>\n<p style=\"text-align: center\"><em>CITR:</em> You used to play in a band called ‘The Immediate’, which were cited by many as the best independent to come out of Ireland for many years. What caused the break up of your first band? And more importantly, what inspired you to create your new pseudonym ‘Villagers’?</p>\n<p style=\"text-align: center\"><strong>The Immediate came to an end very naturally. Two of the guys in the band just didn’t want to do it anymore because they were becoming more interested in other aspects of their lives. We still love each other. After we broke up, I started writing songs on my own. I had no idea if I would form a band or tour or do any of that kind of stuff. So I decided to give it an open, anonymous name; something that simply describes a group of people, whether it be the people in the band, or the people in the songs, or even the people who will hear the band and the songs.</strong></p>\n<p style=\"text-align: center\"><em>CITR: </em>Your sound has been compared to that of Conor Oberst and Paul Simon, both of which are lyrically focused artists. How much do you consider your lyrics as a centerpiece of your work?</p>\n<p style=\"text-align: center\"><strong>I don’t know really – it’s always different for me. Sometimes the lyrics will come first, sometimes the music. Often they arrive together. I see them as the part of a whole; I don’t find it helpful to separate them at all.</strong></p>\n<p style=\"text-align: center\"><em>CITR: </em>Do you believe growing up in Ireland has affected your style of music at all?</p>\n<p style=\"text-align: center\"><strong>Yes I do believe this. I have no idea how though. It’s very complicated I think.</strong></p>\n<p style=\"text-align: center\"><em>CITR:</em> After you had released your debut EP, you were reported as saying that ‘I don’t want it to be a finished project: it needs to be constantly changing.’ Can we expect your debut album, due out May 24<sup>th</sup>, to be a result of this constant evolution?</p>\n<p style=\"text-align: center\"><strong>Yeah I sort of see the album as a document of how the songs sound at this particular time. They’ve slightly evolved since we’ve started playing them live and they had previously evolved since they were committed to tape. Actually, “committed” is a good way of putting it.</strong></p>\n<p style=\"text-align: center\"><em>CITR: </em>You have been described as a folk artist. Would you agree? If not, how would you attempt to describe your sound?</p>\n<p style=\"text-align: center\"><strong>I’m not sure really, ‘folk’ is a very wide-ranging term. Most of the time I just feel like I’m singing the blues.</strong></p>\n<p style=\"text-align: center\"><em>CITR: </em>Having already supported such famous artists as Neil Young and Tracy Chapman, what do you consider the next stage of progression for ‘Villagers’?</p>\n<p style=\"text-align: center\"><strong>I have a little obsessional dream of touring with a female choir; just me and the choir and my little guitar.</strong></p>\n<p style=\"text-align: center\"><em>CITR: </em>PC or Mac?</p>\n<p style=\"text-align: center\"><strong>Once, my mother had to separate my dog from another dog using a frying pan, after we found them stuck together, asshole to asshole.</strong></p>\n<p style=\"text-align: center\"><em>CITR: </em>If you could be any animal, which animal would you be?</p>\n<p style=\"text-align: center\"><strong>Anything but a jackal. One can but dream…</strong></p>\n<p style=\"text-align: center\"><a href=\"https://www.myspace.com/villagers\" target=\"_blank\">Check out Villagers Myspace!</a></p>\n<p><iframe src=\"https://www.facebook.com/plugins/likebox.php?id=114090381951328&width=292&connections=10&stream=false&header=false&height=255\" scrolling=\"no\" frameborder=\"0\" style=\"border:none; overflow:hidden; width:292px; height:255px;\" allowTransparency=\"true\"></iframe></p>\n","slug":"972-5-minutes-with-villagers","category":"interviews","date":1275032134000,"wpid":972,"isSticky":false,"featured_image":{"width":470,"height":470,"src":"2010/05/villagers.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFwAAAwEAAAAAAAAAAAAAAAAAAgQFBv/EACUQAAEDAwMDBQAAAAAAAAAAAAECAwQABSEGERIHEyJBQlJx0f/EABQBAQAAAAAAAAAAAAAAAAAAAAT/xAAYEQADAQEAAAAAAAAAAAAAAAAAAQISMf/aAAwDAQACEQMRAD8Axeq9LQNOaMgSoN3Lc+Sw064kEN8eYWFNqTvyJCkjJ225em1KQen93chR3HY7vcU2lSvMHJGcg5qpJJV02WVZPbVk/Z/TQ2OXJFkt4Eh4AR2/efiKNhIRdvp//9k="},"createdAt":1587295235446,"updatedAt":1588403567260,"author":"5e9b68b27a1236eccfeb1d0e","old_image":"2010/05/villagers.jpg","categories":["interviews","music"]}