{"id":"5e9c2f9e9b6559241525d9f0","title":"Live Review: Spring Offensive (The Ashmolean, Oxford, 05/08/11)","content":"<p>As a kid, live music was kind of forbidden me.</p><p> In spite of desperate pleas in the years leading up to it, my first live show was at the age of 15, watching <strong>Counting Crows</strong> from the plush seated balcony of Bournemouth BIC. It was hardly a night of adrenaline fuelled rock’n’roll excess. About a year later I sneaked down to my local venue, the Railway Inn in Winchester. I think I was actually shaking when I walked through the door to the back room. It was a case of sensory overload. The noise. The sweat. A hundred kids rammed into a dingy, black-walled box. I came away from that show soaked through, with ringing ears and an absolute certainty that THIS was where my life was going, by whatever token.</p>\n<p>Eight years later and we’ve mostly all grown up and found ourselves in jobs or higher education, rather than perspiring and goosepimpled in a cramped back room every week. On first impression, Oxford’s Ashmolean Museum isn’t entirely dissimilar in ambience to the grandiose, but rather sedate setting in which I had my first experience of live music, all Ionic columns and scenic terraces. Even when the doors open and let us down into the smaller basement vault, the historical projections and stiff-collared bartenders are a far cry from the bewitchingly tattered venues in which I spent my formative gig-going years.</p>\n<p><strong>Spring Offensive</strong> take the stage one by one to an eerie high-pitched loop, which, when instruments reach hands, segues perfectly into <em>I Found Myself Smiling</em>, sounding even more forceful and threatening then it did on last year’s <strong><em>Pull Us Apart</em></strong>. The title track of newest EP <strong><em>A Stutter and a Start</em></strong> lends a more immediate energy to the proceedings, the precise, angular jerk of its interlocking guitar lines providing the perfect foil for frontman Lucas Whitworth’s articulate regret. Follow up <em>The Well </em>perfectly showcases the band’s rhythmic complexities, economical use of vocal harmony (four of the band sing, but they do so sparingly and pitch-perfect), and mastery of dynamics, building from a sorrowful hush to a skyscraping climax without falling into wornout post-rock cliché. ever. By the time the five-piece reach the squalling coda of a triumphant <em>Every Coin</em>, I realise that I’ve been grinning like an idiot for the past half hour, and it’s pretty clear that no matter how much time elapses, no matter how many settings change, there isn’t much that comes close to that. The set’s unreleased songs, <em>Bail Out and 52 Miles</em> in particular, have left me champing at the bit for more recorded output from this band.</p>\n<p>Spring Offensive’s <em><strong>A Stutter and a Start</strong></em> is available from their <a href=\"https://www.springoffensive.co.uk/releases.html\">website</a>. Here’s the video to its title track.</p>\n<p><iframe width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/uzByxFhtR4k?feature=oembed\" frameborder=\"0\" allowfullscreen></iframe></p>\n","slug":"9750-live-review-spring-offensive-the-ashmolean-oxford-050811-2","category":"music","date":1313001218000,"wpid":9750,"isSticky":false,"featured_image":{"width":165,"height":165,"src":"2011/08/sproff-165x165.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAABgX/xAAkEAABAwMEAQUAAAAAAAAAAAABAgMEBRESABMhMQYUFSJhc//EABQBAQAAAAAAAAAAAAAAAAAAAAT/xAAZEQADAAMAAAAAAAAAAAAAAAAAAQIRQVH/2gAMAwEAAhEDEQA/AC3kFXoUilh1uMptpKAuK61078UpXcHnglVr920Wcq9HQ4pPp3F4kjKwGX31pwYsf2WAnYax2ibYC3CU6jGFFJuYzF/zGhTaeh2H0//Z"},"createdAt":1587294110352,"updatedAt":1588403551212,"author":"5e9b68b27a1236eccfeb1d3c","old_image":"2011/08/sproff-165x165.jpg","categories":["music","reviews"]}