{"id":"5e9c2f969b6559241525d9e5","artists":["5e9b68d47a1236eccfeb1e2e"],"title":"Review: Beirut – The Rip Tide","content":"<p><strong>Beirut</strong>, or 25 year old New Mexico native <strong>Zach Condon</strong>, has certainly kept his devotees waiting for <em>The Rip Tide</em>.</p><p> It’s taken four years for him to record and release the follow up to 2007’s critically acclaimed <strong><em>The Flying Club Cup</em></strong>, and his newest effort sees <strong>Condon </strong>more considered than on its predecessor, and debut <strong><em>Gulag Orkestar</em></strong>. Sonically and thematically, both of his earlier releases were very much tied to a particular area of the world, <strong><em>Orkestar</em></strong> in the mountains of Eastern Europe and <strong><em>The Flying Club Cup </em></strong>on the back alleys and terraces of France and Italy. <em>The Rip Tide</em>, however,<em> </em>sees <strong>Condon </strong>synthesising his influences into an occasionally less striking, but certainly more rounded set of songs.</p>\n<p>Opening track <em>A Candle’s Fire</em> is built around an accordian motif that’s more <strong>Arcade Fire</strong> than <strong><em>The Flying Club Cup</em></strong>’s Francophilia, air-punching its way to a triumphant climax, and <em>Santa Fe</em> is a joyous, sun-drenched roadtrip to it’s namesake, plotting an insistent trajectory from bitcrushed beats and niggling keyboard to those majestic horns that <strong>Condon</strong> does so well. On early listens, it can feel like the propulsion of the album’s opening double team, not to mention the considerable weight of the <strong>Beirut </strong>back catalogue, turns the remainder of <strong><em>The Rip Tide</em></strong> into a bit of a non-starter. Tracks like the more subtly percussive <em>East Harlem </em>can seem to serve as thoroughfares between the album’s more memorable pieces. <em>Payne’s Bay</em>, as well, may contain the Balkan-styled horns that won <strong><em>Gulag Orkestar</em></strong><em> </em>so many fans, but ultimately, it lacks direction, a waltzing oompah that doesn’t really lead anywhere.</p>\n<p>However, on revisitation, many of <strong><em>The Rip Tide</em></strong>’s less immediate tracks begin to reveal their charm. <em>Goshen</em> has a studied, low-key tenderness to it, <strong>Condon</strong>’s gently undulating voice backed by ponderous ivories, martial drumming and of course more brass, elegiac this time. The title cut comes as something of a drowsy reprise of <em>Santa Fe</em>, illuminating the same stunning vistas in woozy sunset rather than high noon. <em>The Peacock</em> is all the more effective for its drumless backdrop, just lonely, droning organ and vocal harmony, and it provides the perfect precursor to closer <em>Port of Call</em>, which layers its way enticingly up from a brittle, bareboned strum to a gorgeously lilting peak.</p>\n<p>On <em>The Rip Tide</em>, <strong>Zach Condon</strong>’s choice to not tie himself to the traditional sound of a particular country or culture has served him well in the sense that he’s proved (if the calibre of songwriting on the first two <strong>Beirut</strong> records didn’t) he’s capable of more than just genre experimentation. <strong><em>The Rip Tide</em></strong><em> </em>can feel a little slow and singular at first, but on repeated listens it’s sure to sweep you away.</p>\n","slug":"9825-review-beirut-the-rip-tide","category":"album-reviews","date":1313085668000,"wpid":9825,"isSticky":false,"featured_image":{"width":165,"height":165,"src":"2011/08/beirut-the-rip-tide-165x165.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAEG/8QAGBABAQEBAQAAAAAAAAAAAAAAAQACEUH/xAAVAQEBAAAAAAAAAAAAAAAAAAADBf/EABQRAQAAAAAAAAAAAAAAAAAAAAD/2gAMAwEAAhEDEQA/ANAqaAz09e1koRX/2Q=="},"createdAt":1587294102913,"updatedAt":1588403551133,"author":"5e9b68b27a1236eccfeb1d3c","old_image":"2011/08/beirut-the-rip-tide-165x165.jpg","categories":["album-reviews","music"]}