{"id":"5e9c340a9b6559241525e16c","title":"Evolution Tip: Retriever","content":"<p><a href=\"https://admin.</p><p>crackintheroad.com/uploads/2010/05/retriever.jpg\"><img class=\"aligncenter size-full wp-image-986\" src=\"https://api.crackintheroad.com/wp-content/uploads/2010/05/retriever.jpg\" alt=\"\" width=\"700\" height=\"466\" srcset=\"https://api.crackintheroad.com/images/2010/05/retriever.jpg 700w, https://api.crackintheroad.com/images/2010/05/retriever-300x199.jpg 300w, https://api.crackintheroad.com/images/2010/05/retriever-494x328.jpg 494w, https://api.crackintheroad.com/images/2010/05/retriever-165x109.jpg 165w\" sizes=\"(max-width: 700px) 100vw, 700px\" /></a></p>\n<p>So its 10.30 at night and I’m sitting eating Pizza in a takeaway with north east band <strong>Retriever</strong>. <em>Garth Purver</em> the bands guitarist nervously jokes about the flavour of his tango; <em>Graeme Chapman</em> looks decidedly frustrated with the bands performance while the groups lead singer <em>Jackie Miller</em> looks surprisingly upbeat considering the decidedly odd situation that we’re all in. But then a normal situation with <strong>Retriever</strong> in many ways would be abnormal one. In a city full of <strong>Futureheads</strong> clones and posers retriever stand out simply because they’re pure, angry and very uncompromising.</p>\n<p>The band had just walked off stage at <strong>The Head of Steam</strong> venue in Newcastle and the gig hadn’t gone well. Bass malfunctions plagued the set, something <em>Chapman</em> was still reeling about. But rather than hurting what was an already engaging slice of electronic fuzz, the problems actually enhanced the gig. The band have an incredible theatrical quality to their performances, <em>Jackie</em> began with her back turned to the crowd, the band all dressed in black; if anything the malfunctions seemed wonderfully planned. Thankfully their so much more than an inventive performance, backed by an impulsive and ever powerful drum machine that drives an already dark and brooding sound, the band create something incredibly believable. <em>Jackie</em> ponders the band’s robotic member, calling it “the driving force of the band” and I’m inclined to agree. Although the music and performances have an incredible production value it never seems contrived, the strobe the band let loose half way through certain songs really adds something to the look, feel and sound of the sets they play.</p>\n<p>For a sound and a look that seems so incessantly powerful the band still hold on to a certain mystery, <em>Chapman</em> hits the nail on the head saying “we don’t necessarily want people to know what we sound like in conversation”, leaving me wondering if in fact I was ruining my experience of the band by talking to them. The theme of violence plays heavily in their music, Jackie describes the music as an “assault” against what Chapman so eloquently describes as “people just not giving a fuck”. And frankly they don’t, Newcastle seems full of the very things <strong>Retriever</strong> hate; but with their set at Newcastle’s Evolution set imminent perhaps they can bring some much needed pride back to Newcastle’s live music scene.</p>\n<p style=\"text-align: center\"><a href=\"https://www.myspace.com/retrieverretriever\">Check out Retriever’s Myspace</a></p>\n<p style=\"text-align: center\"><a href=\"https://www.ticketweb.co.uk/user?query=search&category=misc&search=Evolution+festival&region=xxx&beginmonth=03&beginday=30&beginyear=2010&interface=evolution\">Buy Tickets for Evolution Festival</a></p>\n","slug":"985-evolution-tipretriever","category":"festivals","date":1274889265000,"wpid":985,"isSticky":false,"featured_image":{"width":700,"height":466,"src":"2010/05/retriever.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAHAAoDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAUH/8QAIhAAAQMDBAMBAAAAAAAAAAAAAQIDEQAEBQYTITESIkGR/8QAFQEBAQAAAAAAAAAAAAAAAAAAAAH/xAAVEQEBAAAAAAAAAAAAAAAAAAAAMf/aAAwDAQACEQMRAD8AyhvWjzWEusa5i7AhKHLZC9sEADsSZUPE+wgjkkRFRl67uAtQaxOA2wYTONQePnfP7SlWD//Z"},"createdAt":1587295242777,"updatedAt":1588403567365,"author":"5e9b68b27a1236eccfeb1d24","old_image":"2010/05/retriever.jpg","categories":["festivals","interviews","music"]}