{"id":"5e9c2f919b6559241525d9dc","artists":["5e9b693e7a1236eccfeb251c"],"title":"Inní : Mystery Sigur Rós Video","content":"<p>Haitus.</p><p> The overuse of that word by PR savvy bands and their management to gently ease fans in to accepting that their band have split meant that, when news filtered out in early 2010 that Sigur Rós were on ‘hiatus’, it made many uncomfortable. Yes there have been occasional mentions of the band by Jonsí during interviews, but having not recorded anything since June 2008’s<em> Með suð í eyrum við spilum endalaust </em>the signs were not good for Sigur Rós ever returning.</p>\n<p>Only hours ago, after a period of complete media blackout, the Sigur Rós homepage posted a mystery trailer video for <em>Inni</em>. The exact nature of what this is a trailer for is not yet known, with ideas ranging from a live DVD in the vein of Jonsí’s own tour film, to a whole new album.</p>\n<p>The prevailing belief is that<em> Inni</em> will be footage of a live show of some sort. Amongst the noise on the clip, there are identifiable audio clips from previous tracks such as <em>Staralfur</em>, whilst the visuals are notably similar to the aesthetic theme of their 2008 tour to support <em><em>Með suð í eyrum við spilum endalaust, </em></em>their most recent studio offering. Indeed<em>, </em>lead single and show stalwart from this album is similarly titled <strong></strong><em><strong>Inní</strong> mér syngur vitleysingur</em> – and contrary to reports, we ‘Inní’ is not a made-up term, rather it means ‘inside’ or ‘within’ in Icelandic.</p>\n<p>Finally, despite having reported themselves as being in the studio this summer to record new material, it seems disparate for the band to have used seemingly old footage and audio samples to promote a new body of work, when they have historically been noted for their meticulous perfectionism in creating an all encompassing style for each set of album-tour-artwork-visuals.</p>\n<p>It is strange, though, if <em>Inní </em>does indeed turn out to be live material of some sort, given that there has only been one studio album released since <em>Heima</em>, a double disc DVD of live performances, and <em>Hvarf/Heim</em>, a two disc compilation of live and unreleased studio material. One would hope that, if this is the case, there is something new to be offered by <em>Inní</em>, rather than this being an attempt to milk the band commercially.</p>\n<p>Watch the trailer below and judge for yourself.</p>\n<p><iframe id=\"tsFrame92680\" src=\"https://cdn.topspin.net/api/v2/widget/player/92680\" frameborder=\"0\" width=\"400\" height=\"300\"></iframe></p>\n","slug":"9854-mystery-sigur-ros-video","category":"music","date":1313104651000,"wpid":9854,"isSticky":false,"featured_image":{"width":165,"height":165,"src":"2011/08/sigur-165x165.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFwAAAwEAAAAAAAAAAAAAAAAAAQIGB//EACYQAAECBAQHAQAAAAAAAAAAAAECAwAEBRESEyExBjJRUmGBkcH/xAAUAQEAAAAAAAAAAAAAAAAAAAAC/8QAGBEBAAMBAAAAAAAAAAAAAAAAAQACQRL/2gAMAwEAAhEDEQA/AIan1anzGQ4uflWrIJsXbXNttfW8I5xRQ0uKSFKUASMQfTY+eWMdcJyW9ev5Axr7lfYKrsdbc5P/2Q=="},"createdAt":1587294097201,"updatedAt":1588403551052,"author":"5e9b68b27a1236eccfeb1d0b","old_image":"2011/08/sigur-165x165.jpg","categories":["music","new"]}