{"id":"5e9c2f829b6559241525d9c5","artists":["5e9b695d7a1236eccfeb26ad"],"title":"Review: United Fruit – Fault Lines","content":"<p>OK.</p><p> So I have a confession to make. I am <em>massively </em>late to the party here. <strong><em>Fault Lines</em></strong>, debut album from Glaswegians <strong><a title=\"United Fruit Bandcamp\" href=\"https://unitedfruit.bandcamp.com/album/fault-lines\">United Fruit</a></strong>, dropped way back on May 30th. And as such I cannot write this review and pretend to be right at the cutting edge of modern music. However, I can and do write this review on the premise that someone might actually read it, and then listen to <strong>United Fruit</strong>, and then buy <strong><em>Fault Lines</em></strong>. If you’ve never been too comfortable with sunny psych-pop, don’t fully understand chillwave (I mean, really?!), and feel that there’s probably far too much reverb across the board, then you need <strong>United Fruit.</strong></p>\n<p>From the moment that <em>Kamikaze</em> opens fire in a hail of six-stringed, staccato shards, one thing is definitely clear. <strong>United Fruit</strong> are noisy. Guitars pushed screaming somewhere beyond overdrive fall away like cobwebs into sparkling chimes, before redoubling their attack. Vocals lie partially obscured by layers of distortion. Still, the band are a far cry from the most recent ‘loud’ reference point, that lo-fi wall of fuzz popularised by <strong>No Age </strong>or <strong>Wavves</strong>. Tracks like the pulsing <em>Red Letter </em>are imbued with a punkish vibe more reminiscent of<strong> Hot Snakes, </strong>while album highlight <em>Go Away, Don’t Leave Me Alone </em>announces itself with the kind of clanking, stop-start guitars that haven’t really been seen since the much missed <strong>Pretty Girls Make Graves </strong>were in their heydey<em></em><strong></strong><em></em></p>\n<p>Far from being unlistenable in its onslaught, <strong><em>Fault Lines</em></strong> plays to its strengths, embracing its raw volume and translating it into a more accessible energy. Both Iskandar Stewart’s and Stuart Galbraith’s vocals certainly carry something akin to a hook in places, particularly on the aforementioned <em>Go Away</em>, or the hip-shakin’ chant of ‘roll baby, roll baby, rock and roll!’ in <em>The Alarm</em>. At times the band’s aggression is tempered by a certain tenderness – <em>Three </em>introduces a little vocal fragility to the proceedings, along with some comparatively gentle guitar, and a quick glance at the lyric sheet reveals a guarded heart-on-sleeve aesthetic that, for me at least, beats the hell out of songs about skating, weed, or not very much at all.</p>\n<p>Part of the appeal of <strong>United Fruit</strong> can be summed up in their skillful walking of one of those metaphorical tightropes that get trotted out so often. There’s certainly nothing kitsch or twee about the band, but similarly, there’s none of the growly, macho posturing that makes the large majority of the actual ‘rock’ scene so hard to swallow. Essentially, <strong><em>Fault Lines </em></strong>makes me want to pick up a guitar, plug it in, turn it up really loud, and jump around like a twat. And not much makes me want to do that any more. The album can be streamed and purchased via <a href=\"https://unitedfruit.bandcamp.com/album/fault-lines\">bandcamp</a>, and you can find <em>Go Away, Don’t Leave Me Alone</em> below, for your listening pleasure.</p>\n<p><iframe style=\"position: relative; display: block; width: 400px; height: 100px;\" src=\"https://bandcamp.com/EmbeddedPlayer/v=2/track=2548754224/size=venti/bgcol=FFFFFF/linkcol=4285BB/\" frameborder=\"0\" width=\"400\" height=\"100\"></iframe></p>\n","slug":"9966-review-united-fruit-fault-lines","category":"album-reviews","date":1313403822000,"wpid":9966,"isSticky":false,"featured_image":null,"createdAt":1587294082427,"updatedAt":1588441788664,"author":"5e9b68b27a1236eccfeb1d3c","old_image":"generated/ab67616d0000b273afcfc307ea918353ee908d63.jpg","categories":["album-reviews","music"]}