{"id":"5e9c2f7f9b6559241525d9bf","artists":["5e9b69517a1236eccfeb2648"],"title":"Review: The War On Drugs – Slave Ambient","content":"<p>Bossgaze.</p><p> The most hilarious albeit fitting genre name of the year, spawned by attempting to describe the music of Philadelphia rock three piece<strong> The War On Drugs</strong>. Whilst it may seem slightly contrived; listening to the groups sophomore offering leaves no doubt behind the origins of the fanciful label. The record in question; <em><strong>Slave Ambient</strong></em> wears it’s <strong>Springsteen</strong> influences proudly on it’s Americana styled sleeves, not just through vocal delivery but also via the formulaic, structured songwriting.</p>\n<p>Way back in 2003 when the group first formed, a certain<strong> Kurt Vile</strong> was a founding member of <strong>The War On Drugs</strong>, alongside <strong>Adam Granduciel</strong>, who had recently arrived in Pennsylvania from California. Eight years and several line up changes later, including<strong> Vile</strong> deciding to pursue his now critically acclaimed solo career, the trio are now ready to release their second full length album<strong><em> Slave Ambient</em>.</strong> Whilst there’s nothing untoward in openly demonstrating musical influences, it can prove slightly perturbing when a record is so weighed down by the work of those before them, causing any imaginative traits of their own to become drowned out.</p>\n<p>Unfortunately, <em><strong>Slave Ambient</strong></em> falls foul to this particular mannerism, lacking any real energy or artistic drive. Recent single <em>Brothers</em> is a fairly bland <strong>Dylan/Springsteen</strong> hybrid, that never really gets out of the starting blocks. I have no doubt that <strong>The War On Drugs</strong> are perfectly capable of crafting their own unique style, however <strong><em>Slave Ambient</em></strong> doesn’t portray this at all. <em>Your Love Is My Name</em> drags on two minutes longer than necessary, and fails in creating a track that feels worthy of further listens. In trying to construct epic, Americana anthems, their own personal input becomes lost in between the idyllic guitar riffs and coarse vocals.</p>\n<p><object width=\"100%\" height=\"81\" classid=\"clsid:d27cdb6e-ae6d-11cf-96b8-444553540000\" codebase=\"https://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=6,0,40,0\"><param name=\"allowscriptaccess\" value=\"always\" /><param name=\"src\" value=\"https://player.soundcloud.com/player.swf?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F14962876\" /><embed width=\"100%\" height=\"81\" type=\"application/x-shockwave-flash\" src=\"https://player.soundcloud.com/player.swf?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F14962876\" allowscriptaccess=\"always\" /></object> <span><a href=\"https://soundcloud.com/onethirtybpm/the-war-on-drugs-baby-missiles\">The War on Drugs – Baby Missiles</a> by <a href=\"https://soundcloud.com/onethirtybpm\">One Thirty BPM</a></span></p>\n<p>It’s this vibe that overshadows much of <em><strong>Slave Ambient</strong></em>; whilst it’s not a record that is offensive on the ears, it disappoints in bringing anything exciting or uncontaminated to the table. There are touches of enthusiasm, such as the shoegaze inspired <em>It’s Your Destiny</em>; where it feels far less forced, and increasingly inherent, however these moments are few and far between. The entirely instrumental <em>City Reprise</em> is another of the albums highlights, coming across as much more impulsive and second-nature to the group, rather than yearning to rejuvenate a time gone by.</p>\n<p>It’s a mighty shame that <strong>The War On Drugs</strong> have fallen at this hurdle, as previous material was extremely promising and notably more deserving of praise than <strong><em>Slave Ambient</em></strong>. There’s nothing particularly offensive on the ears, nevertheless there are few tracks that prove memorable or invigorating enough to merit repeated listens, a fundamental element of any great album. Although <strong>The War On Drugs</strong> may have instigated the inception of one of the most preposterous genre name’s of the year, this album disappoints in actualizing anything truly noteworthy.</p>\n","slug":"9992-review-the-war-on-drugs-slave-ambient","category":"album-reviews","date":1313442993000,"wpid":9992,"isSticky":false,"featured_image":{"width":165,"height":165,"src":"2011/08/war-on-drugs-165x165.jpg","placeholder":"data:image/jpeg;base64, /9j/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAAKAAoDASIAAhEBAxEB/8QAFQABAQAAAAAAAAAAAAAAAAAABgf/xAAjEAACAQQCAAcAAAAAAAAAAAABAgMABAURByEGEiMxQXGS/8QAFAEBAAAAAAAAAAAAAAAAAAAABP/EABsRAAEEAwAAAAAAAAAAAAAAAAEAAhEiMTJR/9oADAMBAAIRAxEAPwBp4D5Cx+AxNzj7hVjlgiNyXKE+ca0B17no0XHLmTcBmubwE9kI6AD62N6qOW80jYe8dpHLaA2WO/igzTS7PqP+jQQXazhJdBt1f//Z"},"createdAt":1587294079398,"updatedAt":1588403550816,"author":"5e9b68b27a1236eccfeb1d27","old_image":"2011/08/war-on-drugs-165x165.jpg","categories":["album-reviews","music"]}